{
  "ticker": "JNJ",
  "date": "2021-11-15",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T11:42:14.385174",
  "source": "alpha_vantage",
  "article_count": 21,
  "articles": [
    {
      "title": "$95B Opioid Trial Begins Against Drug Distributors, Watch On-Demand via CVN",
      "summary": "A $95 billion opioid trial has begun in Washington State, with Attorney General Bob Ferguson suing major drug distributors McKesson Corp., Cardinal Health Inc., and AmerisourceBergen Corp. The lawsuit accuses the companies of creating a \"public nuisance\" by contributing to the opioid epidemic, seeking $38.2 billion in damages after Ferguson rejected a $26 billion nationwide settlement. The trial, being webcast live by Courtroom View Network, will test the \"public nuisance\" theory's effectiveness in holding drug companies liable for opioid-related claims.",
      "url": "https://blog.cvn.com/95b-opioid-trial-begins-against-drug-distributors-watch-gavel-to-gavel-via-cvn",
      "source": "CVN News",
      "published": "20211115T133950",
      "overall_sentiment_score": -0.542429,
      "overall_sentiment_label": "Bearish",
      "ticker_sentiment_score": -0.432313,
      "ticker_sentiment_label": "Bearish",
      "relevance_score": 0.700825
    },
    {
      "title": "Johnson & Johnson stock rises on split news: Here's why and when the company is separating",
      "summary": "Johnson & Johnson announced plans to split into two separate publicly traded companies: one focused on consumer health products and the other on pharmaceuticals and medical devices. The pharmaceutical division, set to retain the Johnson & Johnson name, is projected to generate $77 billion in 2021, significantly more than the consumer health unit's estimated $15 billion. The separation is expected to be completed within 18 months to two years, following legal requirements.",
      "url": "https://www.fastcompany.com/90696510/johnson-johnson-jnj-stock-price-split-explained/",
      "source": "Fast Company",
      "published": "20211112T203640",
      "overall_sentiment_score": 0.502677,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.505151,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Some of the world’s biggest companies are breaking apart. Here’s why.",
      "summary": "Johnson & Johnson announced plans to split into two publicly traded companies, a move that parallels similar decisions by GE and Toshiba. The pharmaceutical and medical devices divisions will separate from the consumer products business. This decision led to an increase in Johnson & Johnson's share price.",
      "url": "https://www.washingtonpost.com/business/2021/11/12/johnson-johnson-split/",
      "source": "The Washington Post",
      "published": "20211112T203640",
      "overall_sentiment_score": 0.437192,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.42033,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Encompass Health looking to expand Northern Virginia rehab hospital",
      "summary": "Encompass Health is planning to expand its Rehabilitation Hospital of Northern Virginia. This expansion proposal comes as the health system is also working on a new inpatient rehab hospital in Bowie. The existing facility is located in Aldie.",
      "url": "https://www.bizjournals.com/washington/news/2021/11/12/encompass-health-rehab-hospital-expansion-proposal.html",
      "source": "The Business Journals",
      "published": "20211112T200726",
      "overall_sentiment_score": 0.158612,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.227341,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.567688
    },
    {
      "title": "Johnson & Johnson to split into 2 public companies",
      "summary": "Johnson & Johnson announced its plan to split into two public companies, separating its consumer health business from its pharmaceutical and medical device segments. This move is intended to make each business more agile and better adapted to its respective market, with the consumer health division potentially mitigating future litigation risks. The split is expected to be completed within two years and follows similar moves by other large pharmaceutical companies.",
      "url": "https://www.npr.org/2021/11/12/1055346617/johnson-split-public-health-care-company",
      "source": "NPR",
      "published": "20211112T163100",
      "overall_sentiment_score": 0.12294,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.135589,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 1.0
    },
    {
      "title": "Johnson & Johnson to split into two companies",
      "summary": "Johnson & Johnson announced its plan to split into two separate companies. One entity will retain the Johnson & Johnson name and focus on prescription drugs and medical devices, while the other new consumer health company will manage brands like Neutrogena, Tylenol, and Band-Aid. The split is anticipated to be finalized by the fall of 2023.",
      "url": "https://www.cbsnews.com/news/johnson-johnson-split-two-companies/",
      "source": "CBS News",
      "published": "20211112T081300",
      "overall_sentiment_score": 0.422191,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.417421,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Johnson & Johnson to split into two companies, separating consumer health business",
      "summary": "Johnson & Johnson announced it will split into two publicly traded companies: one focused on consumer products and another on prescription drugs and medical devices. Shares of J&J rose 4 percent in premarket trading following the news. This move follows General Electric's plan earlier in the week to divide into three separate units.",
      "url": "https://www.nbcnews.com/business/business-news/johnson-johnson-split-two-companies-separating-consumer-health-busines-rcna5394",
      "source": "NBC News",
      "published": "20211112T065800",
      "overall_sentiment_score": 0.429643,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.380321,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Johnson & Johnson, Iconic Company Under Pressure, Plans to Split in Two (Published 2021)",
      "summary": "Johnson & Johnson announced plans to spin off its consumer-products division, which includes brands like Tylenol and Band-Aid, into a separate company. The 135-year-old company will retain its more profitable pharmaceutical and medical devices businesses. This breakup follows years of legal challenges and a trend of other conglomerates splitting to focus on higher-margin sectors.",
      "url": "https://www.nytimes.com/2021/11/12/business/johnson-johnson-split.html",
      "source": "The New York Times",
      "published": "20211112T203637",
      "overall_sentiment_score": 0.128252,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.121316,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 1.0
    },
    {
      "title": "J&J to spin off consumer products and focus on pharmaceuticals",
      "summary": "Johnson & Johnson announced plans to spin off its consumer health division to focus on pharmaceuticals and medical devices, marking the biggest shake-up in the company's 135-year history. This strategic move aims to simplify the company's structure and increase focus, following a trend seen among other large conglomerates and healthcare rivals. The separation is expected to take 18 to 24 months and cost between $500 million to $1 billion.",
      "url": "https://www.reuters.com/business/healthcare-pharmaceuticals/johnson-johnson-plans-split-into-two-companies-wsj-2021-11-12/",
      "source": "Reuters",
      "published": "20211112T182200",
      "overall_sentiment_score": 0.239959,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.327421,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Johnson & Johnson to spin off consumer arm to focus on medical division",
      "summary": "Johnson & Johnson announced it will spin off its consumer health division to focus on its pharmaceutical and medical devices businesses. This strategic move, the largest in the company's 135-year history, is expected to create more value for shareholders by separating the lower-growth consumer unit from the high-margin medical divisions. The consumer arm, known for brands like Band-Aid and Listerine, will become a new publicly traded company within 18 to 24 months.",
      "url": "https://www.theguardian.com/business/2021/nov/12/johnson-johnson-to-spin-off-consumer-arm-to-focus-on-medical-division",
      "source": "The Guardian",
      "published": "20211112T124300",
      "overall_sentiment_score": 0.028849,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.030686,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.303575
    },
    {
      "title": "Johnson & Johnson to spin out consumer health business in new publicly traded company",
      "summary": "Johnson & Johnson announced it will spin off its consumer health business into a new publicly traded company within 18 to 24 months, a move mirroring similar initiatives by other large pharmaceutical firms. This separation will allow J&J to focus on its highly profitable pharmaceutical and medical device units, while the new consumer health company will retain iconic brands like Neutrogena and Tylenol. The decision was driven by the increasing complexity of global healthcare and consumer environments, demanding more focused innovation and agility from both entities.",
      "url": "https://www.fiercepharma.com/pharma/johnson-johnson-to-separate-its-consumer-health-business-create-new-publicly-traded-company",
      "source": "Fierce Pharma",
      "published": "20211112T083500",
      "overall_sentiment_score": 0.315365,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.420848,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Pfizer expects 2021, 2022 COVID-19 vaccine sales to total at least $65 bln",
      "summary": "Pfizer announced expected COVID-19 vaccine sales of $36 billion for 2021 and an additional $29 billion for 2022, surpassing analyst estimates. The company plans to sign more vaccine deals, potentially driving sales even higher, and is urging low- and middle-income countries to place orders early. Pfizer also anticipates a durable market for COVID-19 vaccines beyond 2022, with plans for private markets to emerge.",
      "url": "https://www.reuters.com/business/healthcare-pharmaceuticals/pfizer-raises-covid-19-vaccine-sales-forecast-36-billion-2021-11-02/",
      "source": "Reuters",
      "published": "20211102T060400",
      "overall_sentiment_score": 0.247689,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.13417,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.597126
    },
    {
      "title": "J&J, Costco settle lawsuits over recalled sunscreen",
      "summary": "Johnson & Johnson (JNJ.N) and Costco Wholesale Corp (COST.O) have reached a tentative agreement to settle lawsuits concerning a cancer-causing substance found in several recalled J&J sunscreen products. The settlement, which is subject to court approval by November 19, aims to resolve all claims from lawsuits consolidated in a Florida federal court. J&J maintains it marketed its products appropriately and responsibly, despite voluntarily recalling the items after finding small amounts of benzene.",
      "url": "https://www.reuters.com/business/healthcare-pharmaceuticals/jj-costco-settle-lawsuits-over-recalled-sunscreen-2021-11-01/",
      "source": "Reuters",
      "published": "20211101T162100",
      "overall_sentiment_score": -0.060933,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.132418,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 1.0
    },
    {
      "title": "Emerging technologies in POCT",
      "summary": "Point-of-care testing (POCT) is rapidly advancing with innovations in lab-on-a-chip, smartphone-based technology, and wearable devices, further enhanced by cloud-based deep learning. These developments are expanding POCT applications beyond traditional uses like glucose monitoring to include tumor markers and advanced infectious disease detection, and were critical during the COVID-19 pandemic. The global POCT market is projected for significant growth, driven by key players and diverse applications.",
      "url": "https://healthcare-in-europe.com/en/news/emerging-technologies-in-poct.html",
      "source": "healthcare-in-europe.com",
      "published": "20211115T212644",
      "overall_sentiment_score": 0.297104,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.268416,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.550586
    },
    {
      "title": "GE Was Once a Model for Siemens but Now Follows Its Rival’s Path",
      "summary": "General Electric, once a benchmark for Siemens, is now adopting a similar strategy to its German competitor. This shift comes as both GE and Johnson & Johnson recently announced plans to split, reflecting a broader trend of conglomerate breakups. The article suggests this realignment could narrow the gap that has formed between GE and Siemens over the years.",
      "url": "https://www.wsj.com/business/ge-was-once-a-model-for-siemens-but-now-follows-its-rivals-path-11636656545?gaa_at=eafs&gaa_n=AWEtsqeU-76Sct5tj_BTB-FwIkl-A1fJSTbKgY6Bl1IyCczyXU7TK_pFAmDg&gaa_ts=6907c086&gaa_sig=OJkpVN7phyv7OkhLkPFtv1sZu1lGhGJN5_ZcIrz6HqZIivDfNO91av4WxwdRy5svpdFi149PTmzPGS23fBEp3Q%3D%3D",
      "source": "The Wall Street Journal",
      "published": "20211111T202137",
      "overall_sentiment_score": 0.038852,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.01537,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.641463
    },
    {
      "title": "Energy-Based Aesthetic Devices Market 2021 by Product and Geography – Forecast and Analysis",
      "summary": "The Global Energy-Based Aesthetic Devices Market is projected for rapid growth from 2021 to 2028, driven by new product approvals and launches, as well as R&D in novel materials and non-invasive platforms. Key players like Alma, Hologic’s Cynosure division, and Lumenis are actively expanding their product portfolios, contributing to market expansion, particularly in regions like Asia Pacific. The report offers a comprehensive analysis of market segments, competitive landscapes, and future growth opportunities within the industry.",
      "url": "https://www.openpr.com/news/2461480/energy-based-aesthetic-devices-market-2021-by-product",
      "source": "openPR.com",
      "published": "20211115T074200",
      "overall_sentiment_score": 0.184986,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.27269,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.643502
    },
    {
      "title": "News | Foulkes Refuses to Respond to Questions About CVS and Her Role in Opioid Crisis - Lawsuits Pile Up",
      "summary": "Helena Foulkes, former President of CVS and now a Rhode Island gubernatorial candidate, is facing scrutiny for her role at CVS during the opioid crisis. Multiple lawsuits, including one from the Attorney General of Kentucky, accuse CVS of profiting from the epidemic and failing to prevent the diversion of opioids. Foulkes has refused to directly answer questions regarding CVS's culpability and her oversight of the pharmacy function, with her campaign issuing a statement highlighting her efforts to combat opioid over-prescribing.",
      "url": "https://www.golocalprov.com/news/foulkes-refuses-to-respond-to-questions-about-cvs-and-her-role-in-opioid-cr",
      "source": "GoLocalProv",
      "published": "20211108T200200",
      "overall_sentiment_score": -0.367335,
      "overall_sentiment_label": "Bearish",
      "ticker_sentiment_score": -0.34897,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.624655
    },
    {
      "title": "‘Layer Upon Layer of Regulation’: Breaking Down the CMS Vaccination Mandate",
      "summary": "This article breaks down the Centers for Medicare & Medicaid Services (CMS) vaccination mandate, clarifying which health care providers are included, exemption possibilities, and enforcement methods. It highlights the exclusion of home- and community-based services (HCBS) providers and discusses the complexities facing providers due to overlapping regulations. The piece also delves into the implications of the mandate, particularly regarding opt-out options, religious exemptions, and the requirements for compliance.",
      "url": "https://homehealthcarenews.com/2021/11/layer-upon-layer-of-regulation-breaking-down-the-cms-vaccination-mandate/",
      "source": "Home Health Care News",
      "published": "20211108T192637",
      "overall_sentiment_score": 0.068644,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.102268,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.602112
    },
    {
      "title": "Johnson & Johnson advances global health and avoids supply chain disruptions - Source",
      "summary": "Johnson & Johnson leverages its collaboration with Microsoft to implement digital manufacturing transformation, including Azure, AI, and IoT, to enhance its global supply chain efficiency and resilience. By shifting to a pull supply chain and using smart manufacturing, J&J can ensure products are delivered precisely when needed, reduce errors, and mitigate disruptions. The company has seen improved quality output, a reduction in \"field actions,\" and moved from 28th to 3rd globally in Gartner's Magic Quadrant for Supply Chain Leaders, driven by its technological advancements.",
      "url": "https://news.microsoft.com/source/features/digital-transformation/johnson-johnson-advances-global-health-and-avoids-supply-chain-disruptions/",
      "source": "Microsoft Source",
      "published": "20211102T203638",
      "overall_sentiment_score": 0.419247,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.471509,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "At the F.D.A.’s urging, Pfizer-BioNTech and Moderna are expanding their trials for children 5 to 11. (Published 2021)",
      "summary": "Pfizer-BioNTech and Moderna are expanding their clinical trials for children ages 5 to 11 at the urging of the F.D.A. This expansion is a precautionary measure to detect rare side effects like heart inflammation that were observed in younger vaccinated individuals. It is unclear how this will impact the timeline for emergency authorization of pediatric vaccines.",
      "url": "https://www.nytimes.com/2021/07/26/us/politics/fda-covid-vaccine-trials-children.html",
      "source": "The New York Times",
      "published": "20211101T204728",
      "overall_sentiment_score": 0.08257,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.148359,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.586921
    },
    {
      "title": "Johnson & Johnson is breaking up Band-Aids and pharmaceuticals",
      "summary": "Johnson & Johnson announced it will split into two publicly traded companies: one focused on consumer health products and the other on prescription drugs and medical devices. This separation aims to create two global leaders better positioned for innovation and improved health outcomes. The move follows similar announcements from companies like Toshiba and General Electric, focusing on more profitable business units.",
      "url": "https://www.cnn.com/2021/11/12/investing/johnson-johnson-split",
      "source": "CNN",
      "published": "20211112T094200",
      "overall_sentiment_score": 0.427487,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.423154,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    }
  ]
}