{
  "ticker": "JNJ",
  "date": "2021-10-25",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T11:42:00.260674",
  "source": "alpha_vantage",
  "article_count": 19,
  "articles": [
    {
      "title": "Intuitive says delta variant slows Q3 da Vinci procedure growth",
      "summary": "Intuitive Surgical reported that the resurgent COVID-19 delta variant impacted da Vinci procedure growth in the third quarter, leading to a trimmed full-year forecast. Despite a 20% increase year-over-year, procedures were down 3% from Q2, and the company is bracing for potential supply chain and cost challenges. Intuitive beat revenue expectations due to strong system placements but faces increasing competition.",
      "url": "https://www.medtechdive.com/news/intuitive-delta-variant-robotics-q3-da-vinci-procedures/608555/",
      "source": "MedTech Dive",
      "published": "20211020T203214",
      "overall_sentiment_score": 0.057696,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.111283,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.742715
    },
    {
      "title": "Johnson & Johnson looking to bankruptcy to resolve 40,000 baby powder cancer suits",
      "summary": "Johnson & Johnson is attempting to use bankruptcy proceedings to resolve approximately 40,000 lawsuits alleging its baby powder products caused cancer. The company denies the allegations, calling them an “unrelenting assault” by trial lawyers, and has already spent nearly $1 billion on defense. Critics however, are condemning the move as an \"unconscionable abuse of the legal system.\"",
      "url": "https://abcnews.go.com/Business/johnson-johnson-bankruptcy-resolve-40000-baby-powder-cancer/story?id=80680409",
      "source": "ABC News",
      "published": "20211020T094600",
      "overall_sentiment_score": -0.717055,
      "overall_sentiment_label": "Bearish",
      "ticker_sentiment_score": -0.73104,
      "ticker_sentiment_label": "Bearish",
      "relevance_score": 1.0
    },
    {
      "title": "J&J foresees end to not-for-profit sales of coronavirus vaccine",
      "summary": "Johnson & Johnson announced its intention to transition away from not-for-profit sales of its coronavirus vaccine by late 2022 or early 2023, moving towards a commercial market model. This shift comes as the company anticipates a focus on booster doses and seeks full regulatory approvals, despite lower sales compared to competitors and previous manufacturing setbacks. J&J previously committed to not-for-profit pricing through the pandemic but did not specify an end date for this commitment.",
      "url": "https://www.biopharmadive.com/news/johnson-johnson-vaccine-not-for-profit-price/608477/",
      "source": "BioPharma Dive",
      "published": "20211019T203639",
      "overall_sentiment_score": 0.155705,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.286575,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Johnson & Johnson talc powder spinoff files for bankruptcy",
      "summary": "Johnson & Johnson has created a new subsidiary, LTL Management, transferring $2 billion in talc powder lawsuit settlement money to it before filing LTL for bankruptcy. This move could stall settlements for thousands of families suing the company over claims that its talcum powder caused ovarian cancer. J&J maintains the bankruptcy filing is not a concession of liability but a strategy to resolve the lawsuits efficiently.",
      "url": "https://www.cbsnews.com/news/johnson-johnson-talc-powder-cancer-lawsuits-bankruptcy-ltl-management/",
      "source": "CBS News",
      "published": "20211015T122100",
      "overall_sentiment_score": -0.411247,
      "overall_sentiment_label": "Bearish",
      "ticker_sentiment_score": -0.413829,
      "ticker_sentiment_label": "Bearish",
      "relevance_score": 1.0
    },
    {
      "title": "Gossamer unveils new pipeline plans a year after lead program fizzled out in phase 2",
      "summary": "Gossamer Bio, a year after its lead program failed in phase 2, is introducing two new preclinical assets, GB5121 and GB7208, both central nervous system-penetrant Bruton’s tyrosine kinase (BTK) inhibitors. These therapies are designed to address CNS indications like lymphoma and multiple sclerosis, differentiating them from existing BTK inhibitors. The company plans to advance these candidates into human testing soon, hoping to turn things around after previous setbacks and an executive reshuffle.",
      "url": "https://www.fiercebiotech.com/biotech/gossamer-unveils-2-new-pipeline-candidates-a-year-after-lead-program-fizzled-out-phase-2",
      "source": "Fierce Biotech",
      "published": "20211011T185500",
      "overall_sentiment_score": 0.131739,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.113453,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.603371
    },
    {
      "title": "Johnson & Johnson Reports Q3 2021 Results",
      "summary": "Johnson & Johnson announced strong third-quarter 2021 results, with total sales growing 10.7% to $23.3 billion, driven by robust performance in Pharmaceuticals, recovery in Medical Devices, and growth in Consumer Health. The company reported an 18.2% increase in adjusted earnings per share and raised its full-year 2021 guidance. CEO Alex Gorsky highlighted solid performance across all segments and the company's commitment to innovation and addressing global healthcare challenges as he prepares to transition his role.",
      "url": "https://www.jnj.com/media-center/press-releases/johnson-johnson-reports-q3-2021-results",
      "source": "Johnson & Johnson",
      "published": "20211019T203638",
      "overall_sentiment_score": 0.436528,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.4154,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Intuitive Surgical names new C-suite leaders, reports Street-beating Q3",
      "summary": "Intuitive Surgical announced new C-suite leaders and organizational changes, including the creation of Strategy and Growth and Global Business Services divisions. The company reported strong Q3 2021 financial results, exceeding analyst expectations for revenue and EPS, driven by a 20% increase in robotic surgery procedures using its da Vinci system. This positive performance and leadership restructuring occurred as a competitor, Johnson & Johnson, announced a delay in its surgical robot development.",
      "url": "https://www.medicaldesignandoutsourcing.com/intuitive-surgical-strategy-growh-global-business-services-q3-2021-financial-results/",
      "source": "Medical Design & Outsourcing",
      "published": "20211019T203214",
      "overall_sentiment_score": 0.321114,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.218617,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.641542
    },
    {
      "title": "An extra J. & J. shot substantially boosts protection against Covid, the company reports. (Published 2021)",
      "summary": "Johnson & Johnson announced that a second dose of its Covid-19 vaccine substantially increased protection, showing 94 percent efficacy against mild to severe Covid-19 in the U.S. This booster shot also significantly raised antibody levels, particularly when administered several months after the initial dose. The data has been submitted to the FDA for review.",
      "url": "https://www.nytimes.com/2021/09/21/health/johnson-and-johnson-shot.html",
      "source": "The New York Times",
      "published": "20211015T203639",
      "overall_sentiment_score": 0.013933,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.003942,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.332908
    },
    {
      "title": "F.D.A. Panel Unanimously Recommends Johnson & Johnson Booster Shots (Published 2021)",
      "summary": "A key federal advisory committee unanimously recommended Johnson & Johnson booster shots, likely paving the way for all 15 million initial recipients to receive a second dose. The panel also suggested J&J recipients might benefit from the option of an mRNA booster (Pfizer-BioNTech or Moderna), a possibility the FDA is considering. This recommendation comes despite some scientific skepticism about the necessity of boosters and a call to focus on vaccinating the unvaccinated globally.",
      "url": "https://www.nytimes.com/2021/10/15/health/johnson-johnson-vaccine-booster.html",
      "source": "The New York Times",
      "published": "20211015T000000",
      "overall_sentiment_score": 0.283937,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.272953,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "What the ketamine boom could mean for pharma",
      "summary": "The article discusses the surging demand for ketamine, particularly its off-label use for depression, anxiety, and PTSD, and its implications for the pharmaceutical industry. It highlights the distinction between ketamine-assisted psychotherapy (KAP) and FDA-approved esketamine (Spravato), as well as future opportunities in psychedelic medicine. While ketamine offers significant potential, the article notes the current lack of rigorous evidence for KAP compared to IV ketamine or Spravato.",
      "url": "https://www.drugdiscoverytrends.com/what-the-ketamine-boom-could-mean-for-pharma/",
      "source": "www.drugdiscoverytrends.com",
      "published": "20211014T203731",
      "overall_sentiment_score": 0.213029,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.127563,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.631819
    },
    {
      "title": "WATCH: FDA advisory committee debates Johnson & Johnson COVID-19 booster shots",
      "summary": "U.S. health advisers have endorsed a booster shot for Johnson & Johnson's COVID-19 vaccine, citing concerns about its lower effectiveness compared to two-dose brands. The FDA's advisory panel unanimously recommended offering the booster at least two months after the initial immunization, and also discussed the potential benefits of \"mix-and-match\" boosting with Moderna or Pfizer vaccines for J&J recipients. The decision aims to bolster protection for those who received the single-dose J&J vaccine, especially given the prevalence of the delta variant.",
      "url": "https://www.pbs.org/newshour/health/watch-live-fda-advisory-committee-debates-johnson-johnson-covid-19-booster-shots",
      "source": "PBS",
      "published": "20211014T192200",
      "overall_sentiment_score": 0.158402,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": -0.200304,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 1.0
    },
    {
      "title": "Top 50 Pharma Companies 2021: Notes & Methodology",
      "summary": "This article outlines the notes and methodology used by Med Ad News editors for their 35th annual Top 50 Pharma Companies report in 2021. It details the criteria for company inclusion, financial data definitions like revenue, earnings, R&D, and assets, and explains the exchange rate conversions for non-U.S. companies. The report also includes the selection criteria for the \"Company of the Year\" and a list of past recipients.",
      "url": "https://www.pharmalive.com/top-50-pharma-companies-2021-notes-methodology/",
      "source": "PharmaLive",
      "published": "20211011T004808",
      "overall_sentiment_score": 0.112949,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.136358,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.622513
    },
    {
      "title": "Merck, Pfizer COVID-19 Antivirals Different From Ivermectin",
      "summary": "Merck and Pfizer are developing oral antiviral drugs for COVID-19 that are distinct from ivermectin, contrary to online claims of similarities or repackaging for profit. The article details how these new antivirals like Paxlovid and molnupiravir work by different mechanisms, such as protease inhibition and lethal mutagenesis, respectively, and highlights that their chemical structures bear no resemblance to ivermectin. It also explains why ivermectin, despite its in vitro antiviral effects, is unlikely to be effective against COVID-19 at human-achievable concentrations and warns against using it for this purpose.",
      "url": "https://www.factcheck.org/2021/10/scicheck-merck-pfizer-covid-19-antivirals-different-from-ivermectin/",
      "source": "FactCheck.org",
      "published": "20211015T204726",
      "overall_sentiment_score": 0.305647,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.144841,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.580356
    },
    {
      "title": "U.S. donates 3.6 million doses of Pfizer COVID-19 vaccines to Nigeria",
      "summary": "The United States has donated 3.6 million doses of Pfizer Inc/BioNTech COVID-19 vaccines to Nigeria, two months after previously sending Moderna Inc vaccines. The shipment arrived in Abuja, bringing the total number of Pfizer doses committed to Nigeria to 3.57 million. Nigeria aims to inoculate at least 70% of its population against COVID-19.",
      "url": "https://www.reuters.com/world/africa/us-donates-36-million-doses-pfizer-covid-19-vaccines-nigeria-state-tv-2021-10-14/",
      "source": "Reuters",
      "published": "20211015T072400",
      "overall_sentiment_score": 0.166577,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.128112,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.642297
    },
    {
      "title": "Boosters for Moderna and Johnson & Johnson vaccine recipients weren’t up for debate during a C.D.C. panel.",
      "summary": "A CDC advisory committee recommended Pfizer-BioNTech booster shots for older Americans and those with certain medical conditions, but it did not address boosters for Moderna and Johnson & Johnson vaccine recipients. This decision left some experts concerned about public health policy and equity as data for other vaccine boosters are still under review. The FDA is reviewing Moderna booster data, and Johnson & Johnson has not yet applied for booster authorization.",
      "url": "https://www.nytimes.com/2021/09/23/science/moderna-johnson-covid-boosters.html",
      "source": "The New York Times",
      "published": "20211014T204730",
      "overall_sentiment_score": 0.041289,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.027445,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.902455
    },
    {
      "title": "J&J COVID-19 shot gets better boost from Moderna or Pfizer in NIH study",
      "summary": "A National Institutes of Health (NIH) study found that people who initially received Johnson & Johnson's COVID-19 vaccine had a stronger immune response when boosted with shots from Moderna or Pfizer. The preliminary study also indicated that \"mixing and matching\" booster shots of different types is safe and can produce comparable or higher antibody responses. This research comes as the U.S. Food and Drug Administration prepares to discuss booster shots for Moderna and J&J vaccines.",
      "url": "https://www.reuters.com/business/healthcare-pharmaceuticals/mixing-covid-19-booster-shots-safe-says-nih-study-2021-10-13/",
      "source": "Reuters",
      "published": "20211014T043900",
      "overall_sentiment_score": 0.233704,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.246042,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.917383
    },
    {
      "title": "Johnson & Johnson earns a spot on Fortune's 2021 Change the World list.",
      "summary": "Johnson & Johnson has been recognized on Fortune's 2021 Change the World list for its significant role in battling the COVID-19 pandemic through its Janssen vaccine. The company's commitment to social responsibility, innovation, and global partnerships, guided by \"Our Credo,\" allowed it to respond urgently to the global health crisis. This recognition adds to other recent accolades from Fortune, including Jennifer Taubert's inclusion in the Most Powerful Women in Business list and the company's ranking among the World's Most Admired Companies.",
      "url": "https://www.jnj.com/latest-news/johnson-johnson-earns-spot-on-2021-change-the-world-list",
      "source": "Johnson & Johnson",
      "published": "20211015T203637",
      "overall_sentiment_score": 0.457243,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.471518,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Moderna and J&J COVID-19 vaccine boosters: What doctors must know",
      "summary": "The FDA has authorized and the CDC has recommended booster doses for Moderna and Johnson & Johnson COVID-19 vaccines, allowing for \"mixing and matching\" with other authorized boosters. Doctors must consider clinical considerations, including rare adverse events like myocarditis or blood clots, and perform individual benefit-risk assessments for patients. The goal is to provide continued protection against COVID-19, especially given the decline in vaccine effectiveness against the Delta variant, and to increase immune response.",
      "url": "https://www.ama-assn.org/public-health/infectious-diseases/moderna-and-jj-covid-19-vaccine-boosters-what-doctors-must-know",
      "source": "American Medical Association",
      "published": "20211022T203639",
      "overall_sentiment_score": 0.123751,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.105883,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 1.0
    },
    {
      "title": "How your own DNA could someday save your vision",
      "summary": "Johnson & Johnson is developing investigational gene therapies to treat genetic eye diseases like Retinitis Pigmentosa (RP), an X-linked disorder that causes blindness, and achromatopsia. The company's collaboration with MeiraGTx focuses on gene replacement therapy, injecting a healthy gene to restore function, with clinical trials underway for XLRP and promising results leading to Fast Track and Orphan designations from the FDA. This research aims to preserve and improve vision for patients with limited treatment options.",
      "url": "https://www.jnj.com/innovation/about-gene-therapy-for-retinitis-pigmentosa-and-eye-conditions",
      "source": "Johnson & Johnson",
      "published": "20211011T203637",
      "overall_sentiment_score": 0.516278,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.51134,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    }
  ]
}