{
  "ticker": "JNJ",
  "date": "2022-05-02",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T11:45:47.975533",
  "source": "alpha_vantage",
  "article_count": 6,
  "articles": [
    {
      "title": "Alabama settles opioid claims with J&J, McKesson, Endo for $276 mln -attorney general",
      "summary": "Alabama has reached $276 million in settlements with Johnson & Johnson, McKesson Corp, and Endo International Plc to resolve claims related to the opioid addiction crisis. The state's attorney general stated that Alabama will receive more funds and a faster payout compared to what it would have received under a nationwide settlement. This agreement comes amidst a wave of litigation and settlements by various states addressing the U.S. opioid crisis.",
      "url": "https://www.reuters.com/business/healthcare-pharmaceuticals/alabama-settles-opioid-claims-against-jj-distributors-276-mln-attorney-general-2022-04-19/",
      "source": "Reuters",
      "published": "20220420T005100",
      "overall_sentiment_score": -0.138773,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.028065,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.940883
    },
    {
      "title": "J&J unit's challenge to Intuitive surgery robot patent revived",
      "summary": "A federal appeals court revived a challenge by Johnson & Johnson unit Auris Health Inc to a patent held by rival Intuitive Surgical Operations Inc concerning a robotic tool for surgery. The court ordered the U.S. Patent and Trademark Office's patent tribunal to reconsider its decision that the patent was not obvious, citing that generic industry skepticism alone cannot prevent a finding of obviousness. The underlying patent infringement lawsuit between Auris and Intuitive over Auris' robotic bronchoscopy device is scheduled for trial in January 2023.",
      "url": "https://www.reuters.com/legal/litigation/jj-units-challenge-intuitive-surgery-robot-patent-revived-2022-04-29/",
      "source": "Reuters",
      "published": "20220429T212300",
      "overall_sentiment_score": -0.2153,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.228139,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.804524
    },
    {
      "title": "Low Volatility Stocks Usually Do Well—But There Are Traps",
      "summary": "A Northern Trust Asset Management paper warns that while low-volatility stocks generally outperform over time, they can present traps, particularly in real estate, utilities, and consumer staples sectors. Rising interest rates and economic vulnerability can negatively impact these types of low-volatility holdings. NTAM advises focusing on companies with strong cash flows, profitability, and solid balance sheets to mitigate these risks.",
      "url": "https://www.ai-cio.com/news/low-volatility-stocks-usually-do-well-but-there-are-traps/",
      "source": "Chief Investment Officer",
      "published": "20220425T181642",
      "overall_sentiment_score": 0.223811,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.403039,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.645172
    },
    {
      "title": "Tom Carey, sales leader and mentor, passes away",
      "summary": "Tom Carey, a biopharma commercial veteran and sales leader, has passed away at 68. He played a key role in building BioCentury's sales team and had a distinguished career at companies like Eli Lilly, Syntex, Roche, and Johnson & Johnson. Carey was known for his leadership, mentorship, and dedication to his family.",
      "url": "https://www.biocentury.com/article/643211/tom-carey-sales-leader-and-mentor-passes-away",
      "source": "BioCentury",
      "published": "20220418T115200",
      "overall_sentiment_score": 0.123691,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.137105,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.642081
    },
    {
      "title": "Pharma Expansions: Beigene, Boehringer Ingelheim to Break Ground for New Facilities",
      "summary": "Several biopharma companies are expanding their facilities, including BeiGene with a new U.S. manufacturing and R&D center in New Jersey, and Boehringer Ingelheim investing $57 million to expand its Animal Health Global Innovation Center in Georgia. Breakthrough Properties also raised $3 billion for a new life sciences real estate fund, and Catalent is expanding its manufacturing capabilities across the U.S. and Europe, while a $25 million accelerator for biotech startups is being built in Roanoke Valley.",
      "url": "https://www.biospace.com/biopharma-makes-big-expansions-to-close-the-month",
      "source": "BioSpace",
      "published": "20220429T175643",
      "overall_sentiment_score": 0.130892,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.154388,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.617474
    },
    {
      "title": "BioXcel will use $260M finance deal to expand indications for schizophrenia drug",
      "summary": "BioXcel Therapeutics secured a $260 million financing agreement with Oaktree Capital Management and Qatar Investment Authority to accelerate growth and commercially launch their new schizophrenia drug, IGALMI. The funds will also support the expansion of IGALMI's clinical development, including a phase 3 program for Alzheimer's agitation, and other neuroscience and immuno-oncology programs, providing the company with a cash runway into 2025. This deal positions BioXcel to realize its vision of becoming a leading AI-enabled neuroscience company.",
      "url": "https://www.fiercebiotech.com/biotech/bioxcel-enters-260m-finance-deal-accelerate-growth-though-prerequisites-must-be-met-unlock",
      "source": "Fierce Biotech",
      "published": "20220420T093000",
      "overall_sentiment_score": 0.198016,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.136646,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.587587
    }
  ]
}