{
  "ticker": "JNJ",
  "date": "2022-08-15",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T11:47:51.322373",
  "source": "alpha_vantage",
  "article_count": 19,
  "articles": [
    {
      "title": "Johnson & Johnson Ends Worldwide Sale of Talc-Based Baby Powder",
      "summary": "Johnson & Johnson announced it would end the worldwide sale of talc-based Johnson’s Baby Powder in 2023, transitioning to a cornstarch-based product. This decision comes after thousands of lawsuits claiming its talc was contaminated with asbestos, despite the company's continued insistence on the product's safety. The company is actively involved in complex litigation and bankruptcy proceedings to manage nearly 40,000 pending talc-related lawsuits.",
      "url": "https://www.asbestos.com/news/2022/08/15/johnson-johnson-talc-worldwide-sales/",
      "source": "Mesothelioma Center",
      "published": "20220815T171641",
      "overall_sentiment_score": -0.386458,
      "overall_sentiment_label": "Bearish",
      "ticker_sentiment_score": -0.361323,
      "ticker_sentiment_label": "Bearish",
      "relevance_score": 1.0
    },
    {
      "title": "Johnson & Johnson to stop selling talc-based baby powder globally",
      "summary": "Johnson & Johnson announced it will cease global sales of its talc-based baby powder starting next year, citing a \"commercial decision\" for long-term growth. This follows a previous discontinuation of the product in the U.S. and Canada two years prior due to declining demand amid thousands of lawsuits alleging the powder contained carcinogens.",
      "url": "https://www.washingtonpost.com/business/2022/08/12/johnson-and-johnson-talcum-baby-powder/",
      "source": "The Washington Post",
      "published": "20220812T171642",
      "overall_sentiment_score": -0.247061,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.215341,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 1.0
    },
    {
      "title": "Johnson & Johnson to stop selling talc-based baby powder in 2023",
      "summary": "Johnson & Johnson announced it will cease global sales of its talc-based baby powder in 2023, transitioning to an all cornstarch-based portfolio. This decision comes after the company ended sales in North America in 2020 amid numerous lawsuits alleging its talc products caused cancer due to asbestos contamination, claims J&J denies. The company faces ongoing legal challenges and previously utilized a subsidiary's bankruptcy to pause lawsuits.",
      "url": "https://www.aljazeera.com/news/2022/8/12/johnson-and-johnson-talc-based-baby-powder",
      "source": "Al Jazeera",
      "published": "20220812T171641",
      "overall_sentiment_score": -0.346877,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.316752,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 1.0
    },
    {
      "title": "Johnson & Johnson to replace talc-based powder with cornstarch",
      "summary": "Johnson & Johnson announced it will stop making and selling its talc-based baby powder globally from next year, transitioning to an all cornstarch-based portfolio. This decision comes over two years after sales ended in the US, amid thousands of lawsuits alleging its talcum powder caused ovarian cancer due to asbestos contamination. J&J maintains that its talc-based product is safe, does not contain asbestos, and does not cause cancer.",
      "url": "https://www.bbc.com/news/business-62514263",
      "source": "BBC",
      "published": "20220812T171640",
      "overall_sentiment_score": -0.29481,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.27416,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 1.0
    },
    {
      "title": "Johnson & Johnson to end sales of baby powder with talc globally next year",
      "summary": "Johnson & Johnson announced it will stop selling baby powder containing talc globally next year, replacing it with a cornstarch-based product. This decision follows thousands of lawsuits alleging the talcum powder caused cancer, though J&J maintains the product is safe. The company had already discontinued talc-based baby powder in the U.S. and Canada.",
      "url": "https://www.nbcnews.com/news/us-news/johnson-johnson-end-sales-baby-powder-talc-globally-year-rcna42805",
      "source": "NBC News",
      "published": "20220812T093800",
      "overall_sentiment_score": 0.149557,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.139358,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 1.0
    },
    {
      "title": "After billions in legal costs, Johnson & Johnson plans to halt talc sales worldwide",
      "summary": "Johnson & Johnson announced it will discontinue worldwide sales of its talc-based baby powder in 2023, replacing it with a cornstarch-based version. This decision follows years of costly litigation over its talc products, amounting to billions in legal expenses, despite the company maintaining the product's safety. J&J had previously ceased talc powder sales in the U.S. and Canada and has faced numerous lawsuits and a significant verdict related to asbestos contamination claims.",
      "url": "https://www.fiercepharma.com/pharma/johnson-johnson-will-halt-worldwide-sales-iconic-baby-powder-will-replace-cornstarch-based",
      "source": "Fierce Pharma",
      "published": "20220812T090800",
      "overall_sentiment_score": -0.394312,
      "overall_sentiment_label": "Bearish",
      "ticker_sentiment_score": -0.358787,
      "ticker_sentiment_label": "Bearish",
      "relevance_score": 1.0
    },
    {
      "title": "J&J discontinues talc baby powder amid lawsuits",
      "summary": "Johnson & Johnson announced it will discontinue its talc-based baby powder globally in 2023, transitioning to cornstarch-based products. The company maintains its talc products are safe and do not cause cancer, citing the decision as purely commercial. This move comes amid approximately 38,000 lawsuits alleging that the talc products caused cancer due to asbestos contamination.",
      "url": "https://www.axios.com/2022/08/11/johnson-johnson-baby-powder-talc-lawsuits-jj",
      "source": "Axios",
      "published": "20220811T171642",
      "overall_sentiment_score": -0.211396,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.205734,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 1.0
    },
    {
      "title": "Johnson & Johnson will stop selling talcum-based baby powder globally",
      "summary": "Johnson & Johnson announced it will stop selling its talcum-based baby powder globally and switch to a cornstarch version due to declining demand and ongoing lawsuits claiming the product caused ovarian cancer or mesothelioma. The company maintains the product is safe but cited \"misleading talc litigation advertising\" for the change. This move follows previous legal actions, including a significant reduction in damages awarded to women in one case, and a 2020 recall after asbestos was found in a bottle of the powder.",
      "url": "https://www.cbsnews.com/news/johnson-johnson-baby-powder-discontinued-sale/",
      "source": "CBS News",
      "published": "20220812T111600",
      "overall_sentiment_score": -0.205165,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.201159,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 1.0
    },
    {
      "title": "Johnson & Johnson to stop making talc-based baby powder globally",
      "summary": "Johnson & Johnson announced it will stop selling and making talc-based baby powder globally in 2023, two years after ceasing sales in North America. This decision comes amidst tens of thousands of lawsuits alleging its talc products caused cancer, though the company continues to maintain the product's safety. J&J states it will transition to an all cornstarch-based baby powder portfolio, optimizing its product offerings.",
      "url": "https://www.theguardian.com/business/2022/aug/12/johnson-and-johnson-to-stop-making-talc-based-baby-powder-globally",
      "source": "The Guardian",
      "published": "20220812T053000",
      "overall_sentiment_score": -0.240838,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.23786,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 1.0
    },
    {
      "title": "Johnson & Johnson Will Discontinue Talc-Based Baby Powder Globally in 2023",
      "summary": "Johnson & Johnson announced it will discontinue selling talc-based baby powder globally in 2023, shifting entirely to cornstarch. This decision follows thousands of lawsuits from cancer patients who claimed the talc was contaminated with asbestos; however, J&J maintains its talc products are safe and asbestos-free. The company had already stopped selling the talc version in North America in 2020.",
      "url": "https://www.nytimes.com/2022/08/11/business/johnson-and-johnson-talc-corn-starch.html",
      "source": "The New York Times",
      "published": "20220811T171640",
      "overall_sentiment_score": -0.269137,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.259495,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 1.0
    },
    {
      "title": "J&J to end sales of baby powder with talc globally next year",
      "summary": "Johnson & Johnson announced it will stop selling its talc-based baby powder globally in 2023, transitioning to a cornstarch-based product. This decision follows thousands of lawsuits alleging that the talcum powder caused cancer, despite the company's assertion of its product's safety supported by medical research. J&J had already ceased talc-based powder sales in the U.S. and Canada in 2020 due to declining demand and \"misleading talc litigation advertising.\"",
      "url": "https://apnews.com/article/health-canada-lawsuits-cancer-40bbfd5bb494a3d31a1374195b287f3b",
      "source": "AP News",
      "published": "20220812T100828",
      "overall_sentiment_score": 0.130234,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.123509,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 1.0
    },
    {
      "title": "136 years of championing women’s health",
      "summary": "This article chronicles Johnson & Johnson's 136-year history of advocating for women's health through various initiatives, from medical advancements to employee benefits. It highlights key milestones such as developing essential maternity products, pioneering contraception, addressing maternal mortality disparities, and supporting global public health programs for women. The company's commitment extends to supporting its female employees and innovating solutions for widespread access to healthcare, demonstrating a long-standing dedication to women's well-being.",
      "url": "https://www.jnj.com/our-heritage/136-year-history-of-championing-womens-health",
      "source": "Johnson & Johnson",
      "published": "20220804T171640",
      "overall_sentiment_score": 0.400327,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.442678,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "The quest to make neurodegenerative disease a thing of the past",
      "summary": "Johnson & Johnson is actively researching and developing innovative solutions to prevent, slow, and potentially cure neurodegenerative diseases like Alzheimer's disease and multiple sclerosis. The company is focusing on precision medicine approaches, high-efficacy treatments for MS, and tackling rare autoantibody-driven diseases, with the ultimate goal of making these conditions a thing of the past. Researchers are also working on early detection methods and personalized treatments, including targeting specific proteins and exploring therapeutic antibodies.",
      "url": "https://www.jnj.com/innovation/the-quest-to-make-neurodegenerative-disease-a-thing-of-the-past",
      "source": "Johnson & Johnson",
      "published": "20220810T171642",
      "overall_sentiment_score": 0.418557,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.429279,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "J&J to stop selling talc-based baby powder globally in 2023",
      "summary": "Johnson & Johnson announced it will stop selling its talc-based baby powder globally in 2023, two years after discontinuing sales in the U.S. and Canada. This decision comes amidst approximately 38,000 lawsuits claiming the product caused cancer due to asbestos contamination, allegations J&J denies. The company will transition its baby powder portfolio to cornstarch-based products worldwide.",
      "url": "https://www.cnbc.com/2022/08/11/jj-to-stop-selling-talc-based-baby-powder-globally-in-2023.html",
      "source": "CNBC",
      "published": "20220811T174800",
      "overall_sentiment_score": -0.253209,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.294438,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.955844
    },
    {
      "title": "HCA Healthcare announces collaboration with Johnson & Johnson to address key healthcare clinical and industry issues",
      "summary": "HCA Healthcare and Johnson & Johnson have announced a new collaboration to tackle critical healthcare issues. The partnership will initially focus on improving health equity, specifically through early-stage lung cancer detection in the Black community, enhancing nursing support within HCA Healthcare and Galen College of Nursing, and advancing cardiovascular health initiatives. This collaboration aims to leverage the strengths of both organizations to improve patient access, outcomes, and address the nursing crisis.",
      "url": "https://hcahealthcaretoday.com/2022/08/09/hca-healthcare-announces-collaboration-with-johnson-johnson-to-address-key-healthcare-clinical-and-industry-issues/",
      "source": "HCA Healthcare Today",
      "published": "20220809T165630",
      "overall_sentiment_score": 0.389482,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.348946,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.902128
    },
    {
      "title": "Global TNF Alpha Inhibitors Market Report 2022-2026 & 2031",
      "summary": "The global TNF Alpha Inhibitors market is projected to grow from $38.56 billion in 2021 to $40.73 billion in 2022, reaching $43.83 billion by 2026. This growth is primarily driven by the increasing prevalence of inflammatory diseases like inflammatory bowel disease and psoriasis. Key players in this market include AbbVie, Amgen, and Johnson & Johnson, though the market faces limitations due to the adverse side effects of TNF alpha inhibitors.",
      "url": "https://www.globenewswire.com/news-release/2022/08/04/2492186/28124/en/Global-TNF-Alpha-Inhibitors-Market-Report-2022-2026-2031-Featuring-Major-Players-AbbVie-Amgen-J-J-UCB-Novartis-Pfizer-Merck-Co-Janssen-Biotech-Ablynx-and-Momenta-Pharmaceuticals.html",
      "source": "GlobeNewswire",
      "published": "20220804T070400",
      "overall_sentiment_score": 0.308703,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.311535,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.809469
    },
    {
      "title": "West Virginia cities reach $400 mln opioid distributor settlement",
      "summary": "West Virginia cities and counties have reached a $400 million settlement with drug distributors McKesson Corp, AmerisourceBergen Corp, and Cardinal Health Inc, resolving allegations that the companies fueled the opioid crisis in the state. This settlement covers over 100 local governments and follows previous state-level agreements, though it excludes Huntington and Cabell County, which lost their federal court case. The agreement aims to provide funds to communities hard-hit by opioid abuse, which has led to nearly 500,000 overdose deaths in the U.S. over two decades.",
      "url": "https://www.reuters.com/business/healthcare-pharmaceuticals/west-virginia-cities-reach-400-mln-opioid-distributor-deal-2022-08-01/",
      "source": "Reuters",
      "published": "20220801T201900",
      "overall_sentiment_score": 0.017268,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.135808,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.637668
    },
    {
      "title": "T.J. Maxx parent company to pay $13 million for selling recalled products",
      "summary": "TJX Companies Inc., the parent company of T.J. Maxx, Marshalls, and HomeGoods, has agreed to pay a $13 million fine for selling approximately 1,200 recalled products, including those that posed a suffocation risk to infants. The sales occurred between 2014 and 2019 at brick-and-mortar stores and online. TJX will also implement internal controls and file annual compliance reports for five years to prevent future sales of recalled items.",
      "url": "https://abcnews.go.com/Business/tj-maxx-parent-company-pay-13-million-selling/story?id=87872755",
      "source": "ABC News",
      "published": "20220803T113100",
      "overall_sentiment_score": -0.180575,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.107537,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.631242
    },
    {
      "title": "Johnson & Johnson supports creation of the Africa Frontline First Catalytic Fund",
      "summary": "Johnson & Johnson, through its Foundation, is committing $15 million over three years to support the Global Fund's Africa Frontline First Catalytic Fund (AFF-CF). This initiative aims to strengthen primary healthcare by professionalizing and expanding the workforce of community health workers in 10 African countries by 2030. This support aligns with the Johnson & Johnson Center for Health Worker Innovation's broader commitment to aid 1 million health workers by 2030.",
      "url": "https://www.jnj.com/global-health-equityjohnson-johnson-supports-creation-of-the-africa-frontline-first-catalytic-fund",
      "source": "Johnson & Johnson",
      "published": "20220808T171640",
      "overall_sentiment_score": 0.019935,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.034681,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.305958
    }
  ]
}