{
  "ticker": "JNJ",
  "date": "2023-01-30",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T11:49:41.402969",
  "source": "alpha_vantage",
  "article_count": 2,
  "articles": [
    {
      "title": "Drug wholesaler AmerisourceBergen to change name amid expansion plans",
      "summary": "AmerisourceBergen, a global drug shipping company based in Conshohocken, is changing its name to Cencora to better reflect its expanded global reach and identity as a healthcare company. This rebranding comes as the company continues to grow, having reported $239 billion in revenue last fiscal year and recently acquiring Europe-based Walgreens Boots Alliance Inc. for $6.3 billion, despite facing scrutiny and legal actions related to its opioid distribution practices. The new name is expected to be in use by the second half of 2023.",
      "url": "https://www.phillyvoice.com/amerisourcebergen-name-change-cencora-conshohocken-drug-shipping-opioids/",
      "source": "PhillyVoice",
      "published": "20230124T000000",
      "overall_sentiment_score": 0.047688,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.042359,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.642915
    },
    {
      "title": "Biosimilar advances for Alvotech-Teva and setback for Biocon Biologics",
      "summary": "Alvotech and Teva Pharmaceuticals announced that the FDA accepted for review their Biologics License Application (BLA) for AVT04, a proposed biosimilar to Stelara (ustekinumab), indicating positive progress. Meanwhile, Biocon Biologics received a complete response letter (CRL) from the FDA for its insulin aspart biosimilar application, citing additional data requirements and pre-approval inspection issues. This article highlights contrasting developments in the biosimilar landscape for these companies.",
      "url": "https://gabionline.net/biosimilars/news/biosimilar-advances-for-alvotech-teva-and-setback-for-biocon-biologics",
      "source": "Generics and Biosimilars Initiative",
      "published": "20230120T000000",
      "overall_sentiment_score": 0.06086,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.132335,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.613805
    }
  ]
}