{
  "ticker": "JNJ",
  "date": "2024-04-15",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T11:55:10.284942",
  "source": "alpha_vantage",
  "article_count": 6,
  "articles": [
    {
      "title": "RallyBio (RLYB) Partners With J&J & Gets $6.6M Funding, Stock Up",
      "summary": "RallyBio's (RLYB) shares surged 82.8% after announcing a collaboration with Johnson & Johnson (J&J) and a $6.6 million equity investment. The partnership aims to develop complementary therapeutic approaches for fetal and neonatal alloimmune thrombocytopenia (FNAIT), with RallyBio focusing on prevention for unaoimmunized individuals and J&J developing a treatment for already alloimmunized patients. RallyBio is advancing its investigational therapy, RLYB212, and plans to initiate a phase II study in late 2024.",
      "url": "https://www.nasdaq.com/articles/rallybio-rlyb-partners-with-jj-gets-$6.6m-funding-stock-up",
      "source": "Nasdaq",
      "published": "20240412T102300",
      "overall_sentiment_score": 0.535717,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.465765,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.861028
    },
    {
      "title": "Teva, Viatris win new chance to challenge J&J schizophrenia drug patent",
      "summary": "Teva Pharmaceutical and Viatris have won a new chance to challenge a Johnson & Johnson patent for its schizophrenia drug, Invega Sustenna. A U.S. appeals court revived their challenges, stating the patent may be invalid and sending the case back for reconsideration, which could pave the way for cheaper generic versions. J&J sold over $4.1 billion of the drug worldwide last year, with $2.9 billion in U.S. sales.",
      "url": "https://www.reuters.com/business/healthcare-pharmaceuticals/teva-viatris-win-new-chance-challenge-jj-schizophrenia-drug-patent-2024-04-01/",
      "source": "Reuters",
      "published": "20240401T180100",
      "overall_sentiment_score": 0.317811,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.33554,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.821109
    },
    {
      "title": "5 things that will shape surgical robotics over the next decade",
      "summary": "The surgical robotics sector is poised for significant growth in 2024 and beyond, driven by developments such as Intuitive Surgical's da Vinci 5 approval and the emergence of smaller, more portable consoles. Remote connectivity, powered by both 5G and dedicated fiber optic networks, and the increasing integration of AI are also crucial factors. Additionally, experienced executives from successful surgical robotics companies are re-entering the market with new ventures, intensifying competition and innovation.",
      "url": "https://www.medicaldesignandoutsourcing.com/five-things-shaping-surgical-robotics-over-the-next-decade/",
      "source": "Medical Design & Outsourcing",
      "published": "20240404T000000",
      "overall_sentiment_score": 0.345892,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.348832,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.664241
    },
    {
      "title": "Vertex pays $4.9 billion to hike Alpine’s immunology trail",
      "summary": "Vertex Pharmaceuticals is acquiring Alpine Immune Sciences for $4.9 billion, marking the largest acquisition of the year so far and highlighting significant investment in immunology and inflammation. This deal grants Vertex access to Alpine’s lead asset, povetacicept, a potential best-in-class treatment for IgA nephropathy, lupus, and autoimmune cytopenias, with promising new clinical trial data. The acquisition strengthens Vertex's immunology portfolio, aligning with a broader industry trend of pharmas seeking M&A opportunities in this therapeutic area.",
      "url": "https://www.fiercebiotech.com/biotech/vertex-pays-49-billion-hike-alpines-immunology-trail",
      "source": "Fierce Biotech",
      "published": "20240410T173000",
      "overall_sentiment_score": 0.1627,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.114479,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.619749
    },
    {
      "title": "High-flying Vertex hikes CEO Reshma Kewalramani's pay by 30% to $20.6M",
      "summary": "Vertex Pharmaceuticals CEO Reshma Kewalramani received a 30% pay raise in 2023, bringing her total compensation to $20.6 million, following a 41% surge in the company's share price. This places her among the highest-paid biopharma CEOs, despite being the only woman leading a top-tier biopharma company. The increase was largely driven by a boost in stock awards, and comes after a successful year for Vertex, including an 11% revenue increase and the landmark FDA approval of Casgevy.",
      "url": "https://www.fiercepharma.com/pharma/vertex-hikes-ceo-kewalramanis-pay-30-206m",
      "source": "Fierce Pharma",
      "published": "20240408T082600",
      "overall_sentiment_score": 0.175333,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.126331,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.615302
    },
    {
      "title": "Richard Spector Named Chief Commercial Officer at Femasys",
      "summary": "Richard Spector has been appointed as the new Chief Commercial Officer at Femasys Inc., bringing over 25 years of experience in leading public and private healthcare companies through various commercialization stages. He will be responsible for leading the company's commercialization efforts, particularly for upcoming product launches like FemaSeed and FemBloc. Spector's background includes leadership roles at Qlibrium and Insulet Corporation, where he focused on sales, marketing, and strategic alliances.",
      "url": "https://www.mpo-mag.com/breaking-news/richard-spector-named-chief-commercial-officer-at-femasys/",
      "source": "Medical Product Outsourcing",
      "published": "20240408T000000",
      "overall_sentiment_score": 0.314453,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.226217,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.567595
    }
  ]
}