{
  "ticker": "JNJ",
  "date": "2024-05-06",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T11:55:24.344169",
  "source": "alpha_vantage",
  "article_count": 6,
  "articles": [
    {
      "title": "Johnson & Johnson, Kenvue Hit With $45 Million Talc Judgment",
      "summary": "An Illinois court has ordered Johnson & Johnson and its former spinoff Kenvue Inc. to pay $45 million to the family of Theresa Garcia after a jury determined their talcum-based baby powders caused her fatal cancer. Garcia, a mother of six, died in 2020 from mesothelioma, a cancer linked to asbestos exposure, which expert witnesses testified was present in some J&J baby powder samples. This verdict against Kenvue is the first since it became independent in August 2023, inheriting talc-related liabilities, and comes amidst over 53,000 talcum powder lawsuits against Johnson & Johnson.",
      "url": "https://www.drugwatch.com/news/2024/04/30/johnson-johnson-kenvue-hit-with-45-million-talc-judgment/",
      "source": "Drugwatch.com",
      "published": "20240430T000000",
      "overall_sentiment_score": -0.589218,
      "overall_sentiment_label": "Bearish",
      "ticker_sentiment_score": -0.526573,
      "ticker_sentiment_label": "Bearish",
      "relevance_score": 0.946114
    },
    {
      "title": "Johnson & Johnson and Spinoff Kenvue Ordered to Pay US$45 Million in Talc Cancer Case",
      "summary": "Johnson & Johnson and its spinoff Kenvue Inc. have been ordered to pay US$45 million to the family of an Illinois woman who died from cancer, which her family attributed to the companies' talcum-based baby powders. A Chicago jury assigned 70% responsibility to Kenvue and the rest to J&J. This verdict marks the first against Kenvue in the ongoing talc litigation, while J&J maintains its products are safe and has transitioned to cornstarch-based formulations.",
      "url": "https://www.globalcosmeticsnews.com/johnson-johnson-and-spinoff-kenvue-ordered-to-pay-us45-million-in-talc-cancer-case/",
      "source": "Global Cosmetics News",
      "published": "20240429T000000",
      "overall_sentiment_score": -0.349656,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.338728,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.936242
    },
    {
      "title": "J&J Spin-Off CISO on Maximizing Cybersecurity",
      "summary": "Mike Wagner, the first CISO of Kenvue, J&J's consumer healthcare spin-off, discusses his strategy for building a robust and cost-effective security program. He focused on combining the best practices from J&J with new ideas, including incorporating AI and machine learning, strategically deciding which tools to retain or replace, and assembling a diverse team with roles like Business Information Security Officers (BISOs). Wagner also highlights the importance of transitioning security seamlessly while laying the foundation for future strategies like zero trust.",
      "url": "https://www.darkreading.com/identity-access-management-security/jj-spin-off-ciso-maximize-cybersecurity",
      "source": "Dark Reading | Security",
      "published": "20240425T000000",
      "overall_sentiment_score": 0.322381,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.254626,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.801335
    },
    {
      "title": "Vertex has top orphan asset in the pipeline, as pharma eyes shiny obesity drugs: report",
      "summary": "Vertex Pharmaceuticals' new cystic fibrosis triple combo, VX-121, is projected to be the top-selling orphan drug with a net present value of $5.8 billion by 2028, according to Evaluate. This comes as the pharma industry shifts its focus, with a \"blazing return\" of blockbuster drugs for major diseases like obesity, impacting the growth rate of orphan drug sales. Despite this, orphan drugs are expected to generate $270 billion in sales by 2028.",
      "url": "https://www.fiercebiotech.com/biotech/vertex-has-top-orphan-drug-pipeline-pharma-eyes-shiny-obesity-drugs-report",
      "source": "Fierce Biotech",
      "published": "20240424T120100",
      "overall_sentiment_score": 0.165403,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.13023,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.746566
    },
    {
      "title": "Cidara Therapeutics Reacquires Global Development and Commercial Rights to CD388 and Announces Private Placement Financing of $240 Million",
      "summary": "Cidara Therapeutics has reacquired the global development and commercial rights to CD388, an investigational drug for influenza prevention, from Johnson & Johnson. This move is supported by a $240 million private placement financing led by RA Capital Management, enabling Cidara to fund a Phase 2b clinical trial for CD388. The company aims to develop CD388 as a universal preventative against seasonal and pandemic influenza and has also appointed new board members as part of these strategic changes.",
      "url": "https://www.globenewswire.com/news-release/2024/04/24/2869086/0/en/Cidara-Therapeutics-Reacquires-Global-Development-and-Commercial-Rights-to-CD388-and-Announces-Private-Placement-Financing-of-240-Million.html",
      "source": "GlobeNewswire",
      "published": "20240424T160500",
      "overall_sentiment_score": 0.294053,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.126597,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.646246
    },
    {
      "title": "Novo-Backed Reunion Raises $103M Series A Financing for Psychedelic Trial",
      "summary": "Reunion Neuroscience has successfully raised $103 million in Series A financing, co-led by Novo Holdings and MPM BioImpact, to advance its lead candidate RE104. The funds will support a Phase II trial for RE104, a serotonergic psychedelic drug candidate, in patients with postpartum depression, with patient enrollment starting this quarter and results expected in Q2 2025. Reunion is also exploring RE104 for other neuropsychiatric indications, such as adjustment disorder in cancer, aiming to address unmet medical needs.",
      "url": "https://www.biospace.com/novo-holdings-backed-reunion-neuroscience-raises-103m-series-a-financing-for-psychedelic-trial",
      "source": "BioSpace",
      "published": "20240503T000000",
      "overall_sentiment_score": 0.031307,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.133632,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.594188
    }
  ]
}