{
  "ticker": "JNJ",
  "date": "2024-11-11",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T11:57:30.539756",
  "source": "alpha_vantage",
  "article_count": 10,
  "articles": [
    {
      "title": "Contineum Therapeutics Reports Third Quarter 2024 Financial Results and Recent Business Highlights",
      "summary": "Contineum Therapeutics reported its Q3 2024 financial results, showcasing a strong cash position of $214 million expected to fund operations through 2027. The company is on track with enrollment for its PIPE-307 VISTA trial for RRMS and plans to initiate a Phase 1b PET trial for PIPE-791 in Q4 2024, with multiple clinical readouts anticipated in 2025. Janssen Pharmaceutica also confirmed plans to initiate a Phase 2 trial of PIPE-307 in depression.",
      "url": "https://www.businesswire.com/news/home/20241106662946/en/Contineum-Therapeutics-Reports-Third-Quarter-2024-Financial-Results-and-Recent-Business-Highlights",
      "source": "Business Wire",
      "published": "20241106T000000",
      "overall_sentiment_score": 0.347687,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.295304,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.742945
    },
    {
      "title": "Legend Biotech names Alan Bash as leader of its CAR-T product",
      "summary": "Legend Biotech Corporation has appointed Alan Bash as president of its CAR-T product, CARVYKTI®. In this new role, Bash will manage the continued growth of CARVYKTI®, overseeing commercial, technical operations, and quality functions. His appointment follows recent label expansions for CARVYKTI® and aims to strengthen Legend Biotech's leadership in multiple myeloma treatment.",
      "url": "https://www.roi-nj.com/2024/11/05/healthcare/legend-biotech-names-alan-bash-as-leader-of-its-car-t-product/",
      "source": "ROI-NJ",
      "published": "20241105T000000",
      "overall_sentiment_score": 0.470147,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.319346,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.647102
    },
    {
      "title": "Boston Scientific continues M&A run with Cortex buy",
      "summary": "Boston Scientific has agreed to acquire privately held Cortex, a company developing diagnostic mapping technology for atrial fibrillation, for an undisclosed amount. This acquisition adds to Boston Scientific’s electrophysiology portfolio and follows other significant M&A activities this year, including the completed Silk Road Medical deal and the pending Axonics purchase. The Cortex deal is expected to close in the first half of 2025 and will aid in developing strategies for complex AFib cases, especially amid the rise of pulsed field ablation devices.",
      "url": "https://www.medtechdive.com/news/boston-scientific-cortex-deal/731897/",
      "source": "MedTech Dive",
      "published": "20241104T000000",
      "overall_sentiment_score": 0.175624,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.055016,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.569962
    },
    {
      "title": "Essa abandons sole clinical-stage drug after falling short against Xtandi in phase 2 trial",
      "summary": "Essa Pharma has terminated its sole clinical-stage drug candidate, masofaniten, after it failed to show clear efficacy benefits against Xtandi in a phase 2 prostate cancer trial. The biotech observed a much higher PSA90 response rate in Xtandi monotherapy patients than expected, leading to the abandonment of masofaniten and a strategic review to maximize shareholder value. Following the news, Essa's stock plummeted by 65% in premarket trading.",
      "url": "https://www.fiercebiotech.com/biotech/essa-abandons-sole-clinical-stage-drug-after-falling-short-against-xtandi",
      "source": "Fierce Biotech",
      "published": "20241101T073300",
      "overall_sentiment_score": -0.248092,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": 0.045319,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.633673
    },
    {
      "title": "AbbVie signs agreement to acquire Aliada for $1.4bn",
      "summary": "AbbVie has entered a definitive agreement to acquire Aliada Therapeutics for $1.4bn in cash, with the transaction expected to finalize in Q4 2024. The acquisition includes Aliada’s lead investigational product, ALIA-1758, a potential Alzheimer's disease treatment utilizing a blood-brain barrier-crossing technology. This deal aims to enhance AbbVie's R&D capabilities in neurological disorders.",
      "url": "https://www.pharmaceutical-technology.com/news/abbvie-agreement-acquire-aliada/",
      "source": "Pharmaceutical Technology",
      "published": "20241029T000000",
      "overall_sentiment_score": 0.30617,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.113326,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.606965
    },
    {
      "title": "EXCLUSIVE: Andrew Stanleick Joins Kenvue",
      "summary": "Andrew Stanleick, formerly CEO of BeautyHealth and a Coty executive, has been appointed president of skin health and beauty for North America, Europe, Middle East, and Africa at Kenvue Inc. He will oversee major brands like Neutrogena and Aveeno. This move comes as Kenvue, recently spun off from Johnson & Johnson, faces scrutiny from activist investor Starboard Value to improve its skin care segment.",
      "url": "https://wwd.com/beauty-industry-news/beauty-features/exclusive-andrew-stanleick-joins-kenvue-skincare-1236711360/",
      "source": "WWD",
      "published": "20241105T120000",
      "overall_sentiment_score": 0.192784,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.137123,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.646566
    },
    {
      "title": "How Cidara Got Its Molecule Back",
      "summary": "Cidara Therapeutics reacquired its lead drug-Fc conjugate, CD388, from Janssen Pharmaceuticals after J&J decided to exit infectious disease development. This complex process involved securing $240 million in funding and divesting its approved antifungal drug, rezafungin, to focus entirely on CD388. Cidara is now aggressively advancing CD388, a long-acting antiviral intended for universal flu prevention, into a phase 2b clinical study, highlighting its potential as a novel approach distinct from traditional vaccines and monoclonal antibodies.",
      "url": "https://www.bioprocessonline.com/doc/how-cidara-got-its-molecule-back-0001",
      "source": "Bioprocess Online",
      "published": "20241030T000000",
      "overall_sentiment_score": 0.233092,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.149306,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.736905
    },
    {
      "title": "Pfizer management looks to show turnaround as Starboard looms",
      "summary": "Pfizer's upcoming quarterly financial report is critical as activist hedge fund Starboard Value pressures the company and its CEO to demonstrate a promised turnaround. Investors are seeking improved profitability from cost cuts and revenue growth from recent acquisitions, particularly in cancer drugs. Starboard CEO Jeff Smith suggests material changes are needed, while analysts emphasize the importance of laying groundwork for future growth and focusing on key therapeutic areas.",
      "url": "https://www.reuters.com/business/healthcare-pharmaceuticals/pfizer-management-looks-show-turnaround-starboard-looms-2024-10-28/",
      "source": "Reuters",
      "published": "20241028T102200",
      "overall_sentiment_score": 0.072966,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.113967,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.571387
    },
    {
      "title": "Discover the 3 Best-Performing Biotech IPO Stocks of 2024",
      "summary": "This article highlights the top three best-performing biotech IPO stocks of 2024: CG Oncology (CGON), ArriVent BioPharma (AVBP), and Upstream Bio (UPB). It details their significant gains since going public, the drugs they are developing, and the factors contributing to their success, particularly strong institutional demand. The article also provides financial data, clinical trial status, and analyst price targets for each company.",
      "url": "https://www.marketbeat.com/stock-ideas/discover-the-3-best-performing-biotech-ipo-stocks-of-2024/",
      "source": "MarketBeat",
      "published": "20241106T000000",
      "overall_sentiment_score": 0.168887,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.004063,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.625204
    },
    {
      "title": "Top 5 Companies in the Surgical Robots Industry: Growth Prospects, Trends and Challenges",
      "summary": "This article identifies the top 5 companies in the surgical robots industry, discussing their growth prospects, market trends, and existing challenges. The global surgical robots market is projected to grow significantly, driven by increasing adoption of robotic surgery, a rise in surgical procedures, and technological advancements, despite challenges like high equipment costs. Key players highlighted include Intuitive Surgical, Stryker Corporation, Medtronic, Zimmer Biomet Holdings, and CMR Surgical.",
      "url": "https://www.sphericalinsights.com/blogs/top-5-companies-in-the-surgical-robots-industry-growth-prospects-trends-and-challenges",
      "source": "Spherical Insights",
      "published": "20241101T000000",
      "overall_sentiment_score": 0.356384,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.287988,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.646131
    }
  ]
}