{
  "ticker": "JNJ",
  "date": "2025-12-15",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T12:03:15.434317",
  "source": "alpha_vantage",
  "article_count": 50,
  "articles": [
    {
      "title": "Johnson & Johnson Stock (JNJ) Today: FDA Fast‑Track Voucher Lifts Oncology Narrative as Talc Verdict Renews Legal Overhang",
      "summary": "Johnson & Johnson (JNJ) stock is navigating contrasting news today: a positive FDA priority voucher for a multiple myeloma treatment boosting its oncology outlook, and a negative $40 million talc verdict renewing litigation concerns. While analysts have raised price targets, the stock's strong rally suggests it's entering a \"prove it\" phase, where further significant gains will likely depend on new catalysts beyond multiple expansion. The company's strategic focus on high-growth areas and consistent dividend increases continue to underpin its investment case despite ongoing legal challenges.",
      "url": "https://ts2.tech/en/johnson-johnson-stock-jnj-today-fda-fast-track-voucher-lifts-oncology-narrative-as-talc-verdict-renews-legal-overhang/",
      "source": "ts2.tech",
      "published": "20251215T180817",
      "overall_sentiment_score": 0.105549,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.140367,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 1.0
    },
    {
      "title": "FDA ‘proactively’ awards J&J a national priority review voucher for multiple myeloma drug combo",
      "summary": "The FDA has proactively granted Johnson & Johnson a National Priority Review Voucher for its Tecvayli and Darzalex combination for multiple myeloma, aiming for a decision within one to two months. This follows \"unprecedented\" Phase 3 MajesTEC-3 trial results showing a 54% reduction in death risk and 83% progression-free survival advantage over traditional regimens. The voucher, one of 16 issued under the pilot program, reflects the FDA's commitment to swiftly advancing treatments with outstanding results.",
      "url": "https://www.fiercepharma.com/pharma/fda-proactively-awards-jj-national-priority-voucher-multiple-myeloma-drug-combo",
      "source": "Fierce Pharma",
      "published": "20251215T173521",
      "overall_sentiment_score": 0.279392,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.459256,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Johnson & Johnson bị tòa ra phát quyết bất lợi, phải bồi thường 40 triệu đô la cho 2 bệnh nhân ung thư đã sử dụng phấn rôm.",
      "summary": "Một bồi thẩm đoàn ở Los Angeles đã yêu cầu Johnson & Johnson bồi thường 40 triệu đô la cho hai phụ nữ bị ung thư buồng trứng mà họ cho là do sử dụng phấn rôm của công ty. Johnson & Johnson đã tuyên bố sẽ kháng cáo phán quyết này, khẳng định rằng bột talc của họ an toàn và không gây ung thư. Vụ việc này tiếp nối một loạt các vụ kiện chống lại công ty về mối liên hệ giữa các sản phẩm bột talc của họ và các loại ung thư khác nhau.",
      "url": "https://thuongtruong.com.vn/news/johnson-johnson-bi-toa-ra-phat-quyet-bat-loi-phai-boi-thuong-40-trieu-do-la-cho-2-benh-nhan-ung-thu-da-su-dung-phan-rom-157053.html",
      "source": "Tạp chí điện tử Thương Trường",
      "published": "20251214T084700",
      "overall_sentiment_score": -0.701343,
      "overall_sentiment_label": "Bearish",
      "ticker_sentiment_score": -0.739375,
      "ticker_sentiment_label": "Bearish",
      "relevance_score": 1.0
    },
    {
      "title": "J&J’s talc trouble continues: Johnson & Johnson ordered to pay $40 million in baby powder cancer case",
      "summary": "A California jury has ordered Johnson & Johnson to pay $40 million to two women who claim the company's talc-based baby powder caused their ovarian cancer. The women testified that decades of use led to major surgeries and chemotherapy. Johnson & Johnson plans to appeal the verdict, asserting its products are safe and do not cause cancer, while facing over 67,000 similar lawsuits.",
      "url": "https://timesofindia.indiatimes.com/business/international-business/jjs-talc-trouble-continues-johnson-johnson-ordered-to-pay-40-million-in-baby-powder-cancer-case/articleshow/125943232.cms",
      "source": "Times of India",
      "published": "20251214T000829",
      "overall_sentiment_score": -0.407333,
      "overall_sentiment_label": "Bearish",
      "ticker_sentiment_score": -0.440664,
      "ticker_sentiment_label": "Bearish",
      "relevance_score": 1.0
    },
    {
      "title": "Johnson & Johnson Ordered to Pay $40M in Talcum Powder Verdict",
      "summary": "A Los Angeles jury ordered Johnson & Johnson to pay $40 million to two women who alleged that the company's talcum powder caused their ovarian cancer. This verdict is the latest development in ongoing litigation against J&J concerning its talc-based products, following a failed $9 billion settlement plan earlier this year. Johnson & Johnson maintains that its talc products are safe and plans to appeal the decision.",
      "url": "https://www.newsweek.com/johnson-johnson-ordered-to-pay-40m-in-talcum-powder-verdict-11207960",
      "source": "Newsweek",
      "published": "20251213T162700",
      "overall_sentiment_score": -0.611624,
      "overall_sentiment_label": "Bearish",
      "ticker_sentiment_score": -0.637904,
      "ticker_sentiment_label": "Bearish",
      "relevance_score": 1.0
    },
    {
      "title": "Jury says Johnson & Johnson owes $40 million to 2 cancer patients who used talcum powders",
      "summary": "A Los Angeles jury has awarded $40 million to two women who claimed Johnson & Johnson's talcum powder caused their ovarian cancer. The company plans to appeal the verdict, asserting that talc is safe and does not cause cancer. This case is the latest development in ongoing legal battles concerning the alleged link between talcum powder and various cancers.",
      "url": "https://abcnews.go.com/Business/wireStory/jury-johnson-johnson-owes-40-million-2-cancer-128377954",
      "source": "ABC News",
      "published": "20251213T143900",
      "overall_sentiment_score": -0.41952,
      "overall_sentiment_label": "Bearish",
      "ticker_sentiment_score": -0.448324,
      "ticker_sentiment_label": "Bearish",
      "relevance_score": 1.0
    },
    {
      "title": "J&J’s talc trouble continues: Johnson & Johnson ordered to pay $40 million in baby powder cancer case",
      "summary": "A California jury ordered Johnson & Johnson to pay $40 million to two women who argued its talc-based baby powder caused their ovarian cancer after decades of use. J&J plans to appeal the verdict, asserting its products are safe and that the ruling lacks evidence. The company faces over 67,000 similar lawsuits despite discontinuing talc-based baby powder sales in the U.S. in 2020.",
      "url": "https://timesofindia.indiatimes.com/world/us/jjs-talc-trouble-continues-johnson-johnson-ordered-to-pay-40-million-in-baby-powder-cancer-case/articleshow/125943232.cms",
      "source": "Times of India",
      "published": "20251213T030814",
      "overall_sentiment_score": -0.440388,
      "overall_sentiment_label": "Bearish",
      "ticker_sentiment_score": -0.416802,
      "ticker_sentiment_label": "Bearish",
      "relevance_score": 1.0
    },
    {
      "title": "Johnson & Johnson (JNJ) Stock News Today, Forecasts and Analyst Targets (Dec. 12, 2025)",
      "summary": "Johnson & Johnson (JNJ) stock is trading near record highs, closing Thursday at an all-time high of $210.01. Analysts are actively recalibrating price targets, with Wells Fargo raising its target to $230 and Morgan Stanley to $197, reflecting a valuation debate. The company's momentum is driven by strong Q3 2025 earnings, a raised sales outlook, a planned orthopaedics spin-off, and positive late-stage clinical data in oncology and hematology, despite ongoing talc litigation and policy uncertainties.",
      "url": "https://ts2.tech/en/johnson-johnson-jnj-stock-news-today-forecasts-and-analyst-targets-dec-12-2025/",
      "source": "ts2.tech",
      "published": "20251212T150823",
      "overall_sentiment_score": 0.064288,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.305284,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Johnson & Johnson (JNJ) Stock on December 10, 2025: Pipeline Breakthroughs, Talc Risks and What Analysts Expect Next",
      "summary": "Johnson & Johnson's (JNJ) stock is trading near record highs, driven by strong growth in oncology and immunology, especially new data on its multiple myeloma treatments Tecvayli and Carvykti, and the potential blockbuster drug icotrokinra. However, the company faces significant challenges from ongoing talc litigation, with over 90,000 lawsuits and no global settlement in sight. Analysts have a \"Moderate Buy\" consensus, with price targets close to current trading levels, while some valuation models suggest the stock is still undervalued despite its 2025 rally.",
      "url": "https://ts2.tech/en/johnson-johnson-jnj-stock-on-december-10-2025-pipeline-breakthroughs-talc-risks-and-what-analysts-expect-next/",
      "source": "ts2.tech",
      "published": "20251210T180758",
      "overall_sentiment_score": 0.202564,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.28422,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "J&J’s $1.7 billion bet on Israeli heart device falters after FDA panel vote",
      "summary": "Johnson & Johnson's acquisition of Israeli heart-device maker V-Wave, valued at up to $1.7 billion, is in jeopardy after an FDA advisory panel unanimously voted against the effectiveness and risk-benefit of V-Wave's Ventura Interatrial Shunt System. The acquisition's full value, with $1.1 billion contingent on regulatory approval, is now uncertain as the FDA typically follows such recommendations, potentially limiting the device's market or requiring further trials. This outcome impacts J&J's strategy to offset future revenue loss from other blockbuster drugs.",
      "url": "https://www.calcalistech.com/ctechnews/article/bkycyhizbx",
      "source": "CTech",
      "published": "20251210T084136",
      "overall_sentiment_score": -0.425781,
      "overall_sentiment_label": "Bearish",
      "ticker_sentiment_score": -0.41687,
      "ticker_sentiment_label": "Bearish",
      "relevance_score": 1.0
    },
    {
      "title": "Key facts: Johnson & Johnson Raises Dividend; Reports Positive Study Results",
      "summary": "Johnson & Johnson (JNJ) has increased its dividend for 63 consecutive years, offering a 2.58% yield with an annual payout of $5.20. The company also announced positive Phase 3 study results for TECVAYLI and DARZALEX FASPRO in treating relapsed multiple myeloma patients.",
      "url": "https://www.tradingview.com/news/tradingview:53d82b113d717:0-key-facts-johnson-johnson-raises-dividend-reports-positive-study-results/",
      "source": "TradingView",
      "published": "20251209T200755",
      "overall_sentiment_score": 0.469711,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.484344,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "JNJ vs. PFE: Which Blue-Chip Drug Stock is the Better Investment Now?",
      "summary": "This article compares Johnson & Johnson (JNJ) and Pfizer (PFE), two prominent blue-chip pharmaceutical companies, to determine which offers a better investment opportunity. It delves into their fundamental strengths, growth prospects, and challenges, including patent expirations and the impact of the Medicare Part D redesign. Ultimately, the analysis suggests J&J is the better pick due to its diversified business model, strong pipeline, and consistent financial performance, despite Pfizer's attractive valuation and dividend yield.",
      "url": "https://finviz.com/news/250550/jnj-vs-pfe-which-blue-chip-drug-stock-is-the-better-investment-now",
      "source": "Finviz",
      "published": "20251210T134939",
      "overall_sentiment_score": 0.195877,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.256382,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.985945
    },
    {
      "title": "France - Nanobiotix Seals A Non-dilutive Royalty Financing Agreement For Up To $71 Million",
      "summary": "Nanobiotix has secured a non-dilutive royalty financing agreement with HealthCare Royalty (HCRx) for up to $71 million. This deal involves Nanobiotix receiving an upfront payment of $50 million and eligibility for an additional $21 million, in exchange for a portion of royalties from the sales of JNJ-1900 (NBTXR3), an oncology product. The agreement leverages Nanobiotix's previous exclusive license agreement for JNJ-1900 with Janssen Pharmaceutica NV.",
      "url": "https://www.mondaq.com/pressrelease/183006/nanobiotix-seals-a-non-dilutive-royalty-financing-agreement-for-up-to-%2471-million",
      "source": "Mondaq",
      "published": "20251210T060825",
      "overall_sentiment_score": 0.372029,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.310499,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.719588
    },
    {
      "title": "Protagonist Reports Third Quarter 2025 Financial Results and Provides Corporate Update",
      "summary": "Protagonist Therapeutics announced its third-quarter 2025 financial results and a corporate update, highlighting significant progress in both partnered and wholly-owned programs. Key achievements include NDA and EMA submissions for icotrokinra for psoriasis, rusfertide receiving Breakthrough Therapy Designation for Polycythemia Vera, and the dosing of the first patient in a Phase 1 trial for PN-881, an oral IL-17 peptide antagonist. The company maintains a strong financial position with $678.8 million in cash, cash equivalents, and marketable securities, projected to fund operations through at least the end of 2028.",
      "url": "https://www.dailycomet.com/press-release/story/27689/protagonist-reports-third-quarter-2025-financial-results-and-provides-corporate-update-2/",
      "source": "Daily Comet",
      "published": "20251210T150945",
      "overall_sentiment_score": 0.370047,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.309719,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.712103
    },
    {
      "title": "Kenvue Stock (KVUE) Today: Latest News, Deal Outlook, Analyst Forecasts and Key Risks (Dec. 15, 2025)",
      "summary": "Kenvue Inc. (NYSE: KVUE) stock is currently trading around $17.3, below the implied value of the Kimberly-Clark acquisition offer of approximately $18.59, reflecting market concerns about the deal's timeline, risks, and ongoing Tylenol litigation. Key factors influencing the stock include the S-4 filing progress, shareholder sentiment, and legal developments, particularly the Texas Attorney General's lawsuit against Johnson & Johnson and Kenvue. Despite the acquisition context, Kenvue's recent operational performance shows a decline in net sales and organic sales, with reaffirmed FY2025 modest outlook.",
      "url": "https://ts2.tech/en/kenvue-stock-kvue-today-latest-news-deal-outlook-analyst-forecasts-and-key-risks-dec-15-2025/",
      "source": "ts2.tech",
      "published": "20251215T133223",
      "overall_sentiment_score": 0.027755,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.23307,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.703865
    },
    {
      "title": "AtriCure reports first patients treated with dual-energy PFA, RF platform",
      "summary": "AtriCure announced the successful first-in-human AFib treatments using its new dual-energy surgical cardiac ablation platform, which combines pulsed field ablation (PFA) and advanced radiofrequency ablation (RFA). This platform aims to leverage the benefits of both technologies, with initial procedures showing very quick ablation times. AtriCure plans to conduct a clinical trial to pursue regulatory approvals for this innovative system.",
      "url": "https://www.massdevice.com/atricure-first-patients-treated-dual-energy-pfa/",
      "source": "MassDevice",
      "published": "20251211T190849",
      "overall_sentiment_score": 0.198601,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.134873,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.644991
    },
    {
      "title": "3 High-Yielding ETFs That Retirees Will Love",
      "summary": "This article highlights three high-yielding ETFs (SCHD, DGRO, NOBL) that are suitable for retirees and income-seeking investors due to their dividend payouts, low beta values, and diversified holdings. Each ETF is analyzed for its specific characteristics, such as expense ratio, yield, and portfolio composition, emphasizing their stability and potential for long-term income generation. The article stresses the importance of ETFs in reducing risk compared to investing in individual dividend stocks.",
      "url": "https://finviz.com/news/252565/3-high-yielding-etfs-that-retirees-will-love",
      "source": "Finviz",
      "published": "20251212T063500",
      "overall_sentiment_score": 0.383037,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.330894,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.643744
    },
    {
      "title": "Roll Tide: Lilly selects Alabama site as location for $6B API facility",
      "summary": "Eli Lilly announced Huntsville, Alabama, as the location for a $6 billion active pharmaceutical ingredient (API) manufacturing facility, the third of four planned \"mega sites\" in the U.S. This plant will produce API for peptide and small-molecule medicines, including the GLP-1 weight-loss pill orforglipron, and is expected to create 450 jobs. The investment is part of a larger $27 billion plan to bolster domestic manufacturing and supply chain resilience.",
      "url": "https://www.fiercepharma.com/pharma/roll-tide-lilly-selects-alabama-site-location-6b-api-facility-0",
      "source": "Fierce Pharma",
      "published": "20251209T200907",
      "overall_sentiment_score": 0.314331,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.226171,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.642303
    },
    {
      "title": "Exicure Rally Fueled By Rapid Cell-Boosting Results In Blood Cancer Trial",
      "summary": "Exicure, Inc. (NASDAQ: XCUR) stock surged after sharing positive Phase 2 trial results for burixafor (GPC-100) in combination with propranolol and granulocyte colony-stimulating factor (G-CSF) for mobilizing hematopoietic progenitor cells in multiple myeloma patients. Approximately 90% of participants achieved the primary endpoint of collecting sufficient CD34+ cells, with rapid mobilization kinetics and a favorable safety profile observed, even in patients with prior daratumumab exposure. The differentiated and rapid mobilization kinetics of burixafor allows for same-day administration and apheresis.",
      "url": "https://www.sahmcapital.com/news/content/exicure-rally-fueled-by-rapid-cell-boosting-results-in-blood-cancer-trial-2025-12-09",
      "source": "Sahm",
      "published": "20251209T190903",
      "overall_sentiment_score": 0.484395,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.299967,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.6422
    },
    {
      "title": "OS Therapies targets January BLA filing for OST-HER2 following successful Type C meeting with FDA",
      "summary": "OS Therapies Inc. aims for a January Biologics License Application (BLA) filing for its OST-HER2 immunotherapy platform, which targets osteosarcoma. This follows successful regulatory discussions with the FDA, MHRA, and European CHMP, focusing on accelerated approval pathways using historical control data and biomarkers. The company's unique approach utilizes attenuated listeria engineered to trigger a robust immune response against HER2-expressing cancer cells, with potential expansion to HPV-driven cancers and prostate cancer.",
      "url": "https://www.proactiveinvestors.com/companies/news/1084436/os-therapies-targets-january-bla-filing-for-ost-her2-following-successful-type-c-meeting-with-fda-1084436.html",
      "source": "Proactive financial news",
      "published": "20251215T150847",
      "overall_sentiment_score": 0.336467,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.220907,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.64096
    },
    {
      "title": "15 Best Stocks to Buy for the Long Term",
      "summary": "This article identifies 15 top stocks for long-term investment, highlighting Church & Dwight Co., Inc. (NYSE:CHD) as an example. Despite a recent price target reduction, analysts maintain a Buy rating on CHD due to management's focus on leading brands and expected 8% annual EPS growth. The company reported strong Q3 2025 results with revenue growth and increased operating cash flow, bolstered by strategic acquisitions like TOUCHLAND.",
      "url": "https://www.insidermonkey.com/blog/15-best-stocks-to-buy-for-the-long-term-1657268/2",
      "source": "Insider Monkey",
      "published": "20251210T104300",
      "overall_sentiment_score": 0.178527,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.147393,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.640491
    },
    {
      "title": "AbbVie’s Growth Story Faces A Pipeline Pause",
      "summary": "AbbVie, despite strong performance from key immunology drugs like Skyrizi and Rinvoq, is facing tempered analyst expectations due to a thin late-stage drug pipeline. While current products support growth through 2026, concerns exist about future innovation and substantial upside given the company's premium stock valuation. This situation highlights the pharmaceutical industry's increasing focus on consistent late-stage drug development to maintain growth amid evolving market competition.",
      "url": "https://finimize.com/content/abbvies-growth-story-faces-a-pipeline-pause",
      "source": "Finimize",
      "published": "20251215T160811",
      "overall_sentiment_score": -0.065397,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.117596,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.634198
    },
    {
      "title": "Intuit (INTU) Stock News Today (Dec. 12, 2025): Insider Sales, Analyst Price Targets, and AI Catalysts Ahead of Earnings",
      "summary": "Intuit (INTU) stock is stabilizing near the high-$600s as investors consider recent insider sales from directors Scott D. Cook and Richard L. Dalzell, alongside institutional position updates and a largely optimistic analyst consensus with price targets averaging around $800. The primary focus for the stock's future growth remains its \"agentic AI\" strategy, particularly how it will drive monetization and efficiency through products like QuickBooks and TurboTax ahead of the upcoming tax season and next earnings report in late February 2026.",
      "url": "https://ts2.tech/en/intuit-intu-stock-news-today-dec-12-2025-insider-sales-analyst-price-targets-and-ai-catalysts-ahead-of-earnings/",
      "source": "ts2.tech",
      "published": "20251212T152059",
      "overall_sentiment_score": 0.075867,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.000199,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.631458
    },
    {
      "title": "Amgen’s Uplizna Approved For Its Largest And Most Competitive Indication Yet",
      "summary": "Amgen's Uplizna has received approval for generalized myasthenia gravis, marking its third and most competitive indication. This approval follows earlier indications for IgG4 disease and is expected to further boost sales. The company anticipates Uplizna becoming a new standard of care in the treatment of myasthenia gravis.",
      "url": "https://insights.citeline.com/scrip/rare-diseases/amgens-uplizna-approved-for-its-largest-and-most-competitive-indication-yet-5JF4NDSRZJDT3PPUNI337CKLNY/",
      "source": "Citeline News & Insights",
      "published": "20251212T230742",
      "overall_sentiment_score": 0.296342,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.109009,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.630975
    },
    {
      "title": "Star Tribune - Healthcare Sector Falters: S&P 500's Biggest Loser Amid Broader Market Caution",
      "summary": "The S&P 500 Healthcare sector recently became the biggest underperformer, declining 0.5% and extending a three-day losing streak, signalling a potential shift in investor sentiment. Despite a robust third-quarter performance fueled by strong drug demand, macroeconomic concerns, particularly anticipation of a hawkish Federal Reserve stance on interest rates, are overshadowing individual company successes. This downturn suggests a recalibration for the sector, with companies needing to adapt to evolving market conditions and regulatory scrutiny for long-term success.",
      "url": "https://markets.financialcontent.com/startribune/article/marketminute-2025-12-9-healthcare-sector-falters-s-and-p-500s-biggest-loser-amid-broader-market-caution",
      "source": "FinancialContent",
      "published": "20251209T172300",
      "overall_sentiment_score": 0.13306,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.256611,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.630537
    },
    {
      "title": "Amcor plc (AMCR): A Bull Case Theory",
      "summary": "Amcor plc (AMCR) is positioned as a global packaging powerhouse due to its acquisition of Berry Global, shifting towards higher-margin healthcare and hygiene segments, and becoming the largest player in flexible plastics. Despite execution and leverage risks, successful synergy realization from the merger is expected to double free cash flow, reduce debt, and re-rate the stock, implying potential upside of over 20%. The company offers a compelling risk/reward opportunity with a 5% dividend yield and",
      "url": "https://finviz.com/news/249922/amcor-plc-amcr-a-bull-case-theory",
      "source": "Finviz",
      "published": "20251209T200751",
      "overall_sentiment_score": 0.30937,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.343882,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.627841
    },
    {
      "title": "Nanobiotix Shares Surge 5.23% at Close, Boosted by Target Upgrade",
      "summary": "Nanobiotix shares closed up 5.23% after Leerink Partners raised its target price from $24 to $26, maintaining an 'Outperform' rating. The company has shown significant growth over the past year, driven by advancements in its clinical pipeline, particularly with its leading candidate NBTXR3 in partnership with Johnson & Johnson, and secured non-dilutive financing. These developments and forthcoming clinical data updates in 2026 position Nanobiotix for continued investor interest and potential stock valuation increases.",
      "url": "https://www.ideal-investisseur.fr/en/stock-news/nanobiotix-shares-surge-523-at-close-boosted-by-target-upgrade/10363.html",
      "source": "idéal investisseur",
      "published": "20251210T170948",
      "overall_sentiment_score": 0.572282,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.341174,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.623752
    },
    {
      "title": "Intuitive Surgical (ISRG) stock: What to know before the U.S. market opens on Dec. 15, 2025",
      "summary": "This article provides a comprehensive overview of key factors influencing Intuitive Surgical (ISRG) stock before the market opens on December 15, 2025. It highlights recent FDA clearances for its da Vinci SP system, increasing competition from Medtronic and Johnson & Johnson, Q3 2025 financial performance, ongoing product momentum, and analyst forecasts, all while considering the stock's premium valuation.",
      "url": "https://ts2.tech/en/intuitive-surgical-isrg-stock-what-to-know-before-the-u-s-market-opens-on-dec-15-2025/",
      "source": "ts2.tech",
      "published": "20251214T221221",
      "overall_sentiment_score": 0.115903,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.10203,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.622163
    },
    {
      "title": "XOMA Royalty Corporation: A Deep Dive into a Biotech Royalty Aggregator (12/13/2025)",
      "summary": "XOMA Royalty Corporation, formerly XOMA Corporation, has transformed into a biotech royalty aggregator, acquiring rights to milestone and royalty payments from drug candidates developed by partners. This strategic pivot provides non-dilutive funding to biotech companies and has led to robust financial performance in 2025, despite recent clinical trial setbacks for one partnered asset. The company's diversified portfolio and strategic acquisitions position it for long-term growth, though its reliance on partner success and inherent market volatility remain key risks.",
      "url": "https://markets.financialcontent.com/startribune/article/predictstreet-2025-12-13-xoma-royalty-corporation-a-deep-dive-into-a-biotech-royalty-aggregator-12132025",
      "source": "Markets Financial Content",
      "published": "20251213T210956",
      "overall_sentiment_score": 0.174546,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.118936,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.618544
    },
    {
      "title": "Milestone (NASDAQ: MIST) gains FDA approval for self-use CARDAMYST PSVT spray",
      "summary": "Milestone Pharmaceuticals Inc. (NASDAQ: MIST) announced it has received FDA approval for CARDAMYST (etripamil) nasal spray, making it the first and only self-administered treatment for adults with paroxysmal supraventricular tachycardia (PSVT). This approval is supported by robust clinical data showing rapid and effective conversion to sinus rhythm. CARDAMYST is expected to be available in retail pharmacies in Q1 2026.",
      "url": "https://www.stocktitan.net/news/MIST/milestone-receives-fda-approval-of-cardamysttm-etripamil-as-first-iq6c61f0wfiq.html",
      "source": "Stock Titan",
      "published": "20251213T010830",
      "overall_sentiment_score": 0.307879,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.229994,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.618376
    },
    {
      "title": "Edge-GPU Breast Tomosynthesis Box Market Intelligence 2025-2029 Featuring Hologic, GE Healthcare Technologies, Fujifilm, Canon Medical Systems, Philips and More - ResearchAndMarkets.com",
      "summary": "The global Edge-GPU Breast Tomosynthesis Box market is projected to grow from $0.47 billion in 2024 to $0.88 billion by 2029, driven by advancements in edge computing, increased government support for diagnostic imaging, and rising breast cancer incidence. North America leads the market, with Asia-Pacific expected to show the fastest growth. Key players include Hologic, GE Healthcare Technologies, and Philips, focusing on enhancing image processing and diagnostic accuracy through strategic acquisitions and technological innovations.",
      "url": "https://www.businesswire.com/news/home/20251210389989/en/Edge-GPU-Breast-Tomosynthesis-Box-Market-Intelligence-2025-2029-Featuring-Hologic-GE-Healthcare-Technologies-Fujifilm-Canon-Medical-Systems-Philips-and-More---ResearchAndMarkets.com",
      "source": "Business Wire",
      "published": "20251211T120815",
      "overall_sentiment_score": 0.347711,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.312835,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.618305
    },
    {
      "title": "Sanofi receives nonbinding bids for Medley in competitive sale process",
      "summary": "Sanofi is receiving nonbinding bids for Medley, its generics arm in Brazil, valued between R$1.5 billion and R$2 billion. Large Brazilian pharmaceutical companies and Indian laboratories are among the bidders, with Sanofi expecting to short-list five groups by February for binding offers and conclude the deal in May. This acquisition is seen as a significant entry point into the generics market, potentially reshaping the competitive landscape.",
      "url": "https://valorinternational.globo.com/business/news/2025/12/10/sanofi-receives-nonbinding-bids-for-medley-in-competitive-sale-process.ghtml",
      "source": "Valor International",
      "published": "20251210T100934",
      "overall_sentiment_score": 0.155985,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.116522,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.618204
    },
    {
      "title": "AbbVie Slipped Below 50-Day SMA Last Week: How to Play the Stock",
      "summary": "AbbVie's stock (ABBV) recently fell below its 50-day simple moving average, indicating short-term selling pressure despite a strong long-term trend above its 200-day SMA. This article analyzes AbbVie's strengths, such as the success of new drugs Skyrizi and Rinvoq and its robust pipelines in oncology and neuroscience, against weaknesses like Humira's patent expiration and struggling aesthetics sales. The author concludes that investors should remain invested, citing AbbVie's robust pipeline, strong revenue growth expectations for 2025, and reasonable valuation.",
      "url": "https://finviz.com/news/252699/abbvie-slipped-below-50-day-sma-last-week-how-to-play-the-stock",
      "source": "Finviz",
      "published": "20251212T140048",
      "overall_sentiment_score": 0.152801,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.078239,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.6168
    },
    {
      "title": "Wells Fargo Reaffirms Their Hold Rating on Tandem Diabetes Care (TNDM)",
      "summary": "Wells Fargo analyst Larry Biegelsen has maintained a Hold rating on Tandem Diabetes Care (TNDM) with a price target of $21.00. This rating comes despite the company reporting a quarterly revenue of $249.25 million and a GAAP net loss of $21.17 million in its latest earnings release. The consensus among analysts for Tandem Diabetes Care is a Moderate Buy, with an average price target of $23.65.",
      "url": "https://www.theglobeandmail.com/investing/markets/stocks/TNDM/pressreleases/36607064/wells-fargo-reaffirms-their-hold-rating-on-tandem-diabetes-care-tndm/",
      "source": "The Globe and Mail",
      "published": "20251214T020906",
      "overall_sentiment_score": 0.223769,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.121793,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.615485
    },
    {
      "title": "Exicure Rally Fueled By Rapid Cell-Boosting Results In Blood Cancer Trial",
      "summary": "Exicure, Inc. (NASDAQ: XCUR) stock surged after the company released positive Phase 2 trial results for burixafor (GPC-100) in combination with propranolol and granulocyte colony-stimulating factor (G-CSF) for mobilizing hematopoietic progenitor cells in multiple myeloma patients. Approximately 90% of study participants achieved the primary endpoint, with rapid cell mobilization observed. The burixafor combination demonstrated an excellent safety profile and was well-tolerated, even in patients who had prior exposure to daratumumab, a therapy known to reduce cell mobilization.",
      "url": "https://www.benzinga.com/news/health-care/25/12/49284762/exicure-rally-fueled-by-rapid-cell-boosting-results-in-blood-cancer-trial",
      "source": "Benzinga",
      "published": "20251209T170935",
      "overall_sentiment_score": 0.27559,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.139995,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.614293
    },
    {
      "title": "Healthcare Sector Falters: S&P 500's Biggest Loser Amid Broader Market Caution",
      "summary": "The S&P 500 Healthcare sector saw a significant decline of 0.5% on December 9, 2025, becoming the biggest underperformer despite a strong Q3 performance fueled by new drug demand. This downturn, marked by technical \"sell signals\" and ETF outflows, is largely attributed to investor caution surrounding the Federal Reserve's stance on interest rates, rather than sector-specific issues. While macroeconomic concerns are impacting the sector broadly, individual companies with robust drug pipelines like Eli Lilly and Merck are showing resilience, indicating a nuanced market where strategic positioning and innovation remain key for long-term success.",
      "url": "https://markets.financialcontent.com/wss/article/marketminute-2025-12-9-healthcare-sector-falters-s-and-p-500s-biggest-loser-amid-broader-market-caution",
      "source": "FinancialContent",
      "published": "20251209T172300",
      "overall_sentiment_score": 0.233325,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.429384,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.608166
    },
    {
      "title": "XOMA Royalty Corporation: A Deep Dive into a Biotech Royalty Aggregator (12/13/2025)",
      "summary": "XOMA Royalty Corporation has transformed from a biopharmaceutical developer into a specialized biotechnology royalty aggregator, acquiring rights to future milestone and royalty payments from therapeutic candidates. This model allows XOMA to generate revenue without the high costs and risks of drug development, providing crucial non-dilutive funding to biotech companies. Despite a recent clinical trial setback, XOMA maintains a diversified portfolio, strong financial health, and positive analyst outlook, focusing on strategic acquisitions and earlier-stage assets for long-term growth.",
      "url": "https://markets.financialcontent.com/wral/article/predictstreet-2025-12-13-xoma-royalty-corporation-a-deep-dive-into-a-biotech-royalty-aggregator-12132025",
      "source": "Markets Financial Content",
      "published": "20251213T210956",
      "overall_sentiment_score": 0.268302,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.226882,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.602144
    },
    {
      "title": "Tenaya Therapeutics Announces Pricing of Public Offering",
      "summary": "Tenaya Therapeutics, Inc. (Nasdaq: TNYA) has announced the pricing of its underwritten public offering, consisting of 50,000,000 units at $1.20 per unit, aiming to raise $60 million in gross proceeds. Each unit includes one share of common stock and a warrant to purchase an additional share at $1.50, exercisable for five years. The company plans to use these net proceeds to fund the ongoing development of its clinical and early-stage product candidates, TN-201 and TN-401, as well as for general corporate purposes.",
      "url": "https://www.globenewswire.com/news-release/2025/12/12/3204434/0/en/Tenaya-Therapeutics-Announces-Pricing-of-Public-Offering.html",
      "source": "GlobeNewswire",
      "published": "20251212T001600",
      "overall_sentiment_score": -0.031279,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.07048,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.59418
    },
    {
      "title": "BI Asset Management Fondsmaeglerselskab A S Trims Holdings in Caterpillar Inc. $CAT",
      "summary": "BI Asset Management Fondsmaeglerselskab A S has reduced its stake in Caterpillar Inc. by 12.7% during the second quarter, selling 13,584 shares, though other institutional investors like Fisher Asset Management LLC and Valeo Financial Advisors LLC significantly increased their holdings. Wall Street analysts maintain a \"Moderate Buy\" consensus rating for Caterpillar, with an average target price of $612.16, and the company recently announced a quarterly dividend of $1.51 per share. Recent insider selling by Anthony D. Fassino and Jason Kaiser has also been noted.",
      "url": "https://www.marketbeat.com/instant-alerts/filing-bi-asset-management-fondsmaeglerselskab-a-s-trims-holdings-in-caterpillar-inc-cat-2025-12-13/",
      "source": "MarketBeat",
      "published": "20251213T095028",
      "overall_sentiment_score": 0.124079,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.146035,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.594094
    },
    {
      "title": "Lewis named CEO of the Hain Celestial Group",
      "summary": "Alison E. Lewis has been appointed as the new chief executive officer of The Hain Celestial Group, Inc., following her role as interim CEO since May. Lewis, a board member since September 2024, brings 35 years of experience in the consumer packaged goods industry to the position. The board expressed confidence in her leadership, citing her bold moves to reduce costs, implement a turnaround agenda for growth and margins, and progress a strategic review with Goldman Sachs.",
      "url": "https://www.foodbusinessnews.net/articles/29503-lewis-named-ceo-of-the-hain-celestial-group",
      "source": "Food Business News",
      "published": "20251215T140853",
      "overall_sentiment_score": 0.104421,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.008263,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.58624
    },
    {
      "title": "Atossa Therapeutics (NASDAQ: ATOS) gets FDA RPD tag; PRVs fetch $100–$160 million",
      "summary": "Atossa Therapeutics announced that the U.S. FDA granted Rare Pediatric Disease (RPD) designation to (Z)-Endoxifen for Duchenne Muscular Dystrophy (DMD). This designation makes the drug eligible for a Priority Review Voucher (PRV) upon approval, which has historically ranged from $100–$160 million. The company plans to advance (Z)-Endoxifen, an exon-agnostic approach, to clinical trials for DMD, while oncology remains its core focus.",
      "url": "https://www.stocktitan.net/news/ATOS/atossa-therapeutics-receives-fda-rare-pediatric-disease-designation-s8azslc10a3n.html",
      "source": "Stock Titan",
      "published": "20251211T210959",
      "overall_sentiment_score": 0.294862,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.315077,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.583162
    },
    {
      "title": "EMA Committee for Medicinal Products for Human Use Adopts Positive Opinion Recommending Authorization of Moderna's mNEXSPIKE (COVID-19 Vaccine, mRNA)",
      "summary": "The EMA's Committee for Medicinal Products for Human Use (CHMP) has issued a positive opinion recommending marketing authorization for Moderna's mNEXSPIKE (mRNA-1283), a new COVID-19 vaccine for individuals aged 12 and older. This recommendation is a step towards making mNEXSPIKE available in the EU, building on a Phase 3 trial that showed higher relative vaccine efficacy and a similar safety profile compared to Moderna's original Spikevax vaccine, especially in adults aged 65 and older.",
      "url": "https://www.heraldmailmedia.com/press-release/story/38259/ema-committee-for-medicinal-products-for-human-use-adopts-positive-opinion-recommending-authorization-of-modernas-mnexspike-covid-19-vaccine-mrna/",
      "source": "The Herald-Mail",
      "published": "20251215T170821",
      "overall_sentiment_score": 0.217179,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.114668,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.56991
    },
    {
      "title": "Keurig Dr Pepper Bolsters Investor Confidence with Latest Quarterly Dividend Declaration",
      "summary": "Keurig Dr Pepper (NASDAQ: KDP) has declared a quarterly cash dividend of $0.23 per share, payable on January 16, 2026, to shareholders of record as of January 2, 2026. This move reinforces the company's commitment to returning value to shareholders and signals strong financial health. The consistent dividend policy positions KDP as a reliable investment for long-term growth and income generation within the beverage industry.",
      "url": "https://markets.financialcontent.com/wral/article/marketminute-2025-12-9-keurig-dr-pepper-bolsters-investor-confidence-with-latest-quarterly-dividend-declaration",
      "source": "Markets Financial Content",
      "published": "20251209T165800",
      "overall_sentiment_score": 0.276137,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.206677,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.568065
    },
    {
      "title": "Intuitive Announces Expanded Indications for da Vinci SP",
      "summary": "Intuitive (NASDAQ: ISRG) has announced that the U.S. FDA has cleared its da Vinci Single Port (SP) surgical system for expanded indications, including inguinal hernia repair, cholecystectomy, and appendectomy procedures. This clearance adds to the system's existing U.S. clearances in other surgical fields, allowing surgeons to perform procedures through a single incision with enhanced visualization and precision. The company emphasizes its commitment to less invasive care and improving patient outcomes through continuous innovation of its platforms.",
      "url": "https://www.globenewswire.com/news-release/2025/12/10/3203514/0/en/Intuitive-Announces-Expanded-Indications-for-da-Vinci-SP.html",
      "source": "GlobeNewswire",
      "published": "20251210T161500",
      "overall_sentiment_score": 0.50332,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.28184,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.556454
    },
    {
      "title": "3 Dividend ETFs to Buy and Hold for Life if the Market Crashes",
      "summary": "This article highlights three dividend ETFs—iShares 20+ Year Treasury Bond ETF (TLT), iShares Global Consumer Staples ETF (KXI), and iShares US Pharmaceuticals ETF (IHE)—as strong investments for retirement income, especially in a market downturn. These ETFs offer stability, diversification, and consistent income, acting as a buffer against inflation and market crashes. The article suggests they can be held long-term for compounding returns or strategically used to reallocate funds during market dips.",
      "url": "https://247wallst.com/investing/2025/12/11/3-dividend-etfs-to-buy-and-hold-for-life-if-the-market-crashes/",
      "source": "24/7 Wall St.",
      "published": "20251211T160907",
      "overall_sentiment_score": 0.352096,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.324552,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.556042
    },
    {
      "title": "cbdMD (YCBD) Stock News Today (Dec. 15, 2025): Why Shares Are Volatile, What the Latest Filings Say, and the Updated YCBD Stock Forecast",
      "summary": "cbdMD (YCBD) shares are experiencing significant volatility due to a confluence of company-specific catalysts, including regaining NYSE American compliance and narrowing losses in preliminary FY2025 results, alongside sector-wide momentum from potential federal cannabis policy shifts. The stock saw extraordinary trading volume, suggesting both retail interest and possible short-covering, though risks associated with volatility, regulatory uncertainty, and potential dilution remain. Investors are now looking forward to the audited FY2025 10-K filing for further clarity.",
      "url": "https://ts2.tech/en/cbdmd-ycbd-stock-news-today-dec-15-2025-why-shares-are-volatile-what-the-latest-filings-say-and-the-updated-ycbd-stock-forecast/",
      "source": "ts2.tech",
      "published": "20251215T100845",
      "overall_sentiment_score": 0.061428,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.122535,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.5401
    },
    {
      "title": "Jury says Johnson & Johnson owes $40 million to 2 cancer patients who used talcum powders",
      "summary": "A Los Angeles jury has awarded $40 million to two women who claimed Johnson & Johnson's talcum powder products caused their ovarian cancer. The healthcare giant plans to appeal the verdict, asserting its talc products are safe and do not cause cancer. This ruling follows a previous $966 million award in October to a woman's family over mesothelioma claims linked to asbestos-contaminated baby powder.",
      "url": "https://apnews.com/article/johnson-johnson-baby-powder-ovarian-cancer-3530102b312df155aa427e87770c952b",
      "source": "AP News",
      "published": "20251214T170756",
      "overall_sentiment_score": 0.001969,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.025382,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.349668
    },
    {
      "title": "Jury orders Johnson & Johnson to pay US$40 million to two women in latest talc trial",
      "summary": "A California jury has ordered Johnson & Johnson to pay US$40 million to two women who claimed the company's baby powder caused their ovarian cancer. The women, Monica Kent and Deborah Schultz, testified to using the product for 40 years and subsequently being diagnosed with ovarian cancer. J&J plans to appeal the verdict, maintaining that its products are safe and do not cause cancer, while facing over 67,000 similar lawsuits.",
      "url": "https://www.straitstimes.com/world/united-states/jury-orders-johnson-johnson-to-pay-us40-million-to-two-women-in-latest-talc-trial",
      "source": "The Straits Times",
      "published": "20251213T104500",
      "overall_sentiment_score": 0.01605,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.028908,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.338767
    },
    {
      "title": "Jury says Johnson & Johnson owes $40 million to 2 cancer patients who used talcum powders",
      "summary": "A Los Angeles jury has awarded $40 million to two women who claimed Johnson & Johnson's talcum powder caused their ovarian cancer. This verdict is the latest in ongoing litigation against the company, which continues to assert that its talc products are safe and plans to appeal the decision. Johnson & Johnson stopped selling talc-based powder globally in 2023.",
      "url": "https://www.detroitnews.com/story/business/2025/12/13/johnson-johnson-owes-cancer-patients-millions/87758478007/",
      "source": "The Detroit News",
      "published": "20251213T222400",
      "overall_sentiment_score": 0.043399,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.037475,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.302905
    },
    {
      "title": "Johnson & Johnson é condenada a pagar US$ 40 milhões a consumidoras com câncer",
      "summary": "A Johnson & Johnson foi condenada por um júri da Califórnia a pagar uma indenização de US$ 40 milhões a duas mulheres, Monica Kent e Deborah Schultz, que desenvolveram câncer de ovário e que acusam o talco da empresa pela doença. A companhia, que planeja recorrer da decisão, é acusada de saber que seus produtos eram perigosos e não alertar os consumidores. A suspensão da venda do talco Johnson's Baby nos EUA e Canadá, ocorrida em 2020, foi motivada por diversas ações judiciais alegando a contaminação do produto por amianto, um agente cancerígeno.",
      "url": "https://www.gazetadopovo.com.br/economia/johnson-e-johnson-40-milhoes-cancer/",
      "source": "Gazeta do Povo",
      "published": "20251214T094300",
      "overall_sentiment_score": 0.030235,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.007309,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.302087
    }
  ]
}