{
  "ticker": "JNJ",
  "date": "2025-03-17",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T12:00:07.948632",
  "source": "alpha_vantage",
  "article_count": 14,
  "articles": [
    {
      "title": "4 takeaways from AAOS 2025",
      "summary": "Stryker unveiled its updated Mako surgical robot with a new hip revision feature at AAOS 2025, and orthopedic companies anticipate steady procedure volumes despite economic concerns. Other key takeaways include the sustained elevation of procedure volumes, \"healthy\" capital spending by hospitals, and industry hopes of being insulated from new tariffs.",
      "url": "https://www.medtechdive.com/news/aaos-2025-orthopedics-conference-stryker-mako/742675/",
      "source": "MedTech Dive",
      "published": "20250317T000000",
      "overall_sentiment_score": 0.329259,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.26076,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.707067
    },
    {
      "title": "Johnson & Johnson MedTech wins FDA nod for enhanced robotic-assisted bronchoscopy",
      "summary": "Johnson & Johnson MedTech received FDA clearance for its Monarch Quest technology, an enhanced robotic-assisted bronchoscopy system. This new iteration features AI-powered algorithms and integration with GE HealthCare's OEC 3D mobile CBCT imaging system, aiming to improve accuracy and speed in diagnosing lung cancer by better targeting suspicious lung nodules. The technology represents an advancement in minimally invasive access and visualization of airways for earlier and more definitive diagnoses.",
      "url": "https://www.massdevice.com/johnson-johnson-medtech-fda-robot-bronchoscopy/",
      "source": "MassDevice",
      "published": "20250312T000000",
      "overall_sentiment_score": 0.400031,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.737082,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Legend Biotech Reports Fourth Quarter and Full Year 2024 Results and Recent Highlights",
      "summary": "Legend Biotech reported strong financial results for Q4 and full year 2024, with CARVYKTI® net trade sales reaching $963 million for the full year and over 5,000 patients treated to date. The company initiated commercial production of CARVYKTI® at a Novartis facility and secured reimbursement approval in Spain, contributing to a cash reserve of $1.1 billion providing financial runway into Q2 2026.",
      "url": "https://www.globenewswire.com/news-release/2025/03/11/3040406/0/en/Legend-Biotech-Reports-Fourth-Quarter-and-Full-Year-2024-Results-and-Recent-Highlights.html",
      "source": "GlobeNewswire",
      "published": "20250311T070000",
      "overall_sentiment_score": 0.390703,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.347495,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.616405
    },
    {
      "title": "Contineum Therapeutics Reports Fourth-Quarter 2024 Financial Results; Affirms Key Clinical Development Milestones",
      "summary": "Contineum Therapeutics reported its fourth-quarter 2024 financial results and affirmed key clinical development milestones for 2025 and beyond. The company expects topline data from its PIPE-791 Phase 1b PET trial in Q2 2025 and from its PIPE-307 Phase 2 VISTA trial for RRMS in H2 2025, projecting its cash runway through 2027. Research and development expenses increased significantly in Q4 2024 due to advancements in the PIPE-791 and PIPE-307 programs, anticipating further increases in 2025.",
      "url": "https://markets.financialcontent.com/wedbush/article/bizwire-2025-3-6-contineum-therapeutics-reports-fourth-quarter-2024-financial-results-affirms-key-clinical-development-milestones",
      "source": "FinancialContent",
      "published": "20250306T160500",
      "overall_sentiment_score": 0.277372,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.203247,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.643736
    },
    {
      "title": "Contineum Therapeutics Reports Fourth-Quarter 2024 Financial Results; Affirms Key Clinical Development Milestones",
      "summary": "Contineum Therapeutics announced its fourth-quarter 2024 financial results and outlined key clinical development milestones for 2025. The company expects topline data from its PIPE-791 Phase 1b PET trial in Q2 2025 and from its PIPE-307 Phase 2 VISTA trial for MS in H2 2025. With cash resources projected through 2027, Contineum plans to initiate Phase 2 trials for PIPE-791 in IPF and PrMS in H2 2025 and file an IND for CTX-343 in H2 2025.",
      "url": "https://www.biospace.com/press-releases/contineum-therapeutics-reports-fourth-quarter-2024-financial-results-affirms-key-clinical-development-milestones",
      "source": "BioSpace",
      "published": "20250306T145734",
      "overall_sentiment_score": 0.24408,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.129253,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.636189
    },
    {
      "title": "NANOBIOTIX Strengthens Financial Position Through Amendment of Global Licensing Agreement for JNJ-1900 (NBTXR3) and Extends Cash Visibility to Mid-2026",
      "summary": "Nanobiotix announced an amendment to its global licensing agreement with Janssen Pharmaceutica NV, a Johnson & Johnson company, strengthening its financial position. The amendment shifts nearly all remaining funding obligations for the NANORAY-312 trial to Johnson & Johnson and adjusts potential future milestone payments from $2.7 billion to $2.6 billion, while extending Nanobiotix's cash visibility to mid-2026. This strategic move aims to reduce operational cash burn and pursue additional non-dilutive financing to further extend its financial runway.",
      "url": "https://www.globenewswire.com/news-release/2025/03/17/3044099/0/en/NANOBIOTIX-Strengthens-Financial-Position-Through-Amendment-of-Global-Licensing-Agreement-for-JNJ-1900-NBTXR3-and-Extends-Cash-Visibility-to-Mid-2026.html",
      "source": "GlobeNewswire",
      "published": "20250317T161500",
      "overall_sentiment_score": 0.253719,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.262515,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.703991
    },
    {
      "title": "Zimmer Biomet at Barclays Conference: Strategic Growth Insights",
      "summary": "Zimmer Biomet presented at the Barclays 27th Annual Global Healthcare Conference, where CEO Yvonne Tornos and CFO Sukiyo Padier outlined the company's strategic vision, aiming for 4% to 5% growth in orthopedics, driven by demographic trends and technological advancements. The company plans to regain market share in hips with new product launches and expects the Paragon 28 acquisition to break even by the end of the second year while expanding globally. Key financial and operational updates include maintaining class-leading gross margins, expanding operating margins by at least 30 basis points organically, and focusing on innovation with products like the ROSA robotic system and Persona IQ smart implants.",
      "url": "https://www.investing.com/news/transcripts/zimmer-biomet-at-barclays-conference-strategic-growth-insights-93CH-3927466",
      "source": "Investing.com",
      "published": "20250313T110200",
      "overall_sentiment_score": 0.219554,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.145993,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.568644
    },
    {
      "title": "Dermal Fillers Market Size Report 2032 | AbbVie Inc., Galderma,",
      "summary": "The Dermal Fillers Market is projected to grow from USD 6,238.22 million in 2024 to USD 11,695.43 million by 2032, exhibiting a CAGR of 8.25%. This growth is driven by increasing cosmetic procedures, an aging population, and a preference for minimally invasive treatments, with North America expected to hold the largest market share. Leading companies in the market include AbbVie Inc., Galderma, and Merz Pharma.",
      "url": "https://www.openpr.com/news/4298980/dermal-fillers-market-size-report-2032-abbvie-inc-galderma",
      "source": "openPR.com",
      "published": "20250312T132400",
      "overall_sentiment_score": 0.315534,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.312974,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.941335
    },
    {
      "title": "Hip Replacement Market Report and Company Analysis 2025-2033 Featuring Smith & Nephew, J&J, Integra, Zimmer Biomet, Stryker, B. Braun Melsungen, Globus Medical, MicroPort Scientific, Conformis",
      "summary": "The Hip Replacement Market is projected to grow from US$6.92 billion in 2024 to US$10.24 billion by 2033, exhibiting a compound annual growth rate of 4.45%. This growth is attributed to an aging global population, increasing obesity rates, and advancements in surgical techniques and implant technology. Despite positive trends, challenges such as high surgery costs and the risk of complications or revisions remain.",
      "url": "https://orthospinenews.com/2025/03/11/hip-replacement-market-report-and-company-analysis-2025-2033-featuring-smith-nephew-jj-integra-zimmer-biomet-stryker-b-braun-melsungen-globus-medical-microport-scientific-conformis/",
      "source": "Ortho Spine News",
      "published": "20250311T000000",
      "overall_sentiment_score": 0.309007,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.224573,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.722231
    },
    {
      "title": "Broaden Your ETF Exposure With These 3 Overlooked Funds",
      "summary": "This article highlights three underappreciated ETFs (EFV, SPDW, and HDV) that have outperformed the S&P 500 in early 2025 despite having relatively small asset bases. Two funds, EFV and SPDW, offer broad international equity exposure, while HDV focuses on stable, undervalued large-cap U.S. dividend payers. The funds are presented as diversification opportunities for investors facing market volatility and potential economic headwinds.",
      "url": "https://www.marketbeat.com/stock-ideas/broaden-your-etf-exposure-with-these-3-overlooked-funds/",
      "source": "MarketBeat",
      "published": "20250306T152134",
      "overall_sentiment_score": 0.379757,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.321657,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.604838
    },
    {
      "title": "Broaden Your ETF Exposure With These 3 Overlooked Funds",
      "summary": "As volatility rises and recession concerns grow, investors are looking to Exchange-Traded Funds (ETFs) for diversification. Nathan Reiff highlights three overlooked ETFs with strong 2025 performance or defensive characteristics. These include the iShares MSCI EAFE Value ETF (EFV), SPDR S&P World ex-US ETF (SPDW), and iShares Core High Dividend ETF (HDV), offering global exposure, low costs, and high dividend yields.",
      "url": "https://www.theglobeandmail.com/investing/markets/stocks/PG/pressreleases/31293454/broaden-your-etf-exposure-with-these-3-overlooked-funds/",
      "source": "The Globe and Mail",
      "published": "20250306T063000",
      "overall_sentiment_score": 0.381807,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.321734,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.619015
    },
    {
      "title": "Antiemetics Market Size, Forecast 2031 by Key Companies-",
      "summary": "The global Antiemetics Market is projected to grow from USD 4.84 Billion in 2024 to USD 8.20 Billion by 2031, at a CAGR of 6.8%. The market's growth is significantly influenced by AI and Machine Learning, which are redefining drug development, optimizing clinical outcomes, and powering predictive healthcare insights. Key trends include the adoption of long-acting therapies, nanotechnology-enhanced drug delivery, and precision medicine models, while major companies like Pfizer, Inc., Johnson & Johnson Services, Inc., and Novartis AG contribute to market expansion.",
      "url": "https://www.openpr.com/news/4299213/antiemetics-market-size-forecast-2031-by-key-companies",
      "source": "openPR.com",
      "published": "20250312T171500",
      "overall_sentiment_score": 0.312388,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.339779,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.906494
    },
    {
      "title": "Pharmaceutical Cartridges Industry Forecast Reveals",
      "summary": "The Pharmaceutical Cartridges Market is projected for substantial growth between 2025 and 2032, driven by increasing adoption strategies by key players. The report by DataM Intelligence provides insights into regional growth hotspots, market segments, CAGR forecasts, and revenue performance of leading companies. Key developments in regions like the United States, GCC, and MENA highlight expansions in manufacturing capabilities, enhanced safety features, regulatory updates, and the adoption of smart cartridges and investments in biosimilars.",
      "url": "https://www.openpr.com/news/4298000/pharmaceutical-cartridges-industry-forecast-reveals",
      "source": "openPR.com",
      "published": "20250312T080600",
      "overall_sentiment_score": 0.276344,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.249919,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.616045
    },
    {
      "title": "Hip Replacement Market Report and Company Analysis 2025-2033 Featuring Smith & Nephew, J&J, Integra, Zimmer Biomet, Stryker, B. Braun Melsungen, Globus Medical, MicroPort Scientific, Conformis",
      "summary": "The hip replacement market is projected to grow from US$6.92 billion in 2024 to nearly US$10.24 billion by 2033, driven by an aging global population, advancements in implant technology, and increased awareness and accessibility of healthcare. Key players analyzed in the report include Smith & Nephew, Johnson & Johnson, Zimmer Biomet, and Stryker. Challenges for the market include high surgery costs and the risk of complications and revisions.",
      "url": "https://finance.yahoo.com/news/hip-replacement-market-report-company-101800455.html",
      "source": "Yahoo Finance",
      "published": "20250311T101800",
      "overall_sentiment_score": 0.388186,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.409697,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.734701
    }
  ]
}