{
  "ticker": "JNJ",
  "date": "2025-11-24",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T12:03:00.854536",
  "source": "alpha_vantage",
  "article_count": 50,
  "articles": [
    {
      "title": "J&J’s Anti-Tau Asset Posdinemab Fails In Phase II Alzheimer’s Study",
      "summary": "Johnson & Johnson's anti-tau asset, posdinemab, failed in its Phase II Alzheimer’s study. This immunotherapy, partnered with AC Immune, was targeting tau tangles in Alzheimer's patients' brains. The article highlights an ongoing trial and mentions other companies and drugs in the Alzheimer's development pipeline.",
      "url": "https://insights.citeline.com/scrip/jjs-anti-tau-asset-posdinemab-fails-in-phase-ii-alzheimers-study-MRUM6ZMFORCXHMZYA7IGQKBK2Y/",
      "source": "Citeline News & Insights",
      "published": "20251124T225113",
      "overall_sentiment_score": -0.074388,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.461311,
      "ticker_sentiment_label": "Bearish",
      "relevance_score": 1.0
    },
    {
      "title": "Nanobiotix Provides Third Quarter 2025 Operational and Financial Update Along With 2026 Clinical Outlook",
      "summary": "Nanobiotix reported its operational and financial results for Q3 2025, highlighting the closing of a non-dilutive royalty financing deal with HCRx for up to $71 million. The company also provided a clinical outlook for 2026, including expected data from JNJ-1900 (NBTXR3) studies in various cancers, and detailed advancements in its Curadigm Nanoprimer program with new patent applications and preclinical data. Nanobiotix ended the quarter with €20.4 million in cash and cash equivalents, projecting extended cash visibility into early 2028 with the HCRx financing.",
      "url": "https://www.globenewswire.com/news-release/2025/11/24/3193940/0/en/nanobiotix-provides-third-quarter-2025-operational-and-financial-update-along-with-2026-clinical-outlook.html",
      "source": "GlobeNewswire",
      "published": "20251124T180926",
      "overall_sentiment_score": 0.394426,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.332417,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.703487
    },
    {
      "title": "J&J’s Anti-Tau Bet Falls Flat in Mid-Stage Alzheimer’s Trial",
      "summary": "Johnson & Johnson is discontinuing its Phase II Auτonomy study of posdinemab, an anti-tau antibody for early Alzheimer's disease, after the drug failed to slow clinical decline. This setback follows other recent disappointments in Alzheimer's treatment, including Novo Nordisk's GLP-1 failure and UCB's bepranemab, further highlighting the challenges in developing effective therapies for the neurodegenerative disease. J&J plans to share full data later, contributing to ongoing research into Alzheimer's biology.",
      "url": "https://www.biospace.com/drug-development/j-js-anti-tau-bet-falls-flat-in-mid-stage-alzheimers-trial",
      "source": "BioSpace",
      "published": "20251124T164043",
      "overall_sentiment_score": -0.159832,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.351499,
      "ticker_sentiment_label": "Bearish",
      "relevance_score": 0.961812
    },
    {
      "title": "GE HealthCare submits AI-powered photon CT system to FDA",
      "summary": "GE HealthCare announced the submission of its Photonova Spectra system, an AI-powered photon-counting computed tomography (PCCT) system, to the FDA for 510(k) clearance. This new system utilizes proprietary Deep Silicon detector technology to provide ultra-high-definition imaging with enhanced spectral and spatial resolution, aiming to improve disease detection, characterization, and monitoring. The company believes Photonova Spectra will redefine decision-making and care delivery by improving image quality and streamlining workflows in fast-paced healthcare environments.",
      "url": "https://www.massdevice.com/ge-healthcare-submits-ai-powered-photon-ct-fda/",
      "source": "MassDevice",
      "published": "20251124T150631",
      "overall_sentiment_score": 0.258304,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.14736,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.554557
    },
    {
      "title": "J&J’s novel Alzheimer’s drug fails in key trial, dimming hopes for a hot target",
      "summary": "Johnson & Johnson's experimental Alzheimer's drug, posdinemab, failed to slow disease progression in a mid-stage trial, leading to the termination of the study. This setback casts doubt on other therapies targeting the protein tau in development by companies like Biogen, UCB, and Voyager Therapeutics. J&J plans to present the full trial data later.",
      "url": "https://www.statnews.com/2025/11/24/alzheimers-disease-johnson-and-johnson-posdinemab/",
      "source": "STAT",
      "published": "20251124T143808",
      "overall_sentiment_score": -0.348451,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.394882,
      "ticker_sentiment_label": "Bearish",
      "relevance_score": 1.0
    },
    {
      "title": "J&J MedTech bolsters stroke R&D programs in Ireland",
      "summary": "Johnson & Johnson MedTech is expanding its stroke-focused R&D operations in Ireland, building on previous investments. This expansion, centered in Galway, will develop therapies for different types of stroke and liquid embolic procedures, reinforcing Ireland's role in J&J's global innovation network for neurovascular capabilities. The initiative coincides with a meeting of J&J’s neurovascular global scientific advisory board and aims to create high-skilled job opportunities.",
      "url": "https://www.fiercebiotech.com/medtech/jj-medtech-bolsters-stroke-rd-programs-ireland",
      "source": "Fierce Biotech",
      "published": "20251124T142000",
      "overall_sentiment_score": 0.440888,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.411212,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Johnson & Johnson Collaborates with NVIDIA to Advance Healthcare Robotics Using the Isaac Platform",
      "summary": "Johnson & Johnson MedTech is collaborating with NVIDIA to advance healthcare robotics using the Isaac platform. This partnership involves leveraging physical AI simulation to develop robotic platforms, specifically applying these simulations to the MONARCH Platform for Urology for device design, clinical workflow preparation, and training. The goal is to create high-fidelity digital twins to enhance technology development and improve patient outcomes in robotic surgery.",
      "url": "https://thehealthcaretechnologyreport.com/johnson-johnson-collaborates-with-nvidia-to-advance-healthcare-robotics-using-the-isaac-platform/",
      "source": "The Healthcare Technology Report.",
      "published": "20251124T135113",
      "overall_sentiment_score": 0.333094,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.411333,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Amphastar (NASDAQ: AMPH) in 37th Piper Sandler healthcare fireside chat webcast",
      "summary": "Amphastar Pharmaceuticals (NASDAQ: AMPH) announced that CFO Bill Peters and EVP of Regulatory Affairs Tony Marrs will participate in an analyst-moderated fireside chat at the 37th Annual Piper Sandler Healthcare Conference on December 3, 2025, at 2:00 PM ET. The presentation will be available via webcast on Amphastar's investor website for 30 days. On the day this news was published, AMPH shares gained 2.69%, indicating a positive market reaction.",
      "url": "https://www.stocktitan.net/news/AMPH/amphastar-pharmaceuticals-to-present-at-the-37th-annual-piper-u859yxrjntul.html",
      "source": "Stock Titan",
      "published": "20251124T103039",
      "overall_sentiment_score": 0.14305,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.06015,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.554315
    },
    {
      "title": "J&J's $5B Alzheimer's hope fades as anti-tau antibody posdinemab flops in phase 2",
      "summary": "Johnson & Johnson's anti-tau antibody posdinemab has failed in a phase 2 trial for early Alzheimer's disease, significantly dampening the company's hopes for a potential $5 billion-a-year drug. The scheduled data review showed posdinemab did not significantly slow clinical decline, leading J&J to halt the study. This setback also casts further doubt on the efficacy of monoclonal antibodies targeting tau's mid-domain for Alzheimer's treatment, following a similar failure by UCB's bepranemab.",
      "url": "https://www.fiercebiotech.com/biotech/jjs-5b-alzheimers-hope-fades-anti-tau-antibody-posdinemab-flops-phase-2",
      "source": "Fierce Biotech",
      "published": "20251124T094000",
      "overall_sentiment_score": -0.102227,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.454985,
      "ticker_sentiment_label": "Bearish",
      "relevance_score": 1.0
    },
    {
      "title": "ABT - Abbott Laboratories Stock Price and Quote",
      "summary": "This article provides a detailed financial overview of Abbott Laboratories (ABT), including its stock price, key financial metrics, performance indicators, and recent news. It also lists analyst ratings and insider trading activities, highlighting the company's acquisition of Exact Sciences as a major recent event.",
      "url": "https://finviz.com/quote.ashx?t=ABT",
      "source": "Finviz",
      "published": "20251124T080557",
      "overall_sentiment_score": 0.386523,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.11135,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.638925
    },
    {
      "title": "Eli Lilly Becomes First Trillion-Dollar Health Company",
      "summary": "Eli Lilly became the first healthcare company to reach a $1 trillion market valuation, driven by strong demand for its diabetes drug Mounjaro and weight-loss drug Zepbound. The company briefly crossed this milestone on November 21, 2025, and expects continued growth with new product releases and expanding insurance coverage. This achievement highlights the significant impact of GLP-1 medications on the pharmaceutical industry.",
      "url": "https://www.nbcrightnow.com/lifestyles/health/eli-lilly-becomes-first-trillion-dollar-health-company/article_a31157dc-f8eb-5b98-804b-f53e94f05e7a.html",
      "source": "Nonstop Local News",
      "published": "20251124T063000",
      "overall_sentiment_score": 0.417271,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.12163,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.589475
    },
    {
      "title": "Eli Lilly Enters Uncharted Territory as Market Cap Nears $1T",
      "summary": "Eli Lilly is nearing a $1 trillion market capitalization, driven by immense expectations for its GLP-1 drugs for obesity due to the company's dominance in this rapidly expanding market. Analysts predict sustained growth through products like Mounjaro, Zepbound, and the anticipated oral drug orforglipron, positioning Lilly to be the first drugmaker to reach and potentially maintain such a high valuation. This valuation places Lilly among tech giants and sets it apart from other pharmaceutical companies, though some analysts warn about market volatility and the long-term sustainability due to patent lifecycles.",
      "url": "https://www.biospace.com/business/eli-lilly-enters-uncharted-territory-as-market-cap-nears-1t",
      "source": "BioSpace",
      "published": "20251123T170752",
      "overall_sentiment_score": 0.136127,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.143213,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.609057
    },
    {
      "title": "Jim Cramer Dissects Kimberly-Clark's Acquisition of Kenvue",
      "summary": "Jim Cramer weighs in on Kimberly-Clark's nearly $49 billion bid to acquire Kenvue, a move he finds \"incredibly compelling\" despite potential legal and regulatory risks. He highlights Kenvue's portfolio of household names and its current valuation as reasons to consider buying Kimberly-Clark stock, especially given the different legal systems overseas. Cramer suggests that at 14 times earnings with an almost 5% yield, Kimberly-Clark presents an attractive opportunity.",
      "url": "https://finviz.com/news/236872/jim-cramer-dissects-kimberly-clarks-acquisition-of-kenvue",
      "source": "Finviz",
      "published": "20251123T145100",
      "overall_sentiment_score": 0.264847,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.042244,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.60451
    },
    {
      "title": "A Look at Pfizer's Valuation Following FDA Approval of PADCEV Combination Therapy for Bladder Cancer",
      "summary": "Pfizer and Astellas Pharma received FDA approval for PADCEV in combination with Keytruda for bladder cancer, an important step in Pfizer's oncology pipeline. This approval, coupled with strategic moves like the Metsera acquisition, positions Pfizer for potential value, despite a negative year-to-date share price return. Analysts suggest a fair value of $29.08, indicating the stock is undervalued given its pipeline expansion and future growth prospects.",
      "url": "https://simplywall.st/stocks/us/pharmaceuticals-biotech/nyse-pfe/pfizer/news/a-look-at-pfizers-valuation-following-fda-approval-of-padcev",
      "source": "Simply Wall Street",
      "published": "20251123T075126",
      "overall_sentiment_score": 0.186964,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.119711,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.638246
    },
    {
      "title": "Should Texas Plavix Lawsuit Prompt Fresh Risk Assessment From Bristol-Myers Squibb (BMY) Investors?",
      "summary": "Texas Attorney General Ken Paxton has filed a lawsuit against Bristol-Myers Squibb and Sanofi concerning Plavix, alleging the companies failed to disclose reduced efficacy in certain ethnic groups due to genetic factors, potentially violating state consumer protection laws. This legal action introduces new regulatory and reputational risks for Bristol-Myers Squibb, adding to existing challenges like patent cliffs and pipeline execution. Investors are urged to consider these heightened risks and other perspectives when evaluating the company's investment outlook.",
      "url": "https://simplywall.st/stocks/us/pharmaceuticals-biotech/nyse-bmy/bristol-myers-squibb/news/should-texas-plavix-lawsuit-prompt-fresh-risk-assessment-fro",
      "source": "Simply Wall Street",
      "published": "20251123T053149",
      "overall_sentiment_score": -0.115734,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.017306,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.573691
    },
    {
      "title": "KVUE Stock Today (Nov. 22, 2025): Kenvue Rises as Kimberly‑Clark Deal, Dividend and Tylenol Ruling Shape Outlook",
      "summary": "Kenvue (KVUE) stock rose on November 22, 2025, driven by a proposed acquisition by Kimberly-Clark (KMB) valued at $48-49 billion, a healthy near 5% dividend yield, and a positive ruling regarding a Tylenol-related lawsuit. The stock is trading at a discount to the implied deal value, creating a merger-arbitrage opportunity, while the company's fundamentals show steady but pressured performance. Investors are evaluating KVUE as a three-way bet balancing the deal's success, potential competing bids, and risks like regulatory hurdles or deal failure.",
      "url": "https://ts2.tech/en/kvue-stock-today-nov-22-2025-kenvue-rises-as-kimberly%E2%80%91clark-deal-dividend-and-tylenol-ruling-shape-outlook/",
      "source": "ts2.tech",
      "published": "20251122T213618",
      "overall_sentiment_score": 0.206873,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.132088,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.572198
    },
    {
      "title": "Novartis CEO paid top dollar for Avidity to become a 'leader in neuromuscular diseases'",
      "summary": "Novartis CEO Vas Narasimhan defended the $12 billion acquisition of Avidity Biosciences, stating that the price tag is secondary to strategic fit. The deal, which includes three late-stage antibody-oligonucleotide conjugates, aims to establish Novartis as a leader in neuromuscular diseases, leveraging its expertise in RNA therapeutics and neuroscience. Narasimhan emphasized that the company will continue to pursue high-value external opportunities that strengthen its core therapeutic areas and growth profile.",
      "url": "https://www.fiercebiotech.com/biotech/novartis-ceo-paid-top-dollar-avidity-become-leader-neuromuscular-diseases",
      "source": "Fierce Biotech",
      "published": "20251122T140858",
      "overall_sentiment_score": 0.173585,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.347997,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.730771
    },
    {
      "title": "Siobhan's family all used a trusted bathroom product for decades... now she's one of thousands left with terminal cancer",
      "summary": "Siobhan Ryan, 63, is among 3,000 people suing Johnson & Johnson in the UK, claiming their baby powder caused her terminal ovarian cancer. She used the product for decades, believing it to be safe, and is now devastated by her diagnosis and the potential impact on her family. The lawsuit alleges that Johnson & Johnson concealed the risks of asbestos-contaminated talc for many years.",
      "url": "https://www.dailymail.co.uk/lifestyle/article-15220129/johnson-johnson-talcum-powder-cancer.html",
      "source": "Daily Mail",
      "published": "20251122T061600",
      "overall_sentiment_score": -0.845406,
      "overall_sentiment_label": "Bearish",
      "ticker_sentiment_score": -0.805637,
      "ticker_sentiment_label": "Bearish",
      "relevance_score": 1.0
    },
    {
      "title": "Jim Cramer on Kenvue: \"I Think It is a Good Situation, Not a Bad One\"",
      "summary": "Jim Cramer commented on Kenvue (KVUE), stating that it's a good situation despite ongoing lawsuits, comparing it to Johnson & Johnson's past challenges. He believes long-term shareholders should not be worried, acknowledging the litigation risk while not expecting significant upside in the short term. Kenvue offers consumer health products like Tylenol and Neutrogena.",
      "url": "https://finviz.com/news/236652/jim-cramer-on-kenvue-i-think-it-is-a-good-situation-not-a-bad-one",
      "source": "Finviz",
      "published": "20251122T022900",
      "overall_sentiment_score": 0.169792,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.121784,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.605283
    },
    {
      "title": "Eli Lilly Reaches $1 Trillion Market Cap on Booming Weight-Loss Drugs",
      "summary": "Eli Lilly has achieved a $1 trillion market capitalization, becoming the first pharmaceutical company to reach this milestone, driven by the success of its weight-loss drugs Mounjaro and Zepbound. The company joins a select group of mostly tech companies to surpass this valuation, with its market value now more than double that of its closest industry rival, Johnson & Johnson. This accomplishment positions Eli Lilly as the tenth company globally to exceed the $1 trillion mark according to Dow Jones Market Data.",
      "url": "https://www.wsj.com/health/pharma/eli-lilly-reaches-1-trillion-market-cap-on-booming-weight-loss-drugs-f4664fa9?gaa_at=eafs&gaa_n=AWEtsqf7MKisJNJ0uGVzdTuuhBzI0jippHwu4J5gzKnPlFcGYwr72BIc36rK&gaa_ts=6920d3db&gaa_sig=5qF7zBSMJDRMCPbW9iXVMuBX3639V4szEy1fLNoJDlvjY3V6PZQ1Up2O8ijW1J56wmr-QKCfd8MmGl4oLljB8g%3D%3D",
      "source": "The Wall Street Journal",
      "published": "20251121T205156",
      "overall_sentiment_score": 0.200881,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.113627,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.637764
    },
    {
      "title": "Eli Lilly becomes first drugmaker to hit $1 trillion in market value",
      "summary": "Eli Lilly has become the first drugmaker to achieve a $1 trillion market valuation, driven by the success of its GLP-1 drugs, Zepbound and Mounjaro, for obesity and diabetes. The rapid growth reflects the company's leading position in a market expected to reach $100 billion annually by 2030, putting it on par with tech giants and significantly ahead of its pharmaceutical peers. Despite increased scrutiny over drug costs and intense competition, Lilly continues to invest heavily in manufacturing and new drug development to sustain its momentum.",
      "url": "https://www.biopharmadive.com/news/eli-lilly-1-trillion-pharmaceutical-market-value-obesity/721819/",
      "source": "BioPharma Dive",
      "published": "20251121T185103",
      "overall_sentiment_score": 0.228337,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.12839,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.714618
    },
    {
      "title": "New Haven-based Halda Therapeutics to be acquired for $3 billion by Johnson & Johnson",
      "summary": "Halda Therapeutics, a New Haven-based company developing cancer treatments, has announced an agreement to be acquired by Johnson & Johnson for $3.05 billion. This acquisition will strengthen Johnson & Johnson's oncology pipeline, particularly with Halda’s proprietary RIPTAC platform and lead candidate HLD-0915 for prostate cancer. The deal is expected to close within a few months and is seen as a significant win for Connecticut's biotechnology industry.",
      "url": "https://www.ncadvertiser.com/business/article/halda-therapeutics-johnson-johnson-sale-agreement-21200542.php",
      "source": "New Canaan Advertiser",
      "published": "20251121T174909",
      "overall_sentiment_score": 0.465541,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.45064,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "New Haven-based Halda Therapeutics to be acquired for $3 billion by Johnson & Johnson",
      "summary": "New Haven-based Halda Therapeutics announced an agreement to be acquired by Johnson & Johnson for $3.05 billion, marking one of the largest biotechnology deals in Connecticut. The acquisition strengthens Johnson & Johnson's oncology pipeline with Halda's proprietary RIPTAC platform and lead prostate cancer therapy, HLD-0915. This deal highlights the growing value and innovation within Connecticut's biopharma industry, following other significant acquisitions in the state.",
      "url": "https://www.ctinsider.com/business/article/halda-therapeutics-johnson-johnson-sale-agreement-21200542.php",
      "source": "CT Insider",
      "published": "20251121T173017",
      "overall_sentiment_score": 0.349519,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.415558,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "CT-based Halda Therapeutics to be acquired for $3 billion by J&J",
      "summary": "New Haven-based Halda Therapeutics, a company focused on developing cancer treatments, announced an agreement to be acquired by Johnson & Johnson for $3.05 billion. This acquisition will integrate Halda's proprietary Regulated Induced Proximity Targeting Chimera (RIPTAC) platform, which supports oral, targeted treatments for solid tumors including prostate cancer, into Johnson & Johnson's oncology portfolio. The deal represents one of Connecticut's largest biotechnology company acquisitions, with the transaction expected to close within the next few months.",
      "url": "https://www.nhregister.com/business/article/halda-therapeutics-johnson-johnson-sale-agreement-21200542.php",
      "source": "New Haven Register",
      "published": "20251121T172152",
      "overall_sentiment_score": 0.29807,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.446479,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Shockwave’s Nick West on shaking up treatment for blocked arteries",
      "summary": "Nick West, Chief Medical Officer for Shockwave Medical, a J&J MedTech unit, discusses the rapid growth of intravascular lithotripsy (IVL) for treating blocked arteries and future pipeline developments. IVL uses sound waves to break up calcified plaque, offering advantages over traditional methods like atherectomy. The technology has rapidly gained market share and is being explored for new applications in carotid and valvular calcification.",
      "url": "https://www.medtechdive.com/news/Johnson-JNJ-Shockwave-IVL-Nick-West-interview/805997/",
      "source": "MedTech Dive",
      "published": "20251121T160559",
      "overall_sentiment_score": 0.015713,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.029737,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.330388
    },
    {
      "title": "LLY - Lilly(Eli) & Co Stock Price and Quote",
      "summary": "This article provides a comprehensive overview of Eli Lilly and Co. (LLY) stock performance, financial metrics, and recent news, including its achievement of a $1 trillion market cap. It also details an extensive list of insider transactions, primarily sales by LILLY ENDOWMENT INC. and some buys by company executives, along with recent analyst ratings and price target changes.",
      "url": "https://finviz.com/quote.ashx?t=LLY",
      "source": "Finviz",
      "published": "20251121T160000",
      "overall_sentiment_score": 0.169004,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.097567,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.56549
    },
    {
      "title": "Analysts project durable growth with many near-term catalysts for Boston Scientific",
      "summary": "Analysts from BTIG rated Boston Scientific (NYSE: BSX) a \"Buy\" following a visit to its headquarters, anticipating durable growth driven by a comprehensive R&D pipeline and VC portfolio. Key growth drivers include its Farapulse pulsed field ablation system and Watchman FLX device, with significant expansion expected in the electrophysiology space and APAC region. The company also has numerous near-term catalysts, including upcoming FDA approvals, new product launches in various segments like IVL and neuromodulation, and strategic M&A activities.",
      "url": "https://www.massdevice.com/boston-scientific-growth-near-term-catalysts/",
      "source": "MassDevice",
      "published": "20251121T144844",
      "overall_sentiment_score": 0.229134,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.137419,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.611158
    },
    {
      "title": "XOMA Royalty Announces Closing of Transactions to Acquire LAVA Therapeutics N.V.",
      "summary": "XOMA Royalty Corporation announced the successful acquisition of LAVA Therapeutics N.V., with LAVA shareholders receiving $1.04 in cash per share and a contingent value right (CVR). This acquisition adds early-stage bispecific antibodies developed in collaboration with Johnson & Johnson and Pfizer to XOMA Royalty's portfolio. The transaction aims to drive significant value creation through future milestones and royalties from LAVA's programs.",
      "url": "https://www.globenewswire.com/news-release/2025/11/21/3192735/7281/en/XOMA-Royalty-Announces-Closing-of-Transactions-to-Acquire-LAVA-Therapeutics-N-V.html",
      "source": "GlobeNewswire",
      "published": "20251121T074500",
      "overall_sentiment_score": 0.197767,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.271905,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.625464
    },
    {
      "title": "Rx Rundown: Johnson & Johnson, Avadel Pharmaceuticals, Moderna and more",
      "summary": "This article provides a weekly rundown of medical marketing news, dealmaking, and industry chatter, featuring updates on Johnson & Johnson, Avadel Pharmaceuticals, Moderna, and more. Key developments include significant acquisition deals, FDA approvals and warnings for various drugs and devices, substantial funding rounds for biotech companies, and notable industry news such as layoffs and strategic partnerships. The report covers financial transactions, regulatory decisions, and business activities across the pharmaceutical and healthcare sectors.",
      "url": "https://www.mmm-online.com/news/rx-rundown-johnson-johnson-avadel-pharmaceuticals-moderna-and-more/",
      "source": "Medical Marketing and Media",
      "published": "20251121T070000",
      "overall_sentiment_score": 0.242885,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.123854,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 1.0
    },
    {
      "title": "Where Will Intuitive Surgical Stock Be in 10 Years?",
      "summary": "Intuitive Surgical, a leader in robotic surgical systems, faces challenges from competitors and economic conditions but has a strong growth trajectory due to expanding robotic surgery applications and an aging global population. While the stock's future is uncertain, it is projected that the company will continue to innovate and capture a significant share of the growing surgical market, potentially increasing its stock value substantially over the next decade. Investors should consider its strong market position and potential for continued growth despite high valuation concerns.",
      "url": "https://www.msn.com/en-us/money/companies/where-will-intuitive-surgical-stock-be-in-10-years/ar-AA1QNCci",
      "source": "MSN",
      "published": "20251121T003632",
      "overall_sentiment_score": 0.095824,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.057952,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.603923
    },
    {
      "title": "Contineum’s J&J-partnered MS drug fails to improve vision in phase 2",
      "summary": "Contineum Therapeutics' M1 receptor antagonist, PIPE-307, partnered with Johnson & Johnson, failed to meet its primary and secondary efficacy goals in a phase 2 trial for relapsing-remitting multiple sclerosis (RRMS) patients, specifically in improving vision. The trial, however, showed acceptable safety and tolerability. Following the negative results, Contineum's stock dropped, and the company plans to further analyze the data while continuing to pursue other novel therapies.",
      "url": "https://www.fiercebiotech.com/biotech/contineums-jj-partnered-ms-drug-fails-improve-vision-phase-2",
      "source": "Fierce Biotech",
      "published": "20251120T172600",
      "overall_sentiment_score": 0.018749,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.04532,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.326505
    },
    {
      "title": "Leading where medicine is going",
      "summary": "This page from Johnson & Johnson Innovative Medicine Canada outlines the company's commitment to accessibility and community giving, beyond its business needs. It also highlights their key focus areas in medicine, including Oncology, Immunology, Neuroscience, Cardiovascular & metabolic diseases, Pulmonary hypertension, and Communicable diseases.",
      "url": "https://www.jnj.com/innovativemedicine/canada/",
      "source": "Johnson & Johnson",
      "published": "20251120T141308",
      "overall_sentiment_score": 0.251577,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.257151,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.901597
    },
    {
      "title": "meditating UBS Raises Medtronic Target Price Amid Strong Q2, PFA Technology Shines, But \"Neutral\" Stance Lingers",
      "summary": "UBS Group has raised its price target for Medtronic plc (NYSE: MDT) to $102 from $95 following stronger-than-expected Q2 fiscal 2026 earnings, primarily driven by impressive growth in its Cardiovascular and Neuroscience divisions and over 300% growth in its Pulsed Field Ablation (PFA) technology. Despite this positive revision, UBS maintained a \"Neutral\" rating due to ongoing concerns about the Medical Surgical division's performance and Medtronic's ability to consistently achieve its 6% organic sales growth target across its entire portfolio. The article highlights the competitive implications of Medtronic's PFA success and the broader industry trends favoring minimally invasive procedures.",
      "url": "https://markets.financialcontent.com/wral/article/marketminute-2025-11-20-ubs-raises-medtronic-target-price-amid-strong-q2-pfa-technology-shines-but-neutral-stance-lingers",
      "source": "FinancialContent",
      "published": "20251120T111100",
      "overall_sentiment_score": 0.12496,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.139178,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.720051
    },
    {
      "title": "SCCM Value Equity Fund Sold Kenvue (KVUE) Due to Less Compelling Valuation",
      "summary": "SCCM Value Equity Fund sold its position in Kenvue Inc. (KVUE) during the third quarter of 2025, citing a \"less compelling valuation\" compared to when it was initially added to the portfolio. The fund's decision was influenced by challenges such as pressures on U.S. consumer spending, seasonal delays, competition, and shrinking shelf space, despite Kenvue stabilizing volume trends. Kenvue's stock closed at $16.06 per share on November 19, 2025, with a market capitalization of $30.82 billion.",
      "url": "https://finance.yahoo.com/news/sccm-value-equity-fund-sold-131656840.html",
      "source": "Yahoo Finance",
      "published": "20251120T081600",
      "overall_sentiment_score": -0.111654,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.143888,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.613088
    },
    {
      "title": "Merck Stock Rise as New PAH Drug Winrevair Meets Goal in Another Study",
      "summary": "Merck's new PAH drug, Winrevair, met its primary endpoint in the phase II CADENCE study, showing a significant reduction in pulmonary vascular resistance for adults with CpcPH due to HFpEF. This positive data led to a 3.8% rise in Merck's stock and provides a potential label expansion opportunity for Winrevair, which is crucial as Merck diversifies its portfolio ahead of Keytruda's loss of exclusivity in 2028. Despite facing competition in the PAH market, Winrevair is expected to drive sales growth beyond 2026.",
      "url": "https://www.tradingview.com/news/zacks:70f9d9eed094b:0-merck-stock-rise-as-new-pah-drug-winrevair-meets-goal-in-another-study/",
      "source": "TradingView",
      "published": "20251119T172131",
      "overall_sentiment_score": 0.294068,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.140731,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.628196
    },
    {
      "title": "Here's How Neuroscience Drugs Aided AbbVie's Top-line Growth in Q3",
      "summary": "AbbVie's neuroscience franchise has become a significant growth driver, contributing about 18% to its Q3 topline with a 20% year-over-year increase, primarily from Botox Therapeutic, Qulipta, Ubrelvy, Vraylar, and Vyalev. The company plans to expand this portfolio with new offerings like tavapadon for Parkinson's disease, while facing competition from Biogen and Johnson & Johnson in the neuroscience space. Despite strong growth, AbbVie's stock performance and valuation show it trading at a slight premium to the industry average.",
      "url": "https://www.sharewise.com/us/news_articles/Heres_How_Neuroscience_Drugs_Aided_AbbVies_Topline_Growth_in_Q3_Zacks_20251118_1537",
      "source": "www.sharewise.com",
      "published": "20251119T115603",
      "overall_sentiment_score": 0.232945,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.115585,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.713902
    },
    {
      "title": "Bristol-Myers Squibb (BMY): Assessing Valuation After a 7% Share Price Rebound",
      "summary": "Bristol-Myers Squibb (BMY) shares recently rebounded by 7% but remain below analyst targets, suggesting potential undervaluation. The article discusses BMY's valuation, considering its robust late-stage pipeline, strategic partnerships, and life-cycle management efforts against upcoming patent expiries. Despite growth headwinds, the company's fair value is estimated at $53, indicating it is currently undervalued at $46.81, though risks like patent expiration and slow new launch adoption persist.",
      "url": "https://simplywall.st/stocks/us/pharmaceuticals-biotech/nyse-bmy/bristol-myers-squibb/news/bristol-myers-squibb-bmy-assessing-valuation-after-a-7-share",
      "source": "Simply Wall Street",
      "published": "20251118T210723",
      "overall_sentiment_score": 0.390282,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.449238,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.590259
    },
    {
      "title": "Johnson & Johnson Buys Prostate Cancer Treatment-Maker Halda for $3.1 Billion",
      "summary": "Johnson & Johnson is acquiring Halda Therapeutics for $3.1 billion to bolster its oncology pipeline after losing patent exclusivity for its top-selling drug, Stelara. This acquisition is part of J&J's broader strategy to expand through M&A, addressing a significant drop in Stelara sales while defying overall company sales expectations. The move is expected to strengthen J&J's prostate cancer treatment offerings and contribute to the growing investor interest in the biotech sector.",
      "url": "https://www.thedailyupside.com/industries/healthcare/johnson-johnson-acquires-halda-therapeutics-for-3-1-billion/",
      "source": "The Daily Upside",
      "published": "20251118T202154",
      "overall_sentiment_score": 0.21314,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.442449,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Merck Writes a $9.2 Billion Check for a Flu Drug That Could Change Everything",
      "summary": "Merck & Co. has acquired Cidara Therapeutics for $9.2 billion to secure a next-generation flu drug, CD388, and diversify its portfolio ahead of Keytruda's patent expiration. This strategic move aims to create new revenue streams and mitigate future risks, leveraging Merck's strong financial position. The advanced flu drug, CD388, is in Phase 3 trials and could offer season-long protection against influenza, with potential annual sales exceeding $5 billion.",
      "url": "https://finviz.com/news/233307/merck-writes-a-92-billion-check-for-a-flu-drug-that-could-change-everything",
      "source": "Finviz",
      "published": "20251118T142200",
      "overall_sentiment_score": 0.20022,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.032303,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.573384
    },
    {
      "title": "Avadel deems Lundbeck offer ‘superior’ to Alkermes’: Deals Report",
      "summary": "Avadel Pharmaceuticals has declared an offer from H. Lundbeck S/A as \"superior\" to a previous bid from Alkermes plc, opening a five-day window for Alkermes to respond. This development positions the two companies in a contest for control of Avadel's narcolepsy therapy, Lumryz sodium oxybate, following closely on the heels of another contested M&A battle involving Pfizer and Novo Nordisk for Metsera Inc.",
      "url": "https://www.biocentury.com/article/657638/avadel-deems-lundbeck-offer-superior-to-alkermes-deals-report",
      "source": "BioCentury",
      "published": "20251118T125300",
      "overall_sentiment_score": 0.043624,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.126791,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.58709
    },
    {
      "title": "Jim Cramer Comments On Eli Lilly (LLY)'s Shares After Pfizer CEO's Remarks",
      "summary": "Jim Cramer reiterated his bullish stance on Eli Lilly (LLY) shares, citing the company's investments, its developing weight loss pill, and its broader drug portfolio. He commented on CEO David Ricks' strong position, even in the face of future competition. The article also suggests that superior returns might be found in certain AI stocks, despite LLY's potential.",
      "url": "https://finviz.com/news/232700/jim-cramer-comments-on-eli-lilly-llys-shares-after-pfizer-ceos-remarks",
      "source": "Finviz",
      "published": "20251118T084500",
      "overall_sentiment_score": 0.196611,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.126251,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.555734
    },
    {
      "title": "How Court-Approved Dividend Amid Tylenol Litigation Has Changed Kenvue’s (KVUE) Investment Story",
      "summary": "A recent court ruling approved a US$400 million dividend for Kenvue despite ongoing Tylenol litigation, addressing prior financial uncertainty for the company. This decision highlights Kenvue's capital allocation flexibility and could recalibrate its investment outlook and risk profile by removing a short-term overhang on capital management. Investors are still advised to consider the ongoing legal challenges and their potential impact on Kenvue's financial flexibility.",
      "url": "https://simplywall.st/stocks/us/household/nyse-kvue/kenvue/news/how-court-approved-dividend-amid-tylenol-litigation-has-chan",
      "source": "Simply Wall Street",
      "published": "20251118T023618",
      "overall_sentiment_score": 0.177852,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.1497,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.618883
    },
    {
      "title": "Zymeworks (ZYME) Soars on Positive Phase 3 Ziihera Data in Gastric Cancer – What Today’s Breakthrough Means for the Stock and Patients",
      "summary": "Zymeworks Inc. announced positive topline Phase 3 results for Ziihera (zanidatamab-hrii) in HER2-positive gastroesophageal adenocarcinoma, showing significant improvements in progression-free and overall survival. Development partner Jazz Pharmaceuticals plans to file an sBLA in 1H 2026, positioning Ziihera as a potential new first-line standard of care. This breakthrough sent ZYME stock soaring in pre-market trading and could materially alter Zymeworks' financial forecasts and long-term narrative, despite the company remaining loss-making.",
      "url": "https://ts2.tech/en/zymeworks-zyme-soars-on-positive-phase-3-ziihera-data-in-gastric-cancer-what-todays-breakthrough-means-for-the-stock-and-patients/",
      "source": "ts2.tech",
      "published": "20251117T200858",
      "overall_sentiment_score": 0.36891,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.209312,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.646406
    },
    {
      "title": "NRx Pharmaceuticals, Inc. Reports Third Quarter 2025 Financial Results and Provides Corporate Update",
      "summary": "NRx Pharmaceuticals, Inc. announced its Q3 2025 financial results and provided a corporate update, highlighting the re-filing of its Abbreviated New Drug Application for KETAFREE™ with an expected Q2 2026 GDUFA date. The company also detailed the progress of HOPE Therapeutics' revenue-generating facilities and secured operating capital through July 2026. Additionally, NRx received FDA Fast Track Designation for NRX-100 and presented new Real-World Data supporting NRX-101's effectiveness in augmenting Transcranial Magnetic Stimulation.",
      "url": "https://investingnews.com/nrx-pharmaceuticals-inc-reports-third-quarter-2025-financial-results-and-provides-corporate-update/",
      "source": "Investing News Network",
      "published": "20251117T160922",
      "overall_sentiment_score": 0.394678,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.109731,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.574318
    },
    {
      "title": "J&J to buy Halda Therapeutics for $3B",
      "summary": "Johnson & Johnson (J&J) has agreed to acquire Halda Therapeutics, a precision cancer treatment startup, for $3.05 billion in cash. This acquisition will allow J&J to expand its portfolio in solid tumor and prostate cancer treatments.",
      "url": "https://www.axios.com/pro/biotech-deals/2025/11/17/johnson-johnson-to-buy-halda-therapeutics-for-3b",
      "source": "Axios",
      "published": "20251117T155118",
      "overall_sentiment_score": 0.430973,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.422962,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Johnson & Johnson to acquire CT-based Halda Therapeutics for $3.05B",
      "summary": "Johnson & Johnson is set to acquire New Haven-based Halda Therapeutics for $3.05 billion in cash. This acquisition, the second multi-billion dollar biotech deal in Connecticut this year, brings Halda’s experimental cancer drug platform, including novel RIPTAC therapeutics, under Johnson & Johnson's umbrella. The deal is contingent on antitrust approval and is expected to close within a few months.",
      "url": "https://hartfordbusiness.com/article/johnson-johnson-to-acquire-ct-based-halda-therapeutics-for-3-05b/",
      "source": "Hartford Business Journal",
      "published": "20251117T150608",
      "overall_sentiment_score": 0.311875,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.430785,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "J&J, Aiming for $50B in Cancer Sales, Buys Halda for $3B in Cash",
      "summary": "Johnson & Johnson is acquiring Halda Therapeutics for $3.05 billion in cash to bolster its oncology pipeline, specifically targeting prostate and lung cancer with Halda's RIPTAC platform. This acquisition supports J&J's ambitious goal of achieving $50 billion in oncology sales by 2030, leveraging Halda's lead candidate HLD-0915 and other therapies. The deal, expected to close within months, follows J&J's prior commitment to limited business development for the rest of 2025 after a major January acquisition.",
      "url": "https://www.biospace.com/business/j-j-aiming-for-50b-in-cancer-sales-buys-halda-for-3b-in-cash",
      "source": "BioSpace",
      "published": "20251117T150608",
      "overall_sentiment_score": 0.202486,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.406632,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Johnson & Johnson to Buy Halda Therapeutics For $3.05 Billion",
      "summary": "Johnson & Johnson has agreed to acquire clinical-stage biotechnology company Halda Therapeutics for $3.05 billion in cash. This strategic acquisition aims to strengthen J&J's oncology pipeline by incorporating Halda's proprietary platform for developing oral, targeted therapies for various solid tumors, including prostate cancer. The deal is expected to finalize within the next few months.",
      "url": "https://www.wsj.com/business/deals/johnson-johnson-to-buy-halda-therapeutics-for-3-05-billion-2e460ca1?gaa_at=eafs&gaa_n=AWEtsqeI9P8DIXT6dwDNcPSgSY5CbWnleksmi7qd4bO6B0jLguDkvWaDqPqQ&gaa_ts=691b27df&gaa_sig=L-0a8gPimUevUmvR-CCBwwDEXav0Yqy-LIFgWIMz_Tp5P5Uq92dhjxaW2IYvCEKOEcptcfoNWI-b-sVZRN7AiA%3D%3D",
      "source": "The Wall Street Journal",
      "published": "20251117T133619",
      "overall_sentiment_score": 0.405759,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.434316,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Johnson & Johnson to Buy Halda Therapeutics in $3.1 Billion Deal",
      "summary": "Johnson & Johnson has agreed to acquire Halda Therapeutics, a cancer treatment biotech, for $3.05 billion in an all-cash deal. Halda Therapeutics is currently developing therapies for prostate cancer, as well as breast, lung, and multiple other tumor types. This acquisition aims to bolster Johnson & Johnson's oncology pipeline.",
      "url": "https://www.bloomberg.com/news/articles/2025-11-17/johnson-johnson-to-buy-halda-therapeutics-in-3-1-billion-deal",
      "source": "Bloomberg.com",
      "published": "20251117T131100",
      "overall_sentiment_score": 0.435657,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.446111,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Joe Terranova on the quantitative approach to the JOET ETF that identifies winners like Palantir early",
      "summary": "Joe Terranova, creator of the Virtus Terranova U.S. Quality Momentum ETF (JOET), discussed his quantitative strategy for stock picking as the ETF celebrates its five-year anniversary. His approach has successfully identified winners like Palantir early and helped manage emotion-driven investment decisions. Terranova plans to expand his ETF offerings by applying the same rules-based strategy to other asset classes, such as small-cap and European equities.",
      "url": "https://www.cnbc.com/2025/11/17/joe-terranova-on-the-quantitative-approach-to-the-joet-etf-that-identifies-winners-like-palantir-early.html",
      "source": "CNBC",
      "published": "20251117T112900",
      "overall_sentiment_score": 0.46965,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.107241,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.582362
    }
  ]
}