{
  "ticker": "JNJ",
  "date": "2025-09-22",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T12:02:17.257368",
  "source": "alpha_vantage",
  "article_count": 21,
  "articles": [
    {
      "title": "If You'd Invested $1,000 in Johnson & Johnson (JNJ) Stock 5 Years Ago, Here's How Much You'd Have Today",
      "summary": "This article examines the performance of Johnson & Johnson (JNJ) stock over the past five years, noting that a $1,000 investment would have grown to $1,359, representing a 6.3% annual growth rate. This significantly underperforms the S&P 500's average annual gain of 14.7% over the same period. Despite past underperformance, the article highlights J&J's promising future outlook, solid dividend payment history, and appealing valuation, suggesting it could be a good long-term income-producing investment.",
      "url": "https://www.fool.com/investing/2025/09/15/if-you-invested-1000-in-johnson-johnson-stock-5-yr/",
      "source": "The Motley Fool",
      "published": "20250915T051900",
      "overall_sentiment_score": 0.055118,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.084302,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 1.0
    },
    {
      "title": "Here's why Jim Cramer thinks Johnson & Johnson can keep running",
      "summary": "Jim Cramer believes Johnson & Johnson (J&J) stock can continue to perform well due to its momentum, reasonable valuation, improved handling of legal issues, and strong portfolio of drugs and medical devices. Despite the broader healthcare sector lagging, J&J shares are up over 23% year-to-date. Cramer anticipates the stock could reach $186 and potentially $200, driven by its diversified business and robust drug pipeline, even as it faces a patent cliff for Stelara.",
      "url": "https://www.cnbc.com/2025/09/11/heres-why-jim-cramer-thinks-johnson-johnson-can-keep-running.html",
      "source": "CNBC",
      "published": "20250911T193300",
      "overall_sentiment_score": 0.422191,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.417495,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Is Rerating Around The Corner For Johnson & Johnson Stock?",
      "summary": "Johnson & Johnson stock (NYSE: JNJ) has outperformed the S&P 500 healthcare index significantly in 2025, driven by diversified revenue growth, strong financial performance, and a robust balance sheet. The company's strategic portfolio expansion and consistent shareholder value commitment suggest that its recent rally is sustainable and justifies a premium valuation, with a significant upside potential for investors. Despite potential risks, JNJ's improved fundamentals position it for continued outperformance and a re-rating.",
      "url": "https://www.trefis.com/stock/jnj/articles/574744/is-rerating-around-the-corner-for-johnson-johnson-stock/2025-09-09",
      "source": "Trefis",
      "published": "20250909T000000",
      "overall_sentiment_score": 0.233986,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.491108,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Johnson & Johnson: A Safe Hold, But Lacking Catalysts To Beat The Market (NYSE:JNJ)",
      "summary": "Johnson & Johnson is considered a safe hold due to its strong dividend growth and current slight undervaluation. However, the company is in a mature phase with slow growth, lacking clear catalysts to outperform the broader market. While a market pullback could align its stock with trends, the near-term outlook suggests continued underperformance, warranting a Hold rating with a $188 price target.",
      "url": "https://seekingalpha.com/article/4820358-johnson-and-johnson-a-safe-hold-but-lacking-catalysts-to-beat-the-market",
      "source": "Seeking Alpha",
      "published": "20250908T040500",
      "overall_sentiment_score": -0.067995,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.084554,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 1.0
    },
    {
      "title": "IRCAD North America Collaborates with Johnson & Johnson to Advance Surgical Training and Education",
      "summary": "IRCAD North America is partnering with Johnson & Johnson MedTech in a multi-year agreement to advance surgical training and education. This collaboration will bring innovative surgical technologies to IRCAD NA's training center at The Pearl, Charlotte's first innovation district, and aims to revolutionize surgical excellence through hands-on training and translational research. Johnson & Johnson MedTech will supply various surgical technologies and host its own courses at the facility, enhancing surgical team skills globally.",
      "url": "https://atriumhealth.org/about-us/newsroom/news/2025/ircad-north-america-collaborates-with-johnson-and-johnson",
      "source": "Atrium Health",
      "published": "20250911T000000",
      "overall_sentiment_score": 0.47335,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.474779,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Johnson & Johnson Elects John Morikis, Retired Chairman, President and Chief Executive Officer of The Sherwin-Williams Company, to its Board of Directors",
      "summary": "Johnson & Johnson announced the election of John Morikis, retired Chairman, President, and Chief Executive Officer of The Sherwin-Williams Company, to its Board of Directors. Joaquin Duato, Chairman and CEO of Johnson & Johnson, highlighted Morikis's strong understanding of global markets, complex supply chains, and ability to leverage technology for innovation. Morikis expressed his honor to join the board and support the company's strategy of delivering breakthrough treatments and creating shareholder value.",
      "url": "https://www.jnj.com/media-center/press-releases/johnson-johnson-elects-john-morikis-retired-chairman-president-and-chief-executive-officer-of-the-sherwin-williams-company-to-its-board-of-directors",
      "source": "Johnson & Johnson",
      "published": "20250908T225841",
      "overall_sentiment_score": 0.263699,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.497897,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Johnson & Johnson Elects John Morikis, Retired Chairman, President and Chief Executive Officer of The Sherwin-Williams Company, to its Board of Directors",
      "summary": "Johnson & Johnson announced the election of John Morikis, former Chairman, President, and CEO of The Sherwin-Williams Company, to its Board of Directors. Joaquin Duato, Chairman and CEO of Johnson & Johnson, highlighted Morikis's leadership experience and understanding of global markets and supply chains as valuable assets. Morikis expressed his honor and commitment to supporting Johnson & Johnson's long-term strategy and innovation in healthcare.",
      "url": "https://www.businesswire.com/news/home/20250908666514/en/Johnson-Johnson-Elects-John-Morikis-Retired-Chairman-President-and-Chief-Executive-Officer-of-The-Sherwin-Williams-Company-to-its-Board-of-Directors",
      "source": "Business Wire",
      "published": "20250908T000000",
      "overall_sentiment_score": 0.266729,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.41284,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Johnson & Johnson adds former Sherwin-Williams CEO to its board",
      "summary": "Johnson & Johnson announced the election of John Morikis, former chair, president, and CEO of The Sherwin-Williams Company, to its board of directors. Morikis brings extensive experience in leading a multinational organization, global markets, complex supply chains, and leveraging technology for innovation. His appointment is expected to significantly contribute to Johnson & Johnson's long-term strategy in healthcare innovation.",
      "url": "https://www.massdevice.com/johnson-johnson-former-sherwin-williams-ceo-board/",
      "source": "MassDevice",
      "published": "20250909T000000",
      "overall_sentiment_score": 0.117278,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.44757,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Trump's Biotech Playbook Ignites $350 Billion Investment Blitz",
      "summary": "Former President Donald Trump's second-term policies have spurred a $350 billion investment surge in the U.S. pharmaceutical and biotech sectors, focusing on domestic manufacturing and R&D. Major drugmakers like Johnson & Johnson, AstraZeneca, Novartis, Bristol-Myers Squibb, and Eli Lilly are making significant commitments, presenting substantial opportunities for investors in both individual stocks and biotech ETFs like XBI and IBB. This unprecedented investment aims to turbocharge America's biotech sector, creating jobs, driving innovation, and boosting revenue.",
      "url": "https://www.benzinga.com/markets/biotech/25/09/47572576/trumps-biotech-playbook-ignites-350-billion-investment-blitz",
      "source": "Benzinga",
      "published": "20250909T170929",
      "overall_sentiment_score": 0.414739,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.424098,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.735389
    },
    {
      "title": "Fabricante do Tylenol cai 7% após relatório negativo do governo Trump",
      "summary": "A Kenvue Inc., fabricante do Tylenol, viu suas ações caírem 7,5% após um relatório do governo Trump associar o uso do analgésico por mulheres grávidas ao desenvolvimento de autismo. Apesar do relatório impulsionar a queda das ações e a Kenvue já acumular perdas no ano, pesquisadores contestam a evidência, afirmando não haver ligação concreta entre o medicamento e o autismo. O presidente americano Donald Trump havia antecipado o informe como um \"anúncio muito importante\".",
      "url": "https://www.cnnbrasil.com.br/economia/negocios/fabricante-do-tylenol-cai-7-apos-relatorio-negativo-do-governo-trump/",
      "source": "CNN Brasil",
      "published": "20250922T192700",
      "overall_sentiment_score": -0.343434,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.298451,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.720966
    },
    {
      "title": "Insulet makes CFO change, appoints longtime J&J leader",
      "summary": "Insulet (Nasdaq: PODD) has appointed Flavia Pease as its new Executive Vice President and CFO, succeeding Ana Maria Chadwick, effective September 30, 2025. Pease, a veteran of healthcare and medical technology with over two decades at Johnson & Johnson, has served on Insulet's board since January 2024. This change follows several other executive appointments earlier this year, and Insulet expects to exceed its third-quarter revenue guidance due to strong customer growth.",
      "url": "https://www.massdevice.com/insulet-makes-cfo-change-jnj-leader/",
      "source": "MassDevice",
      "published": "20250916T000000",
      "overall_sentiment_score": 0.282042,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.101396,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.712473
    },
    {
      "title": "Mã cổ phiếu Merck (NYSE: MRK): Cách mua, Định giá, So sánh, Đầu tư",
      "summary": "Bài viết phân tích chi tiết về cổ phiếu Merck (MRK), một tập đoàn dược phẩm sinh học đa quốc gia hàng đầu của Mỹ, tập trung vào các sản phẩm chủ lực như Keytruda và Gardasil. Bài viết đi sâu vào lịch sử hình thành, hoạt động kinh doanh, phân tích SWOT, so sánh với các đối thủ cạnh tranh, và dự báo tiềm năng tương lai của MRK, đặc biệt là chiến lược R&D và M&A để đối phó với thách thức hết hạn bằng sáng chế. Mục đích là cung cấp cho nhà đầu tư cái nhìn toàn diện để đưa ra quyết định đầu tư sáng suốt với mã chứng khoán này.",
      "url": "https://www.ebc.com/vi/forex/268559.html",
      "source": "EBC Financial Group",
      "published": "20250912T190841",
      "overall_sentiment_score": 0.192212,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.103982,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.70317
    },
    {
      "title": "Jim Cramer Says Procter & Gamble Stock is “Still Way Too High”",
      "summary": "Jim Cramer expressed his view that Procter & Gamble (NYSE: PG) stock is \"still way too high,\" alongside Johnson & Johnson, despite recent market weakness. He believes investors might be entering too early into these defensive stocks and suggests waiting for further analyst endorsements. Cramer also noted the potential for PG to benefit from a weaker dollar, but still recommends considering AI stocks for greater upside and less downside risk.",
      "url": "https://finance.yahoo.com/news/jim-cramer-says-procter-gamble-134505439.html",
      "source": "Yahoo Finance",
      "published": "20250913T000000",
      "overall_sentiment_score": -0.290397,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.272164,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.701137
    },
    {
      "title": "Alvotech Announces Marketing Approval in Japan of Three New Biosimilars",
      "summary": "Alvotech announced that its partner Fuji Pharma has received marketing approval in Japan for three new biosimilars: AVT03 (denosumab biosimilar), AVT05 (golimumab biosimilar), and AVT06 (aflibercept biosimilar). Notably, AVT05 is the first golimumab biosimilar approved in major global markets. This expands Alvotech's presence in Japan following the successful launch of a Stelara® biosimilar last year, aiming to increase access to affordable biologic medicines.",
      "url": "https://www.globenewswire.com/news-release/2025/09/19/3153112/0/en/Alvotech-Announces-Marketing-Approval-in-Japan-of-Three-New-Biosimilars.html",
      "source": "GlobeNewswire",
      "published": "20250919T074500",
      "overall_sentiment_score": 0.078576,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.101411,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.644854
    },
    {
      "title": "Medical device maker Insulet taps industry veteran Flavia Pease as CFO",
      "summary": "Insulet, a medical device manufacturer, has appointed Flavia Pease, an industry veteran and former Charles River Laboratories executive, as its new chief financial officer, effective September 30. The company also raised its third-quarter total revenue forecast, driven by strong customer growth for its wearable insulin pumps. Pease's previous experience at Charles River Laboratories and Johnson & Johnson, combined with her existing role on Insulet's board, makes her a strong fit for the position, according to analysts.",
      "url": "https://www.reuters.com/business/healthcare-pharmaceuticals/medical-device-maker-insulet-taps-industry-veteran-flavia-pease-cfo-2025-09-16/",
      "source": "Reuters",
      "published": "20250916T222800",
      "overall_sentiment_score": 0.216175,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.057827,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.634556
    },
    {
      "title": "Is Pacer US Cash Cows 100 ETF (COWZ) a Strong ETF Right Now?",
      "summary": "The Pacer US Cash Cows 100 ETF (COWZ), launched in 2016, is a large-cap value smart beta ETF with over $19.72 billion in assets, focusing on U.S. companies with high free cash flow yields. It has an expense ratio of 0.49% and a 12-month trailing dividend yield of 2.06%. The fund's top sectors are Healthcare, Energy, and Information Technology, with its top 10 holdings accounting for 20.95% of its total assets.",
      "url": "https://www.sharewise.com/de/news_articles/Is_Pacer_US_Cash_Cows_100_ETF_COWZ_a_Strong_ETF_Right_Now_Zacks_20250908_2223",
      "source": "www.sharewise.com",
      "published": "20250908T050924",
      "overall_sentiment_score": 0.186366,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.137322,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.621676
    },
    {
      "title": "KVUE stock price: Kenvue plummets as Trump announcement expected to tie Tylenol to autism, tout leucovorin",
      "summary": "Kenvue Inc. (KVUE) stock fell significantly following news that the Trump administration is expected to link Tylenol to autism and suggest leucovorin as a potential treatment. This announcement comes despite research, including a JAMA study, indicating no association between acetaminophen use during pregnancy and an increased risk of autism. Kenvue maintains that acetaminophen does not cause autism, while federal health officials may raise concerns based on other research.",
      "url": "https://www.fastcompany.com/91408354/kvue-kenvue-stock-price-falls-trump-expected-to-tie-tylenol-to-autism-announcement-leucovorin",
      "source": "Fast Company",
      "published": "20250922T000000",
      "overall_sentiment_score": -0.263445,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.149896,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.611174
    },
    {
      "title": "Is Bristol Myers Squibb Undervalued?",
      "summary": "Bristol Myers Squibb stock has significantly underperformed the broader market, falling 20% this year due to pipeline setbacks. Despite moderate operational and financial conditions, its current low valuation ($45, with a 24.56% upside) makes it attractive. The article analyzes BMY's growth, profitability, financial stability, and resilience during downturns, concluding that the stock is undervalued given its valuation metrics and promising new developments like the Abecma acquisition and a co-developed antibody for lung cancer.",
      "url": "https://www.trefis.com/stock/bmy/articles/575734/is-bristol-myers-squibb-undervalued/2025-09-22",
      "source": "Trefis",
      "published": "20250922T000000",
      "overall_sentiment_score": 0.313484,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.329572,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.605987
    },
    {
      "title": "MeiraGTx Reports Second Quarter 2025 Financial and Operational Results",
      "summary": "MeiraGTx Holdings plc announced its second-quarter 2025 financial and operational results, highlighting significant progress in its clinical programs and regulatory interactions. Key developments include FDA alignment on the AAV-hAQP1 Phase 2 study for radiation-induced xerostomia, RMAT designation for AAV-GAD in Parkinson's disease, and advancements toward MAA and BLA filings for AAV-AIPL1 for LCA4. The company also detailed a strategic collaboration with Hologen AI and provided financial figures, reporting a net loss of $38.8 million for the quarter.",
      "url": "https://investingnews.com/meiragtx-reports-second-quarter-2025-financial-and-operational-results/",
      "source": "Investing News Network",
      "published": "20250912T085708",
      "overall_sentiment_score": 0.2691,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.32177,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.605473
    },
    {
      "title": "Regeneron Files UK Patent Proceedings Against Alvotech and Fisher Clinical Services for Aflibercept Biosimilar",
      "summary": "Regeneron has initiated a patent infringement lawsuit in the UK against Alvotech and Fisher Clinical Services UK Limited concerning Alvotech's aflibercept biosimilar, Mynzepli®. This action follows a recent settlement of US aflibercept litigation with Sandoz and ongoing BPCIA litigation against several other biosimilar developers in the US. The UK filing adds another front to Regeneron's efforts to protect its Eylea® patent against biosimilar competition.",
      "url": "https://www.pearceip.law/2025/09/10/regeneron-files-uk-patent-proceedings-against-alvotech-and-fisher-clinical-services-for-aflibercept-biosimilar/",
      "source": "Pearce IP",
      "published": "20250910T235803",
      "overall_sentiment_score": 0.149245,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.141428,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.594025
    },
    {
      "title": "TOMI Environmental Solutions, Inc. Announces Expanded FDA Approval for Hydrogen Peroxide Use in Food Additives",
      "summary": "TOMI Environmental Solutions, Inc. announced expanded FDA approval for hydrogen peroxide as a secondary direct food additive, which broadens market opportunities for its SteraMist technology in the food industry. This approval allows the use of food-grade hydrogen peroxide in food production, provided residues are removed before consumption, a condition met by TOMI's SteraMist solution. The company anticipates significant growth in various food safety verticals, aligning with scientific support for its residue-free technology.",
      "url": "https://www.quiverquant.com/news/TOMI+Environmental+Solutions%2C+Inc.+Announces+Expanded+FDA+Approval+for+Hydrogen+Peroxide+Use+in+Food+Additives",
      "source": "Quiver Quantitative",
      "published": "20250918T131400",
      "overall_sentiment_score": 0.326991,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.302541,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.303876
    }
  ]
}