{
  "ticker": "JNJ",
  "date": "2025-01-13",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T11:59:25.294326",
  "source": "alpha_vantage",
  "article_count": 14,
  "articles": [
    {
      "title": "J&J doubles down on neurological drugs with $14.6 billion Intra-Cellular deal",
      "summary": "Johnson & Johnson announced its biggest deal in over two years, agreeing to acquire neurological drug maker Intra-Cellular Therapies for $14.6 billion. This acquisition will strengthen J&J's presence in the brain disease treatment market and grant it access to Intra-Cellular's approved drug Caplyta and other experimental therapies. The deal, representing a 39% premium, is expected to accelerate growth in J&J's drug business but faces potential antitrust scrutiny due to overlapping products.",
      "url": "https://www.reuters.com/markets/deals/jj-buy-intra-cellular-therapies-146-billion-2025-01-13/",
      "source": "Reuters",
      "published": "20250113T185900",
      "overall_sentiment_score": 0.33496,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.322301,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "JPM25: Johnson & Johnson makes a splash, buying out Intra-Cellular Therapies for $14.6B",
      "summary": "Johnson & Johnson opened the J.P. Morgan Healthcare Conference by acquiring Intra-Cellular Therapies for $14.6 billion, paying a 39% premium. This acquisition, driven by the strong performance of Intra-Cellular's drug Caplyta, marks the largest biopharma acquisition since February 2024 and further strengthens J&J's neuroscience portfolio. The deal values Intra-Cellular Therapies at $132 per share and adds a promising CNS specialist to J&J’s assets.",
      "url": "https://www.fiercepharma.com/pharma/johnson-johnson-makes-jpm-splash-buying-out-intra-cellular-146b",
      "source": "Fierce Pharma",
      "published": "20250113T102900",
      "overall_sentiment_score": 0.217724,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.459588,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Johnson & Johnson Acquires Intra-Cellular Therapies to Bolster Mental Health Business",
      "summary": "Johnson & Johnson announced its acquisition of Intra-Cellular Therapies for approximately $14.6 billion, significantly bolstering its neuroscience portfolio. The acquisition includes Caplyta (lumateperone), an approved therapy for schizophrenia and bipolar depression, and ITI-1284, currently in Phase II trials for generalized anxiety disorder and Alzheimer-related psychosis. J&J emphasizes this move will expand their reach in treating neuropsychiatric and neurodegenerative disorders globally.",
      "url": "https://www.pharmexec.com/view/johnson-johnson-acquires-intra-cellular-therapies-bolster-mental-health-business",
      "source": "Pharmaceutical Executive",
      "published": "20250113T000000",
      "overall_sentiment_score": 0.493831,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.498889,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "10 drugmakers that rule the pharmaceutical industry",
      "summary": "S&P Global ranked the world's top pharmaceutical companies based on business strength and financial risk. Johnson & Johnson and Roche led the list with excellent business and minimal financial risk profiles. The article details the strengths and weaknesses of 10 major drugmakers, including their revenue, product diversity, and market position.",
      "url": "https://qz.com/s-p-global-pharma-ratings-1851622593",
      "source": "Quartz",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.134903,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.319803,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.902887
    },
    {
      "title": "Why Takeda no longer has an 'IT department' as part of the drug maker's digital and data transformation",
      "summary": "Takeda Pharmaceutical, under Chief Data and Technology Officer Gabriele Ricci, has eliminated the term \"IT department\" to emphasize technology as a core business function. The company has substantially reorganized its technology division, bringing most technical work in-house by hiring thousands of engineers and data scientists, and investing heavily in digital and AI transformation to adapt to a volatile pharmaceutical environment. Takeda is actively upskilling its workforce in new technologies, including generative AI tools like \"myAibou,\" and is building and buying AI models while ensuring ethical AI practices.",
      "url": "https://fortune.com/2024/11/13/takeda-pharmaceutical-tech-ai-gabriele-ricci/",
      "source": "Fortune",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.220546,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.227367,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.766499
    },
    {
      "title": "Contineum Therapeutics Completes Enrollment in Phase 2 PIPE-307 VISTA Trial for the Treatment of Relapsing-Remitting Multiple Sclerosis (RRMS)",
      "summary": "Contineum Therapeutics has completed target enrollment of 168 patients for its Phase 2 PIPE-307 VISTA trial for relapsing-remitting multiple sclerosis (RRMS) ahead of schedule. PIPE-307 is an M1 receptor antagonist designed to show evidence of remyelination. Topline data from the trial, expected to conclude in Q3 2025, will assess the drug's safety and efficacy.",
      "url": "https://www.biospace.com/press-releases/contineum-therapeutics-completes-enrollment-in-phase-2-pipe-307-vista-trial-for-the-treatment-of-relapsing-remitting-multiple-sclerosis-rrms",
      "source": "BioSpace",
      "published": "20250109T115920",
      "overall_sentiment_score": 0.350596,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.340496,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.730234
    },
    {
      "title": "Partnering with Customers and Leveraging Data to Boost Health",
      "summary": "Kenvue, spun off from Johnson & Johnson, has focused on leveraging data and strategic partnerships with retailers to optimize its supply chain operations. This approach has led to reduced unloading times, overages, damages, shortages, and improved on-time shipment arrivals. The company utilizes technology, including AI, to enhance order-to-cash processes, automate order intake, improve picking/packing efficiency, and implement a \"Perfect Store\" solution to prevent out-of-stocks at the retail shelf level.",
      "url": "https://www.inboundlogistics.com/articles/partnering-with-customers-and-leveraging-data-to-boost-health/",
      "source": "Inbound Logistics",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.309752,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.119952,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.708215
    },
    {
      "title": "Moderna | History, Innovation, Challenges, & Facts",
      "summary": "Moderna, a biotechnology company founded in 2010, specializes in messenger RNA (mRNA) medicines and is best known for developing one of the first COVID-19 vaccines. The company researches treatments for infectious diseases, cancer, and rare genetic disorders, actively exploring new uses for mRNA technology. Moderna's rapid growth has led to significant advancements, but also challenges including patent disputes and scrutiny over executive stock sales.",
      "url": "https://www.britannica.com/money/Moderna-Inc",
      "source": "Britannica",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.105614,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.091359,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.645179
    },
    {
      "title": "Abdera Therapeutics Expands Management Team and Board of Directors",
      "summary": "Abdera Therapeutics announced the appointments of Philippe Bishop, M.D., as chief medical officer and Eric Dobmeier to its board of directors. Dr. Bishop brings extensive oncology drug development experience, which will be crucial as Abdera advances its lead DLL3 program, ABD-147, into clinical trials. Mr. Dobmeier, former CEO of Chinook Therapeutics, adds significant company-building and corporate development expertise, aligning with Abdera's goal of becoming a leading radiopharmaceutical company.",
      "url": "https://www.businesswire.com/news/home/20240130041699/en/Abdera-Therapeutics-Expands-Management-Team-and-Board-of-Directors",
      "source": "Business Wire",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.265394,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.209518,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.640106
    },
    {
      "title": "GLP-1 boom makes Eli Lilly the first $1 trillion pharma company",
      "summary": "Eli Lilly has become the first healthcare or pharma company to achieve a $1 trillion valuation, largely driven by the success of its GLP-1 drugs, Mounjaro and Zepbound. The company's market cap has more than doubled that of its closest competitor, Johnson & Johnson, and significantly surpassed rival Novo Nordisk, whose market cap has declined due to slowing sales of its GLP-1 drugs and increased competition from compounded versions. This achievement highlights the transformative impact of the obesity drug market and underscores the importance of innovative drug development and market anticipation in maintaining leadership within the pharmaceutical industry.",
      "url": "https://www.emarketer.com/content/glp-1-boom-makes-eli-lilly-first--1-trillion-pharma-company",
      "source": "eMarketer",
      "published": "20250104T000000",
      "overall_sentiment_score": 0.261623,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": -0.14197,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.638523
    },
    {
      "title": "McKesson, Cencora slapped with $266M in damages in Baltimore opioid lawsuit",
      "summary": "A Baltimore court has ordered McKesson and Cencora (formerly AmerisourceBergen) to pay $266 million in damages to the city for their role in the opioid crisis. The judgment comes after a 2022 ruling that found the two drug distributors liable for causing a public nuisance. This decision adds to billions of dollars already paid by opioid manufacturers and distributors to settle similar lawsuits across the country.",
      "url": "https://www.msn.com/en-us/money/companies/mckesson-cencora-slapped-with-266m-in-damages-in-baltimore-opioid-lawsuit/ar-AA1u1Eze",
      "source": "MSN",
      "published": "20241231T235959",
      "overall_sentiment_score": -0.48796,
      "overall_sentiment_label": "Bearish",
      "ticker_sentiment_score": -0.43868,
      "ticker_sentiment_label": "Bearish",
      "relevance_score": 0.617702
    },
    {
      "title": "AI revolutionising everything from patient care to health communication: Delhi AIIMS director",
      "summary": "AIIMS, Delhi, is investing over Rs 300 crore in digital infrastructure to integrate AI, enhancing efficiency, reducing delays, and enabling research across patient care and health communication. Experts highlighted AI's role in simplifying health information and empowering patients but emphasized balancing technology with human empathy for compassionate care. The article also features Humeta, an AI model by Healthpresso, designed to make complex medical concepts accessible and reliable.",
      "url": "https://m.economictimes.com/tech/artificial-intelligence/ai-revolutionising-everything-from-patient-care-to-health-communication-delhi-aiims-director/articleshow/116823153.cms",
      "source": "The Economic Times",
      "published": "20241231T132549",
      "overall_sentiment_score": 0.358676,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.435429,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.613626
    },
    {
      "title": "TDF Litigation",
      "summary": "Gilead Sciences is facing litigation in California over its TDF-based HIV medications, where plaintiffs argue the company should have developed TAF-based medicines sooner. The California Supreme Court is reviewing an appeals court decision that would impose a new legal obligation on manufacturers to develop improved products, a theory Gilead and many amici curiae argue could stifle innovation. Gilead maintains that it developed TDF and later TAF medications responsibly, with both drug types currently approved and recommended for HIV treatment.",
      "url": "https://www.gilead.com/tdf-litigation",
      "source": "Gilead Sciences",
      "published": "20241231T235959",
      "overall_sentiment_score": -0.151388,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.127036,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.605865
    },
    {
      "title": "Nina Barton",
      "summary": "Nina Barton is the Executive Vice President and Group President – Care & Connection at The Clorox Company, a position she assumed in July 2024. In this role, she is responsible for driving the company's Care & Connection businesses, including Brita, Burt’s Bees, Food, Glad, Kingsford and Litter. Barton brings over 25 years of consumer packaged goods experience, previously serving as CEO of Vytalogy Wellness and global chief growth officer at The Kraft Heinz Company.",
      "url": "https://www.thecloroxcompany.com/company/corporate-governance/executive-team/nina-barton/",
      "source": "The Clorox Company",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.282157,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.130966,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.572492
    }
  ]
}