{
  "ticker": "JNJ",
  "date": "2025-07-21",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T12:01:33.734574",
  "source": "alpha_vantage",
  "article_count": 18,
  "articles": [
    {
      "title": "ETFs to Gain on JNJ's Solid Q1 Earnings & Upbeat Outlook",
      "summary": "Johnson & Johnson (JNJ) reported stronger-than-expected second-quarter 2025 results, beating earnings and revenue estimates and lifting its full-year revenue and EPS guidance. Following a 6.1% rally in JNJ shares, investors can gain exposure to its growth through ETFs with significant allocations to JNJ. These include iShares U.S. Pharmaceuticals ETF (IHE), VanEck Vectors Pharmaceutical ETF (PPH), Health Care Select Sector SPDR Fund (XLV), iShares U.S. Healthcare ETF (IYH), and First Trust Nasdaq Pharmaceuticals ETF (FTXH).",
      "url": "https://www.tradingview.com/news/zacks:94fe16a3c094b:0-etfs-to-gain-on-jnj-s-solid-q1-earnings-upbeat-outlook/",
      "source": "TradingView",
      "published": "20250717T041000",
      "overall_sentiment_score": 0.354924,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.43804,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "ETFs to Gain on JNJ's Solid Q1 Earnings & Upbeat Outlook",
      "summary": "Johnson & Johnson (JNJ) reported strong second-quarter 2025 results, beating both earnings and revenue estimates and subsequently raising its full-year revenue and EPS guidance. Shares of JNJ rallied 6.1% following the announcement. Investors can capitalize on JNJ's growth by investing in ETFs with significant allocations to the company, including iShares U.S. Pharmaceuticals ETF (IHE), VanEck Vectors Pharmaceutical ETF (PPH), Health Care Select Sector SPDR Fund (XLV), iShares U.S. Healthcare ETF (IYH), and First Trust Nasdaq Pharmaceuticals ETF (FTXH).",
      "url": "https://www.theglobeandmail.com/investing/markets/stocks/JNJ/pressreleases/33470675/etfs-to-gain-on-jnjs-solid-q1-earnings-upbeat-outlook/",
      "source": "The Globe and Mail",
      "published": "20250717T110400",
      "overall_sentiment_score": 0.358003,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.426114,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Johnson & Johnson receives U.S. FDA Priority Review for TAR-200 NDA in high-risk non-muscle invasive bladder cancer",
      "summary": "Johnson & Johnson announced that the U.S. FDA granted Priority Review to its New Drug Application (NDA) for TAR-200 for the treatment of Bacillus Calmette-Guérin (BCG)-unresponsive high-risk non-muscle invasive bladder cancer (HR-NMIBC). The NDA is supported by data from the Phase 2b SunRISe-1 study, which showed an 82.4 percent complete response rate. TAR-200 is an innovative intravesical drug-releasing system designed for sustained local delivery of gemcitabine, offering a new treatment option for patients with limited alternatives.",
      "url": "https://www.jnj.com/media-center/press-releases/johnson-johnson-receives-u-s-fda-priority-review-for-tar-200-nda-in-high-risk-non-muscle-invasive-bladder-cancer",
      "source": "Johnson & Johnson",
      "published": "20250717T000000",
      "overall_sentiment_score": 0.41093,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.44623,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Johnson & Johnson (JNJ) Q2 2025 Earnings Call Transcript",
      "summary": "Johnson & Johnson (JNJ) reported strong Q2 2025 results, achieving 4.6% operational sales growth and $23.7 billion in worldwide sales, despite significant headwinds from STELARRA biosimilar competition. The company raised its full-year sales and EPS guidance, driven by robust performance in its innovative medicine segment, particularly in oncology and immunology, and significant momentum in MedTech, especially cardiovascular. J&J remains confident in its pipeline and strategic execution to navigate competitive landscapes and drive sustained growth.",
      "url": "https://www.fool.com/earnings/call-transcripts/2025/07/16/johnson-johnson-q2-2025-earnings-call-transcript/",
      "source": "The Motley Fool",
      "published": "20250716T114900",
      "overall_sentiment_score": 0.435256,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.399877,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "These 3 Undervalued Stocks Could Surge as Value Rotation Nears",
      "summary": "This article identifies three undervalued stocks to potentially benefit from a rotation back into value investments, namely Johnson & Johnson (JNJ), Berkshire Hathaway (BRK.B), and Intel Corp (INTC). These companies are presented as having significant upside potential and limited downside risk despite current market optimism focusing on growth stocks. Analyst ratings and recent institutional buying reinforce the bullish outlook for these value plays.",
      "url": "https://finviz.com/news/103274/these-3-undervalued-stocks-could-surge-as-value-rotation-nears",
      "source": "Finviz",
      "published": "20250714T170900",
      "overall_sentiment_score": 0.403003,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.405256,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.885033
    },
    {
      "title": "The 10 best US dividend stocks",
      "summary": "This article identifies the 10 best US dividend stocks for 2025, emphasizing the importance of dividend durability and economic moats over high yields. The selection is based on Morningstar's Dividend Yield Focus Index, featuring undervalued companies with strong financial health and competitive advantages. Each stock is presented with key Morningstar metrics and analyst insights.",
      "url": "https://www.morningstar.com.au/stocks/10-best-us-dividend-stocks",
      "source": "Morningstar",
      "published": "20250718T162704",
      "overall_sentiment_score": 0.420227,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.448099,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.809121
    },
    {
      "title": "A Kenvue anuncia transição de CEO e ações para liberar valor para os acionistas",
      "summary": "Kenvue Inc. announced a CEO transition and strategic actions to unlock shareholder value. Kirk Perry, a Kenvue director and experienced consumer goods and tech leader, was appointed interim CEO. The company is actively conducting a comprehensive review of strategic alternatives and released preliminary Q2 2025 financial results.",
      "url": "https://www.kenvue.com/pt-br/media/kenvue-announces-ceo-transition-strategic-review",
      "source": "Kenvue",
      "published": "20250714T040833",
      "overall_sentiment_score": 0.041263,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.010247,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.746175
    },
    {
      "title": "Tylenol maker Kenvue ousts CEO amid board's strategic review",
      "summary": "Kenvue, the maker of Band-Aid and Tylenol, has ousted CEO Thibaut Mongon amidst a strategic review by its board, leading to speculation of an eventual sale of the company or parts of it. Kirk Perry, a former Procter & Gamble executive, has been appointed interim CEO. This leadership change and ongoing strategic review have been pushed by investors aiming to boost performance or consider a sale, especially after the company's financial struggles and a recent proxy fight.",
      "url": "https://ca.finance.yahoo.com/news/kenvue-ceo-steps-down-105740283.html",
      "source": "Yahoo! Finance Canada",
      "published": "20250714T000000",
      "overall_sentiment_score": 0.085324,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.103577,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.700541
    },
    {
      "title": "Tylenol-maker Kenvue fires CEO amid board's strategic review",
      "summary": "Kenvue, the Tylenol and Band-Aid maker, has fired CEO Thibaut Mongon amidst investor pressure to boost performance and a board-initiated strategic review. Kirk Perry has been named interim CEO, marking the company's second major executive shake-up this year. The strategic review will explore options to simplify operations and potentially sell off certain brands, particularly within its skin-health and beauty unit.",
      "url": "https://www.cnbc.com/2025/07/14/kenvue-ceo-thibaut-mongon-steps-down.html",
      "source": "CNBC",
      "published": "20250714T071200",
      "overall_sentiment_score": 0.052396,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.117384,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.646906
    },
    {
      "title": "Stryker’s AI Strategy: Analysis of Dominance in Medical Technology",
      "summary": "This report details Stryker Corporation's AI strategy, highlighting its dual approach to achieve dominance in medical technology. Stryker leverages the Mako SmartRobotics™ platform for surgical intelligence and an Ambient Intelligence Network, built through acquisitions like Vocera and care.ai, to create a \"Smart Hospital\" environment. The convergence of these two ecosystems is designed to establish a comprehensive, data-driven view of the patient journey, positioning Stryker as a leading force in AI-driven healthcare.",
      "url": "https://www.klover.ai/stryker-ai-strategy-analysis-of-dominance-in-medical-technology/",
      "source": "Klover.ai",
      "published": "20250720T000837",
      "overall_sentiment_score": 0.260963,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.105743,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.64662
    },
    {
      "title": "CVRx, Inc. (NASDAQ:CVRX) institutional owners may be pleased with recent gains after 24% loss over the past year",
      "summary": "Institutional investors own 47% of CVRx, Inc. (NASDAQ:CVRX), making them the largest shareholder group, likely pleased with a recent 12% gain after a 24% loss over the past year. Johnson & Johnson Innovation - JJDC, Inc. is the top individual shareholder with 16%, and institutional ownership implies scrutiny and potential stock price sensitivity to their trading actions. Private equity firms hold 31% and the general public 22%, while insiders own less than 1% but have shown recent buying activity.",
      "url": "https://simplywall.st/stocks/us/healthcare/nasdaq-cvrx/cvrx/news/cvrx-inc-nasdaqcvrx-institutional-owners-may-be-pleased-with",
      "source": "Simply Wall Street",
      "published": "20250715T000000",
      "overall_sentiment_score": 0.171064,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.153125,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.645561
    },
    {
      "title": "Moderna gets full US approval for COVID shot in at-risk children 6 months and older",
      "summary": "The U.S. Food and Drug Administration has granted full approval for Moderna's COVID-19 vaccine, Spikevax, for children aged 6 months through 11 years who are at an increased risk of the disease. This move faces controversy as Health Secretary Robert F. Kennedy Jr. has previously questioned vaccine safety and replaced members of the CDC's Advisory Committee on Immunization Practices with vaccine skeptics. Despite this, the CDC continues to recommend updated COVID vaccines for everyone aged six months and older, with shots remaining an option for healthy children when parents and doctors agree.",
      "url": "https://www.reuters.com/business/healthcare-pharmaceuticals/moderna-gets-full-us-approval-covid-vaccine-children-6-months-older-2025-07-10/",
      "source": "Reuters",
      "published": "20250710T042700",
      "overall_sentiment_score": -0.202045,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.316191,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.64515
    },
    {
      "title": "Baxter appoints Andrew Hider as CEO",
      "summary": "Baxter has appointed Andrew Hider as its new President and CEO, filling the vacancy left by José Almeida's retirement. Hider, previously CEO of ATS Corporation, is known for overseeing a series of tuck-in acquisitions that drove revenue growth. Baxter expects Hider to accelerate the company's growth rate through innovation and acquisitions, with him scheduled to start by September 3rd.",
      "url": "https://www.medtechdive.com/news/baxter-andrew-hider-ceo/752403/",
      "source": "MedTech Dive",
      "published": "20250708T000000",
      "overall_sentiment_score": 0.189402,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.104633,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.636783
    },
    {
      "title": "Boston Scientific’s AI Strategy: Analysis of Dominance in Medical Technology",
      "summary": "This report analyzes how Boston Scientific (BSX) is strategically positioning itself to dominate the AI-enabled medical technology market. By integrating AI into its high-growth product portfolios, particularly in cardiology, and leveraging robust financial performance, strategic acquisitions, and proprietary data moats, BSX is building a defensible competitive advantage. The article details BSX's product-led AI approach, its \"buy and build\" innovation strategy, and how it cultivates talent and utilizes vast datasets to reinforce its market position against both traditional MedTech rivals and emerging Big Tech challenges.",
      "url": "https://www.klover.ai/boston-scientific-ai-strategy-analysis-of-dominance-in-medical-technologies/",
      "source": "Klover.ai",
      "published": "20250720T000801",
      "overall_sentiment_score": 0.277202,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.131022,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.625348
    },
    {
      "title": "Kenvue Announces CEO Transition and Actions to Unlock Shareholder Value",
      "summary": "Kenvue Inc. (NYSE: KVUE) announced a CEO transition and a comprehensive review of strategic alternatives to unlock shareholder value. Kirk Perry has been appointed Interim CEO, effective immediately, replacing Thibaut Mongon. The company also reported select preliminary financial results for the second quarter of 2025, with net sales decreasing by 4.0% and organic sales by 4.2%.",
      "url": "https://investors.kenvue.com/financial-news/news-details/2025/Kenvue-Announces-CEO-Transition-and-Actions-to-Unlock-Shareholder-Value/default.aspx",
      "source": "Kenvue Investor Relations",
      "published": "20250714T235123",
      "overall_sentiment_score": 0.19915,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.086143,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.623361
    },
    {
      "title": "XLV vs. XLK: Time to Rotate Into Healthcare?",
      "summary": "This article examines whether it's time for investors to rotate from high-performing technology stocks (XLK) into the underperforming, yet defensive, healthcare sector (XLV). It highlights the significant divergence in performance, with tech surging while healthcare lagged, and discusses factors like stretched valuations in tech and the defensive nature of healthcare, especially given an aging population and consistent demand for services. Despite political rhetoric, the article suggests that healthcare offers compelling long-term exposure and a potential tactical opportunity for rebalancing portfolios.",
      "url": "https://www.etf.com/sections/advisor-center/xlv-vs-xlk-time-rotate-healthcare",
      "source": "ETF.com",
      "published": "20250710T105847",
      "overall_sentiment_score": 0.165435,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.245321,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.618902
    },
    {
      "title": "Healthcare ETF XLV Rebounds to $138 as S&P 500 Opens Higher",
      "summary": "The Health Care Select Sector SPDR Fund (XLV) is currently undervalued, trading at a 16x-17x forward P/E despite projected 2025 earnings growth of 14.3%. With an ultra-low expense ratio, high dividend yield, and concentration in innovative pharmaceutical giants, XLV presents a compelling long-term investment opportunity. Despite political risks like potential Medicare/Medicaid cuts and drug price mandates, AI integration and expansion into biotech and life sciences offer significant future upside, reinforcing a \"Buy\" rating for investors seeking defensive growth.",
      "url": "https://www.tradingnews.com/news/xlv-etf-jumps-to-138-usd",
      "source": "TradingNEWS",
      "published": "20250716T050942",
      "overall_sentiment_score": 0.227557,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.27891,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.617324
    },
    {
      "title": "THW Stock: 13%-Yielding Health-Care Fund Pays Monthly",
      "summary": "The abrdn World Healthcare Fund (NYSE:THW) offers investors exposure to global health-care companies with a high dividend yield of over 13%, paid monthly. This closed-end fund invests across pharmaceuticals, biotech, medical devices, and health-care services, holding major names like Johnson & Johnson and UnitedHealth Group Inc. While attractive for income, potential investors should be aware of risks including dividend continuity, leverage, sector-specific risks, and Net Asset Value erosion.",
      "url": "https://www.incomeinvestors.com/thw-stock-13-percent-yielding-health-care-fund-pays-monthly/77380/",
      "source": "Income Investors",
      "published": "20250714T071000",
      "overall_sentiment_score": 0.35819,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.319173,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.615358
    }
  ]
}