{
  "ticker": "JNJ",
  "date": "2025-04-28",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T12:00:36.510409",
  "source": "alpha_vantage",
  "article_count": 12,
  "articles": [
    {
      "title": "“No More Tears” Book and Court Ruling Expose Johnson & Johnson’s Tactics in Talc Bankruptcy Cases",
      "summary": "A new book, \"No More Tears: The Dark Secrets Of Johnson & Johnson,\" by investigative journalist Gardiner Harris, exposes J&J's alleged unethical behavior and prioritization of profits over patient safety, particularly concerning talc products. This release coincides with a Houston court's rejection of J&J's third attempt to settle talc-related lawsuits through bankruptcy, enabling plaintiffs' claims to proceed. The article highlights J&J's alleged disregard for scientific evidence linking talc to ovarian cancer and its efforts to use bankruptcy to avoid accountability, marking a victory for talc victims.",
      "url": "https://www.anapolweiss.com/blog/no-more-tears-the-dark-secrets-of-johnson-johnson/",
      "source": "Anapol Weiss",
      "published": "20250421T000000",
      "overall_sentiment_score": -0.706583,
      "overall_sentiment_label": "Bearish",
      "ticker_sentiment_score": -0.700089,
      "ticker_sentiment_label": "Bearish",
      "relevance_score": 1.0
    },
    {
      "title": "Johnson & Johnson CEO warns US tariffs may disrupt drug supply",
      "summary": "Johnson & Johnson CEO Joaquin Duato warned that US tariffs on pharmaceuticals could lead to supply chain disruptions and that favorable tax policies would be more effective for boosting domestic manufacturing. This warning comes as the company reported strong first-quarter results but adjusted its profit outlook to account for an estimated $400 million impact from tariffs, primarily in its medical device business. J&J, along with other drugmakers like Eli Lilly, is advocating for tax incentives over tariffs to encourage US investment and production.",
      "url": "https://www.reuters.com/business/healthcare-pharmaceuticals/jj-beats-wall-street-quarterly-sales-profit-estimates-cancer-drug-sales-2025-04-15/",
      "source": "Reuters",
      "published": "20250415T163400",
      "overall_sentiment_score": -0.083099,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.152217,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 1.0
    },
    {
      "title": "Johnson & Johnson Earnings: Solid Innovation and Manageable Tariff Headwind",
      "summary": "Johnson & Johnson reported solid first-quarter sales and EPS growth, with management raising sales guidance for 2025 despite concerns about biosimilars and tariffs. The company's fair value estimate remains at $164 per share, supported by strong performance in key products like Carvykti and icotrokinra, which are expected to drive mid-single-digit top-line growth. Although J&J faces a $400 million tariff impact, particularly in its medtech business, strategic product performance and potential tax policy changes are factored into the outlook.",
      "url": "https://www.morningstar.com/stocks/johnson-johnson-earnings-solid-innovation-manageable-tariff-headwind",
      "source": "Morningstar",
      "published": "20250415T000000",
      "overall_sentiment_score": 0.312372,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.42731,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.958174
    },
    {
      "title": "Adicet Bio Appoints Michael Grissinger to the Board of Directors",
      "summary": "Adicet Bio, Inc. has announced the appointment of Michael Grissinger to its Board of Directors. Grissinger brings over four decades of experience in business development, strategy, and M&A leadership from global pharmaceutical companies, including a significant tenure at Johnson & Johnson. His expertise in immunology and track record of driving commercial success are expected to be instrumental in Adicet’s growth and advancement of its gamma delta T cell platform for autoimmune and solid tumor indications.",
      "url": "https://www.citybiz.co/article/683723/adicet-bio-appoints-michael-grissinger-to-the-board-of-directors/",
      "source": "citybiz",
      "published": "20250417T000000",
      "overall_sentiment_score": 0.311811,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.226733,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.736886
    },
    {
      "title": "Merck KGaA to buy biotech SpringWorks for $3.9B",
      "summary": "Merck KGaA announced its agreement to acquire SpringWorks Therapeutics for $3.9 billion, a deal coming after months of negotiations. SpringWorks brings two U.S.-approved drugs for rare tumors, Ogsiveo and Gomekli, to Merck KGaA's portfolio. This acquisition marks the first biotech buyout over $1 billion since mid-January and aligns with Merck KGaA's strategy to expand its global presence and innovation capabilities.",
      "url": "https://www.biopharmadive.com/news/merck-kgaa-springworks-deal-acquire-cancer-drug/746474/",
      "source": "BioPharma Dive",
      "published": "20250428T045201",
      "overall_sentiment_score": 0.252048,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.326313,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.641018
    },
    {
      "title": "Thermo Fisher jumps on the US investment bandwagon with $2B in additional spending",
      "summary": "Thermo Fisher Scientific announced an additional $2 billion investment in the U.S. over the next four years, with three-quarters dedicated to strengthening manufacturing operations and the remainder to R&D. This move aligns with a trend of biopharma companies increasing their U.S. presence, driven by a desire to bolster American innovation and competitiveness. CEO Marc Casper emphasized the company's commitment to ensuring life-saving medicines and therapies continue to be developed and produced domestically.",
      "url": "https://www.fiercepharma.com/manufacturing/thermo-fisher-joins-us-investment-bandwagon-2b-plan",
      "source": "Fierce Pharma",
      "published": "20250424T145000",
      "overall_sentiment_score": 0.406014,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.340837,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.637335
    },
    {
      "title": "Thermo Fisher to Invest $2 Billion in US Biotech Manufacturing, R&D",
      "summary": "Thermo Fisher Scientific is investing $2 billion in its US operations over the next four years, with $1.5 billion dedicated to expanding manufacturing and $500 million for R&D. This move aims to bolster domestic innovation and manufacturing capabilities in the life sciences sector. The investment builds on previous growth, with the company doubling revenue and increasing its workforce significantly since 2017, and follows similar announcements from other major biopharma companies.",
      "url": "https://www.pharmexec.com/view/thermo-fisher-invest-2-billion-us-biotech-manufacturing-rd",
      "source": "Pharmaceutical Executive",
      "published": "20250428T000000",
      "overall_sentiment_score": 0.338655,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.313084,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.62729
    },
    {
      "title": "Hydrogel‐Based Smart Materials for Wound Healing and Sensing",
      "summary": "This review explores the advancements in hydrogel-based smart materials for wound healing and sensing, highlighting their potential for revolutionizing medical treatments and real-time diagnostics. The article details the design principles, fabrication techniques, and diverse applications of these materials, which mimic the natural extracellular matrix to support wound regeneration while addressing issues like material stability and toxicity. It covers innovations such as nanofibers, elastomers, conducting polymers, and their integration with smart monitoring systems and bioactive components for enhanced wound care. The review concludes by discussing challenges and future directions, emphasizing the transformative potential of multifunctional hydrogel-based materials in improving wound healing and continuous monitoring.",
      "url": "https://onlinelibrary.wiley.com/doi/full/10.1002/agt2.70047",
      "source": "Wiley Online Library",
      "published": "20250422T050939",
      "overall_sentiment_score": 0.283257,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.283039,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.61171
    },
    {
      "title": "Roche e Regeneron anunciam bilhões em investimentos nos EUA diante de novas tarifas",
      "summary": "Roche and Regeneron announced multi-billion dollar investments to expand production in the U.S., making them the latest pharmaceutical companies to commit to American manufacturing. This move comes as new and upcoming tariffs on foreign-made medicines approach, following similar commitments from Novartis, Johnson & Johnson, and Eli Lilly. The investments will create new facilities and jobs, particularly for glucose monitoring devices and weight-loss medications.",
      "url": "https://www.infomoney.com.br/saude/roche-e-regeneron-anunciam-bilhoes-em-investimentos-nos-eua-diante-de-novas-tarifas/",
      "source": "InfoMoney",
      "published": "20250422T153500",
      "overall_sentiment_score": 0.434959,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.414567,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.603768
    },
    {
      "title": "Healthcare ETFs Tug of War: Insurers Tumble, Pharma Surges",
      "summary": "The U.S. healthcare sector experienced a turbulent trading session on April 17, 2025, with insurer stocks falling due to UnitedHealth's earnings disappointment. However, strong gains from drugmakers, particularly Eli Lilly, helped offset broader sector losses. This led to a \"tug of war\" within healthcare ETFs, where pharmaceutical-focused funds surged while those heavily invested in healthcare providers declined.",
      "url": "https://www.tradingview.com/news/zacks:77033e263094b:0-healthcare-etfs-tug-of-war-insurers-tumble-pharma-surges/",
      "source": "TradingView",
      "published": "20250417T000000",
      "overall_sentiment_score": -0.029163,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.541814,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.600366
    },
    {
      "title": "Insulet Appoints Ashley McEvoy President and CEO",
      "summary": "Insulet Corporation announced the appointment of Ashley McEvoy as its new President and Chief Executive Officer, effective immediately. Ms. McEvoy succeeds Jim Hollingshead, who will transition out of the role by April 28, 2025. Insulet also expects to exceed its first-quarter revenue guidance and will raise its full-year 2025 guidance.",
      "url": "https://www.businesswire.com/news/home/20250427237590/en/Insulet-Appoints-Ashley-McEvoy-President-and-CEO",
      "source": "Business Wire",
      "published": "20250427T000000",
      "overall_sentiment_score": 0.388367,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.262344,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.591676
    },
    {
      "title": "Merck KGaA’s Rare Tumor Strategy Takes Shape With $3.9B SpringWorks Acquisition",
      "summary": "Merck KGaA is acquiring SpringWorks Therapeutics for $3.9 billion to bolster its rare tumor portfolio and pipeline. SpringWorks brings two FDA-approved drugs, Ogsiveo and Gomekli, which are also under regulatory review in Europe and have potential for broader applications in various cancers. This acquisition strengthens Merck KGaA's U.S. presence and strategic focus on unmet medical needs in rare tumor treatment.",
      "url": "https://medcitynews.com/2025/04/merck-kgaa-springworks-therapeutics-acquisition-rare-tumor-cancer-ogsiveo-gomekli/",
      "source": "MedCity News",
      "published": "20250428T110856",
      "overall_sentiment_score": 0.241944,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": -0.089076,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.563329
    }
  ]
}