{
  "ticker": "JNJ",
  "date": "2026-01-26",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T12:03:44.654485",
  "source": "alpha_vantage",
  "article_count": 50,
  "articles": [
    {
      "title": "Johnson & Johnson Stock: 2026 Outlook After 50% Gains",
      "summary": "Johnson & Johnson (JNJ) has shown resilient performance, posting $25 billion in quarterly revenue and $6 billion profit, driven by its pharmaceutical and MedTech portfolios. Despite challenges like tariffs and litigation, the stock is projected to reach $277 by 2028, implying a 26% total return or 8% annualized over three years. This outlook is based on assumptions of 5.8% revenue growth, 34.4% operating margins, and an 18.4x exit P/E multiple, with different scenarios explored for varying operational outcomes.",
      "url": "https://www.tikr.com/blog/johnson-johnson-stock-2026-outlook-after-50-gains",
      "source": "TIKR.com",
      "published": "20260126T171010",
      "overall_sentiment_score": 0.345065,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.30928,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "How Johnson & Johnson’s 2025 Beat and 2026 Sales Guidance Could Shape JNJ Investors’ Outlook",
      "summary": "Johnson & Johnson reported strong fourth-quarter and full-year 2025 sales, exceeding expectations, and issued above-consensus sales guidance for 2026, targeting around $100 billion in operational sales. This performance, driven by oncology and medtech momentum and a robust pipeline, reinforces the company's research-driven healthcare platform narrative. Despite the positive outlook, investors are weighing risks like pricing pressures and ongoing litigation, which caused a modest stock pullback post-earnings.",
      "url": "https://nz.finance.yahoo.com/news/johnson-johnson-2025-beat-2026-200825739.html",
      "source": "Yahoo Finance New Zealand",
      "published": "20260123T201055",
      "overall_sentiment_score": 0.42241,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.381339,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Johnson & Johnson stock holds steady as Guggenheim reiterates Buy rating",
      "summary": "Guggenheim reiterated a Buy rating and a $227.00 price target for Johnson & Johnson (NYSE:JNJ) after the healthcare giant reported strong Q4 2025 financial results. The company's sales of $24.564 billion and EPS of $2.46 exceeded or met analyst expectations, driven by strong performance in its Innovative Medicine and MedTech segments. Despite potential for muted stock reaction due to recent gains, J&J issued a positive 2026 sales and EPS guidance.",
      "url": "https://www.investing.com/news/analyst-ratings/johnson--johnson-stock-holds-steady-as-guggenheim-reiterates-buy-rating-93CH-4460074",
      "source": "Investing.com",
      "published": "20260122T145245",
      "overall_sentiment_score": -0.081312,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.457263,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Johnson and Johnson stock hits all-time high at 220.21 USD By Investing.com",
      "summary": "Johnson & Johnson (JNJ) stock has reached an all-time high of $220.21, marking a 49.2% increase over the past year. This milestone follows strong Q4 2025 sales and earnings that surpassed analyst expectations, with several firms reiterating positive ratings and increasing price targets. The company maintains a market capitalization of $525.25 billion, a P/E ratio of 19.78, and a 2.39% dividend yield, having paid dividends for 56 consecutive years.",
      "url": "https://au.investing.com/news/company-news/johnson-and-johnson-stock-hits-alltime-high-at-22021-usd-93CH-4218546",
      "source": "Investing.com Australia",
      "published": "20260122T143842",
      "overall_sentiment_score": 0.533685,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.516708,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Cancer drugs fuel J&J's sales growth and upbeat forecast",
      "summary": "Johnson & Johnson's sales growth is primarily driven by its oncology drug portfolio. This strong performance in cancer treatments has led the company to issue an optimistic forecast for its future financial results. The positive outlook suggests continued robust growth, particularly in its pharmaceutical sector.",
      "url": "https://firstwordpharma.com/story/7073177",
      "source": "FirstWord Pharma",
      "published": "20260122T122658",
      "overall_sentiment_score": 0.435623,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.408461,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Johnson & Johnson’s 2nd investment will fuel Wilson’s progress",
      "summary": "Johnson & Johnson is making a second significant investment in Wilson County, North Carolina, by building a new manufacturing facility for oncology and neurology drugs, creating 500 new jobs. This expansion highlights successful bipartisan economic development partnerships and is supported by enhanced workforce training programs at Wilson Community College, including the new Biomanufacturing Education and Skills Training (BEST) Center. The initiative aims to connect educational opportunities with industry needs, ensuring local residents are prepared for high-quality jobs in the growing life sciences sector.",
      "url": "https://www.wilsontimes.com/columns/johnson-johnsons-2nd-investment-will-fuel-wilsons-progress-7f6c28f0",
      "source": "The Wilson Times",
      "published": "20260122T045716",
      "overall_sentiment_score": 0.43045,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.412278,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "J&J Aims for $100B in Sales, Puts Stelara Patent Cliff ‘in the Rearview Mirror’",
      "summary": "Johnson & Johnson reported strong 2025 earnings, with worldwide sales reaching $94.2 billion, and projects sales to hit $100.5 billion in 2026. This growth comes despite the significant revenue decline of its blockbuster drug Stelara due to patent expiration, with other segments like oncology, Tremfaya, and Spravato driving the company's expansion. J&J also maintained its stance on ongoing talc litigation, disputing certain expert testimonies.",
      "url": "https://www.biospace.com/business/j-j-aims-for-100b-in-sales-puts-stelara-patent-cliff-in-the-rearview-mirror",
      "source": "BioSpace",
      "published": "20260122T045716",
      "overall_sentiment_score": 0.427716,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.415823,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "J&J’s cardiovascular business boosts medtech growth in 2025",
      "summary": "Johnson & Johnson's cardiovascular business was the primary driver of growth for its medical device division in 2025, with sales increasing by nearly 16% to $8.93 billion. This growth strategy involves shifting focus to higher-growth markets, exemplified by the acquisitions of Abiomed and Shockwave Medical. Meanwhile, J&J plans to spin off its orthopedics business in mid-2027 to further streamline its portfolio towards these high-growth areas.",
      "url": "https://www.medtechdive.com/news/jnj-q4-full-year-earnings-cardiovascular/810121/",
      "source": "MedTech Dive",
      "published": "20260122T035642",
      "overall_sentiment_score": 0.446168,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.446709,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Johnson & Johnson (JNJ) Q4 2025 Earnings Call Highlights: Strong Revenue Growth and ...",
      "summary": "Johnson & Johnson reported strong Q4 and full-year 2025 results, with significant revenue growth in both Innovative Medicine and MedTech segments. Key drivers included strong oncology and immunology sales, alongside a robust product pipeline. While facing headwinds from STELARA and talc litigation, the company remains confident in its ability to achieve double-digit revenue growth by the end of the decade through strategic focus on high-innovation markets and continued pipeline development.",
      "url": "https://sg.finance.yahoo.com/news/johnson-johnson-jnj-q4-2025-210241219.html",
      "source": "Yahoo Finance Singapore",
      "published": "20260121T210525",
      "overall_sentiment_score": 0.402554,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.430353,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Johnson & Johnson Beats Earnings and Lifts Outlook as Shares Drop",
      "summary": "Johnson & Johnson reported better-than-expected earnings for the fourth quarter, leading to a lifted outlook. Despite this positive financial performance and a strong stock gain of 43% in 2025, the company's stock experienced a decline following the announcement. This situation highlights a discrepancy between strong financial results and immediate market reaction.",
      "url": "https://www.barrons.com/articles/johnson-johnson-earnings-beat-outlook-stock-falls-7b2c508e?gaa_at=eafs&gaa_n=AWEtsqfZ2C35HXJhsakbKU4ggdY-Mli7VU1Wndh9pFXZHfV4Ro266TytMSj3&gaa_ts=6975270c&gaa_sig=9B4s1CSOlPfrvSOIY6GKL2rNwm6ZeJ63_rdSktxeKQRqghc3cWCNX8j4bbt3XX-HUkEjcxK0uo0pt0iSz0g4Cw%3D%3D",
      "source": "Barron's",
      "published": "20260121T195708",
      "overall_sentiment_score": 0.148074,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.140577,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 1.0
    },
    {
      "title": "Led by Darzalex surge, J&J expects revenue to reach $100B in 2026",
      "summary": "Johnson & Johnson projects its 2026 revenue to reach $100-$101 billion, driven significantly by the strong performance of its multiple myeloma drug Darzalex, which exceeded $14.4 billion in sales for 2025. This growth signals a sustainable path to the $100 billion mark, unlike Pfizer's pandemic-driven surge, with J&J also forecasting double-digit revenue increases by the end of the decade, particularly in oncology, immunology, and neuroscience. Despite biosimilar competition impacting Stelara sales, other key products like Tremfya, Spravato, Carvykti, and Erleada are contributing to the company's \"accelerated growth\" into a new era.",
      "url": "https://www.fiercepharma.com/pharma/led-darzalex-surge-jj-expects-revenue-reach-100b-2026",
      "source": "Fierce Pharma",
      "published": "20260121T192708",
      "overall_sentiment_score": 0.457334,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.450681,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "J&J eyes $100B in sales amid gains for cancer, immune drugs",
      "summary": "Johnson & Johnson projects sales of $100 billion to $101 billion in 2026, driven by growth in its cancer and immunology portfolios, despite facing patent expirations for key drugs like Stelara and upcoming ones for Darzalex. The company's fourth-quarter 2025 sales reached $24.6 billion, a 9.1% increase, although investor reaction was muted due to anticipated higher costs and unmet expectations for some drug sales. J&J is strategically acquiring new companies and expanding its oncology portfolio to mitigate the impact of expiring patents and aims to become the leading oncology company with $50 billion in sales by the end of the decade.",
      "url": "https://www.biopharmadive.com/news/johnson-johnson-2025-earnings-sales-cancer-immune-drugs/810097/",
      "source": "BioPharma Dive",
      "published": "20260121T165716",
      "overall_sentiment_score": 0.07468,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.080764,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 1.0
    },
    {
      "title": "Johnson & Johnson MedTech sales up 7.5% in Q4",
      "summary": "Johnson & Johnson reported strong fourth-quarter results, with sales beating analyst expectations and earnings matching them. The company's MedTech segment saw a 7.5% increase, driven by acquisitions and key product lines like electrophysiology and Abiomed heart pumps. J&J's CEO highlighted a \"catapult year\" fueled by innovation across its six key businesses and provided an optimistic outlook for 2026.",
      "url": "https://www.massdevice.com/johnson-johnson-medtech-sales-up-7-5-in-q4/",
      "source": "MassDevice",
      "published": "20260121T154409",
      "overall_sentiment_score": 0.203201,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.284201,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "J&J says 2026 sales could top $100 billion",
      "summary": "Johnson & Johnson projects its 2026 sales to reach around $100 billion for the first time, following a strong performance driven by a 9.1% revenue growth in Q4 and a 10% rise in innovative medicines sales, particularly cancer drugs. Despite a recent drug pricing deal with the Trump administration and ongoing legal liabilities related to talc products, J&J is optimistic about its oncology pipeline and new therapies like icotrokinra, even as investor enthusiasm remains muted. The company aims to become the largest oncology player with over $50 billion in cancer drug sales by 2030.",
      "url": "https://pharmaphorum.com/news/jj-says-2026-sales-could-top-100-billion",
      "source": "pharmaphorum",
      "published": "20260122T132659",
      "overall_sentiment_score": 0.034223,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.129251,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.973725
    },
    {
      "title": "Analysts Are Bullish on These Healthcare Stocks: Invivyd (IVVD), Alignment Healthcare (ALHC)",
      "summary": "This article highlights analysts' bullish sentiments on several healthcare stocks, focusing on Invivyd (IVVD) and Alignment Healthcare (ALHC). H.C. Wainwright maintained a Buy rating for Invivyd with a $10.00 price target, while KeyBanc maintained a Buy rating for Alignment Healthcare with a $28.00 price target. Johnson & Johnson (JNJ) also received a Buy rating from RBC Capital with a $240.00 price target.",
      "url": "https://www.theglobeandmail.com/investing/markets/stocks/JNJ/pressreleases/37190673/analysts-are-bullish-on-these-healthcare-stocks-invivyd-ivvd-alignment-healthcare-alhc/",
      "source": "The Globe and Mail",
      "published": "20260123T082752",
      "overall_sentiment_score": 0.425274,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.434178,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.74497
    },
    {
      "title": "Genmab Stops Recruiting Patients In Trial Of ProfoundBio ADC GEN1286",
      "summary": "Genmab has ceased recruiting patients for its trial of ProfoundBio's ADC GEN1286. The article, published on January 26, 2026, highlights this development in the pharmaceutical business news.",
      "url": "https://insights.citeline.com/scrip/r-and-d/clinical-trials/genmab-stops-recruiting-patients-in-trial-of-profoundbio-adc-gen1286-LCITULQOJFDGFFZTGVMGN54Z2A/",
      "source": "Citeline News & Insights",
      "published": "20260126T225754",
      "overall_sentiment_score": -0.160035,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.210587,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.729087
    },
    {
      "title": "Why Intuitive Surgical Could Still Lead the Robotic Surgery Market in 5 Years",
      "summary": "Intuitive Surgical, despite increasing competition from Medtronic and Johnson & Johnson, is well-positioned to maintain its leadership in the robotic surgery market over the next five years. This is primarily due to its advanced da Vinci 5 system, an established business model based on recurring revenue from consumables, high switching costs for hospitals, and its extensive clinical data and network of trained surgeons. The article asserts that the market is expanding, allowing for multiple players, and Intuitive's continuous innovation and entrenched ecosystem provide a strong competitive advantage.",
      "url": "https://nai500.com/blog/2026/01/why-intuitive-surgical-could-still-lead-the-robotic-surgery-market-in-5-years/",
      "source": "NAI500",
      "published": "20260122T064551",
      "overall_sentiment_score": 0.211735,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.129751,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.706385
    },
    {
      "title": "Medtronic wins CE mark for Affera Sphere-360 PFA catheter, reports first U.S. IDE cases",
      "summary": "Medtronic has achieved two significant milestones for its Affera Sphere-360 catheter, a pulsed field ablation (PFA) system: it received CE mark approval and completed the first U.S. cases in its Horizon 360 FDA IDE trial. This all-in-one mapping and single-shot PFA catheter is designed to simplify AFib treatment, enhance efficiency, and provide durable lesions. The company is advancing in the competitive PFA market, leveraging technology acquired through its 2022 acquisition of Affera.",
      "url": "https://www.massdevice.com/medtronic-ce-mark-affera-first-ide-cases/",
      "source": "MassDevice",
      "published": "20260126T115340",
      "overall_sentiment_score": 0.220949,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.1073,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.64937
    },
    {
      "title": "Biotech Recovery: Halozyme and Catalyst Stocks Surge Amid Strong Growth",
      "summary": "The biotech sector is experiencing a strong recovery, with the SPDR S&P Biotech ETF outperforming the S&P 500 in 2025. Halozyme Therapeutics and Catalyst Pharmaceuticals are key players in this surge, showing significant revenue and EPS growth, driven by their competitive edge in drug delivery systems and rare disease treatments, respectively. Both companies forecast continued strong growth into 2026, indicating a positive outlook, though analyst opinions on Halozyme are mixed.",
      "url": "https://intellectia.ai/news/stock/biotech-recovery-halozyme-and-catalyst-stocks-surge-amid-strong-growth",
      "source": "Intellectia AI",
      "published": "20260125T165935",
      "overall_sentiment_score": 0.342777,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.253076,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.645151
    },
    {
      "title": "Deutsche Bank Downgrades Qiagen NV (QGEN) to Hold",
      "summary": "Deutsche Bank analyst Jan Koch has downgraded Qiagen NV (NYSE: QGEN) from a Buy rating to a Hold rating, setting a price target of $54.00. The article is a premium-only piece, requiring a subscription to StreetInsider.com to read the full details of the downgrade.",
      "url": "https://www.streetinsider.com/Analyst+Comments/Deutsche+Bank+Downgrades+Qiagen+NV+%28QGEN%29+to+Hold/25877154.html",
      "source": "StreetInsider",
      "published": "20260122T075756",
      "overall_sentiment_score": -0.025774,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.103072,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.644736
    },
    {
      "title": "ISS Backs Kenvue (KVUE) Deal, Investors Debate Tylenol and Litigation Risks",
      "summary": "Institutional Shareholder Services (ISS) has recommended that Kenvue shareholders approve Kimberly-Clark's $40 billion bid, citing potential synergies despite ongoing talcum litigation and Tylenol safety concerns. Meridian Hedged Equity Fund believes the market has overreacted to these concerns, seeing significant value potential in Kenvue through brand reinvestment and cost optimization. Investor sentiment may stabilize following the ISS endorsement, though both Kimberly-Clark and Kenvue have seen their share prices decline since the deal announcement.",
      "url": "https://finviz.com/news/282082/iss-backs-kenvue-kvue-deal-investors-debate-tylenol-and-litigation-risks",
      "source": "Finviz",
      "published": "20260121T185635",
      "overall_sentiment_score": 0.033831,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.145897,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.643407
    },
    {
      "title": "Protagonist Therapeutics (NASDAQ:PTGX) CEO Sells $2,840,446.24 in Stock",
      "summary": "Protagonist Therapeutics (NASDAQ:PTGX) CEO Dinesh Ph Patel sold 34,438 shares of the company's stock for a total of $2,840,446.24. This transaction reduced his ownership by 5.6%, leaving him with 580,505 shares valued at approximately $47.88 million. The company, a clinical-stage biopharmaceutical firm focusing on oral peptide therapies, has a consensus \"Moderate Buy\" rating from analysts with an average target price of $86.77.",
      "url": "https://www.marketbeat.com/instant-alerts/protagonist-therapeutics-nasdaqptgx-ceo-sells-284044624-in-stock-2026-01-21/",
      "source": "MarketBeat",
      "published": "20260121T235748",
      "overall_sentiment_score": -0.159169,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.144907,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.642892
    },
    {
      "title": "Novo Nordisk’s Wegovy Pill And Akero Deal Reframe Obesity Growth Story",
      "summary": "Novo Nordisk has launched the first FDA-approved oral GLP-1 weight loss drug, a Wegovy pill, and completed its acquisition of Akero Therapeutics, alongside positive Phase 3 results for CagriSema. These developments highlight the company's strengthened focus on obesity and metabolic diseases. Investors are closely watching how these strategic moves will impact prescription trends and competitive dynamics in the growing metabolic health market.",
      "url": "https://simplywall.st/stocks/us/pharmaceuticals-biotech/nyse-nvo/novo-nordisk/news/novo-nordisks-wegovy-pill-and-akero-deal-reframe-obesity-gro",
      "source": "Simply Wall Street",
      "published": "20260125T045805",
      "overall_sentiment_score": 0.34721,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.130133,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.642573
    },
    {
      "title": "Navigating 2026: How health systems can thrive amid AI, labor and consumer pressures",
      "summary": "This article discusses the challenges and opportunities for health systems in 2026, focusing on the impact of AI, labor shortages, and evolving consumer demands. It highlights strategies for healthcare providers to navigate these pressures and succeed in a rapidly changing environment. The content also touches on related healthcare news, including Medicare Advantage changes, hospital immigration enforcement, medical device advancements, and AI in prescription services.",
      "url": "https://www.modernhealthcare.com/providers/mh-navigating-2026-health-systems-ai-labor-consumer-pressures/",
      "source": "Modern Healthcare",
      "published": "20260126T035804",
      "overall_sentiment_score": 0.142006,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.121416,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.641555
    },
    {
      "title": "Costco stock (COST) ends Friday higher; what to watch before the next U.S. session",
      "summary": "Costco (COST) shares closed Friday 0.7% higher at $983.25, just under the $1,000 mark. Investors are looking forward to several key dates, including a dividend record date on January 30, the release of January sales figures on February 4, and the fiscal second-quarter earnings call on March 5. Additionally, the company faces a new class-action lawsuit regarding \"no preservatives\" claims on its rotisserie chicken products.",
      "url": "https://ts2.tech/en/costco-stock-cost-ends-friday-higher-what-to-watch-before-the-next-u-s-session/",
      "source": "TechStock²",
      "published": "20260124T155441",
      "overall_sentiment_score": 0.096855,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.227467,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.640208
    },
    {
      "title": "Procter & Gamble Earnings: Frigid Sales and Margins Don’t Suggest Cracks in Its Standing",
      "summary": "Procter & Gamble's fiscal second-quarter sales were flat, with higher prices offset by lower volume, and adjusted gross margins slightly decreased due to various factors despite cost savings. Despite weak consumer spending and an uncertain geopolitical environment, Morningstar views P&G's focus on efficiency and brand spending as a prudent long-term strategy. The company’s $148 fair value estimate remains unchanged, making shares fairly valued and a potential addition for investors.",
      "url": "https://www.morningstar.com/stocks/procter-gamble-earnings-frigid-sales-margins-dont-suggest-cracks-its-standing",
      "source": "Morningstar",
      "published": "20260122T191740",
      "overall_sentiment_score": 0.069637,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.146671,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.638273
    },
    {
      "title": "Jim Cramer on Simon Property's CEO: \"We Think David Simon's the Best Mall Operator There Is\"",
      "summary": "Jim Cramer praised David Simon, CEO of Simon Property Group (SPG), calling him \"the best mall operator there is\" during a discussion about a club member's diversified portfolio. Cramer expressed concern about one of the REITs, VICI, suggesting it be replaced with a healthcare company like J&J for better diversification. He highlighted SPG's strengths in retail while also recommending consideration of AI stocks for greater upside and less risk.",
      "url": "https://finviz.com/news/283359/jim-cramer-on-simon-propertys-ceo-we-think-david-simons-the-best-mall-operator-there-is",
      "source": "Finviz",
      "published": "20260122T090059",
      "overall_sentiment_score": 0.403303,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.209877,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.633876
    },
    {
      "title": "GSK to Boost Respiratory & Immunology Pipeline With $2.2B RAPT Buyout",
      "summary": "GSK announced its definitive agreement to acquire RAPT Therapeutics for an estimated $2.2 billion, adding ozureprubart, a long-acting anti-immunoglobulin E monoclonal antibody, to its pipeline. This acquisition is expected to strengthen GSK’s respiratory, immunology, and inflammation pipeline, with ozureprubart currently in a phase IIb study for food allergen protection and phase III studies planned. This deal is part of a broader M&A spree in the biotech and pharma sector, as companies seek to diversify revenue streams and expand portfolios.",
      "url": "https://finviz.com/news/282624/gsk-to-boost-respiratory-immunology-pipeline-with-22b-rapt-buyout",
      "source": "Finviz",
      "published": "20260121T165726",
      "overall_sentiment_score": 0.173319,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.145921,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.632056
    },
    {
      "title": "Kenvue (KVUE) stock price barely budges as Kimberly-Clark deal vote nears",
      "summary": "Kenvue (KVUE) shares saw little movement as investors anticipate a Jan. 29 vote on the company's proposed sale to Kimberly-Clark. Despite the implied valuation of the deal being above current trading prices, analysts point to \"deal dynamics\" and Tylenol litigation concerns causing the stock to be range-bound. Institutional Shareholder Services has recommended approval, but the litigation overhang remains a key concern for skeptics.",
      "url": "https://ts2.tech/en/kenvue-kvue-stock-price-barely-budges-as-kimberly-clark-deal-vote-nears/",
      "source": "TechStock²",
      "published": "20260123T204156",
      "overall_sentiment_score": 0.157519,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": -0.119241,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.629279
    },
    {
      "title": "Form 424B2 BARCLAYS BANK PLC",
      "summary": "Barclays Bank PLC has filed a Form 424B2 with the SEC for $500,000 Leveraged Barrier Notes due January 23, 2031, linked to the performance of a global basket of indices. These notes do not pay interest and investors risk losing a significant portion or all of their principal if the Final Basket Value falls below 70% of the Initial Basket Value. The filing details the terms, risks, hypothetical payment scenarios, and tax considerations of these complex debt securities, emphasizing the credit risk of Barclays Bank PLC and the potential for a U.K. Bail-in Power exercise.",
      "url": "https://www.streetinsider.com/SEC+Filings/Form+424B2+BARCLAYS+BANK+PLC/25880580.html",
      "source": "StreetInsider",
      "published": "20260122T172847",
      "overall_sentiment_score": 0.083869,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.125894,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.627613
    },
    {
      "title": "Is STAAR Surgical (STAA) Attractively Priced After Prolonged Share Price Weakness?",
      "summary": "STAAR Surgical (STAA) has experienced prolonged share price weakness, with significant declines over the past five years. While a Discounted Cash Flow (DCF) analysis suggests the stock is undervalued by 50.2%, its Price to Sales (P/S) ratio of 4.13x is above the industry average and its proprietary \"Fair Ratio,\" indicating it might be overvalued by this metric. The article encourages investors to use \"Narratives\" on Simply Wall St to align their personal views and financial forecasts for a more complete valuation assessment.",
      "url": "https://simplywall.st/stocks/us/healthcare/nasdaq-staa/staar-surgical/news/is-staar-surgical-staa-attractively-priced-after-prolonged-s",
      "source": "Simply Wall Street",
      "published": "20260125T035823",
      "overall_sentiment_score": -0.099625,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.014296,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.623255
    },
    {
      "title": "Jim Cramer on Simon Property’s CEO: “We Think David Simon’s the Best Mall Operator There Is”",
      "summary": "Jim Cramer expressed high regard for Simon Property Group's CEO, David Simon, calling him the best mall operator. Cramer reviewed a club member's diversified portfolio including SPG, Amazon (AMZN), Broadcom (AVGO), Cheniere (LNG), and VICI Properties, advising to replace VICI with Johnson & Johnson (J&J) for better diversification, specifically adding a healthcare company. Simon Property Group (SPG) is highlighted as a real estate investment trust focused on shopping, dining, and entertainment destinations.",
      "url": "https://www.insidermonkey.com/blog/jim-cramer-on-simon-propertys-ceo-we-think-david-simons-the-best-mall-operator-there-is-1679065/",
      "source": "Insider Monkey",
      "published": "20260122T030900",
      "overall_sentiment_score": 0.262125,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.209101,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.62229
    },
    {
      "title": "Protagonist Therapeutics to Participate in the 44th Annual J.P. Morgan Healthcare Conference 2026",
      "summary": "Protagonist Therapeutics announced that its President and CEO, Dinesh V. Patel, Ph.D., will present a company overview at the 44th Annual J.P. Morgan Healthcare Conference, scheduled from January 12-15, 2026, in San Francisco. The company will also hold one-on-one meetings during the event. Protagonist Therapeutics, a biopharmaceutical company, has two novel peptides in advanced Phase 3 clinical development, with NDA submissions for icotrokinra and rusfertide in July and December 2025, respectively.",
      "url": "https://www.southbendtribune.com/press-release/story/14500/protagonist-therapeutics-to-participate-in-the-44th-annual-j-p-morgan-healthcare-conference-2026/",
      "source": "South Bend Tribune",
      "published": "20260124T082846",
      "overall_sentiment_score": 0.284686,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.229835,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.61959
    },
    {
      "title": "Legend Biotech (LEGN) Advances Cell Therapy Innovation and Expands Oncology Pipeline",
      "summary": "Legend Biotech (LEGN) is advancing its cell therapy innovation and expanding its oncology pipeline, with analysts at Deutsche Bank and Cantor Fitzgerald reiterating Buy and Overweight ratings, respectively. The company is expected to deliver topline results from its first in-vivo CAR T program and aims for profitability in 2026, driven by therapies like Carvykti. Preclinical data for its in-vivo CAR-T cells show robust expansion and sustained B-cell elimination, suggesting promise for future treatments.",
      "url": "https://finviz.com/news/286488/legend-biotech-legn-advances-cell-therapy-innovation-and-expands-oncology-pipeline",
      "source": "Finviz",
      "published": "20260126T045830",
      "overall_sentiment_score": 0.47466,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.342085,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.613436
    },
    {
      "title": "Kenvue stock price jumps 2% as KVUE takeover vote nears — what traders watch next",
      "summary": "Kenvue's stock price rose 2.1% to $17.75 with unusually high volume as a crucial takeover vote approaches on January 29th. The proposed deal with Kimberly-Clark values Kenvue at roughly $18.45 per share, leaving KVUE currently undervalued. Traders are closely watching for further developments, especially regarding ongoing litigation and proxy updates, as the shareholder vote looms.",
      "url": "https://ts2.tech/en/kenvue-stock-price-jumps-2-as-kvue-takeover-vote-nears-what-traders-watch-next/",
      "source": "TechStock²",
      "published": "20260123T030123",
      "overall_sentiment_score": -0.112812,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.347594,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.611632
    },
    {
      "title": "10 Best US Stocks to Buy Under $50",
      "summary": "This article identifies Legend Biotech Corporation (NASDAQ: LEGN) as one of the best US stocks to buy under $50, highlighting its stock price of $19.13 and a potential upside of 197.11%. Deutsche Bank reiterated a Buy rating with a $60 price target, anticipating positive topline results from its CAR T program and projecting profitability in 2026. Cantor Fitzgerald also maintained an Overweight rating and a $74 price target, forecasting a 100% year-over-year sales increase for its cancer therapy, Carvykti, which partner Johnson & Johnson expects to exceed $5 billion in peak sales.",
      "url": "https://www.insidermonkey.com/blog/10-best-us-stocks-to-buy-under-50-1680589/2/",
      "source": "Insider Monkey",
      "published": "20260125T192729",
      "overall_sentiment_score": 0.481703,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.308099,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.60991
    },
    {
      "title": "Legend Biotech (LEGN) Advances Cell Therapy Innovation and Expands Oncology Pipeline",
      "summary": "Legend Biotech (LEGN) is advancing its cell therapy innovations and expanding its oncology pipeline, with analysts reiterating \"Buy\" and \"Overweight\" ratings based on promising preclinical data for its in-vivo CAR T program and strong sales projections for its cancer therapy, Carvykti. The company aims for profitability in 2026 while continuing to develop its pipeline. Despite the positive outlook for LEGN, the article also promotes an AI stock believed to have higher upside potential.",
      "url": "https://www.insidermonkey.com/blog/legend-biotech-legn-advances-cell-therapy-innovation-and-expands-oncology-pipeline-1681243/?amp=1",
      "source": "Insider Monkey",
      "published": "20260126T031400",
      "overall_sentiment_score": 0.33027,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.240099,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.609421
    },
    {
      "title": "Jim Cramer on Ares Capital: \"I Want to Be Very Careful There\"",
      "summary": "Jim Cramer expressed caution regarding Ares Capital (ARCC), stating he wants to \"be very careful there\" due to uncertainty about its holdings and a high 9% yield that makes him nervous. He suggested switching out of ARCC and into Johnson & Johnson (J&J). Cramer discussed other holdings like Apple, Hershey, Kimberly-Clark, and NVIDIA, and suggested that while ARCC provides financing solutions to middle-market companies, other AI stocks might offer better upside potential with less risk.",
      "url": "https://finviz.com/news/283355/jim-cramer-on-ares-capital-i-want-to-be-very-careful-there",
      "source": "Finviz",
      "published": "20260122T125722",
      "overall_sentiment_score": 0.215853,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.542971,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.606602
    },
    {
      "title": "ISS Backs Kenvue (KVUE) Deal, Investors Debate Tylenol and Litigation Risks",
      "summary": "Institutional Shareholder Services (ISS) has recommended that shareholders approve Kimberly-Clark's $40 billion bid for Kenvue (KVUE), despite ongoing litigation risks regarding talcum and Tylenol. Kenvue's stock has seen a significant decline since its 2023 listing. The acquisition aims for synergies, but investor sentiment is influenced by concerns about product litigation and the potential for greater returns in favored AI stocks.",
      "url": "https://www.insidermonkey.com/blog/iss-backs-kenvue-kvue-deal-investors-debate-tylenol-and-litigation-risks-1678390/?amp=1",
      "source": "Insider Monkey",
      "published": "20260121T122642",
      "overall_sentiment_score": -0.059919,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.142234,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.606158
    },
    {
      "title": "The Truth About Zimmer Biomet Stock: Silent Boom Or Boring Boomer Play?",
      "summary": "The article explores whether Zimmer Biomet stock (ZBH) is a silently growing asset or a stable, perhaps unexciting, long-term investment. It highlights the company's position in the medical technology sector, particularly in joint replacements, benefiting from an aging global population and advancements in robot-assisted surgery. The author suggests ZBH is a solid choice for diversified, long-term portfolios despite lacking the viral hype of other trending stocks.",
      "url": "https://www.ad-hoc-news.de/boerse/news/ueberblick/the-truth-about-zimmer-biomet-stock-silent-boom-or-boring-boomer-play/68510773",
      "source": "AD HOC NEWS",
      "published": "20260123T021301",
      "overall_sentiment_score": 0.228254,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.127129,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.605747
    },
    {
      "title": "Sarepta Announces Positive Topline Three-Year EMBARK Results Showing ELEVIDYS Significantly Slows Disease Progression on Key Functional Measures in Ambulatory Duchenne Patients",
      "summary": "Sarepta Therapeutics announced positive three-year topline results from its EMBARK study, demonstrating that ELEVIDYS significantly slows disease progression in ambulatory Duchenne muscular dystrophy patients. The gene therapy showed sustained and increasing efficacy across key motor function measures like NSAA, Time to Rise, and 10-meter walk/run, with a 70% or greater reduction in the rate of decline compared to an external control group. The study also reinforced ELEVIDYS's manageable safety profile, with no new treatment-related safety signals observed.",
      "url": "https://www.businesswire.com/news/home/20260126453576/en/Sarepta-Announces-Positive-Topline-Three-Year-EMBARK-Results-Showing-ELEVIDYS-Significantly-Slows-Disease-Progression-on-Key-Functional-Measures-in-Ambulatory-Duchenne-Patients",
      "source": "Business Wire",
      "published": "20260126T145852",
      "overall_sentiment_score": 0.285561,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.233953,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.602634
    },
    {
      "title": "How Investors Are Reacting To CRH (CRH) Buybacks Amid Institutional Moves And US Infrastructure Push",
      "summary": "CRH plc is continuing its US$300 million share buyback program, attracting new institutional investments like the State of Alaska's US$8.30 million position. The company's Americas division is actively lobbying Congress for modernized US infrastructure, linking future economic activity to construction spending. This article examines how CRH's capital return strategy and advocacy for infrastructure funding shape its investment appeal amidst construction cycles and policy reliance.",
      "url": "https://simplywall.st/stocks/us/materials/nyse-crh/crh/news/how-investors-are-reacting-to-crh-crh-buybacks-amid-institut/amp",
      "source": "Simply Wall Street",
      "published": "20260126T125732",
      "overall_sentiment_score": 0.028959,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.057663,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.598174
    },
    {
      "title": "Recursion Pharma director Gibson sells $178,800 in stock",
      "summary": "Director Christopher Gibson of Recursion Pharmaceuticals Inc. sold 40,000 shares of Class A Common Stock for $178,800 on January 20, 2026, and converted an equal number of Class B shares to Class A. Following these transactions, Gibson maintains substantial direct and indirect holdings in the company. Separately, Recursion Pharmaceuticals recently reported positive Phase 1b/2 TUPELO trial results for its drug REC-4881, leading to a JPMorgan upgrade, and plans to present updated clinical data in December 2025.",
      "url": "https://www.investing.com/news/insider-trading-news/recursion-pharma-director-gibson-sells-178800-in-stock-93CH-4461792",
      "source": "Investing.com",
      "published": "20260123T005739",
      "overall_sentiment_score": 0.208438,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.261337,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.5766
    },
    {
      "title": "Allstate Corp Makes New $775,000 Investment in Natera, Inc. $NTRA",
      "summary": "Allstate Corp has made a new $775,000 investment in Natera, a medical research company, acquiring 4,816 shares in the third quarter. Despite this new institutional investment, Natera has recently seen significant insider selling, with CEO, CFO, and other insiders selling over 500,000 shares worth $114 million in the last 90 days. Analysts maintain a \"Moderate Buy\" rating for Natera, with an average target price of $245.50, while the stock currently trades around $242.91.",
      "url": "https://www.marketbeat.com/instant-alerts/filing-allstate-corp-makes-new-775000-investment-in-natera-inc-ntra-2026-01-23/",
      "source": "MarketBeat",
      "published": "20260123T082836",
      "overall_sentiment_score": 0.083841,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.061789,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.571972
    },
    {
      "title": "Barclays Q4 Preview: Kimberly-Clark (KMB) Target Cut, \"enthusiasm\" Not Driven by Fundamentals",
      "summary": "Barclays has cut its price target for Kimberly-Clark (KMB) to $102 from $132, maintaining an Equal Weight rating, citing that recent enthusiasm for the stock is due to \"a flight to safety\" rather than improving fundamentals. The firm also expressed unease about company-specific and broader sector conditions, warning of potential headwinds from oil and currency pressures. Simultaneously, Institutional Shareholder Services (ISS) advised Kimberly-Clark shareholders to support the proposed acquisition of Kenvue, believing it could strengthen Kimberly-Clark’s financial profile despite market concerns and ongoing litigation issues.",
      "url": "https://finviz.com/news/283271/barclays-q4-preview-kimberly-clark-kmb-target-cut-enthusiasm-not-driven-by-fundamentals",
      "source": "Finviz",
      "published": "20260122T025717",
      "overall_sentiment_score": 0.032443,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.109888,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.570237
    },
    {
      "title": "CVRx launches major heart failure trial to expand Barostim therapy reach",
      "summary": "CVRx, Inc. (NASDAQ:CVRX) announced the initiation of its BENEFIT-HF clinical trial, a large-scale study evaluating its Barostim therapy for an expanded heart failure patient population. This randomized trial will enroll 2,500 patients aimed at potentially tripling the indicated patient population for Barostim by broadening current usage criteria. The company, despite being unprofitable, has shown strong revenue growth and is considered slightly undervalued based on Fair Value estimates.",
      "url": "https://ng.investing.com/news/company-news/cvrx-launches-major-heart-failure-trial-to-expand-barostim-therapy-reach-93CH-2302077",
      "source": "Investing.com Nigeria",
      "published": "20260123T070020",
      "overall_sentiment_score": 0.445038,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.296009,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.561085
    },
    {
      "title": "The Bull Case For Pfizer (PFE) Could Change Following Novavax Matrix-M Adjuvant Licensing Deal - Learn Why",
      "summary": "Pfizer recently secured a licensing deal with Novavax for its Matrix-M vaccine adjuvant technology, aiming to enhance future vaccines. This deal is seen as an incremental broadening of Pfizer's vaccine toolkit rather than a transformative event, as the company still faces challenges with rebuilding earnings post-pandemic, managing high debt, and addressing patent expirations. Investors are weighing Pfizer's low valuation against dividend strain and pipeline execution risks, with a wide range of fair value estimates.",
      "url": "https://simplywall.st/stocks/us/pharmaceuticals-biotech/nyse-pfe/pfizer/news/the-bull-case-for-pfizer-pfe-could-change-following-novavax",
      "source": "Simply Wall Street",
      "published": "20260122T005820",
      "overall_sentiment_score": 0.071448,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.009451,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.552663
    },
    {
      "title": "Dr Reddys Laboratories Ltd Hits Intraday High with 4.98% Surge on 22 Jan 2026",
      "summary": "Dr. Reddy's Laboratories Ltd. experienced a significant intraday surge of 4.98% on January 22, 2026, reaching a high of Rs 1211.5. This strong performance outperformed both its sector and the broader Sensex, despite the stock having a \"Sell\" grade Mojo Score and remaining below its longer-term moving averages. The article highlights the stock's high intraday volatility and its mixed long-term performance compared to the Sensex.",
      "url": "https://www.marketsmojo.com/news/stocks-in-action/dr-reddys-laboratories-ltd-hits-intraday-high-with-498-surge-on-22-jan-2026-3799653",
      "source": "Markets Mojo",
      "published": "20260122T135741",
      "overall_sentiment_score": 0.105624,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.11316,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.543203
    },
    {
      "title": "Johnson & Johnson forecasts 2026 profit above Wall Street estimates",
      "summary": "Johnson & Johnson has forecast 2026 sales and profit that exceed Wall Street estimates, despite expecting a hit of hundreds of millions of dollars from a drug pricing deal with the Trump administration. The company also reported strong fourth-quarter earnings, driven by robust sales in its blood cancer therapy Darzalex, psoriasis drug Tremfya, and its medical devices business, even as sales for its blockbuster drug Stelara declined. This optimistic outlook comes amidst ongoing legal challenges concerning its talc products and rising competition.",
      "url": "https://www.cnbc.com/2026/01/21/johnson-johnson-jnj-q4-earnings.html",
      "source": "CNBC",
      "published": "20260121T114120",
      "overall_sentiment_score": 0.036913,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.01538,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.316767
    },
    {
      "title": "Pennsylvania J&J talc lawsuit trial alleges company concealed asbestos risk",
      "summary": "A new Johnson & Johnson talc lawsuit trial has commenced in Pennsylvania, alleging the company concealed asbestos risks in its baby powder. The suit, filed by the estate of Gayle Emerson who died from ovarian cancer, claims J&J knew its talc-based product contained asbestos since 1969. Johnson & Johnson denies these allegations, arguing Emerson's cancer was due to other factors and that their talc is safe.",
      "url": "https://topclassactions.com/lawsuit-settlements/lawsuit-news/pennsylvania-jj-talc-lawsuit-trial-alleges-company-concealed-asbestos-risk/",
      "source": "Class Action Lawsuits",
      "published": "20260126T165747",
      "overall_sentiment_score": 0.026664,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.011697,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.316053
    }
  ]
}