{
  "ticker": "XOM",
  "date": "2022-02-07",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T13:05:39.192540",
  "source": "alpha_vantage",
  "article_count": 11,
  "articles": [
    {
      "title": "Exxon moves headquarters, reorganizes company",
      "summary": "Exxon Mobil Corp. announced a reorganization and plans to move its headquarters to Spring, Texas, near Houston, to streamline operations and cut costs. The revamp includes making its low-carbon division one of its three main business lines and aims to save the company $6 billion compared to 2019. This move follows pressure from a hedge fund to focus on new forms of energy.",
      "url": "https://www.eenews.net/articles/exxon-moves-headquarters-reorganizes-company/",
      "source": "E&E News by POLITICO",
      "published": "20220201T070800",
      "overall_sentiment_score": 0.30285,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.314554,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Exxon to move HQ to Houston, merge refining and chemicals",
      "summary": "Exxon Mobil Corp. announced it will relocate its corporate headquarters from suburban Dallas to the Houston area by mid-2023, combining its chemical and refining divisions. This move is part of a broader shake-up aimed at reducing costs, reorganizing the company into three main business lines, and accelerating its cost-cutting drive to achieve $6 billion in savings by 2023. The reorganization seeks to enhance collaboration and shareholder value through the energy transition.",
      "url": "https://www.worldoil.com/news/2022/1/31/exxon-to-move-hq-to-houston-merge-refining-and-chemicals/",
      "source": "World Oil",
      "published": "20220131T191701",
      "overall_sentiment_score": 0.079492,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.426988,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Exxon Mobil to move headquarters out of Irving",
      "summary": "Exxon Mobil is moving its corporate headquarters from Irving to Houston, a decision announced as part of the company's plan to streamline its business structure by combining its chemical and downstream operations. This move means that North Texas will lose its second-largest public company upon completion next year.",
      "url": "https://www.bizjournals.com/dallas/news/2022/01/31/exxon-mobil-headquarters-houston-dallas.html",
      "source": "The Business Journals",
      "published": "20220131T145600",
      "overall_sentiment_score": 0.129754,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.112457,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 1.0
    },
    {
      "title": "Shell (SHEL) Stock Price, News & Analysis",
      "summary": "This article provides a detailed analysis of Shell (NYSE: SHEL) stock, covering its current price, key statistics, company overview, analyst ratings, earnings, valuation, dividend information, and recent news. It highlights Shell's position as a global integrated energy company focusing on both traditional hydrocarbons and developing lower-carbon solutions, emphasizing its \"Moderate Buy\" consensus rating and a 4.06% dividend yield. The report also includes FAQs about share performance, earnings, buybacks, subsidiaries, major shareholders, and how to buy shares.",
      "url": "https://www.marketbeat.com/stocks/NYSE/SHEL/",
      "source": "MarketBeat",
      "published": "20220207T130936",
      "overall_sentiment_score": 0.190096,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.071263,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.554096
    },
    {
      "title": "Darling Ingredients VP Melissa Gaither to Retire and Suann Guthrie to Succeed",
      "summary": "Darling Ingredients Inc. announced that Melissa Gaither, Vice President of Investor Relations, Sustainability, and Global Communications, will retire on April 29 after 33 years of service. Suann Guthrie has been named as her successor, effective January 31, bringing over 20 years of experience in strategy development, media, investor relations, and corporate communications from the tech and energy sectors.",
      "url": "https://www.citybiz.co/article/209845/darling-ingredients-vp-melissa-gaither-to-retire-and-suann-guthrie-to-succeed/",
      "source": "citybiz",
      "published": "20220131T163115",
      "overall_sentiment_score": 0.169193,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.03057,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.648481
    },
    {
      "title": "ExxonMobil Exiting Irving HQ for Houston Megacampus",
      "summary": "Exxon Mobil Corp. announced it will be moving its corporate headquarters from Irving, Texas, to its megacampus in the Houston area as part of a larger business restructuring. The relocation is anticipated to be finished by mid-2023. The Houston campus spans 385 acres and previously housed over 10,000 Exxon employees.",
      "url": "https://www.nbcdfw.com/news/business/exxonmobil-exiting-irving-hq-for-houston-megacampus/2874604/",
      "source": "NBC 5 Dallas-Fort Worth",
      "published": "20220131T134100",
      "overall_sentiment_score": 0.032311,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.049093,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 1.0
    },
    {
      "title": "Chevron kicks off oil industry's Q4 results with a miss",
      "summary": "Chevron (CVX.N) reported fourth-quarter profits that missed Wall Street estimates and provided a weak outlook for this year's oil and gas production, causing its shares to drop. The company's earnings of $2.65 per share were below the $3.12 per share forecast, largely due to weaker output, downstream margins, and a hit from timing of bookings in its LNG business. Despite this, Chevron achieved its best annual earnings since 2014, driven by spending cuts, and announced increased shareholder returns including a share buyback and a dividend hike.",
      "url": "https://www.reuters.com/business/chevron-kicks-off-oil-industrys-fourth-quarter-results-with-miss-2022-01-28/",
      "source": "Reuters",
      "published": "20220128T213800",
      "overall_sentiment_score": -0.2785,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.125171,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.607036
    },
    {
      "title": "Chevron shares touch record high ahead of Q4 results",
      "summary": "Shares of U.S. oil major Chevron Corp touched an all-time high intraday on Wednesday, boosted by a strong stock market rally and rising oil prices, ahead of its fourth-quarter financial results. Oil prices reached $90 a barrel for the first time in seven years, leading to a surge in major producers' stocks. Analysts anticipate Chevron to report earnings per share of $3.12 for the fourth quarter.",
      "url": "https://www.reuters.com/business/chevron-shares-hit-record-high-ahead-4th-quarter-results-2022-01-26/",
      "source": "Reuters",
      "published": "20220126T103000",
      "overall_sentiment_score": 0.378354,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.333168,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.644026
    },
    {
      "title": "Oil tops $90, 7-year high",
      "summary": "U.S. crude oil surged past $90 per barrel, reaching a 7-year high, with Brent crude hitting $91 per barrel. This rise comes as OPEC declined requests to increase production and national average gas prices hit $3.41 per gallon, leading some experts to predict a potential rise to $4. Geopolitical tensions between Russia and Ukraine are also contributing to the price pressure.",
      "url": "https://www.foxbusiness.com/markets/oil-tops-90-7-year-high-gas-prices-aaa",
      "source": "Fox Business",
      "published": "20220203T145200",
      "overall_sentiment_score": 0.210222,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": -0.222451,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.723102
    },
    {
      "title": "Oil companies, union to continue talks on worker contract",
      "summary": "Negotiators for major oil companies and the United Steelworkers union met but failed to reach an agreement on a new labor contract covering 30,000 U.S. workers. Both sides agreed to continue talks at a later date, with the union having rejected a 9% pay raise offer over three years. This comes after the union and Marathon Petroleum averted a potential strike by agreeing to a 24-hour extension of the existing contract.",
      "url": "https://www.reuters.com/business/energy/oil-companies-union-hold-new-talks-us-refinery-worker-contract-2022-02-01/",
      "source": "Reuters",
      "published": "20220202T014400",
      "overall_sentiment_score": -0.155092,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.133922,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.714714
    },
    {
      "title": "Exxon Mobil restructures into three divisions and packs up for Houston",
      "summary": "Exxon Mobil Corp. is relocating its corporate headquarters from suburban Dallas to the Houston area by mid-2023 and reorganizing into three main business lines: upstream, product solutions, and low-carbon. This major shake-up aims to reduce costs, with the company on track for $6 billion in savings by 2023. This reorganization will bring top executives to the company's Houston-area campus, fostering closer collaboration and a streamlined business model.",
      "url": "https://energynow.com/2022/02/exxon-mobil-restructures-into-three-divisions-and-packs-up-for-houston/",
      "source": "EnergyNow.com",
      "published": "20220201T191659",
      "overall_sentiment_score": 0.316392,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.308255,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 1.0
    }
  ]
}