{
  "ticker": "XOM",
  "date": "2022-11-28",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T13:09:00.462319",
  "source": "alpha_vantage",
  "article_count": 12,
  "articles": [
    {
      "title": "Report: Bob Simpson's MorningStar Partners Files for Proposed $100 Million Public Offering",
      "summary": "MorningStar Partners LP, an oil and gas company led by Bob Simpson, is pursuing a proposed $100 million initial public offering and plans to change its name to TXO Energy Partners. The company, focused on the Permian and San Juan basins, reported $15 million in net income on $204 million revenue for a nine-month period ending September and aims to list its shares on the NYSE under the symbol TXO. It was founded by Bob Simpson after the 2009 sale of XTO Energy.",
      "url": "https://fortworthinc.com/news/report-bob-simpson-s-morningstar-partners-files-for-proposed/",
      "source": "Fort Worth Inc.",
      "published": "20221123T103900",
      "overall_sentiment_score": 0.284809,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.143627,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.613741
    },
    {
      "title": "Strive AUM Tops $500 Million",
      "summary": "Strive Asset Management, which advocates for companies to prioritize profits over ESG concerns, has reached $500 million in assets under management (AUM). A significant 80% of this AUM is concentrated in its Strive U.S. Energy ETF, which primarily invests in companies like Exxon Mobil and Chevron, benefiting from rising oil prices. Strive's next goal is to reach $1 billion in AUM, which is crucial for achieving profitability given its current revenue run rate of approximately $2 million.",
      "url": "https://247wallst.com/investing/2022/11/18/strive-aum-tops-500-million/",
      "source": "24/7 Wall St.",
      "published": "20221118T073000",
      "overall_sentiment_score": 0.357965,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.302497,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.728951
    },
    {
      "title": "Phillips 66 stock falls Monday, underperforms market",
      "summary": "Phillips 66 stock (PSX) fell 0.93% on Monday, underperforming the broader market as both the S&P 500 and Dow Jones Industrial Average also declined. The stock closed below its 52-week high and underperformed against some competitors like Exxon Mobil and Chevron, although it did outperform Marathon Petroleum. Trading volume for Phillips 66 also exceeded its 50-day average.",
      "url": "https://www.marketwatch.com/data-news/phillips-66-stock-falls-monday-underperforms-market-01668464315?ocid=10020&gaa_at=eafs&gaa_n=AWEtsqelfb6JAfRRRGOjjj0_XWtA3NttzH6OOAyCgTCuGJy2LMFtBdb9gTsA&gaa_ts=6907a32e&gaa_sig=7e9UAzoo3CWPo4vzWC7F9UY2VmY1Jlfa1_jDPFV3KP24NWGMeXhLaGEgQCkdTxqpBELMItfABIO5INTsQNszoQ%3D%3D",
      "source": "MarketWatch",
      "published": "20221114T171800",
      "overall_sentiment_score": 0.070659,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.208981,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.731268
    },
    {
      "title": "WSJ News Exclusive | Exxon Mobil Has a Potash Problem in the Permian Basin",
      "summary": "Exxon Mobil is facing challenges in developing a key asset in the Permian Basin due to sharing land with potash mining companies. Unlike many rivals, Exxon's direct access to oil-soaked rocks is hindered by underground mines extracting potash, a vital crop nutrient. This situation complicates the drilling efforts of the Texas-based oil company in New Mexico.",
      "url": "https://www.wsj.com/articles/exxon-mobil-has-a-potash-problem-in-the-permian-basin-11669500508?gaa_at=eafs&gaa_n=AWEtsqcphSYx5umhXoK1xDxlNuCmBCDpWrWw-vnJUdRWtonfIHVT8lSB2lgF&gaa_ts=6907b168&gaa_sig=VdgkmBn_e1Q16rtyiOHUUS4OaafZVu0UgyPzCzlXwYIj81UXt6Jv5jYp_Ytt5408hM_YwIDI0nVpZvYcve8OrQ%3D%3D",
      "source": "The Wall Street Journal",
      "published": "20221127T191702",
      "overall_sentiment_score": 0.04428,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.230934,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 1.0
    },
    {
      "title": "US Treasury authorizes Chevron to expand oil pumping in Venezuela",
      "summary": "The U.S. Treasury Department has authorized Chevron Corp. to expand its oil operations in Venezuela, following renewed talks between the socialist Maduro regime and Venezuelan opposition leaders. This decision aligns with the U.S. policy of targeted sanctions relief tied to steps that alleviate suffering and support democracy in Venezuela. The move also comes as the Biden administration seeks to address rising energy prices and global oil shortages.",
      "url": "https://www.foxbusiness.com/energy/us-treasury-authorizes-chevron-expand-oil-pumping-venezuela",
      "source": "Fox Business",
      "published": "20221126T133100",
      "overall_sentiment_score": 0.30942,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.322559,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.615295
    },
    {
      "title": "Nabors Marks Major Industry Milestone: Fully Automates Existing Land Rig with First-of-its-Kind Robotics Module",
      "summary": "Nabors Industries has launched its Canrig Red Zone Robotics (RZR) Rig Floor Module, which automates routine drilling activities on existing land rigs. This modular upgrade, successfully deployed on an X29 rig for ExxonMobil in the Permian Basin, aims to enhance safety by eliminating manual tasks in hazardous \"red zones\" and improve drilling consistency. The RZR module represents a cost-effective path to scaling drilling automation across existing assets, building on lessons learned from Nabors' fully automated newbuild R801 rig.",
      "url": "https://www.prnewswire.com/news-releases/nabors-marks-major-industry-milestone-fully-automates-existing-land-rig-with-first-of-its-kind-robotics-module-301680031.html",
      "source": "PR Newswire",
      "published": "20221116T074600",
      "overall_sentiment_score": 0.263325,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.327493,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.748068
    },
    {
      "title": "Eni Loads First Coral-Sul LNG Cargo Offshore Mozambique",
      "summary": "Eni SpA has loaded its first liquefied natural gas (LNG) cargo from the Coral-Sul Floating LNG (FLNG) terminal offshore Mozambique, with volumes bound for BP plc. This marks a significant step for Europe's energy security and resource diversification, especially given the current strain on global energy markets due to geopolitical events. The project, sanctioned in 2017, is the first of three planned LNG projects in Mozambique.",
      "url": "https://naturalgasintel.com/news/eni-loads-first-coral-sul-lng-cargo-offshore-mozambique/",
      "source": "Natural Gas Intelligence",
      "published": "20221114T153800",
      "overall_sentiment_score": 0.269966,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.304985,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.611242
    },
    {
      "title": "Williams integrating LNG value chain capabilities",
      "summary": "Williams is integrating its capabilities across the natural gas value chain to meet growing global demand for LNG, which is expected to double over the next two decades. The company has partnered with Sempra Infrastructure to connect the Haynesville basin to Gulf Coast LNG export facilities, including proposed expansions at Cameron LNG and a new facility in Port Arthur, Texas. This strategy aims to deliver low-carbon, reliable natural gas from the wellhead to international markets, supporting global energy needs and climate goals.",
      "url": "https://www.williams.com/2022/11/16/williams-integrating-lng-value-chain-capabilities/",
      "source": "Williams Companies",
      "published": "20221116T184614",
      "overall_sentiment_score": 0.259803,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.128976,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.637344
    },
    {
      "title": "California Releases World’s First Plan to Achieve Net Zero Carbon Pollution",
      "summary": "California has released the world's first detailed plan to achieve net-zero carbon pollution by 2045, following Governor Newsom's call for more ambitious climate action. The plan, once adopted, aims to create 4 million new jobs, slash greenhouse gas emissions by 85%, cut oil usage by 94%, and save Californians $200 billion in health costs due to pollution. It outlines significant targets for renewable energy, clean buildings, carbon removal, and clean fuels, positioning California as a global leader in climate commitment.",
      "url": "https://www.gov.ca.gov/2022/11/16/california-releases-worlds-first-plan-to-achieve-net-zero-carbon-pollution/",
      "source": "California State Portal | CA.gov",
      "published": "20221116T162709",
      "overall_sentiment_score": -0.604668,
      "overall_sentiment_label": "Bearish",
      "ticker_sentiment_score": -0.743022,
      "ticker_sentiment_label": "Bearish",
      "relevance_score": 0.842568
    },
    {
      "title": "Plan to cut statewide fuel emissions 20% starts Jan. 1",
      "summary": "Washington's new Clean Fuel Standard, adopted by the Department of Ecology, will begin on January 1, 2023, aiming to cut statewide transportation emissions by 20% by 2034. This program utilizes a market-based approach to incentivize fuel producers to reduce the carbon intensity of their products and is not expected to significantly impact gas prices, adding less than a tenth of a cent in 2023. The initiative seeks to promote cleaner transportation options and investments in low-carbon fuels and zero-emission vehicle infrastructure.",
      "url": "https://ecology.wa.gov/about-us/who-we-are/news/2022/nov-28-clean-fuel-standard-adoption",
      "source": "Department of Ecology - State of Washington (.gov)",
      "published": "20221128T162617",
      "overall_sentiment_score": 0.296152,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.255584,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.573947
    },
    {
      "title": "Exxon Mobil Has a Potash Problem in the Permian Basin",
      "summary": "Exxon Mobil is facing a unique challenge in the Permian Basin due to shared land with potash mining companies. This situation is hindering the oil company's ability to access oil-rich reserves directly, unlike many of its competitors. The conflict arises because potash, a vital crop nutrient, lies underground near oil and natural-gas reserves, creating a drilling obstacle for Exxon Mobil.",
      "url": "https://www.wsj.com/articles/exxon-mobil-has-a-potash-problem-in-the-permian-basin-11669500508?gaa_at=eafs&gaa_n=AWEtsqeakfofhrJFA72agRaGCOGhpl_1wVqqtv8QLjP62ZnqrAdj--A0sUGo&gaa_ts=690794fb&gaa_sig=CM153mueNLqSGZDV95veTOl5R0uLyDmK7X-Iqc9eE7Ldgt0_rT6xqtx9AjcUN1E_lSbjLRWAAUYMP6fPcYXVnQ%3D%3D",
      "source": "The Wall Street Journal",
      "published": "20221127T171549",
      "overall_sentiment_score": -0.133429,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.214461,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.916497
    },
    {
      "title": "What Does Clean Energy Mean for Midstream?",
      "summary": "Midstream companies, historically focused on crude oil and natural gas, are increasingly positioned to capture opportunities in clean energy, including hydrogen, renewable fuels, and carbon capture. The Inflation Reduction Act is catalyzing this shift by providing incentives for carbon capture and hydrogen production, making these ventures more viable. Companies like Kinder Morgan, EnLink Midstream, Williams, and TC Energy are actively engaging in these new clean energy initiatives, leveraging existing infrastructure and expertise.",
      "url": "https://www.etftrends.com/energy-infrastructure-channel/what-does-clean-energy-mean-for-midstream/",
      "source": "ETF Trends",
      "published": "20221118T163643",
      "overall_sentiment_score": 0.367777,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.33049,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.72768
    }
  ]
}