{
  "ticker": "XOM",
  "date": "2022-03-21",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T13:06:08.398717",
  "source": "alpha_vantage",
  "article_count": 19,
  "articles": [
    {
      "title": "Exxon Mobil CEO says oil companies were in tough position before Ukraine-Russia war",
      "summary": "Exxon Mobil CEO Darren Woods stated that oil companies were challenged to ramp up production to meet demand even before the Ukraine crisis due to underinvestment during the COVID-19 pandemic and reduced government support. Woods also highlighted the global energy security needs exposed by the conflict and Exxon's efforts to increase production despite also halting operations in Russia. The article touches on rising oil prices, the U.S. government's deliberation on banning Russian oil imports, and the interconnectedness of the energy industry.",
      "url": "https://www.foxbusiness.com/markets/exxon-mobile-ceo-darren-woods",
      "source": "Fox Business",
      "published": "20220307T160200",
      "overall_sentiment_score": 0.147386,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.295046,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.971082
    },
    {
      "title": "The Zacks Analyst Blog Highlights Chevron, Exxon Mobil, Tesla, Target Corp, and Marriott International",
      "summary": "This Zacks Analyst Blog highlights five U.S. corporate giants—Chevron, Exxon Mobil, Tesla, Target Corp, and Marriott International—as strong buy recommendations despite current market volatility, inflation, and geopolitical tensions. These companies are identified for their strong fundamentals, positive earnings estimate revisions, and solid growth potential. The article provides a detailed analysis of why each company is a compelling investment, citing their business models, market positioning, and financial outlook amidst challenging economic conditions.",
      "url": "https://finance.yahoo.com/news/zacks-analyst-blog-highlights-chevron-103210806.html",
      "source": "Yahoo Finance",
      "published": "20220315T080000",
      "overall_sentiment_score": 0.411876,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.425509,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.934834
    },
    {
      "title": "Dow slides nearly 800 points as oil hits $120 a barrel while Russia conflict rattles investors",
      "summary": "Global stocks, including the Nasdaq, dropped significantly as oil prices surged to $120 a barrel. This market reaction was driven by investor concerns over potential sanctions on Russian crude oil and the broader economic implications of the conflict in Ukraine. The national average for gasoline also rose to $4 per gallon.",
      "url": "https://www.washingtonpost.com/business/2022/03/07/stocks-markets-russia-ukraine-inflation/",
      "source": "The Washington Post",
      "published": "20220307T161653",
      "overall_sentiment_score": -0.267697,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.329869,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.74854
    },
    {
      "title": "ANTHONY CAVANNA Obituary (2022) - Washington, DC - The Washington Post",
      "summary": "Anthony J. Cavanna, a key executive instrumental in taking Trex Company Inc. public in 1999, passed away on February 10, 2022, at the age of 82. He had a distinguished 35-year career at ExxonMobil before co-founding Trex and overseeing its financial success. Cavanna was also a dedicated alumnus of Villanova School of Engineering and was knighted for his contributions to the Belgian economy.",
      "url": "https://www.legacy.com/us/obituaries/washingtonpost/name/anthony-cavanna-obituary?id=33538495",
      "source": "Legacy obituary",
      "published": "20220307T185645",
      "overall_sentiment_score": 0.266439,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.133314,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.73856
    },
    {
      "title": "ConocoPhillips CEO: Not much conversation between oil industry and Biden Administration",
      "summary": "ConocoPhillips CEO Ryan Lance stated that there was not much conversation between the oil industry and the Biden Administration before Russia invaded Ukraine, but that has since ramped up due to national and energy security concerns. Lance also cautioned that the Russia-Ukraine situation may not resolve quickly, requiring longer-term planning for energy security. While initially commenting on a potential ban on energy exports as \"stupidest\", the CEO and ConocoPhillips fully support President Biden's ban on Russian oil imports.",
      "url": "https://www.foxbusiness.com/markets/us-russian-oil-ban-stupidest-move-conocophillips-ceo",
      "source": "Fox Business",
      "published": "20220308T144400",
      "overall_sentiment_score": 0.205053,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.104261,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.72946
    },
    {
      "title": "Feeling Short on Energy? Give This Inverse ETF a Look",
      "summary": "The energy sector has seen a recent decline, with the S&P GSCI Energy index falling over 20% since March 8, creating an opportunity for bearish traders. An inverse ETF, the Direxion Daily Energy Bear 2X Shares (ERY), is presented as a way to capitalize on further weakness in the energy sector. The article notes that despite recent drops, energy has been a stellar performer and a hedge against inflation for much of the year, but ongoing negotiations regarding the Russia-Ukraine conflict could temper oil prices.",
      "url": "https://www.etftrends.com/leveraged-inverse-channel/feeling-short-on-energy-give-this-inverse-etf-a-look/",
      "source": "ETF Trends",
      "published": "20220318T163657",
      "overall_sentiment_score": -0.199987,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.326168,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.649397
    },
    {
      "title": "San Antonio’s Valero Energy was a big buyer of Russian oil; with new ban, it’s looking elsewhere",
      "summary": "San Antonio-based Valero Energy Corp., a major buyer of Russian crude oil, faces a new ban on imports from Russia imposed by President Biden in response to the invasion of Ukraine. The company, which purchased over 15 million barrels of Russian oil last year, will now have to seek alternative sources, likely contributing to higher gasoline prices. Analysts note the difficulty of replacing Russian crude quickly and the potential for a significant oil supply shortage.",
      "url": "https://www.expressnews.com/business/article/San-Antonio-Valero-Energy-Russian-oil-16987504.php",
      "source": "San Antonio Express-News",
      "published": "20220308T181400",
      "overall_sentiment_score": 0.15382,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.106269,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.647566
    },
    {
      "title": "Fact check: Is the U.S. polluting the air more than ever?",
      "summary": "This article fact-checks a claim by U.S. Rep. Glenn Grothman that the U.S. has made significant strides in reducing carbon emissions compared to other countries. PolitiFact rated his claim as \"True,\" citing data showing an 8.2 percent decrease in U.S. greenhouse gas emissions from 2010 to 2019, while countries like China and India saw increases. The article also touches on Grothman's concern that stricter U.S. environmental laws could push manufacturing jobs to countries with lower standards.",
      "url": "https://www.expressnews.com/politics/us-world/article/Is-the-U-S-polluting-the-air-more-than-ever-16998408.php",
      "source": "San Antonio Express-News",
      "published": "20220314T190644",
      "overall_sentiment_score": 0.107417,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.125011,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.645799
    },
    {
      "title": "Energy ETFs Retreat as Crude Oil Dips Below $100",
      "summary": "Energy ETFs plunged as crude oil prices fell below $100, driven by waning supply fears and concerns over demand due to a spike in COVID-19 cases in China. The decline was also influenced by potential progress in the Iran nuclear deal, which could reintroduce Iranian oil to global markets, and ongoing Russia-Ukraine ceasefire talks. Additionally, China's decreased oil processing rates and the Federal Reserve's anticipated interest rate hike further weighed on the oil market.",
      "url": "https://www.etftrends.com/alternatives-channel/energy-etfs-retreat-as-crude-oil-dips-below-100/",
      "source": "ETF Trends",
      "published": "20220315T161653",
      "overall_sentiment_score": -0.346,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.347017,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.645688
    },
    {
      "title": "Hess CEO says oil is in the 'intensive care unit' — U.S., other nations need to act",
      "summary": "Hess Corporation CEO John Hess asserted that the oil market is in the \"intensive care unit\" and urged the U.S. and other nations to take immediate action to stabilize prices amidst the Russia-Ukraine war. He called on the International Energy Agency to release 240 million barrels from strategic petroleum reserves, arguing that last week's 60 million barrel release was insufficient to avert an economic recession.",
      "url": "https://www.cnbc.com/2022/03/08/hess-ceo-says-oil-is-in-the-intensive-care-unit-us-other-nations-need-to-act.html",
      "source": "CNBC",
      "published": "20220308T102200",
      "overall_sentiment_score": 0.151925,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.145469,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.642885
    },
    {
      "title": "Once the biggest importer of Russian oil, Valero looks to Latin America and elsewhere to replace it",
      "summary": "Valero, formerly the largest U.S. importer of Russian oil, is seeking new crude supplies from Latin America and other regions after voluntarily discontinuing Russian purchases due to the invasion of Ukraine. The company is actively pursuing supply contracts with countries like Ecuador to fill the void, despite market uncertainties and rising oil prices. Analysts offer mixed prospects for Valero, with some seeing potential benefits from market shifts, while others foresee a negative impact on profitability despite the company's efforts to adapt.",
      "url": "https://sanantonioreport.org/valero-replaces-russian-oil/",
      "source": "San Antonio Report",
      "published": "20220321T190644",
      "overall_sentiment_score": -0.053476,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.143836,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.639503
    },
    {
      "title": "Steelworkers Walk Off Job at Chevron Richmond Refinery",
      "summary": "Over 500 workers at Chevron Corp.'s Richmond refinery went on strike due to safety concerns and demands for higher wages to combat inflation and high Bay Area living costs. The United Steelworkers union stated that the strike began after workers rejected Chevron's contract offer, which offered a 2.5% pay increase while the union sought 5%. The strike raises concerns about potential impacts on California's already high gasoline prices, though Chevron anticipates no issues in maintaining product supply with replacement workers.",
      "url": "https://www.nbcbayarea.com/news/local/steelworkers-officially-on-strike-at-chevron-richmond-refinery/2842907/",
      "source": "NBC Bay Area",
      "published": "20220321T182500",
      "overall_sentiment_score": -0.213031,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.141476,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.630435
    },
    {
      "title": "US oil giant Halliburton suspends operations in Russia",
      "summary": "Halliburton and Schlumberger, two major US oil field services companies, have announced the suspension of their operations in Russia due to sanctions imposed over the invasion of Ukraine. Halliburton halted future business, shipments of sanctioned parts, and has no active joint ventures, while Schlumberger ceased investment and technology deployment. This move follows similar actions by over 400 other multinational firms pressured to exit the Russian market.",
      "url": "https://www.theguardian.com/business/2022/mar/19/halliburton-schlumberger-suspend-operations-russia",
      "source": "The Guardian",
      "published": "20220319T121600",
      "overall_sentiment_score": -0.315332,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.231425,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.630405
    },
    {
      "title": "News Content Hub - Rigs report: contracting activity jumps, Valaris drillship sustains minor damage",
      "summary": "Global offshore drilling activity significantly increased, with seven new contracts pushing the total to 351 contracted jack-ups and floaters. Maersk Drilling secured a 150-day contract for its Maersk Resolve rig, valued at US$16.9M. Concurrently, the Valaris DS-16 drillship and bulk carrier Akti sustained minor damage in a collision due to gale-force winds in Pascagoula, Mississippi, though Valaris expects no delays to its contract commencement.",
      "url": "https://www.rivieramm.com/news-content-hub/news-content-hub/rigs-report-contracting-activity-jumps-while-valaris-drillship-sustains-minor-damage-70246",
      "source": "Riviera Maritime Media",
      "published": "20220316T190624",
      "overall_sentiment_score": 0.098403,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.130494,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.629444
    },
    {
      "title": "Commodity funds post hefty gains over the past week",
      "summary": "Commodity mutual funds and ETFs experienced significant gains over the last week due to rising crude oil and metal prices, intensified by the conflict between Russia and Ukraine. Key performers included ProShares Ultra Bloomberg Crude Oil, United States Oil Fund LP, and iShares S&P GSCI Commodity-Indexed Trust, with oil prices reaching 2008 highs and other commodity futures also soaring. This surge led to a net inflow of $7.9 billion into commodity funds in February, marking the largest influx since August 2020.",
      "url": "https://www.reuters.com/markets/europe/global-markets-commodities-2022-03-07/",
      "source": "Reuters",
      "published": "20220307T114900",
      "overall_sentiment_score": 0.322055,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.327391,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.62291
    },
    {
      "title": "Workers go on strike at California refinery owned by Chevron",
      "summary": "Over 500 workers at Chevron Corp.'s refinery in Richmond, California, initiated a strike after rejecting a contract offer the United Steelworkers union deemed unreasonable. Chevron stated that refinery operations would continue and that it does not anticipate supply chain issues, despite concerns that a prolonged strike could impact California's high gasoline prices. The dispute arose as local bargaining units negotiated specific issues beyond a national agreement for oil workers.",
      "url": "https://kmph.com/news/nation-world/workers-go-on-strike-at-california-refinery-owned-by-chevron",
      "source": "KMPH",
      "published": "20220321T075200",
      "overall_sentiment_score": -0.145747,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.143377,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.618203
    },
    {
      "title": "Baker Hughes joins Halliburton and Schlumberger in pausing Russian operations",
      "summary": "Baker Hughes announced it is suspending new investments for its Russia operations, following similar moves by rivals Halliburton Co. and Schlumberger, in response to U.S. sanctions over Russia’s invasion of Ukraine. This decision means these major oil field services companies are winding down or suspending activities in Russia, joining over 400 other multinational firms. Ukrainian President Volodymyr Zelenskyy has urged remaining U.S. businesses to leave Russia, stating the market is \"flooded with our blood.\"",
      "url": "https://whyy.org/articles/baker-hughes-joins-halliburton-schlumberger-pausing-russian-operations/",
      "source": "WHYY",
      "published": "20220319T165622",
      "overall_sentiment_score": -0.237699,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.219599,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.606905
    },
    {
      "title": "John Hess Built His Net Worth in the Oil and Gas Industry",
      "summary": "John Hess, CEO of Hess Corporation, has amassed a net worth of at least $440 million through his family's long-standing involvement in the oil and gas industry, founded by his father Leon Hess. He recently urged the U.S. and IEA to take more aggressive action to stabilize oil prices amidst the Russia-Ukraine war and rising petroleum costs, advocating for larger releases from strategic reserves. Hess believes these actions are crucial to prevent an economic recession.",
      "url": "https://marketrealist.com/p/john-hess-net-worth/",
      "source": "Market Realist",
      "published": "20220308T133400",
      "overall_sentiment_score": 0.154325,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.138139,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.599577
    },
    {
      "title": "ConocoPhillips CEO says a decision to drill more today won't see oil flowing for up to a year",
      "summary": "ConocoPhillips CEO Ryan Lance stated that even if drilling for new oil started immediately today, it would take 8 to 12 months for the oil to begin flowing, offering no immediate relief to elevated prices. His comments followed the U.S. ban on Russian oil imports and highlighted challenges like inflation and supply chain issues impacting the oil industry's ability to ramp up production quickly. Lance also suggested that tapping into strategic petroleum reserves could provide short-term relief, but a longer-term strategy is needed for energy security given the potential for sustained high oil prices.",
      "url": "https://www.cnbc.com/2022/03/08/drill-more-today-and-oil-wont-flow-for-up-to-a-year-conocophillips.html",
      "source": "CNBC",
      "published": "20220308T160800",
      "overall_sentiment_score": 0.130335,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.098107,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.580918
    }
  ]
}