{
  "ticker": "XOM",
  "date": "2023-04-03",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T13:10:26.622774",
  "source": "alpha_vantage",
  "article_count": 2,
  "articles": [
    {
      "title": "Comcast Stock Is a Buy",
      "summary": "Morningstar analyst Michael Hodel rates Comcast stock as a buy, citing its undervalued status, attractive yield, and stable dividend. The article highlights Comcast's strong core cable business with competitive advantages and resilient broadband provision, despite challenges from competition and the evolving TV landscape. Key metrics like a $60 fair value estimate and a Wide Economic Moat rating reinforce the positive outlook, while acknowledging risks such as regulation and technological obsolescence.",
      "url": "https://www.morningstar.com/stocks/comcast-stock-is-buy",
      "source": "Morningstar",
      "published": "20230329T000000",
      "overall_sentiment_score": 0.139655,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.03493,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.610689
    },
    {
      "title": "Halliburton and Honeywell in talks to develop oil fields and refineries in Libya",
      "summary": "Halliburton and Honeywell International Inc. are negotiating $1.4 billion in deals with Libya's National Oil Corporation (NOC) to develop an oil field and construct a refinery in southern Libya. The initial agreement for the refinery's design is expected soon, followed by a $400 million contract for its construction. This development follows U.S. Secretary of State Antony Blinken's statement about reopening the U.S. embassy in Libya to support elections and comes as American firms increasingly view Libya as a safe environment for investment.",
      "url": "https://libyaupdate.com/halliburton-and-honeywell-in-talks-to-develop-oil-fields-and-refineries-in-libya/",
      "source": "Libya Update News - Libya Update News",
      "published": "20230324T145019",
      "overall_sentiment_score": 0.385947,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.34005,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.590727
    }
  ]
}