{
  "ticker": "XOM",
  "date": "2023-09-18",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T13:34:17.193592",
  "source": "alpha_vantage",
  "article_count": 3,
  "articles": [
    {
      "title": "Vivek Ramaswamy's 'anti-woke' investment firm now manages assets worth more than $1 billion",
      "summary": "Vivek Ramaswamy's \"anti-woke\" investment firm, Strive Asset Management, which was founded in 2022 to counter ESG-focused investing, has grown to manage over $1 billion in assets. The firm's success comes despite challenges, including a lawsuit from former employees, and its focus is on encouraging companies to prioritize excellence over ESG concerns. Ramaswamy has also criticized major investment firms like BlackRock for pushing ESG agendas.",
      "url": "https://markets.businessinsider.com/news/etf/vivek-ramaswamy-anti-woke-investment-firm-assets-1-billion-2023-9",
      "source": "markets.businessinsider.com",
      "published": "20230906T102718",
      "overall_sentiment_score": -0.085519,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.344137,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.612413
    },
    {
      "title": "XOMO - YieldMax XOM Option Income Strategy ETF Stock Price and Quote",
      "summary": "This article provides a detailed quote and financial data for the XOMO - YieldMax XOM Option Income Strategy ETF. It includes current stock price, performance metrics, dividend information, fund characteristics, and recent news announcements related to YieldMax ETFs. The fund aims for current income and indirect exposure to Exxon Mobil Corporation (XOM) through a synthetic covered call strategy.",
      "url": "https://finviz.com/quote.ashx?t=XOMO",
      "source": "Finviz",
      "published": "20230904T000857",
      "overall_sentiment_score": 0.056205,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.025019,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.711746
    },
    {
      "title": "YieldMax Writes Call Options on JPMorgan Chase With JPMO ETF",
      "summary": "YieldMax has launched the YieldMax JPM Option Income Strategy ETF (JPMO), an actively managed fund that aims to generate monthly income by writing call options on JPMorgan Chase & Co. Corp. (JPM). The fund seeks to harvest compelling yields with capped participation in JPM's price gains and is managed by ZEGA Financial with an expense ratio of 0.99%. This new ETF expands YieldMax's growing suite of option income strategy ETFs.",
      "url": "https://www.nasdaq.com/articles/yieldmax-writes-call-options-on-jpmorgan-chase-with-jpmo-etf",
      "source": "Nasdaq",
      "published": "20230912T060936",
      "overall_sentiment_score": 0.20605,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.102767,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.58505
    }
  ]
}