{
  "ticker": "XOM",
  "date": "2024-09-09",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T13:38:16.042709",
  "source": "alpha_vantage",
  "article_count": 8,
  "articles": [
    {
      "title": "ExxonMobil eyes 2025 start date for first U.S. Gulf Coast carbon capture project",
      "summary": "ExxonMobil is targeting a 2025 start date for its first U.S. Gulf Coast carbon capture project, pending regulatory approval for injection wells. This project aims to store up to 2 million tons of CO2 emissions annually from CF Industries Holdings Inc.'s ammonia plant in Louisiana. The company views carbon capture as crucial for reducing emissions while maintaining fossil fuel benefits and plans to establish a larger Gulf Coast hub.",
      "url": "https://www.worldoil.com/news/2024/9/5/exxonmobil-eyes-2025-start-date-for-first-u-s-gulf-coast-carbon-capture-project/",
      "source": "World Oil",
      "published": "20240905T000000",
      "overall_sentiment_score": 0.204901,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.29162,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.940438
    },
    {
      "title": "Halliburton cybersecurity attack unlikely to impact oil and gas operations, company reports",
      "summary": "Halliburton Co. reported that a recent cybersecurity attack disrupting its business is unlikely to materially impact its finances or operations. The company is evaluating the breach, has activated its response plan, and has proactively taken some systems offline. Despite a stock dip and removal of information by hackers, Halliburton continues to provide products and services globally to its customers.",
      "url": "https://worldoil.com/news/2024/9/3/halliburton-cybersecurity-attack-unlikely-to-impact-oil-and-gas-operations-company-reports/",
      "source": "World Oil",
      "published": "20240903T000000",
      "overall_sentiment_score": -0.154016,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.139875,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.635562
    },
    {
      "title": "Oil Giant Halliburton Partly Went Offline Following Cyberattack",
      "summary": "Halliburton, a major global oil industry player, experienced a severe cyberattack that caused operational disruptions and took some systems offline. The incident, detected on August 21, 2024, was later identified as a RansomHub ransomware attack, though Halliburton has not officially confirmed the ransomware type. The company has engaged external experts, notified law enforcement, and is working on restoration while assuring no significant impact on energy services.",
      "url": "https://latesthackingnews.com/2024/09/02/oil-giant-halliburton-partly-went-offline-following-cyberattack/",
      "source": "Latest Hacking News - Exploits, Vulnerabilities, Tech and Tutorials",
      "published": "20240902T000000",
      "overall_sentiment_score": -0.250772,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.05473,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.623267
    },
    {
      "title": "Undervalued by 16%, This Dividend Stock Is a Buy for the Long Term",
      "summary": "Kenvue, the consumer health company spun off from Johnson & Johnson, is highlighted as an attractive dividend stock, trading 16% below its fair value estimate of $26. Morningstar assigns Kenvue a wide economic moat due to strong brand power and economies of scale, projecting competitiveness for at least 20 years. The article discusses growth drivers such as innovation, an aging population, and digital investments, while also addressing risks like market competition and past talc litigation.",
      "url": "https://www.morningstar.com/stocks/undervalued-by-16-this-dividend-stock-is-buy-long-term",
      "source": "Morningstar",
      "published": "20240829T000000",
      "overall_sentiment_score": 0.178115,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.109191,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.604546
    },
    {
      "title": "The investment portfolio has \"strategic value\"! Goldman Sachs' assessment: The world is entering a \"commodity control cycle\".",
      "summary": "Goldman Sachs argues that traditional stock-bond portfolios are vulnerable to stagflation risks due to stagnating globalization and geopolitical tensions, leading the world into a \"commodity control cycle.\" This cycle, characterized by Insulation, Expansion, Concentration, and Leverage, makes commodities an indispensable core asset for hedging future risks. The report recommends incorporating a broad range of commodities into investment portfolios for long-term strategic value against inflation and geopolitical shocks.",
      "url": "https://news.futunn.com/en/post/61668433/the-investment-portfolio-has-strategic-value-goldman-sachs-assessment-the",
      "source": "富途牛牛",
      "published": "20240904T173800",
      "overall_sentiment_score": 0.309111,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.253392,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.605711
    },
    {
      "title": "Should You Invest in the Strive U.S. Energy ETF (DRLL)?",
      "summary": "This article examines the Strive U.S. Energy ETF (DRLL) as an investment option for broad exposure to the energy sector. It highlights DRLL's passive management, low costs, and diversification, detailing its index tracking, expense ratio, top holdings like Exxon Mobil (XOM) and Chevron (CVX), and recent performance. The piece concludes by rating DRLL as a \"Buy\" and suggesting alternative energy ETFs for consideration.",
      "url": "https://www.nasdaq.com/articles/should-you-invest-strive-us-energy-etf-drll",
      "source": "Nasdaq",
      "published": "20240902T062000",
      "overall_sentiment_score": 0.314182,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.305777,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.721009
    },
    {
      "title": "Regulator Fines Imperial Oil Over Kearl Project Incident",
      "summary": "The Alberta Energy Regulator (AER) has fined Imperial Oil CAD 50,000 and imposed terms and conditions due to a wastewater release incident at its Kearl Oil Sands Project in August 2022. Imperial Oil is required to implement projects for sharing lessons learned with other operators and to further study the impacts of the release, with all findings needing public disclosure. The investigation into potential contraventions remains ongoing, but Imperial Oil has expressed regret and a commitment to collaborating with Indigenous communities to rebuild trust.",
      "url": "https://www.rigzone.com/news/regulator_fines_imperial_oil_over_kearl_project_incident-26-aug-2024-177874-article/",
      "source": "Rigzone",
      "published": "20240826T030000",
      "overall_sentiment_score": -0.127229,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.202953,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.727268
    },
    {
      "title": "Halliburton says hackers removed data in August cyberattack",
      "summary": "Halliburton, the oilfield services company, confirmed that an unauthorized third party accessed and removed data from its systems during a cyberattack in August. The company is evaluating the nature and scope of the removed information but stated that the incident is not likely to have a material impact. Halliburton activated its cybersecurity response plan and launched an internal investigation with external advisers.",
      "url": "https://www.businessinsurance.com/halliburton-says-hackers-removed-data-in-august-cyberattack/",
      "source": "Business Insurance",
      "published": "20240903T000000",
      "overall_sentiment_score": -0.154766,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.123658,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.566275
    }
  ]
}