{
  "ticker": "XOM",
  "date": "2024-11-11",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T13:39:18.392185",
  "source": "alpha_vantage",
  "article_count": 12,
  "articles": [
    {
      "title": "Exxon, Chevron Beat Estimates on Permian Oil-Supply Boost",
      "summary": "Exxon Mobil Corp. and Chevron Corp. both exceeded analysts' profit and sales estimates, largely due to increased oil production from the Permian Basin. This boost in output helped both companies offset the impact of weaker crude prices. Exxon also announced a dividend increase.",
      "url": "https://www.bloomberg.com/news/articles/2024-11-01/chevron-beats-estimates-on-higher-permian-basin-oil-production",
      "source": "Bloomberg.com",
      "published": "20241101T101500",
      "overall_sentiment_score": 0.363274,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.346513,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.939831
    },
    {
      "title": "Transocean, Noble, Valaris, Borr, and Odfjell Drilling fleets' $23 billion backlog spotlights state of play in booming rig market",
      "summary": "Five major offshore drilling companies—Transocean, Noble Corporation, Valaris, Borr Drilling, and Odfjell Drilling—have collectively secured a Q3 2024 backlog of $23.22 billion, reflecting a booming rig market fueled by global energy demands and geopolitical tensions. Despite some localized market uncertainties and environmental concerns, analysts predict substantial growth in the offshore drilling industry, with the market expected to reach $80.64 billion by 2033. Each company highlights strong operational performance, strategic growth initiatives, and significant contract wins that contribute to their robust backlogs and positive outlooks for future earnings and shareholder returns.",
      "url": "https://www.offshore-energy.biz/transocean-noble-valaris-borr-and-odfjell-drilling-fleets-23-billion-backlog-spotlights-state-of-play-in-booming-rig-market/",
      "source": "Offshore Energy",
      "published": "20241111T000000",
      "overall_sentiment_score": 0.305632,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.307563,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.724295
    },
    {
      "title": "Pampa Energía prioritizing Vaca Muerta oil outlay while mulling gas, urea options",
      "summary": "Pampa Energía is focusing on increasing oil production and dispatch at its Vaca Muerta acreage, Rincón de Aranda, with plans to invest US$700mn next year to boost output to 45,000b/d by 2027. Concurrently, the company is exploring new gas export opportunities, including LNG projects and piped gas to Brazil and Chile, and is configuring a US$2-3bn urea plant in Bahía Blanca. These initiatives highlight Pampa’s strategy to monetize its hydrocarbon reserves and expand into petrochemicals.",
      "url": "https://www.bnamericas.com/en/features/pampa-energia-prioritizing-vaca-muerta-oil-outlay-while-mulling-gas-urea-options",
      "source": "BNamericas",
      "published": "20241107T000000",
      "overall_sentiment_score": 0.099774,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.118483,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.711943
    },
    {
      "title": "ConocoPhillips explores sale of Permian shale assets worth over $1 billion, sources say",
      "summary": "ConocoPhillips is exploring the sale of over $1 billion worth of non-core Permian Basin shale assets, two years after a previous unsuccessful attempt. This move comes as the company prepares to finalize its $22.5 billion acquisition of Marathon Oil and aims to raise $2 billion through asset sales to manage debt. Investment bankers at RBC Capital Markets are managing the sale process, inviting bids from smaller public and private oil producers.",
      "url": "https://www.reuters.com/business/energy/conocophillips-explores-sale-permian-shale-assets-worth-over-1-billion-sources-2024-10-30/",
      "source": "Reuters",
      "published": "20241030T190900",
      "overall_sentiment_score": 0.176574,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.125878,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.673114
    },
    {
      "title": "Electronic Arts (EA) Earnings: 2Q25 Key Numbers",
      "summary": "Electronic Arts (EA) reported net revenues of $2.02 billion for the second quarter of 2025, a 6% increase year-over-year, but net income and earnings per share decreased by 26% and 24% respectively. Net bookings reached $2.07 billion. The company provided guidance for Q3 2025 EPS at $0.85-1.02 and fiscal year 2025 EPS at $3.82-4.33.",
      "url": "https://news.alphastreet.com/electronic-arts-ea-earnings-2q25-key-numbers/",
      "source": "AlphaStreet",
      "published": "20241030T000000",
      "overall_sentiment_score": -0.137463,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.11088,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.648857
    },
    {
      "title": "What does Trump’s 2024 election win mean for global markets?",
      "summary": "A Donald Trump presidency is projected to impact global markets by strengthening the U.S. dollar, boosting domestic stocks in certain sectors, but potentially weighing on bonds, emerging markets, clean energy, and sustainable investing. His policies, including tariffs and tax cuts, are expected to fuel inflation and growth in the U.S. while creating headwinds for other economies and sectors. The article details specific impacts across currencies, stocks, bonds, commodities, emerging markets, and sustainable investing.",
      "url": "https://www.reuters.com/markets/whats-stake-global-markets-trump-presidency-2024-11-06/",
      "source": "Reuters",
      "published": "20241106T170200",
      "overall_sentiment_score": 0.223178,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.318261,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.624872
    },
    {
      "title": "Nauticus wraps up autonomous, tether-less survey for Shell in Gulf of Mexico",
      "summary": "Nauticus Robotics has successfully completed an initial autonomous, tether-less survey for Shell Exploration and Production Inc. in the Gulf of Mexico, covering inactive and active assets off Louisiana at depths up to 1,000 meters. This project demonstrates Nauticus's viable product in a deepwater environment, contributing to its growing 2025 commercial work pipeline. The company recently began commercial operations of its Aquanaut Mark 2 underwater vehicle and secured over $12 million in funding to accelerate the certification of its robots.",
      "url": "https://www.offshore-energy.biz/nauticus-wraps-up-autonomous-tether-less-survey-for-shell-in-gulf-of-mexico/",
      "source": "Offshore Energy",
      "published": "20241106T000000",
      "overall_sentiment_score": 0.487495,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.327843,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.60017
    },
    {
      "title": "Petrobras posts 22% increase in quarterly profit, announces $3 billion in dividends",
      "summary": "Brazilian state-run oil firm Petrobras reported a 22% increase in its third-quarter net profit, reaching 32.6 billion reais ($5.7 billion). The company also announced $3 billion in dividends and increased its investments for the quarter, primarily in exploration and production. Despite a year-on-year decrease in adjusted EBITDA, the company's net revenue from sales topped expectations.",
      "url": "https://www.reuters.com/business/energy/brazils-petrobras-posts-22-increase-third-quarter-net-profit-2024-11-07/",
      "source": "Reuters",
      "published": "20241108T002800",
      "overall_sentiment_score": 0.257544,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.25615,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.589802
    },
    {
      "title": "Valero Considers All Options, Including Sale, for California Refineries Amid Regulatory Pressure",
      "summary": "Valero Energy Corp. is evaluating all options, including the potential sale of its two California refineries (Benicia and Wilmington), due to increasing regulatory pressures in the state. CEO Lane Riggs stated that \"all options are on the table\" given California's challenging regulatory environment. This comes as California implements new regulations for refiners and faces high gas prices, potentially leading to more refinery closures and increased dependence on gasoline imports.",
      "url": "https://pgjonline.com/news/2024/october/valero-considers-all-options-including-sale-for-california-refineries-amid-regulatory-pressure",
      "source": "Pipeline and Gas Journal",
      "published": "20241031T000000",
      "overall_sentiment_score": -0.161819,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.125942,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.586757
    },
    {
      "title": "Visa Earnings: A Stable Fiscal Year Finishes on a Good Note",
      "summary": "Visa concluded its fiscal year with a stable fourth quarter, reinforcing its position in a comfortable groove as pandemic, political, and macro effects have dissipated. The company showed consistent growth and strong profitability, evidenced by a 12% year-over-year increase in constant currency net revenue and an 8% rise in payment volume. Cross-border volume normalization and muted client incentive growth further contribute to the positive outlook, with Morningstar maintaining its $272 fair value estimate.",
      "url": "https://www.morningstar.com/stocks/visa-earnings-stable-fiscal-year-finishes-good-note",
      "source": "Morningstar",
      "published": "20241030T000000",
      "overall_sentiment_score": 0.377136,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.134765,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.574516
    },
    {
      "title": "U.S. Apache to Exit UK North Sea Due To Windfall Tax",
      "summary": "U.S. oil producer Apache plans to cease all oil production in the UK North Sea by 2030, citing the uneconomical impact of the UK's windfall tax, known as the Energy Profits Levy (EPL). The tax, recently increased to 38% and extended to March 2030, along with the removal of investment allowances, has led Apache to redirect its North Sea investments solely towards asset safety and integrity. This decision follows a growing trend of companies reconsidering their operations in the UK North Sea due to policy changes and rising taxes.",
      "url": "https://oilprice.com/Latest-Energy-News/World-News/US-Apache-to-Exit-UK-North-Sea-Due-To-Windfall-Tax.html",
      "source": "Crude Oil Prices Today | OilPrice.com",
      "published": "20241108T103000",
      "overall_sentiment_score": -0.258913,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.149776,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.560376
    },
    {
      "title": "AbbVie Earnings: Maintaining Fair Value Estimate as Firm Rapidly Pushes Through Humira Headwind",
      "summary": "AbbVie reported strong third-quarter revenue, exceeding expectations and demonstrating progress in offsetting Humira's sales decline with newer immunology products Skyrizi and Rinvoq. Despite raising revenue and GAAP guidance, Morningstar is maintaining its fair value estimate of $176 per share due to only minor long-term model changes. The firm also showed growth in oncology and neurology, with promising new drug approvals and strong performance from existing products.",
      "url": "https://www.morningstar.com/stocks/abbvie-earnings-maintaining-fair-value-estimate-firm-rapidly-pushes-through-humira-headwind",
      "source": "Morningstar",
      "published": "20241030T000000",
      "overall_sentiment_score": 0.206741,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": -0.07642,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.539192
    }
  ]
}