{
  "ticker": "XOM",
  "date": "2024-07-08",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T13:37:33.510530",
  "source": "alpha_vantage",
  "article_count": 4,
  "articles": [
    {
      "title": "Chevron Inks PSCs for Two Blocks Offshore Equatorial Guinea",
      "summary": "Chevron Corp. and Equatorial Guinea’s state-owned GEPetrol have signed production sharing contracts (PSCs) for offshore blocks EG06 and EG11. These contracts aim to revitalize exploration and production offshore Equatorial Guinea, particularly near the producing Block B which houses the Zafiro field. This initiative is part of an effort to reverse the country's hydrocarbon production decline and boost energy security in West Africa, with Chevron also involved in the Gas Mega Hub project.",
      "url": "https://www.rigzone.com/news/chevron_inks_pscs_for_two_blocks_offshore_equatorial_guinea-24-jun-2024-177188-article/",
      "source": "Rigzone",
      "published": "20240624T075000",
      "overall_sentiment_score": 0.313646,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.141917,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.707865
    },
    {
      "title": "Aramco and Sempra announce Heads of Agreement",
      "summary": "Aramco and Sempra's subsidiaries have signed a non-binding Heads of Agreement for a 20-year sale and purchase agreement for 5.0 million tpy of LNG from the Port Arthur LNG Phase 2 expansion project. The agreement also includes Aramco's potential 25% equity participation in the project. This move marks a significant step in Aramco's strategy to become a leading global LNG player and aims to enhance energy security and provide a lower-carbon energy source.",
      "url": "https://www.hydrocarbonengineering.com/gas-processing/01072024/aramco-and-sempra-announce-heads-of-agreement/",
      "source": "Hydrocarbon Engineering",
      "published": "20240701T083000",
      "overall_sentiment_score": 0.303688,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.211611,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.6323
    },
    {
      "title": "5 Stocks to Buy for 3Q 2024",
      "summary": "Morningstar Chief US Markets Strategist Dave Sekera discusses the Q3 2024 stock and bond market outlook and recommends five stocks for the quarter: ExxonMobil, Fortinet, International Flavors and Fragrances, Baxter International, and Ventas Inc. He also reviews recent earnings reports, key economic data, and Morningstar's fair value estimates for several companies, including Taiwan Semiconductor and Chipotle. The discussion highlights concerns about consumer spending, market concentration in large-cap tech stocks, and opportunities in undervalued sectors like small-cap and value stocks.",
      "url": "https://www.morningstar.com/markets/5-stocks-buy-3q-2024",
      "source": "Morningstar",
      "published": "20240701T000000",
      "overall_sentiment_score": 0.075601,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.408568,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.718941
    },
    {
      "title": "Digital Innovation: TotalEnergies to Partner with SLB for a more sustainable energy",
      "summary": "TotalEnergies and SLB are partnering to develop innovative subsurface digital solutions aimed at achieving more sustainable hydrocarbon production and implementing TotalEnergies’ \"More energy, less emissions, more value\" strategy. This collaboration will lead to the development of next-generation cloud-based software to optimize production, reduce carbon intensity in existing fields, and enhance geological carbon storage through AI. Additionally, TotalEnergies will support SLB by solarizing its industrial sites globally to help reduce SLB's carbon footprint.",
      "url": "https://totalenergies.com/news/press-releases/digital-innovation-totalenergies-partner-slb-more-sustainable-energy",
      "source": "TotalEnergies.com",
      "published": "20240702T000000",
      "overall_sentiment_score": 0.319392,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.299179,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.623593
    }
  ]
}