{
  "ticker": "XOM",
  "date": "2024-12-23",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T13:39:46.651246",
  "source": "alpha_vantage",
  "article_count": 15,
  "articles": [
    {
      "title": "Verde Clean Fuels, Inc. Announces $50 Million Equity Investment by Cottonmouth Ventures, LLC, a Wholly-Owned Subsidiary of Diamondback Energy, Inc.",
      "summary": "Verde Clean Fuels, Inc. has announced a $50 million equity investment from Cottonmouth Ventures, LLC, a subsidiary of Diamondback Energy, Inc. Cottonmouth will purchase 12.5 million shares of Verde Class A common stock at $4.00 per share, with the closing anticipated in Q1 2025. This investment will increase Cottonmouth's total stake in Verde to $70 million, making it the second-largest shareholder and supporting the development of natural gas-to-gasoline production plants in the Permian Basin.",
      "url": "https://www.businesswire.com/news/home/20241219967262/en/Verde-Clean-Fuels-Inc.-Announces-%2450-Million-Equity-Investment-by-Cottonmouth-Ventures-LLC-a-Wholly-Owned-Subsidiary-of-Diamondback-Energy-Inc.",
      "source": "Business Wire",
      "published": "20241219T050338",
      "overall_sentiment_score": 0.235771,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.117893,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.63971
    },
    {
      "title": "Chevron Australia signs long-term gas supply deal with Alcoa",
      "summary": "Chevron Australia has signed a 10-year gas supply deal with Alcoa, starting in 2028, to provide 130 petajoules of gas from its Western Australian facilities. This gas will power Alcoa's alumina refineries in the region. The deal follows previous supply agreements and comes as Alcoa faces challenges with its Kwinana refinery and a recent disruption at its Pinjarra refinery.",
      "url": "https://www.reuters.com/business/energy/chevron-australia-signs-long-term-gas-supply-deal-with-alcoa-2024-12-17/",
      "source": "Reuters",
      "published": "20241217T033200",
      "overall_sentiment_score": 0.156596,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.077384,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.726833
    },
    {
      "title": "Woodside Taps Bechtel to Build $1.3B Revamped Louisiana LNG Project",
      "summary": "Woodside Energy Group Ltd. has awarded Bechtel Energy Group an engineering, procurement, and construction (EPC) contract to continue work on the Driftwood LNG project, now renamed Louisiana LNG. The $1.3 billion project in Hackberry, LA, involving three trains with a 16.5 Mt/y capacity, aims for a final investment decision for the first three trains by March. This move solidifies Woodside's Gulf Coast presence after acquiring Tellurian Inc. and expands its North American LNG portfolio.",
      "url": "https://naturalgasintel.com/news/woodside-taps-bechtel-to-build-13b-revamped-louisiana-lng-project/",
      "source": "Natural Gas Intelligence",
      "published": "20241210T095800",
      "overall_sentiment_score": 0.344722,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.237652,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.635807
    },
    {
      "title": "How investors are adjusting to a slower green transition",
      "summary": "Investors are adapting to a deceleration in the green transition, shifting focus from a top-down approach to a bottom-up view for specific clean technology investments that can deliver returns. While still interested in clean tech, there's increased recognition that the path to net zero will take longer than initially expected, leading to a renewed focus on large incumbent companies and their management of the green transition. The article discusses delayed peak oil and gas demand forecasts and the growing importance of carbon capture and biofuels in a prolonged energy transition.",
      "url": "https://www.goldmansachs.com/insights/articles/how-investors-are-adjusting-to-a-slower-green-transition",
      "source": "Goldman Sachs",
      "published": "20241210T000000",
      "overall_sentiment_score": 0.107997,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.121792,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.608537
    },
    {
      "title": "AutoZone (AZO) Q1 2025 Earnings: Key financials and quarterly highlights",
      "summary": "AutoZone (AZO) reported Q1 2025 earnings with net sales of $4.3 billion, a 2.1% increase year-over-year, and same-store sales up 0.4%. Net income was $564.9 million, or $32.52 per share. The company also expanded its store count, opening 34 new stores across the US, Mexico, and Brazil.",
      "url": "https://news.alphastreet.com/autozone-azo-q1-2025-earnings-key-financials-and-quarterly-highlights/",
      "source": "AlphaStreet",
      "published": "20241210T000000",
      "overall_sentiment_score": 0.042282,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.10015,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.628426
    },
    {
      "title": "C3 AI Announces Fiscal Second Quarter 2025 Financial Results",
      "summary": "C3 AI announced strong financial results for its fiscal second quarter ended October 31, 2024, with revenue accelerating 29% year-over-year and raised guidance for FY 2025. The company highlighted its strategic alliance with Microsoft to accelerate enterprise AI adoption and significant momentum in federal and commercial agreements, including major generative AI pilot conversions. Key financial figures include $94.3 million in total revenue and a GAAP net loss per share of $(0.52).",
      "url": "https://www.businesswire.com/news/home/20241209723558/en/C3-AI-Announces-Fiscal-Second-Quarter-2025-Financial-Results",
      "source": "Business Wire",
      "published": "20241209T000000",
      "overall_sentiment_score": 0.349479,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.279388,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.571234
    },
    {
      "title": "Consumers sue Exxon, Dow, others over plastic recycling claims",
      "summary": "A new lawsuit filed by consumers alleges that Exxon Mobil, Chevron, Dow, and others misled the public for years about the feasibility of plastic recycling, leading to higher prices and increased waste. The suit claims these companies engaged in an antitrust conspiracy to misrepresent recycling capabilities, thereby artificially inflating demand for plastic products. Consumers are seeking an injunction against false advertising and unspecified monetary damages for the increased costs they incurred.",
      "url": "https://www.reuters.com/legal/litigation/consumers-sue-exxon-dow-others-over-plastic-recycling-claims-2024-12-17/",
      "source": "Reuters",
      "published": "20241217T214700",
      "overall_sentiment_score": -0.383851,
      "overall_sentiment_label": "Bearish",
      "ticker_sentiment_score": -0.417765,
      "ticker_sentiment_label": "Bearish",
      "relevance_score": 0.923504
    },
    {
      "title": "ExxonMobil names Tenaris its 2024 Supplier of the Year",
      "summary": "ExxonMobil has designated Tenaris as its 2024 Supplier of the Year, acknowledging the company's consistent superior performance, competitiveness, and high standards across global operations. Tenaris, a long-term supplier, provides OCTG solutions and services for ExxonMobil's US upstream operations and supports drilling projects worldwide, aligning with ExxonMobil's values and expectations for safety, quality, reliability, and sustainability. This award reinforces Tenaris's commitment to being a preferred supplier by delivering valuable outcomes and strengthening business relationships.",
      "url": "https://finance.yahoo.com/news/exxonmobil-names-tenaris-2024-supplier-190400176.html",
      "source": "Yahoo Finance",
      "published": "20241216T190400",
      "overall_sentiment_score": 0.367265,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.254646,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.832317
    },
    {
      "title": "Canada's Imperial Oil forecasts higher 2025 production on oil sands boost",
      "summary": "Imperial Oil forecasts higher crude production in 2025, driven by increased output from its Kearl and Cold Lake oil sands assets in Alberta. The company estimates 2025 production to be between 433,000 and 456,000 barrels of oil equivalent per day, an increase from its 2024 forecast, and projects higher capital spending for next year. This mirrors trends from peers Cenovus Energy and Suncor Energy, who also anticipate higher output due to increased exports.",
      "url": "https://www.reuters.com/markets/commodities/imperial-oil-forecasts-higher-production-2025-2024-12-12/",
      "source": "Reuters",
      "published": "20241212T141400",
      "overall_sentiment_score": 0.418297,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.333341,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.737696
    },
    {
      "title": "South Texas Drilling Permit Roundup: December sees surge in activity",
      "summary": "Drilling activity in the Eagle Ford shale play experienced an uptick in December, signaling an end to a holiday season lull. This surge in activity suggests a renewed focus on exploration and production in the South Texas region. The article highlights the increased drilling permits, indicating a potential boost for the local energy sector.",
      "url": "https://www.bizjournals.com/sanantonio/news/2024/12/10/south-texas-drilling-permit-roundup-oil-gas-eog.html",
      "source": "The Business Journals",
      "published": "20241210T000000",
      "overall_sentiment_score": 0.307089,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.208039,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.632057
    },
    {
      "title": "C3 AI shares surge on strong second quarter and upgraded outlook",
      "summary": "C3.ai Inc. shares jumped over 15% following strong fiscal second-quarter earnings and revenue that surpassed analyst expectations, along with an upgraded outlook for the third quarter and full year. The AI software maker reported a reduced net loss per share and a significant increase in revenue, driven by strong customer acquisition and a new global alliance agreement with Microsoft Corp.",
      "url": "https://siliconangle.com/2024/12/09/c3-ai-shares-surge-strong-second-quarter-upgraded-outlook/",
      "source": "SiliconANGLE",
      "published": "20241209T172800",
      "overall_sentiment_score": 0.255452,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.227016,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.623085
    },
    {
      "title": "Exxon Mobil Vs. Diamondback Energy: Only One Is A Compelling Buy",
      "summary": "This article compares Exxon Mobil and Diamondback Energy, two major energy production companies with generous shareholder capital return programs. The author analyzes both side-by-side to determine which one presents a more compelling buying opportunity at the moment, noting that Diamondback Energy has recently underperformed the broader energy sector compared to Exxon Mobil.",
      "url": "https://seekingalpha.com/article/4743925-exxon-mobil-vs-diamondback-energy-only-one-is-a-compelling-buy",
      "source": "Seeking Alpha",
      "published": "20241212T123600",
      "overall_sentiment_score": 0.191437,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.059909,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.906721
    },
    {
      "title": "Murphy Oil CEO joins Regions board",
      "summary": "Murphy Oil CEO Roger W. Jenkins has been appointed to the board of directors for Regions Bank. This appointment follows the recent announcement of Jenkins's retirement from Murphy Oil and is expected to leverage his extensive oil industry expertise for Regions. Jenkins recently received a major honor from a large professional services organization.",
      "url": "https://www.bizjournals.com/birmingham/news/2024/12/11/murphy-oil-ceo-joins-regions-board.html",
      "source": "The Business Journals",
      "published": "20241211T000000",
      "overall_sentiment_score": 0.200986,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.111869,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.608217
    },
    {
      "title": "Eastman among companies sued for alleged decades-long ‘fraud and deception’ over plastic recycling",
      "summary": "Eastman Chemical Company is among several defendants named in a federal class-action lawsuit alleging that chemical companies engaged in decades-long fraud and deception regarding the recyclability of plastics. Ford County, Kansas filed the lawsuit claiming the industry's actions exacerbated the plastic waste crisis and financially burdened communities. The lawsuit seeks damages and an injunction against advertising plastic products as recyclable.",
      "url": "https://www.wjhl.com/news/local/eastman-among-companies-sued-for-alleged-decades-long-fraud-and-deception-over-plastic-recycling/",
      "source": "WJHL",
      "published": "20241210T204100",
      "overall_sentiment_score": -0.360633,
      "overall_sentiment_label": "Bearish",
      "ticker_sentiment_score": -0.347035,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.816088
    },
    {
      "title": "Why Is Schlumberger Limited (SLB) One of the Top Oil and Gas Stocks To Invest In According to Hedge Funds?",
      "summary": "Schlumberger Limited (SLB) is highlighted as a top oil and gas stock to invest in, according to hedge funds, ranking 4th among energy stocks specializing in oil and gas. The article discusses global oil demand trends, a generally bleak outlook for oil prices in the near future, and the oil and gas industry's significant contributions to the global economy and shareholder returns despite these challenges. Schlumberger's strong Q3 2024 performance, including revenue growth, expanded EBITDA margins, and substantial free cash flow, along with its strategic investments in technology and AI, underpin its favorable position.",
      "url": "https://finance.yahoo.com/news/why-schlumberger-limited-slb-one-193705882.html",
      "source": "Yahoo Finance",
      "published": "20241222T193705",
      "overall_sentiment_score": 0.093345,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.124846,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.639713
    }
  ]
}