{
  "ticker": "XOM",
  "date": "2024-07-29",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T13:37:47.801987",
  "source": "alpha_vantage",
  "article_count": 15,
  "articles": [
    {
      "title": "ExxonMobil Inks CCS Agreement with Ammonia Producer CF",
      "summary": "ExxonMobil has signed a carbon capture and storage (CCS) agreement with CF Industries Holdings, Inc. to store up to 500,000 metric tons per year of CO2 from CF Industries' Yazoo City, Mississippi complex starting in 2028. This marks ExxonMobil's second CCS project with CF Industries, adding to a previous agreement for their Donaldsonville facility. The project aims to reduce the Yazoo City site's CO2 emissions by approximately 50 percent and contributes to ExxonMobil's overall goal of expanding carbon capture solutions.",
      "url": "https://www.rigzone.com/news/exxonmobil_inks_ccs_agreement_with_ammonia_producer_cf-29-jul-2024-177558-article/",
      "source": "Rigzone",
      "published": "20240729T090200",
      "overall_sentiment_score": 0.409208,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.432315,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.921372
    },
    {
      "title": "CF Industries Unveils $100 Million Emissions Reduction Initiative at Mississippi Plant",
      "summary": "CF Industries Holdings, Inc. announced a $100 million carbon capture and sequestration (CCS) project at its Yazoo City, Mississippi Complex to annually reduce CO2 emissions by up to 500,000 metric tons. The company has partnered with ExxonMobil for CO2 transportation and permanent geologic storage, with sequestration expected to begin in 2028. This initiative is CF Industries' second major decarbonization effort with ExxonMobil, aiming to enhance low-carbon ammonia production and help achieve its 2030 emissions intensity reduction goal.",
      "url": "https://www.chemanalyst.com/NewsAndDeals/NewsDetails/cf-industries-unveils-100-million-emissions-reduction-initiative-at-mississippi-plant-29276",
      "source": "ChemAnalyst",
      "published": "20240726T000000",
      "overall_sentiment_score": 0.417375,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.304548,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.729084
    },
    {
      "title": "$100 million emissions reduction project announced in Yazoo City",
      "summary": "CF Industries Holdings, Inc., the world's largest producer of ammonia, announced a $100 million carbon capture and sequestration (CCS) project at its Yazoo City Delta facility. This project is expected to reduce carbon dioxide emissions by up to 500,000 metric tons annually and will involve ExxonMobil for transport and sequestration. The investment aims to advance low-carbon ammonia production and allow products from the Yazoo City Complex to have a substantially lower carbon intensity.",
      "url": "https://magnoliatribune.com/2024/07/26/100-million-emissions-reduction-project-announced-in-yazoo-city/",
      "source": "Magnolia Tribune",
      "published": "20240726T000000",
      "overall_sentiment_score": 0.424168,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.304238,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.731648
    },
    {
      "title": "Earnings Infographic: IBM Q2 2024 earnings and revenue beat estimates",
      "summary": "International Business Machines Corporation (NYSE: IBM) reported stronger-than-expected earnings and revenues for the second quarter of 2024. Revenues reached $15.77 billion, surpassing the $15.48 billion from the previous year, with adjusted earnings hitting $2.43 per share compared to $2.18 per share a year ago. On an unadjusted basis, the net profit for the June quarter was $1.83 billion, or $1.96 per share.",
      "url": "https://news.alphastreet.com/earnings-infographic-ibm-q2-2024-earnings-and-revenue-beat-estimates/",
      "source": "AlphaStreet",
      "published": "20240724T000000",
      "overall_sentiment_score": 0.089086,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.118654,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.638281
    },
    {
      "title": "Nauticus Advances Autonomous Solutions Project with Brazil Operator",
      "summary": "Nauticus Robotics has completed Phase I of a four-phase contract with Brazil's largest offshore oil and gas operator, focusing on autonomous solutions for deepwater field inspection. This phase involved engineering and proof-of-concept documentation for the Aquanaut Mark 2 vehicle, leveraging Nauticus' ToolKITT software. The project aims to revolutionize subsea operations, improving efficiency, safety, and reducing CO2 emissions, with subsequent phases involving technology integration, testing, and field qualification in Brazil.",
      "url": "https://www.rigzone.com/news/nauticus_advances_autonomous_solutions_project_with_brazil_operator-19-jul-2024-177461-article/",
      "source": "Rigzone",
      "published": "20240719T090700",
      "overall_sentiment_score": 0.44877,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.241599,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.649722
    },
    {
      "title": "Infographic: Halliburton (HAL) reports strong earnings growth for Q2 2024",
      "summary": "Halliburton Company (NYSE: HAL) reported strong financial results for the second quarter of 2024, with a double-digit increase in net profit. Revenue increased by 1% annually to $5.83 billion, driven by international market demand which offset weakness in North America. The company's net profit rose to $713 million, or $0.80 per share, from $610 million, or $0.68 per share, in the prior year.",
      "url": "https://news.alphastreet.com/infographic-halliburton-hal-reports-strong-earnings-growth-for-q2-2024/",
      "source": "AlphaStreet",
      "published": "20240719T000000",
      "overall_sentiment_score": 0.200904,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.110005,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.613802
    },
    {
      "title": "Abbott Laboratories (ABT) Q2 2024 Earnings: Key financials and quarterly highlights",
      "summary": "Abbott Laboratories (NYSE: ABT) reported its Q2 2024 earnings, with net sales increasing 4% year-over-year to $10.4 billion. Net earnings decreased 5% to $1.3 billion, or $0.74 per share, while adjusted EPS rose 5.6% to $1.14. The company provided full-year 2024 guidance, expecting GAAP EPS of $3.30-3.40 and adjusted EPS of $4.61-4.71.",
      "url": "https://news.alphastreet.com/abbott-laboratories-abt-q2-2024-earnings-key-financials-and-quarterly-highlights/",
      "source": "AlphaStreet",
      "published": "20240718T000000",
      "overall_sentiment_score": 0.093175,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.094875,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.634497
    },
    {
      "title": "Kinder Morgan Earnings: New SNG Project to Serve Growing Power Demand",
      "summary": "Kinder Morgan's Q2 earnings were solid, reaffirming its 2024 guidance and narrow moat rating. The firm is well-positioned to meet demand from AI, data centers, and LNG exports. A significant development is the proposed $3 billion South System Expansion 4 project, designed to add 1.2 billion cubic feet per day to the Southern Natural Gas Pipeline, serving growing power generation needs in the Southeast including those from AI and data centers.",
      "url": "https://www.morningstar.com/stocks/kinder-morgan-earnings-new-sng-project-serve-growing-power-demand",
      "source": "Morningstar",
      "published": "20240718T000000",
      "overall_sentiment_score": 0.290285,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.104959,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.645856
    },
    {
      "title": "SLB Announces Second-Quarter 2024 Results",
      "summary": "SLB reported strong second-quarter 2024 results with revenue increasing 5% sequentially and 13% year-on-year to $9.14 billion. The company achieved diluted EPS, excluding charges and credits, of $0.85, up 13% sequentially and 18% year-on-year, driven by broad-based international growth and margin expansion across all divisions. SLB's CEO highlighted solid cash flow from operations of $1.44 billion and free cash flow of $776 million, with the Board approving a quarterly cash dividend of $0.275 per share.",
      "url": "https://www.businesswire.com/news/home/20240717947903/en/SLB-Announces-Second-Quarter-2024-Results",
      "source": "Business Wire",
      "published": "20240717T000000",
      "overall_sentiment_score": 0.59662,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.343079,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.622946
    },
    {
      "title": "PNC Earnings: Highlights of PNC Financial Services Group’s Q2 2024 report",
      "summary": "The PNC Financial Services Group reported a modest increase in revenues and net income for the second quarter of 2024, with net income attributable to common shareholders reaching $1.36 billion. The company also raised its quarterly cash dividend to $1.60 per share, and revenues increased by 2% annually to $5.41 billion. Management expects a growth trajectory towards record net interest income in 2025.",
      "url": "https://news.alphastreet.com/pnc-earnings-highlights-of-pnc-financial-services-groups-q2-2024-report/",
      "source": "AlphaStreet",
      "published": "20240716T000000",
      "overall_sentiment_score": 0.140926,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.115329,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.569667
    },
    {
      "title": "ExxonMobil and CF Industries announce blue ammonia retrofit of US fertiliser site",
      "summary": "ExxonMobil and CF Industries are retrofitting a US fertiliser site to produce \"blue ammonia.\" This low-carbon ammonia will be used for various industrial applications and will benefit from significant tax credits for carbon capture and storage. The project aims to reduce emissions and leverage financial incentives for sustainable practices.",
      "url": "https://www.hydrogeninsight.com/production/exxonmobil-and-cf-industries-announce-blue-ammonia-retrofit-of-us-fertiliser-site/2-1-1683472",
      "source": "Hydrogen Insight",
      "published": "20240726T090000",
      "overall_sentiment_score": 0.454609,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.434181,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.97709
    },
    {
      "title": "Exxon Mobil, CF Industries sign carbon capture and storage deal",
      "summary": "Exxon Mobil announced a carbon capture and storage (CCS) agreement with ammonia producer CF Industries. Under the deal, Exxon will transport and store up to 500,000 metric tons per year of captured CO2 from CF Industries' Mississippi complex, aiming to reduce the site's CO2 emissions by about 50% starting in 2028. This marks Exxon's fourth CCS project and second with CF Industries.",
      "url": "https://www.reuters.com/business/energy/exxon-mobil-cf-industries-sign-carbon-capture-storage-deal-2024-07-25/",
      "source": "Reuters",
      "published": "20240725T220800",
      "overall_sentiment_score": 0.312694,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.444251,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Vaalco Stock: Far More Energetic Management (NYSE:EGY)",
      "summary": "Vaalco Energy is diversifying its operations following its 2022 acquisition of TransGlobe Energy, particularly focusing on stable regions like Alberta, Canada. The company boasts a debt-free balance sheet with a substantial cash reserve, enabling opportunistic acquisitions with rapid payback due to limited competition. This strategic approach aims to reduce business risk and improve overall stability.",
      "url": "https://seekingalpha.com/article/4704450-vaalco-energy-far-more-energetic-management",
      "source": "Seeking Alpha",
      "published": "20240716T192600",
      "overall_sentiment_score": 0.496189,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.115358,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.603621
    },
    {
      "title": "Short-Term Selling of Lithium Could Yield to Long-Term Strength",
      "summary": "Despite short-term selling pressure on lithium due to an EV supply glut, long-term demand for electric vehicles suggests future strength for the metal. Prices fell significantly in June, but Sprott analysts believe a bottom may be near, citing that increased production from less efficient sources may be priced out and that forthcoming catalysts could drive recovery. Depressed prices present an opportunity for investors to consider long-term growth in the lithium mining sector, exemplified by ETFs like Sprott Lithium Miners ETF (LITP).",
      "url": "https://www.etftrends.com/gold-silver-investing-channel/short-term-selling-lithium-could-yield-long-term-strength/",
      "source": "ETF Trends",
      "published": "20240723T000000",
      "overall_sentiment_score": 0.270771,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.143903,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.640868
    },
    {
      "title": "US oil company ran 1977 article predicting climate crisis could cause starvation",
      "summary": "A 1977 article from Marathon World, a publication by Marathon Oil Company (predecesor to Marathon Petroleum), predicted global temperature rise linked to industrial expansion could lead to \"widespread starvation and other social and economic calamities.\" This discovery comes as Marathon Petroleum faces a lawsuit alleging it concealed its knowledge of catastrophic climate impacts. The article highlights that the company was aware of the potential dangers of climate change decades ago, similar to other major oil companies.",
      "url": "https://www.theguardian.com/us-news/article/2024/jul/18/us-oil-marathon-petroleum-climate-change",
      "source": "The Guardian",
      "published": "20240718T080000",
      "overall_sentiment_score": -0.295647,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.276241,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.658239
    }
  ]
}