{
  "ticker": "XOM",
  "date": "2025-08-11",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T13:43:20.500965",
  "source": "alpha_vantage",
  "article_count": 25,
  "articles": [
    {
      "title": "Vanguard vs. Fidelity: Which Is the Better High-Yield ETF to Buy Now?",
      "summary": "This article compares two high-yield ETFs, Vanguard High Dividend Yield ETF (VYM) and Fidelity High Dividend ETF (FDVV), to determine which is a better buy for 2025. While both offer compelling features for income-focused investors, the article concludes that VYM is the superior choice due to its ultra-low expense ratio, broader diversification, and focus on stable, high-yield companies, despite FDVV offering a higher yield and growth potential.",
      "url": "https://247wallst.com/investing/2025/08/09/vanguard-vs-fidelity-which-is-the-better-high-yield-etf-to-buy-now/",
      "source": "24/7 Wall St.",
      "published": "20250809T100600",
      "overall_sentiment_score": 0.307487,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.346355,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.613309
    },
    {
      "title": "Oxy combines big revenues with decisive debt reduction",
      "summary": "Occidental Petroleum Corp. announced strong second-quarter results with $2.6 billion in operating cash flow and a significant $7.5 billion debt reduction within 13 months of acquiring CrownRock Corp. The company also highlighted exceeding production guidance, achieving higher cash flow despite lower oil prices, and making progress on its Stratos direct air capture plant, with trains one and two transitioning to operations.",
      "url": "https://www.oaoa.com/local-news/oxy-combines-big-revenues-with-decisive-debt-reduction/",
      "source": "Odessa American",
      "published": "20250808T000000",
      "overall_sentiment_score": 0.251184,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.134487,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.550338
    },
    {
      "title": "Take-Two Interactive (TTWO) Q1 FY26 loss narrows on higher revenues",
      "summary": "Take-Two Interactive (TTWO) reported a narrower net loss for the first quarter of fiscal year 2026, driven by higher-than-expected revenues. The gaming company's revenues increased to $1.50 billion, and net bookings rose to $1.42 billion, leading to a significant reduction in net loss per share. The company also raised its Fiscal Year 2026 Net Bookings outlook due to their strong start to the fiscal year.",
      "url": "https://news.alphastreet.com/take-two-interactive-ttwo-q1-fy26-loss-narrows-on-higher-revenues/",
      "source": "AlphaStreet",
      "published": "20250807T000000",
      "overall_sentiment_score": 0.221286,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.123987,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.60128
    },
    {
      "title": "Oxy Earnings: Results Were as Expected; Capital Moves Favor Bondholders",
      "summary": "Morningstar has slightly lowered its fair value estimate for Occidental Petroleum (OXY) to $58 per share, despite results aligning with guidance. The company's capital allocation strategy now prioritizes debt repayment over shareholder returns, largely due to the CrownRock acquisition. While drilling efficiencies improved in the Permian basin, higher-than-expected operating expenses for Q3 were mostly offset by reduced capital expenditure guidance.",
      "url": "https://www.morningstar.com/stocks/oxy-earnings-results-were-expected-capital-moves-favor-bondholders",
      "source": "Morningstar",
      "published": "20250807T000000",
      "overall_sentiment_score": 0.045136,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.12823,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.606216
    },
    {
      "title": "US ETF becomes substantial shareholder of SGX-listed small-cap; has stakes in 30 S’pore stocks",
      "summary": "The Avantis International Small Cap Value ETF (AVDV), managed by American Century Investments, has become a substantial shareholder in Singapore-listed oil company Rex International by increasing its stake to 5.3%. This marks the first time an ETF has become a substantial shareholder of an SGX-listed small-cap company. The investment is seen as a potential positive trend for Singapore's small-cap companies, boosting liquidity and attracting further institutional interest.",
      "url": "https://www.straitstimes.com/business/companies-markets/us-etf-becomes-substantial-shareholder-of-sgx-listed-small-cap-has-stakes-in-30-spore-stocks",
      "source": "The Straits Times",
      "published": "20250805T050000",
      "overall_sentiment_score": 0.117565,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.205102,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.623359
    },
    {
      "title": "Second quarter 2025 results",
      "summary": "BP announced its second-quarter 2025 results, reporting an underlying replacement cost (RC) profit of $2.4 billion and operating cash flow of $6.3 billion. The company highlighted strong operational performance, progress in portfolio enhancement and divestments, and the delivery of structural cost reductions. BP also declared a dividend of 8.32 cents per ordinary share and a new $750 million share buyback.",
      "url": "https://www.bp.com/en/global/corporate/news-and-insights/press-releases/second-quarter-2025-results.html",
      "source": "bp global",
      "published": "20250805T000000",
      "overall_sentiment_score": 0.300623,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.229399,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.61852
    },
    {
      "title": "Libya's NOC signs memorandum of understanding with ExxonMobil after decade of inactivity",
      "summary": "Libya's National Oil Corporation (NOC) has signed a memorandum of understanding with U.S. oil giant ExxonMobil, marking a return to activity after a decade-long halt due to security concerns. The agreement focuses on conducting geological and geophysical studies to identify hydrocarbon resources in four offshore blocks and the Sirte Basin. ExxonMobil had previously reduced its operations in Libya in 2013 due to growing instability following the 2011 uprisings.",
      "url": "https://www.reuters.com/business/energy/libyas-noc-signs-memorandum-understanding-with-exxonmobil-after-decade-2025-08-04/",
      "source": "Reuters",
      "published": "20250804T215500",
      "overall_sentiment_score": 0.405657,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.439015,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Shell Finalizes $1.45 Billion Sale of Colonial Enterprises Stake to Brookfield",
      "summary": "Shell has completed the sale of its 16.125% stake in Colonial Enterprises, Inc. to Brookfield Infrastructure Partners L.P. for $1.45 billion, including non-recourse debt. This divestment aligns with Shell's strategy to streamline operations and focus on core businesses. Brookfield, through its subsidiary Colossus AcquireCo LLC, now owns 100% of Colonial Enterprises, which operates the crucial Colonial Pipeline Company.",
      "url": "https://www.chemanalyst.com/NewsAndDeals/NewsDetails/shell-finalizes-1-45-billion-sale-of-colonial-enterprises-stake-to-brookfield-38326",
      "source": "ChemAnalyst",
      "published": "20250801T135732",
      "overall_sentiment_score": 0.207274,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.111202,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.623873
    },
    {
      "title": "Exxon Mobil Corp reports results for the quarter ended June 30 - Earnings Summary",
      "summary": "Exxon Mobil Corp reported adjusted earnings of $1.64 per share for the quarter ended June 30, beating analyst expectations of $1.54 per share, despite being lower than the previous year. Revenue for the quarter fell 12.4% to $81.51 billion, though it still surpassed analyst estimates. Analysts currently rate Exxon Mobil as a \"buy\" with a median 12-month price target of $124.50.",
      "url": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3TT172:0-exxon-mobil-corp-reports-results-for-the-quarter-ended-june-30-earnings-summary/",
      "source": "TradingView",
      "published": "20250801T113100",
      "overall_sentiment_score": 0.438168,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.434774,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Exxon Mobil, Chevron say oil production is booming and they’re rolling in cash",
      "summary": "Exxon Mobil and Chevron reported record-high oil production levels and increased free cash flow, leading to rising stock prices for both companies. Chevron specifically highlighted record worldwide and U.S. net oil-equivalent production, with significant jumps in output from Tengizchevroil, Gulf of America, and the Permian Basin. These strong financial results and production figures exceeded expectations, further boosting investor confidence.",
      "url": "https://www.marketwatch.com/story/chevrons-stock-gains-amid-record-oil-production-and-as-free-cash-flow-more-than-doubles-9b677e9c?gaa_at=eafs&gaa_n=AWEtsqfY4j4ClvlZfmZ-43hO_uVG9Kzkh_-jOksZExDhaD-5TnzV_AX4dxO5&gaa_ts=690748e0&gaa_sig=FdogHmAVbFApnNJVUMF--q1ldQSJwCxAziUjlU2SUstgvOm3059BxBCTjAqFWGNxD8hcJkTI7KOkjKvQuicAaw%3D%3D",
      "source": "MarketWatch",
      "published": "20250801T103300",
      "overall_sentiment_score": 0.719068,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.724963,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "ExxonMobil beats Q2 profit estimates on strong output, higher refining margins",
      "summary": "ExxonMobil exceeded Q2 profit estimates due to record production from the Permian Basin and strong refining margins, despite a decrease in net income from lower commodity prices. The company reported adjusted earnings of $1.64 per share and revenue of $81.51 billion, highlighting its strong cost structure and advantaged portfolio. ExxonMobil also progressed on major projects and achieved significant structural cost savings.",
      "url": "https://www.proactiveinvestors.com/companies/news/1075941/exxonmobil-beats-q2-profit-estimates-on-strong-output-higher-refining-margins-1075941.html",
      "source": "Proactive financial news",
      "published": "20250801T093600",
      "overall_sentiment_score": 0.476589,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.495248,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "CVR Energy, Inc. (NYSE:CVI) Q2 2025 Earnings Call Transcript",
      "summary": "CVR Energy, Inc. reported a Q2 2025 consolidated net loss of $90 million and an EBITDA loss of $24 million, impacted by RIN obligations and reduced throughputs. Despite challenges in refining and renewable segments, the fertilizer segment showed strong performance. The company is focused on deleveraging and exploring future dividend reinstatements while CEO Dave Lamp announced his retirement.",
      "url": "https://www.insidermonkey.com/blog/cvr-energy-inc-nysecvi-q2-2025-earnings-call-transcript-1581745/",
      "source": "Insider Monkey",
      "published": "20250801T081300",
      "overall_sentiment_score": 0.235545,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.103747,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.528152
    },
    {
      "title": "Exxon Mobil, Chevron say oil production is booming and they’re rolling in cash",
      "summary": "Exxon Mobil and Chevron reported strong second-quarter results, with profit and free cash flow exceeding expectations. Both oil giants achieved historic production levels, driving an increase in their stock prices and indicating continued financial success for the companies.",
      "url": "https://www.marketwatch.com/story/chevrons-stock-gains-amid-record-oil-production-and-as-free-cash-flow-more-than-doubles-9b677e9c?gaa_at=eafs&gaa_n=AWEtsqfb0LXxDMbq57hPqfOKkth4pdnd_KsFdADa-alw8BjbQYBlZmGIhN1N&gaa_ts=690747a6&gaa_sig=pere-uXzIAim8J4YdSSrTFFJUs2wxNlFToWjLPCXFe-KZxUMbqaZ6bM8-w-AnDOdWSA51I3YptTcUoRZjlLxnQ%3D%3D",
      "source": "MarketWatch",
      "published": "20250801T063300",
      "overall_sentiment_score": 0.447924,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.439865,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Fluor–JGC JV picks up FEED job for Canadian LNG plant’s expansion",
      "summary": "A joint venture between Fluor Corporation and JGC Holdings Corporation has secured the front-end engineering and design (FEED) contract for the proposed Phase 2 expansion of the LNG Canada facility in Kitimat, British Columbia. This award follows their successful work on Phase 1 of the project, highlighting their continued partnership with LNG Canada. While the expansion would increase the plant's capacity and processing capabilities, a final investment decision has not yet been made by the five joint venture participants.",
      "url": "https://www.offshore-energy.biz/fluor-jgc-jv-picks-up-feed-job-for-canadian-lng-plants-expansion/",
      "source": "Offshore-Energy.biz",
      "published": "20250801T031402",
      "overall_sentiment_score": 0.372443,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.334117,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.600197
    },
    {
      "title": "ExxonMobil actively seeking acquisitions, says CEO",
      "summary": "Exxon Mobil Corp. CEO Darren Woods stated that the company is actively looking for opportunities to acquire smaller rivals, a year after its $60 billion purchase of Pioneer Natural Resources Co. Woods emphasized that acquisitions would focus on creating value through combining assets and expertise, rather than just increasing size, aiming for a \"one plus one equaling more than three\" outcome for shareholders. He clarified that any deal must drive more value for combined shareholders than either company could achieve alone and would not involve significant layoffs.",
      "url": "https://worldoil.com/news/2025/8/1/exxonmobil-actively-seeking-acquisitions-says-ceo/",
      "source": "World Oil",
      "published": "20250801T000000",
      "overall_sentiment_score": 0.193479,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.452691,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "ExxonMobil Earnings: Growing Production and Cost Reductions Help Mitigate Lower Commodity Prices",
      "summary": "ExxonMobil's second-quarter earnings surpassed market expectations despite lower oil prices and refining margins, driven by strong volume growth, structural cost reductions, and contributions from new projects. The company's production of 4.6 million barrels of oil equivalent per day marked a 1.7% increase from the first quarter, representing its highest second-quarter performance in 25 years. Morningstar maintains its narrow moat rating and $135 fair value estimate for ExxonMobil, noting that the shares currently trade at a nearly 20% discount, as the market may not be fully recognizing the company's achievable 2030 targets.",
      "url": "https://www.morningstar.com/stocks/exxonmobil-earnings-growing-production-cost-reductions-help-mitigate-lower-commodity-prices",
      "source": "Morningstar",
      "published": "20250801T000000",
      "overall_sentiment_score": 0.233292,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.344014,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Ford Motor Company (F) Q2 adj. earnings drop despite higher revenues",
      "summary": "Ford Motor Company reported a decline in adjusted earnings for the second quarter of fiscal 2025 to $0.37 per share, despite a 5% increase in revenues to $50.2 billion. The company cited special charges and expenses related to an EV program cancellation as reasons for the earnings drop. Ford reinstated its full-year 2025 adjusted EBIT guidance and expects significant tariff-related headwinds.",
      "url": "https://news.alphastreet.com/ford-motor-company-f-q2-adj-earnings-drop-despite-higher-revenues/",
      "source": "AlphaStreet",
      "published": "20250731T000000",
      "overall_sentiment_score": -0.162171,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.25254,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.592817
    },
    {
      "title": "Exxon starts production at fourth floating oil vessel in Guyana",
      "summary": "An Exxon Mobil-led consortium has begun production at its fourth floating production, storage and offloading vessel, \"One Guyana,\" at the Stabroek Block in Guyana. This increases the total capacity from the oilfield to over 900,000 barrels of oil per day, moving the joint venture closer to its 2030 target of 1.7 million barrels of oil equivalent per day. The launch of \"One Guyana\" was four months ahead of schedule and will develop the Yellowtail and Redtail fields, marketing its crude as Golden Arrowhead.",
      "url": "https://www.reuters.com/business/energy/exxon-starts-production-fourth-floating-oil-vessel-guyana-2025-08-08/",
      "source": "Reuters",
      "published": "20250808T143500",
      "overall_sentiment_score": 0.221738,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.415869,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Imperial Oil optimistic about major projects talks with federal government",
      "summary": "Imperial Oil's CEO, John Whelan, expressed optimism regarding discussions with the federal government about supporting industry projects, following the passing of Bill C-5 which aims to speed up permitting for nation-building initiatives. The company reported a net income of $949 million in its second quarter, down from $1.13 billion last year, but highlighted the completion of Canada's largest renewable diesel facility at its Strathcona refinery and strong upstream production. Whelan also noted that the Trans Mountain pipeline expansion boosted petroleum product sales.",
      "url": "https://canada.constructconnect.com/dcn/news/government/2025/08/imperial-oil-optimistic-about-major-projects-talks-with-federal-government",
      "source": "constructconnect.com",
      "published": "20250807T090844",
      "overall_sentiment_score": -0.066512,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.090692,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.705542
    },
    {
      "title": "Imperial Oil optimistic about major projects talks with federal government",
      "summary": "Imperial Oil Ltd.'s CEO, John Whelan, expressed optimism regarding ongoing discussions with the federal government about supporting major industry projects, following the passing of Bill C-5 (Building Canada Act). This positive outlook comes as the company reported its second-quarter results, showing a decrease in net income and total revenue compared to the previous year, despite increased petroleum product sales and upstream production. Imperial also highlighted the completion and start of production at its renewable diesel facility, the largest of its kind in Canada.",
      "url": "https://canada.constructconnect.com/joc/news/government/2025/08/imperial-oil-optimistic-about-major-projects-talks-with-federal-government",
      "source": "constructconnect.com",
      "published": "20250807T000000",
      "overall_sentiment_score": 0.213538,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.32085,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.712119
    },
    {
      "title": "Why Is BP Stock Gaining Tuesday? - BP (NYSE:BP)",
      "summary": "BP's stock is gaining due to better-than-expected Q2 2025 earnings, despite revenue falling short of analyst expectations. The company also announced a 4% increase in its quarterly dividend and launched a $750 million share buyback program. BP maintains its full-year 2025 outlook, focusing on growing upstream and focusing downstream operations.",
      "url": "https://www.benzinga.com/markets/earnings/25/08/46850944/bp-maintains-outlook-hikes-dividend-and-rolls-out-750-million-share-buyback",
      "source": "Benzinga",
      "published": "20250805T000903",
      "overall_sentiment_score": 0.164528,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.110112,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.609353
    },
    {
      "title": "BlackRock Pivots from Sustainability Evangelists to Fossil-Fuel Funders",
      "summary": "BlackRock is accused of greenwashing, as it continues to invest billions in fossil fuel companies through its \"sustainable\" funds despite previous commitments to sustainability. The article highlights the discrepancy between BlackRock's public stance on ESG and its investment practices, particularly in light of CEO Larry Fink's changing rhetoric and the company's departure from net-zero initiatives. Regulatory bodies and NGOs are raising concerns about the misleading nature of these \"green\" labels and the lack of real impact from BlackRock's sustainable investing strategies.",
      "url": "https://www.desmog.com/2025/08/01/blackrock-pivots-from-sustainability-evangelists-to-fossil-fuel-funders/",
      "source": "DeSmog",
      "published": "20250801T082700",
      "overall_sentiment_score": -0.378446,
      "overall_sentiment_label": "Bearish",
      "ticker_sentiment_score": -0.421152,
      "ticker_sentiment_label": "Bearish",
      "relevance_score": 0.622664
    },
    {
      "title": "Exxon, Chevron report record oil production for second quarter",
      "summary": "Exxon Mobil Corp. and Chevron Corp. reported better-than-expected Q2 results, driven by record oil production which softened the impact of lower crude prices. Exxon achieved its highest Q2 output in over 25 years, while Chevron hit an all-time high of nearly 4 million bpd, leading to shares climbing for both companies. Despite the strong performance, Chevron anticipates potential price pressure in the second half of the year due to increased supply.",
      "url": "https://www.worldoil.com/news/2025/8/1/exxon-chevron-report-record-oil-production-for-second-quarter/",
      "source": "World Oil",
      "published": "20250801T000000",
      "overall_sentiment_score": 0.311836,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.326853,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Trump To Russia: End Ukraine War In 10 Days Or Face Tariffs — Oil Approaches $70",
      "summary": "President Trump issued an ultimatum to Russia, demanding an end to the Ukraine conflict within 10 days or face new tariffs and sanctions. This shortened deadline, from an initial 50 days, has introduced volatility into global oil markets, with crude oil futures already approaching $70 per barrel. Trump dismissed concerns about oil market disruption, pledging to boost domestic production and warning China about secondary sanctions if it continues to purchase Russian oil.",
      "url": "https://www.benzinga.com/news/politics/25/07/46713772/trump-to-russia-end-ukraine-war-in-10-days-or-face-tariffs-oil-approaches-70",
      "source": "Benzinga",
      "published": "20250730T120901",
      "overall_sentiment_score": 0.208964,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.183012,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.61923
    },
    {
      "title": "Fueling the future: Renewable diesel production begins at Strathcona Refinery",
      "summary": "ExxonMobil's majority-owned affiliate, Imperial Oil Limited, has started renewable diesel production at its Strathcona Refinery in Canada. This facility is projected to be Canada's largest, capable of producing up to 20,000 barrels per day of lower greenhouse gas emission fuels. It will supply customers in Western Canada and Imperial operations in Northern Alberta, sourcing bio-feedstocks from Canadian agricultural suppliers.",
      "url": "https://corporate.exxonmobil.com/locations/canada/renewable-diesel-production-at-strathcona-refinery",
      "source": "Exxon Mobil Corporation",
      "published": "20250805T000000",
      "overall_sentiment_score": 0.34935,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.725445,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.805199
    }
  ]
}