{
  "ticker": "XOM",
  "date": "2025-07-21",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T13:43:06.555180",
  "source": "alpha_vantage",
  "article_count": 25,
  "articles": [
    {
      "title": "Pioneer founder Scott Sheffield no longer wants to join Exxon board after FTC ruling",
      "summary": "Pioneer founder Scott Sheffield has stated he no longer wishes to join Exxon Mobil Corp.’s board, despite the U.S. Federal Trade Commission clearing the way for him to do so. Sheffield criticized Exxon's previous actions to bar him, stemming from accusations by the FTC that he and Hess Corp. CEO John Hess sought to coordinate with OPEC on oil pricing and output. This decision comes after a change in FTC leadership, with the new chairman having previously dissented from the original ban.",
      "url": "https://www.dallasnews.com/business/energy/2025/07/18/pioneer-founder-scott-sheffield-no-longer-wants-to-join-exxon-board-after-ftc-ruling/",
      "source": "Dallas News",
      "published": "20250718T095900",
      "overall_sentiment_score": 0.10759,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.107912,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 1.0
    },
    {
      "title": "Exxon Sees $1.5B Earnings Hit From Lower Oil, Gas Prices",
      "summary": "Exxon Mobil Corp. anticipates a $1.5 billion reduction in its second-quarter earnings due to lower oil and gas prices. While oil and gas prices negatively impacted earnings by $1 billion and $500 million respectively, refining margins are expected to provide a $300 million uplift. This guidance is consistent with analysts' estimates, distinguishing Exxon from Shell due to its smaller trading organization.",
      "url": "https://www.rigzone.com/news/wire/exxon_sees_15b_earnings_hit_from_lower_oil_gas_prices-08-jul-2025-181080-article/",
      "source": "Rigzone",
      "published": "20250708T170000",
      "overall_sentiment_score": -0.419229,
      "overall_sentiment_label": "Bearish",
      "ticker_sentiment_score": -0.43149,
      "ticker_sentiment_label": "Bearish",
      "relevance_score": 1.0
    },
    {
      "title": "Exxon Mobil expects $1.5B hit to Q2 earnings from lower oil and gas prices",
      "summary": "Exxon Mobil announced an expected $1.5 billion hit to its second-quarter earnings due to lower oil and gas prices. The company anticipates a profit decline from falling liquids prices between $800 million and $1.2 billion, and an additional $300 million to $700 million reduction from lower natural gas prices. Despite these challenges, Exxon Mobil expects refining margins to partially offset the negative impact, potentially boosting earnings by about $300 million.",
      "url": "https://www.proactiveinvestors.com/companies/news/1074339/exxon-mobil-expects-1-5b-hit-to-q2-earnings-from-lower-oil-and-gas-prices-1074339.html",
      "source": "Proactive financial news",
      "published": "20250708T105600",
      "overall_sentiment_score": -0.297816,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.291998,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 1.0
    },
    {
      "title": "DOE approves giving ExxonMobil a million barrels of oil from reserve",
      "summary": "The U.S. Department of Energy approved an exchange from the Strategic Petroleum Reserve with ExxonMobil Corp., providing up to one million barrels of crude oil to address delivery issues at ExxonMobil's Baton Rouge refinery. This move aims to stabilize transportation fuel supplies in Louisiana and the Gulf Coast. ExxonMobil will return the borrowed oil, plus additional barrels, at no cost to taxpayers.",
      "url": "https://www.upi.com/Top_News/US/2025/07/11/ExxonMobil-DOE-Wright-crude-oil-million-barrels/2301752254186/",
      "source": "upi",
      "published": "20250711T144300",
      "overall_sentiment_score": 0.427732,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.429162,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.966507
    },
    {
      "title": "Chevron prevails over Exxon in Hess megamerger, and it matters for Chevron’s stock",
      "summary": "International arbitrators ruled in favor of Chevron's merger with Hess Corp. after nearly two years of waiting, providing relief to Chevron Corp. investors. The decision resolves a dispute with Exxon Mobil Corp. over Hess's assets in Guyana, which had created an overhang for Chevron's stock. This outcome is significant for Chevron's stock performance as it clears the path for the acquisition of key Hess assets, including those in North Dakota and Guyana.",
      "url": "https://www.marketwatch.com/story/chevron-prevails-over-exxon-in-hess-megamerger-and-it-matters-for-chevrons-stock-d7613b4b?gaa_at=eafs&gaa_n=AWEtsqc8sxRHHncDxHQqlPxifxKPwlKCr7Ve-CkyaSjJGB-53wmT--UliKVO&gaa_ts=690747b0&gaa_sig=3W0t7ACajYWQlLVtIj1EF8eXqxQLs_5MqiegBZhVBFz2hnyufbxfVH4qO5AFPk-OUuQ53m7eMWxjMbLEcGmFmg%3D%3D",
      "source": "MarketWatch",
      "published": "20250718T114700",
      "overall_sentiment_score": 0.077147,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.324967,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.950448
    },
    {
      "title": "The 10 best US dividend stocks",
      "summary": "This article identifies the 10 best US dividend stocks for 2025, emphasizing the importance of dividend durability and economic moats over high yields. The selection is based on Morningstar's Dividend Yield Focus Index, featuring undervalued companies with strong financial health and competitive advantages. Each stock is presented with key Morningstar metrics and analyst insights.",
      "url": "https://www.morningstar.com.au/stocks/10-best-us-dividend-stocks",
      "source": "Morningstar",
      "published": "20250718T162704",
      "overall_sentiment_score": 0.397686,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.463865,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.867725
    },
    {
      "title": "CF Industries Initiates Landmark CO2 Sequestration at Donaldsonville Complex",
      "summary": "CF Industries has successfully started its CO2 dehydration and compression unit at the Donaldsonville Complex in Louisiana, marking a significant step towards decarbonization. This initiative, in collaboration with ExxonMobil, facilitates the permanent geological sequestration of up to 2 million metric tons of CO2 annually and will enable CF Industries to produce approximately 1.9 million tons of low-carbon ammonia, qualifying for significant 45Q tax credits. The project underscores a strategic business decision positioning CF Industries at the forefront of the low-carbon economy.",
      "url": "https://www.chemanalyst.com/NewsAndDeals/NewsDetails/cf-industries-initiates-landmark-co2-sequestration-at-donaldsonville-complex-37964",
      "source": "ChemAnalyst",
      "published": "20250716T000000",
      "overall_sentiment_score": 0.497572,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.439926,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.823653
    },
    {
      "title": "Chevron vence batalha contra Exxon e fecha acordo de US$ 53 bi para comprar a Hess",
      "summary": "Chevron Corp. venceu a disputa de arbitragem contra a Exxon Mobil Corp. e concluiu seu acordo de US$ 53 bilhões para adquirir a Hess Corp. A decisão resolve um impasse estratégico e garante à Chevron uma participação crucial no Bloco Stabroek na Guiana, fortalecendo seu portfólio de ativos de petróleo. O CEO da Chevron, Mike Wirth, destacou a fusão como um sucesso que \"reúne o que há de melhor no setor\".",
      "url": "https://valor.globo.com/empresas/noticia/2025/07/18/chevron-vence-batalha-contra-exxon-e-fecha-acordo-de-us-53-bi-para-comprar-a-hess.ghtml",
      "source": "Valor Econômico",
      "published": "20250718T110300",
      "overall_sentiment_score": 0.121442,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.212769,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.802787
    },
    {
      "title": "CF Industries starts up carbon sequestration facility",
      "summary": "CF Industries has commenced operations at its new carbon dioxide dehydration and compression plant in Louisiana, capable of capturing and storing up to 2 million metric tons of CO₂ annually. In partnership with ExxonMobil, the captured CO₂ will be stored geologically, qualifying CF Industries for 45Q tax credits and advancing its strategy to decarbonize global ammonia production. The project also benefits from a draft EPA Class VI permit for ExxonMobil's CCS Rose project, which could accelerate CO₂ storage on the Gulf Coast.",
      "url": "https://inspenet.com/en/noticias/cf-industries-starts-up-carbon-sequestration-facility/",
      "source": "Inspenet",
      "published": "20250714T000000",
      "overall_sentiment_score": 0.401903,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.333608,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.800466
    },
    {
      "title": "Why Free Cash Flow Drives Superior Stock Performance",
      "summary": "Legendary investor Warren Buffett highlights free cash flow as the most crucial valuation metric, especially as intangible assets now dominate company balance sheets. Analysts at Lord Abbett found that portfolios focused on free cash flow yield significantly outperformed those based on price-to-book value over two decades. Several ETFs, such as the Pacer U.S. Cash Cows 100 ETF, VictoryShares Free Cash Flow ETF, and Invesco Nasdaq Free Cash Flow Achievers ETF, utilize this metric to select companies with strong financial health and growth prospects, including top holdings like Exxon Mobil, Qualcomm, and NVIDIA.",
      "url": "https://finance.yahoo.com/news/why-free-cash-flow-drives-164200231.html",
      "source": "Yahoo Finance",
      "published": "20250717T000000",
      "overall_sentiment_score": 0.329775,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.308027,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.748538
    },
    {
      "title": "Chevron prevails over Exxon in Hess megamerger, and it matters for Chevron’s stock",
      "summary": "An international arbitration court ruled in favor of Chevron's merger with Hess Corp. after nearly two years. This decision comes after Exxon Mobil Corp. had challenged Chevron over Hess's assets in Guyana, which created an overhang for Chevron's stock. The resolution of this dispute is expected to positively impact Chevron's investors.",
      "url": "https://www.marketwatch.com/story/chevron-prevails-over-exxon-in-hess-megamerger-and-it-matters-for-chevrons-stock-d7613b4b?gaa_at=eafs&gaa_n=AWEtsqcdZsooIazKGAOafe1pF3ToKCGOzSfqb4VnjFBwui5fmvAf_Q0ARSNn&gaa_ts=690748f2&gaa_sig=Rg3ofsrs6dJEfDXl_-t4k4omjQKqpQw7uK07Ocv8gY7SsFj6Nx65hRQmDEFCfoqJpOiEClkGgLGIdGFLdMfdlw%3D%3D",
      "source": "MarketWatch",
      "published": "20250718T114700",
      "overall_sentiment_score": 0.146743,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.239114,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.731836
    },
    {
      "title": "XenoTherapeutics to acquire ESSA Pharma in deal backed by XOMA Royalty",
      "summary": "XenoTherapeutics Inc., a U.S. nonprofit specializing in xenotransplantation therapies, plans to acquire ESSA Pharma Inc., a Vancouver-based pharmaceutical company, in an all-cash deal backed by XOMA Royalty Corporation. The acquisition, valued at approximately US$1.91 per share, aims to provide an exit for ESSA's shareholders following setbacks in its prostate cancer drug development and will allow XenoTherapeutics to leverage ESSA's public listing for its future development efforts. The transaction is expected to close in the second half of 2025, subject to regulatory and shareholder approvals.",
      "url": "https://www.canadianlawyermag.com/news/general/xenotherapeutics-to-acquire-essa-pharma-in-deal-backed-by-xoma-royalty/392759",
      "source": "Canadian Lawyer Mag",
      "published": "20250715T045920",
      "overall_sentiment_score": 0.07779,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.201674,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.731534
    },
    {
      "title": "Q3 2025 US stock market outlook: After the rally, what’s still undervalued?",
      "summary": "The Q3 2025 US stock market outlook suggests that after a strong rally, the market is trading at a premium to fair value, with growth stocks especially overvalued. The article highlights that value and small-cap stocks remain attractively priced, particularly in the healthcare, energy, communications, and real estate sectors. Investors are advised to rebalance portfolios, taking profits from overvalued assets and reinvesting in undervalued areas to prepare for potential market volatility stemming from tariff deadlines and earnings season.",
      "url": "https://www.morningstar.com.au/markets/q3-2025-us-stock-market-outlook-after-rally-whats-still-undervalued",
      "source": "Morningstar",
      "published": "20250710T000000",
      "overall_sentiment_score": 0.345668,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.278973,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.728493
    },
    {
      "title": "Chevron completes $53 billion Hess takeover following lengthy Exxon arbitration",
      "summary": "Chevron has finalized its $53 billion acquisition of Hess Corporation after winning an arbitration against ExxonMobil regarding Hess's offshore Guyana assets, which had delayed the deal for over a year. The combined company now boasts a strong portfolio in critical energy markets, including a 30% position in Guyana's Stabroek Block and significant U.S. Bakken assets. This strategic move is expected to drive substantial free cash flow and production growth, with $1 billion in annual cost synergies anticipated by the end of 2025.",
      "url": "https://www.worldoil.com/news/2025/7/18/chevron-completes-53-billion-hess-takeover-following-lengthy-exxon-arbitration/",
      "source": "World Oil",
      "published": "20250718T081008",
      "overall_sentiment_score": -0.093013,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.221916,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.712145
    },
    {
      "title": "1 Big Beautiful Bill Could Energize This ETF Trio",
      "summary": "A proposed bill by President Trump, dubbed the \"One Big Beautiful Bill,\" aims to significantly boost the oil and gas industry by opening up federal lands and waters for drilling, mandating numerous lease sales in the Gulf of America. This legislative push could provide a substantial tailwind for leveraged ETFs focused on the energy sector. Direxion's GUSH, ERX, and XOMX ETFs are highlighted as potential beneficiaries, offering leveraged exposure to oil and gas exploration, broader energy companies, and single-stock Exxon Mobil, respectively.",
      "url": "https://etfdb.com/leveraged-inverse-content-hub/1-big-beautiful-bill-energize-leveraged-etf-trio/",
      "source": "ETF Database",
      "published": "20250714T052156",
      "overall_sentiment_score": 0.379519,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.403593,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.700099
    },
    {
      "title": "Going Into Earnings, Is Netflix Stock a Buy, a Sell, or Fairly Valued?",
      "summary": "Morningstar provides an outlook on Netflix (NFLX) ahead of its Q2 2025 earnings report, assessing whether the stock is a buy, sell, or fairly valued. The article highlights key metrics such as a $750 fair value estimate, a narrow economic moat, and high uncertainty, while discussing what to watch for in the earnings report, including subscriber gains, advertising revenue commentary, and international growth. Despite strong financial health and free cash flow projections, Morningstar believes Netflix stock is significantly overvalued at its current price.",
      "url": "https://www.morningstar.com/stocks/going-into-earnings-is-netflix-stock-buy-sell-or-fairly-valued-7",
      "source": "Morningstar",
      "published": "20250711T000000",
      "overall_sentiment_score": -0.146838,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.135889,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.640478
    },
    {
      "title": "Going into Earnings, Is Schwab Stock a Buy, a Sell, or Fairly Valued?",
      "summary": "This article from Morningstar assesses Charles Schwab (SCHW) stock ahead of its Q2 2025 earnings release. It delves into key metrics like cash sweep trends and net interest margin guidance, concluding that the stock is fairly valued with a wide economic moat despite a high uncertainty rating. Investors are advised to watch commentary on cash sweeps and NIM guidance.",
      "url": "https://www.morningstar.com/stocks/going-into-earnings-is-schwab-stock-buy-sell-or-fairly-valued-4",
      "source": "Morningstar",
      "published": "20250714T000000",
      "overall_sentiment_score": 0.119308,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.109791,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.633007
    },
    {
      "title": "This Is Why I Would Buy SPXL",
      "summary": "The Direxion Daily S&P 500 Bull 3X Shares ETF (SPXL) offers triple-magnified exposure to the S&P 500, making it an attractive option for investors seeking aggressive growth. While highly volatile due to its leverage and daily rebalancing, the author suggests SPXL can be used safely by limiting its allocation in a portfolio and balancing it with un-leveraged ETFs like SPY. The article highlights SPXL's historical performance, quarterly dividends, and the importance of using it cautiously within a diversified strategy.",
      "url": "https://247wallst.com/investing/2025/07/07/this-is-why-i-would-buy-spxl/",
      "source": "24/7 Wall St.",
      "published": "20250707T124800",
      "overall_sentiment_score": 0.263271,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.248403,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.624509
    },
    {
      "title": "Charles Schwab Earnings: Firing on All Cylinders Amid Heavy Trading",
      "summary": "Charles Schwab reported strong second-quarter results, exceeding expectations in client trading volume, net new asset growth, and net interest margin improvement. The company's robust client inflows and expense discipline led to a significant improvement in its adjusted operating margin. Morningstar has raised its fair value estimate for Schwab stock to $105 per share, citing a stronger capital markets outlook and expected cost efficiency gains.",
      "url": "https://www.morningstar.com/stocks/charles-schwab-earnings-firing-all-cylinders-amid-heavy-trading",
      "source": "Morningstar",
      "published": "20250718T000000",
      "overall_sentiment_score": 0.323383,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.12497,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.617953
    },
    {
      "title": "LVHD Can Provide Investors With Stability And Income (NASDAQ:LVHD)",
      "summary": "The Franklin U.S. Low Volatility High Dividend Index ETF (LVHD) offers a differentiated strategy focused on profitable U.S. companies with durable dividends, featuring diversification caps and a preference for defensive sectors. It has low fees, a 3.47% yield, and has outperformed peers over 1- and 5-year periods. The article recommends LVHD as a Buy with a 3-6% portfolio allocation due to its income potential, volatility management, and diversification.",
      "url": "https://seekingalpha.com/article/4801736-lvhd-can-provide-investors-with-stability-and-income",
      "source": "Seeking Alpha",
      "published": "20250716T172900",
      "overall_sentiment_score": 0.061018,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.123313,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.61093
    },
    {
      "title": "CF Industries Q2 2025 slides: Strong cash flow despite market undervaluation",
      "summary": "CF Industries reported robust Q2 2025 financial results with strong net earnings and adjusted EBITDA, driven by higher selling prices and increased sales volumes. The company demonstrated a strong commitment to shareholder returns through share repurchases and is pursuing strategic initiatives in low-carbon ammonia, despite a market undervaluation indicated by a stock price decrease on earnings day. The article highlights CF Industries' operational efficiency, strong cash flow generation, and optimistic long-term outlook for the nitrogen market.",
      "url": "https://www.investing.com/news/company-news/cf-industries-q2-2025-slides-strong-cash-flow-despite-market-undervaluation-93CH-4175183",
      "source": "Investing.com",
      "published": "20250708T033500",
      "overall_sentiment_score": 0.305652,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.236396,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.61021
    },
    {
      "title": "PNC Earnings: Solid Results Driven by Strong Fees and Controlled Expenses",
      "summary": "PNC Financial Services Group reported strong Q2 financials with a 14% EPS increase year-over-year, reaffirming confidence in meeting annual targets. The bank demonstrated strong fee revenue generation and disciplined expense control, with early signs of commercial loan demand recovery and active management of its swap portfolio supporting Net Interest Income growth. While credit quality is improving, shares are considered nearly fairly valued despite an expected low-single-digit increase to its fair value estimate.",
      "url": "https://www.morningstar.com/stocks/pnc-earnings-solid-results-driven-by-strong-fees-controlled-expenses",
      "source": "Morningstar",
      "published": "20250716T000000",
      "overall_sentiment_score": 0.341151,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.127355,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.582323
    },
    {
      "title": "Key metrics from PNC Financial Services’ (PNC) Q2 2025 earnings results",
      "summary": "The PNC Financial Services Group, Inc. (NYSE: PNC) reported increased revenue and net income for Q2 2025. Total revenue rose 4% year-over-year to $5.7 billion, and net income attributable to common shareholders was $1.53 billion, or $3.85 per share. Performance varied across segments, with Retail Banking earnings decreasing while Corporate & Institutional Banking and Asset Management Group saw increases.",
      "url": "https://news.alphastreet.com/key-metrics-from-pnc-financial-services-pnc-q2-2025-earnings-results/",
      "source": "AlphaStreet",
      "published": "20250716T000000",
      "overall_sentiment_score": 0.064979,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.201609,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.563772
    },
    {
      "title": "Exxon just warned Wall Street of billion-dollar profit hits. Here’s what may cause it.",
      "summary": "Exxon Mobil Corp. has warned investors that its second-quarter profit could be negatively impacted by more than $1 billion due to lower crude prices and nearly $1 billion because of lower natural-gas prices. The energy major flagged these potential hits to its upstream, or exploration and production, business, which previously reported a GAAP profit of $6.8 billion in the first quarter of this year. Exxon is scheduled to release its second-quarter earnings on August 1.",
      "url": "https://www.marketwatch.com/story/exxon-just-warned-wall-street-of-billion-dollar-profit-hits-heres-what-may-cause-it-e9108053?gaa_at=eafs&gaa_n=AWEtsqfXZq9PIQDyWymqlBF4-CKEvmJkfWj6sxH__Wj2gOngdoWe0Ig0wzWl&gaa_ts=690747a3&gaa_sig=sXxb4aZS4qjVMYLIJhoDZBCqtDjnLV-MixFdXx38X12b2y-9kMn7B_JYDF4x_pKI-9OCJBWWJ_nJmpvteNIC4Q%3D%3D",
      "source": "MarketWatch",
      "published": "20250707T174300",
      "overall_sentiment_score": 0.021753,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.000256,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.347151
    },
    {
      "title": "Lobbying Update: $20,000 of MURPHY OIL CORPORATION lobbying was just disclosed",
      "summary": "MURPHY OIL CORPORATION has disclosed $20,000 in lobbying expenditures for Q2 2025, covering issues such as offshore leasing, oil and gas production, and environmental regulations. The article also details recent insider trading activity for MUR, with more purchases than sales, and significant shifts in institutional holdings. Analyst ratings are mixed, with a median price target of $26.0 from multiple firms.",
      "url": "https://www.quiverquant.com/news/Lobbying+Update%3A+%2420%2C000+of+MURPHY+OIL+CORPORATION+lobbying+was+just+disclosed",
      "source": "Quiver Quantitative",
      "published": "20250711T170800",
      "overall_sentiment_score": 0.106476,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.127382,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.326128
    }
  ]
}