{
  "ticker": "XOM",
  "date": "2025-11-24",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T13:44:30.879053",
  "source": "alpha_vantage",
  "article_count": 50,
  "articles": [
    {
      "title": "ExxonMobil (XOM) Buys 40% Stake in Bahia Pipeline as Part of New Joint Venture",
      "summary": "Exxon Mobil Corporation (XOM) and Enterprise Products Partners are forming a joint venture to operate the Bahia natural gas liquids pipeline. As part of the deal, Exxon will acquire a 40% stake in the pipeline from Enterprise for $650 million. This investment aligns with ExxonMobil's long-term growth strategy and its $140 billion spending plan through 2030 to expand its Permian operations.",
      "url": "https://finviz.com/news/237962/exxonmobil-xom-buys-40-stake-in-bahia-pipeline-as-part-of-new-joint-venture",
      "source": "Finviz",
      "published": "20251124T174900",
      "overall_sentiment_score": 0.431845,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.407379,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Exxon pauses plans for major hydrogen plant, CEO Woods says (NYSE:XOM)",
      "summary": "Exxon Mobil is delaying its plans to construct a large hydrogen production facility due to insufficient customer demand. CEO Darren Woods confirmed this decision in an interview, noting that the company had initially unveiled these plans in 2022. The move highlights the challenges in scaling up hydrogen production amid evolving market conditions.",
      "url": "https://seekingalpha.com/news/4525511-exxon-pauses-plans-for-major-hydrogen-plant-ceo-woods-says",
      "source": "Seeking Alpha",
      "published": "20251124T123400",
      "overall_sentiment_score": -0.253447,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.255619,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 1.0
    },
    {
      "title": "Exxon Mobil CEO Pauses World’s Largest Blue Hydrogen Facility Due to Weak Customer Demand",
      "summary": "Exxon Mobil CEO Darren Woods announced the pausing of plans for what would be one of the world's largest blue hydrogen production facilities in Baytown, Texas, due to weak customer demand. Despite the significant investment made with partners like ADNOC, potential customers are hesitant to commit to off-take contracts, citing the higher costs associated with carbon capture technology. Woods believes in the long-term viability of the project and confirmed it can restart once market demand is sufficient.",
      "url": "https://egyptoil-gas.com/news/exxon-mobil-ceo-pauses-worlds-largest-blue-hydrogen-facility-due-to-weak-customer-demand/",
      "source": "Egypt Oil & Gas",
      "published": "20251124T073847",
      "overall_sentiment_score": -0.127878,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.294393,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 1.0
    },
    {
      "title": "XOM - Exxon Mobil Corp Stock Price and Quote",
      "summary": "This article provides comprehensive stock information for Exxon Mobil Corp (XOM), including its stock price, key financial metrics, performance indicators, and recent news. It details insider transactions, analyst ratings with target price changes, and a chronological list of recent news headlines related to the company's activities and financial performance.",
      "url": "https://finviz.com/quote.ashx?t=XOM",
      "source": "Finviz",
      "published": "20251124T050652",
      "overall_sentiment_score": 0.177627,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.262195,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Exxon freezes plans for major hydrogen plant amid weak customer demand",
      "summary": "Exxon Mobil has paused its plans to build one of the world's largest blue hydrogen production facilities due to weak customer demand and the higher cost associated with carbon capture. CEO Darren Woods stated that potential customers are unwilling to pay the premium for this cleaner hydrogen, reflecting a broader slowdown in traditional energy firms' transition to cleaner sources. The project, which has already seen about $500 million invested, can be restarted when market demand improves.",
      "url": "https://www.reuters.com/sustainability/climate-energy/exxon-freezes-plans-major-hydrogen-plant-amid-weak-customer-demand-2025-11-21/",
      "source": "Reuters",
      "published": "20251121T212800",
      "overall_sentiment_score": -0.407274,
      "overall_sentiment_label": "Bearish",
      "ticker_sentiment_score": -0.390566,
      "ticker_sentiment_label": "Bearish",
      "relevance_score": 1.0
    },
    {
      "title": "Exxon Lifts Force Majeure on Mozambique LNG Project",
      "summary": "Exxon Mobil Corp. has lifted the force majeure on its Rovuma liquefied natural gas project in Mozambique, signaling a crucial step toward its final investment decision and commitment of construction funds. This follows improved security conditions in the region after an attack in 2021 by Islamic State-affiliated militants. The project, alongside TotalEnergies' nearby LNG plant, is expected to transform Mozambique's economy and increase Exxon's LNG supply by 2030, with an anticipated operational start in the early 2030s.",
      "url": "https://www.rigzone.com/news/wire/exxon_lifts_force_majeure_on_mozambique_lng_project-20-nov-2025-182359-article/",
      "source": "Rigzone",
      "published": "20251120T115600",
      "overall_sentiment_score": 0.423786,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.438083,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Exxon Lifts Force Majeure on Giant Mozambique LNG Project",
      "summary": "Exxon Mobil Corp. has lifted the force majeure on its Rovuma liquefied natural gas project in Mozambique, a crucial step towards sanctioning the development and committing construction funds. This decision follows an improvement in security conditions in the region, after militants had caused the suspension in 2021. The lifting of the force majeure enables work to resume and positions Exxon for a final investment decision next year, with the project expected to produce up to 18 million tons of gas annually by the early 2030s.",
      "url": "https://www.energyconnects.com/news/oil/2025/november/exxon-lifts-force-majeure-on-giant-mozambique-lng-project/",
      "source": "Energy Connects",
      "published": "20251120T030643",
      "overall_sentiment_score": 0.407404,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.439713,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Traub Capital Management LLC Buys Shares of 5,437 Exxon Mobil Corporation $XOM",
      "summary": "Traub Capital Management LLC significantly increased its stake in Exxon Mobil Corporation by acquiring 5,437 shares valued at $586,000 in Q2, boosting institutional ownership to approximately 61.8%. This comes as Exxon Mobil increased its quarterly dividend to $1.03, and analysts maintain a \"Moderate Buy\" consensus with an average target price of $128.67, despite an insider stock sale by a VP. The article details other institutional investments, insider activity, stock performance, and analyst ratings for XOM.",
      "url": "https://www.marketbeat.com/instant-alerts/filing-traub-capital-management-llc-buys-shares-of-5437-exxon-mobil-corporation-xom-2025-11-19/",
      "source": "MarketBeat",
      "published": "20251119T142158",
      "overall_sentiment_score": 0.316404,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.330269,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Exxon Mobil to close part of plant at Mossmorran",
      "summary": "Exxon Mobil is closing its Fife Ethylene Plant (FEP) in Mossmorran, UK, by February, putting 179 directly employed jobs and 250 contractor jobs at risk. The company attributes the closure to a lack of competitive future due to the UK's economic and policy environment, along with market conditions. This decision has sparked significant concern among local politicians and industry bodies, highlighting broader challenges facing the UK's industrial sector and the energy transition.",
      "url": "https://www.bbc.com/news/articles/cy0kxq0zp47o",
      "source": "BBC",
      "published": "20251118T165149",
      "overall_sentiment_score": -0.281853,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.268392,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 1.0
    },
    {
      "title": "Exxon to close Scottish chemicals plant in 2026 amid market uncertainty",
      "summary": "Exxon Mobil announced it will close its Fife ethylene plant in Scotland by February 2026, citing high supply costs, weak market conditions, and the UK's economic and policy environment as reasons for its uncompetitiveness. The closure will affect 179 Exxon employees and nearly 250 contractors, with some employees offered transfers. This decision reflects broader challenges faced by European chemical producers and a trend of declining refining capacity in the region.",
      "url": "https://www.reuters.com/sustainability/boards-policy-regulation/exxon-close-scottish-chemicals-plant-2026-amid-market-uncertainty-2025-11-18/",
      "source": "Reuters",
      "published": "20251118T134600",
      "overall_sentiment_score": -0.422656,
      "overall_sentiment_label": "Bearish",
      "ticker_sentiment_score": -0.446544,
      "ticker_sentiment_label": "Bearish",
      "relevance_score": 1.0
    },
    {
      "title": "Pragmatic and empowering: The force behind India’s energy story",
      "summary": "ExxonMobil's India Country Chair, Mike Mustian, discusses the company's significant role in India's rapidly growing energy sector. He highlights ExxonMobil's investments in India's people, industry, and energy to support the nation's \"Viksit Bharat 2047\" goals. Mustian emphasizes India's pragmatic approach to meeting energy demands and its potential to become a global hub for manufacturing energy equipment.",
      "url": "https://corporate.exxonmobil.com/locations/india/newsroom/2025/pragmatic-and-empowering-the-force-behind-indias-energy-story",
      "source": "Exxon Mobil Corporation",
      "published": "20251118T100713",
      "overall_sentiment_score": 0.493486,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.463588,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Methane pyrolysis technology",
      "summary": "ExxonMobil and BASF have formed a strategic collaboration to advance methane pyrolysis technology for low-emission hydrogen production, planning a demonstration plant in Baytown, Texas. This technology converts natural gas into hydrogen and solid carbon without CO2 emissions, offering a competitive and scalable solution for industrial hydrogen needs. The collaboration combines BASF's process innovation with ExxonMobil's scale-up expertise to accelerate commercial readiness.",
      "url": "https://corporate.exxonmobil.com/what-we-do/delivering-industrial-solutions/hydrogen/advancing-low-emission-hydrogen",
      "source": "Exxon Mobil Corporation",
      "published": "20251117T143309",
      "overall_sentiment_score": 0.478994,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.453286,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "ExxonMobil-BASF Team Up To Produce 2,000 Tons Low-Emission Hydrogen Annually",
      "summary": "ExxonMobil and BASF have partnered to advance methane pyrolysis technology, aiming to produce up to 2,000 tons of low-emission hydrogen and 6,000 tons of solid carbon annually at a new demonstration plant in Baytown. This collaboration aligns with ExxonMobil's strategy for scalable hydrogen solutions and BASF's ambition to reduce its carbon footprint. The initiative represents a significant step in developing efficient, globally deployable low-emission hydrogen technologies.",
      "url": "https://www.benzinga.com/markets/large-cap/25/11/48906398/exxonmobil-basf-team-up-to-produce-2000-tons-low-emission-hydrogen-annually",
      "source": "Benzinga",
      "published": "20251117T132800",
      "overall_sentiment_score": 0.420473,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.415047,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Plotkin Financial Advisors LLC Boosts Holdings in Exxon Mobil Corporation $XOM",
      "summary": "Plotkin Financial Advisors LLC significantly increased its stake in Exxon Mobil Corporation by 19.9% in the second quarter, bringing its total holdings to $1,394,000. Other institutional investors like Geode Capital Management LLC and Bank of New York Mellon Corp also adjusted their positions. The article further details insider transactions, analyst ratings, financial performance, and dividend information for Exxon Mobil.",
      "url": "https://www.marketbeat.com/instant-alerts/filing-plotkin-financial-advisors-llc-boosts-holdings-in-exxon-mobil-corporation-xom-2025-11-16/",
      "source": "MarketBeat",
      "published": "20251116T134159",
      "overall_sentiment_score": 0.303207,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.415239,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "ExxonMobil to Acquire 40 Percent of Bahia NGL Pipeline",
      "summary": "Enterprise Products Partners LP will farm out 40 percent of the Bahia natural gas liquids (NGLs) pipeline to Exxon Mobil Corp, with the deal expected to close in early 2026. Following the acquisition, Enterprise and ExxonMobil plan to increase Bahia’s capacity to one million bpd and extend the pipeline by 92 miles to ExxonMobil’s Cowboy natural gas processing plant. This expansion, expected to be completed in late 2027, aims to address the rising NGL production in the Permian Basin, where NGL production is projected to increase by over 30 percent between 2024 and 2030.",
      "url": "https://www.rigzone.com/news/wire/exxonmobil_to_acquire_40_percent_of_bahia_ngl_pipeline-21-nov-2025-182362-article/",
      "source": "Rigzone",
      "published": "20251121T080000",
      "overall_sentiment_score": 0.346849,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.416125,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.969147
    },
    {
      "title": "Daily oil production hits 900,000 barrels in Guyana's Stabroek block",
      "summary": "ExxonMobil Guyana Limited and its co-venturers have achieved a new production milestone of 900,000 barrels of oil daily in Guyana's Stabroek block, driven by the successful ramp-up of the Yellowtail project and strong performance from other assets. The consortium has committed over US$60 billion to develop seven government-sanctioned projects, with production capacity expected to reach 1.7 million barrels of oil by 2030 from eight developments. This achievement underscores the collaboration between ExxonMobil, the Guyanese government, and partners in building a world-class energy sector.",
      "url": "https://corporate.exxonmobil.com/locations/guyana/news-releases/11122025-daily-oil-production-hits-900000-barrels-in-guyanas-stabroek-block",
      "source": "Exxon Mobil Corporation",
      "published": "20251112T170451",
      "overall_sentiment_score": 0.381541,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.498198,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.96332
    },
    {
      "title": "Exxon joins Chevron in pursuing parts of Lukoil global empire, sources say",
      "summary": "Exxon Mobil is reportedly pursuing parts of sanctioned Russian oil major Lukoil's international assets, joining rival Chevron Corp. The U.S. oil giant is considering Lukoil's stakes in Kazakhstan's Karachaganak and Tengiz fields, as well as a potential bid for the West Qurna 2 field in Iraq. This comes after the U.S. Treasury authorized companies to begin talks with Lukoil regarding its global assets.",
      "url": "https://wkzo.com/2025/11/18/exxon-joins-chevron-in-pursuing-parts-of-lukoil-global-empire-sources-say/",
      "source": "WKZO",
      "published": "20251118T133900",
      "overall_sentiment_score": 0.189899,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.237278,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.947461
    },
    {
      "title": "Chandra Asri gets $750 million from KKR to buy Exxon's Singapore fuel stations",
      "summary": "Indonesia's Chandra Asri Pacific has secured a $750 million financing package from KKR to support its acquisition of ExxonMobil's Esso-branded retail fuel station network in Singapore. The deal involves nearly 60 fuel stations, and Chandra Asri plans to retain the Esso branding and continue sourcing fuel from ExxonMobil. KKR Capital Markets will arrange the financing, anchored by KKR's private credit and insurance platforms, seeing it as an opportunity to support Chandra Asri's downstream energy expansion in Singapore.",
      "url": "https://www.reuters.com/business/energy/chandra-asri-gets-750-million-kkr-buy-exxons-singapore-fuel-stations-2025-11-17/",
      "source": "Reuters",
      "published": "20251117T023900",
      "overall_sentiment_score": 0.372392,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.316178,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.941258
    },
    {
      "title": "$27 billion fills Shell, BP, TotalEnergies, Eni, Equinor, ExxonMobil, Chevron, and ConocoPhillips’ quarterly profit coffers",
      "summary": "Major European and U.S. oil companies, including Shell, BP, TotalEnergies, Equinor, Eni, ExxonMobil, Chevron, and ConocoPhillips, reported over $27.14 billion in combined profits for Q3 2025. These results highlight the continued reliance on fossil fuels despite rising concerns about hydrocarbon production rates, with many companies announcing strong financial performance, increased dividends, and share buybacks. The financial success of these companies comes amidst calls for more upstream investments to prevent a significant drop in oil supply by 2050.",
      "url": "https://www.offshore-energy.biz/27-billion-fills-shell-bp-totalenergies-eni-equinor-exxonmobil-chevron-and-conocophillips-quarterly-profit-coffers/",
      "source": "Offshore-Energy.biz",
      "published": "20251117T142115",
      "overall_sentiment_score": 0.377505,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.431192,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.934024
    },
    {
      "title": "Exxon joins Chevron in pursuing parts of Lukoil global empire, sources say",
      "summary": "Exxon Mobil is reportedly considering options to acquire parts of sanctioned Russian oil major Lukoil's international assets, following rival Chevron. Both U.S. oil majors are looking at Lukoil's stakes in Kazakhstan's Karachaganak and Tengiz fields, with Exxon also potentially eyeing the West Qurna 2 field in Iraq. This interest comes after the U.S. Treasury authorized companies to begin talks with Lukoil regarding its global assets, which include oilfields in multiple countries and refineries in Europe.",
      "url": "https://www.bicmagazine.com/api/amp/industry/natgas-lng/exxon-joins-chevron-in-pursuing-parts-of-lukoil-global-empire/",
      "source": "BIC Magazine",
      "published": "20251119T000000",
      "overall_sentiment_score": 0.191295,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.254566,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.932277
    },
    {
      "title": "Exxon joins Chevron in pursuing parts of Lukoil global empire, sources say",
      "summary": "U.S. oil major Exxon Mobil is reportedly considering options to acquire parts of sanctioned Russian oil major Lukoil's international assets, joining rival Chevron Corp in this pursuit. Exxon's interest specifically includes Lukoil assets in Kazakhstan, where both companies share stakes in major oil fields, and potentially the West Qurna 2 field in Iraq. This development follows recent U.S. Treasury authorization for companies to negotiate with Lukoil regarding these assets, attracting a growing list of potential bidders.",
      "url": "https://www.bicmagazine.com/industry/natgas-lng/exxon-joins-chevron-in-pursuing-parts-of-lukoil-global-empire/",
      "source": "BIC Magazine",
      "published": "20251119T000000",
      "overall_sentiment_score": 0.114478,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.102743,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.924082
    },
    {
      "title": "Exxon Mobil And Chevron Eye Russian Oil Giant’s Global Assets",
      "summary": "Exxon Mobil and Chevron are considering bids for Lukoil's international oil assets in Kazakhstan and Iraq after the US government temporarily eased sanctions. This move opens the door for American firms to compete with other international players like Abu Dhabi’s state oil company and Carlyle for Lukoil's global operations, which account for about 0.5% of worldwide oil output. The situation highlights the increasing influence of geopolitics on global energy markets as Western firms aim to shift key assets away from Russian control.",
      "url": "https://finimize.com/content/exxon-mobil-and-chevron-eye-russian-oil-giants-global-assets",
      "source": "Finimize",
      "published": "20251118T185121",
      "overall_sentiment_score": 0.210104,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.201106,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.915863
    },
    {
      "title": "Chevron, Exxon plan to keep boosting oil production, even as crude gets cheaper. What gives?",
      "summary": "Chevron and Exxon Mobil plan to increase their oil and gas production over the next five years, despite falling crude prices. These energy giants are adopting a long-term strategy, looking decades ahead and leveraging their size and integrated operations, including refining and chemicals businesses.",
      "url": "https://www.marketwatch.com/story/chevron-exxon-plan-to-keep-boosting-oil-production-even-as-crude-gets-cheaper-what-gives-74851e21?gaa_at=eafs&gaa_n=AWEtsqcjs2xykkstuGcUzpvFE_IhnriJULZuO6gPzmjiZwz7j8E3gLLkf5k5&gaa_ts=691a3542&gaa_sig=38NH0_D8sYGn1lH9lQECdARwIC13C2W6FPwSu6BX8p09kJ-XntYS-lGpnzXJjLWD6H5vb9qAhaJHV51Ky-36Ug%3D%3D",
      "source": "MarketWatch",
      "published": "20251116T151000",
      "overall_sentiment_score": 0.210834,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.228443,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.89491
    },
    {
      "title": "Exxon joins Chevron in pursuing parts of Lukoil global empire, sources say",
      "summary": "U.S. oil major Exxon Mobil is reportedly considering options to acquire parts of sanctioned Russian oil major Lukoil’s international assets, joining rival Chevron Corp. Both companies are looking at Lukoil's assets in Kazakhstan, and Exxon may also bid for the West Qurna 2 field in Iraq. This interest follows U.S. Treasury clearance for companies to negotiate with Lukoil, whose global assets include European refineries and stakes in oilfields worldwide.",
      "url": "https://wtvbam.com/2025/11/18/exxon-joins-chevron-in-pursuing-parts-of-lukoil-global-empire-sources-say/",
      "source": "WTVB",
      "published": "20251118T133900",
      "overall_sentiment_score": 0.197299,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.216791,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.874616
    },
    {
      "title": "Chandra Asri Group Gets $750M from KKR (KKR) to Fund Esso Singapore Network Acquisition",
      "summary": "KKR has provided a $750 million bespoke financing solution to Chandra Asri Group to support its growth strategy and the acquisition of ExxonMobil’s Esso-branded retail fuel station network in Singapore. This funding, arranged by KKR Capital Markets and anchored by KKR’s private credit and insurance platforms, will enable Chandra Asri Group to expand its downstream energy platform and strengthen its presence in Southeast Asia. Both companies emphasized the strategic partnership as a commitment to delivering reliable and sustainable energy solutions.",
      "url": "https://www.stocktitan.net/news/KKR/kkr-provides-750-million-bespoke-financing-solution-to-chandra-asri-sm84j3d1k51t.html",
      "source": "Stock Titan",
      "published": "20251116T200600",
      "overall_sentiment_score": 0.19042,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": -0.111992,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.720751
    },
    {
      "title": "Chandra Asri Pacific Buys Esso Singapore Stations With KKR Backing",
      "summary": "Chandra Asri Pacific has secured a $750 million deal, backed by KKR, to acquire nearly 60 Esso fuel stations in Singapore. This strategic move marks Chandra Asri Pacific's entry into Singapore's retail energy market, with plans to retain the Esso branding and workforce, and also includes a long-term supply agreement with ExxonMobil. KKR's investment highlights the growing interest in Asia's downstream energy sector, while the deal's impact on Chandra Asri Pacific's stock suggests the market is assessing its long-term implications.",
      "url": "https://finimize.com/content/chandra-asri-pacific-buys-esso-singapore-stations-with-kkr-backing",
      "source": "Finimize",
      "published": "20251117T025112",
      "overall_sentiment_score": 0.330361,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.204468,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.7204
    },
    {
      "title": "KKR Provides $750 Million Bespoke Financing Solution to Chandra Asri Group",
      "summary": "KKR, a global investment firm, has provided a $750 million bespoke financing solution to Chandra Asri Group to support its growth strategy, including the acquisition of ExxonMobil’s Esso-branded retail fuel station network in Singapore. This collaboration reinforces confidence in Chandra Asri's transformation journey and its expanding downstream energy platform, enabling it to pursue growth objectives with financial discipline. The investment is part of KKR's Asia Pacific Credit strategy, which focuses on providing tailored capital solutions to leading companies in the region.",
      "url": "https://www.businesswire.com/news/home/20251116458363/en/KKR-Provides-%24750-Million-Bespoke-Financing-Solution-to-Chandra-Asri-Group",
      "source": "Business Wire",
      "published": "20251118T103644",
      "overall_sentiment_score": 0.298657,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.134195,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.719926
    },
    {
      "title": "What every Chevron Investor Should Know Before Buying",
      "summary": "Chevron (NYSE: CVX) is shifting its strategy to prioritize stronger cash flow and value growth, focusing on reduced capital expenditures and cost-cutting while still modestly increasing production. Despite recent weakness in oil prices, Chevron's Q3 2025 results were better than feared, and the company plans to increase cash flow by 10% annually through 2030, returning much of it to investors via share repurchases and dividends. This approach, along with its strong dividend growth track record, makes it a potentially attractive option for conservative long-term investors.",
      "url": "https://finviz.com/news/234669/what-every-chevron-investor-should-know-before-buying",
      "source": "Finviz",
      "published": "20251120T052500",
      "overall_sentiment_score": 0.223305,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.219933,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.718824
    },
    {
      "title": "Clean Power Production for Oil & Gas, Refineries",
      "summary": "Babcock & Wilcox provides a comprehensive range of clean power production technologies and aftermarket support services for the petrochemical and refining industry. Their offerings include custom-engineered solutions for boilers, environmental controls, material handling, and carbon capture, aiming to enhance efficiency, reliability, and reduce emissions in refinery operations. The company also specializes in field engineering, construction services, and innovative technologies like BrightLoop™ for hydrogen and syngas production.",
      "url": "https://www.babcock.com/home/utilitiesindustries/industrial-facilities/petrochemical-and-refining",
      "source": "Babcock & Wilcox",
      "published": "20251124T034433",
      "overall_sentiment_score": 0.273595,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.207666,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.716033
    },
    {
      "title": "Here's Why Hold Strategy Is Apt for Imperial Oil Stock Now",
      "summary": "Imperial Oil (IMO) has significantly outperformed its peers and the broader oil and energy sector year-to-date, driven by record upstream production, strategic ventures with ExxonMobil, and a resilient integrated business model. However, the company faces challenges including a declining chemical business segment, potential slowdowns in shareholder returns, and susceptibility to volatile commodity prices. Given these factors, a \"Hold\" rating is recommended, suggesting investors await a more opportune entry point.",
      "url": "https://finviz.com/news/237675/heres-why-hold-strategy-is-apt-for-imperial-oil-stock-now",
      "source": "Finviz",
      "published": "20251124T095300",
      "overall_sentiment_score": 0.252061,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.228562,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.703725
    },
    {
      "title": "I Always Recommend Chevron (CVX) To Anyone Who Wants An Oil Company, Says JIm Cramer",
      "summary": "Jim Cramer continues to recommend Chevron (CVX) due to his faith in CEO Mike Wirth, despite a slight drop in Cramer's mentions of the company. Cramer highlights Chevron's revised capital expenditure plans and targeted 10% annual cash flow growth through 2030, emphasizing the CEO's conservative approach and the company's exposure to hyperscalers through natural gas. While acknowledging CVX's potential, the author suggests greater promise in specific AI stocks.",
      "url": "https://finviz.com/news/230806/i-always-recommend-chevron-cvx-to-anyone-who-wants-an-oil-company-says-jim-cramer",
      "source": "Finviz",
      "published": "20251115T123500",
      "overall_sentiment_score": 0.244349,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.148765,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.649239
    },
    {
      "title": "Marathon Petroleum stock hits 52-week high at 201.65 USD",
      "summary": "Marathon Petroleum's stock reached a new 52-week high of $201.65, demonstrating significant growth with a 29.48% one-year change and a 43.16% year-to-date return. Despite a slight miss in Q3 2025 earnings per share, the company exceeded revenue expectations and received a reiterated Buy rating from UBS with a price target of $220. Management's aggressive share buybacks signal strong confidence in the company's future.",
      "url": "https://in.investing.com/news/company-news/marathon-petroleum-stock-hits-52week-high-at-20165-usd-93CH-5100763",
      "source": "Investing.com India",
      "published": "20251112T020800",
      "overall_sentiment_score": 0.135085,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.119743,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.648478
    },
    {
      "title": "Sealed Air agrees to sell to private equity firm for $6.2B",
      "summary": "Sealed Air, known for brands like Bubble Wrap, has agreed to be acquired by private equity firm CD&R for $6.2 billion, representing an enterprise value of $10.3 billion. The deal, which delists Sealed Air from the NYSE, includes a 30-day \"go-shop\" period allowing the company to solicit higher offers. Analysts suggest the current terms are below some expectations and active investor Ancora Alternatives may have influenced the strategic review.",
      "url": "https://www.packagingdive.com/news/sealed-air-cdr-acquire-private-equity-food-protective/805653/",
      "source": "Packaging Dive",
      "published": "20251117T050049",
      "overall_sentiment_score": 0.055656,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.167078,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.646543
    },
    {
      "title": "New ETFs Are Betting Big on Texas",
      "summary": "Three ETF issuers have launched or filed for funds that focus on Texas-based companies, attracted by the state's lack of income taxes and pro-business policies. This trend is expected to continue as more corporations relocate to Texas and issuers pursue specialized niches. The performance of these Texas-focused funds has been mixed, with some showing gains and others declines since their launch.",
      "url": "https://www.thedailyupside.com/etf/thematics-sectors/new-etfs-are-betting-big-on-texas/",
      "source": "The Daily Upside",
      "published": "20251117T185203",
      "overall_sentiment_score": 0.026129,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.172655,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.644887
    },
    {
      "title": "AMGN - Amgen Inc Latest Stock News & Market Updates",
      "summary": "This article provides the latest news and stock updates for Amgen Inc. (AMGN), a global biotechnology leader. It covers recent FDA approvals for IMDELLTRA and TEZSPIRE, significant clinical trial results for Repatha, Q3 2025 financial results, dividend announcements, and the launch of the direct-to-patient program AmgenNow for Repatha.",
      "url": "https://www.stocktitan.net/news/AMGN/",
      "source": "Stock Titan",
      "published": "20251122T072125",
      "overall_sentiment_score": 0.203659,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": -0.072601,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.643653
    },
    {
      "title": "CF Industries Holdings, Inc. Reports First Nine Months 2025 Net Earnings of $1.05 Billion, Adjusted EBITDA of $2.07 Billion",
      "summary": "CF Industries Holdings, Inc. announced strong financial results for the first nine months of 2025, with net earnings of $1.05 billion and adjusted EBITDA of $2.07 billion, driven by constructive global nitrogen market dynamics and strong operations. The company completed a $3 billion share repurchase program and began a new $2 billion program, while also commencing premium low-carbon ammonia sales and making progress on decarbonization projects. The outlook remains positive due to continued strong global nitrogen demand and emerging demand for low-carbon ammonia, supporting favorable margins for North American producers.",
      "url": "https://www.businesswire.com/news/home/20251105805213/en/CF-Industries-Holdings-Inc.-Reports-First-Nine-Months-2025-Net-Earnings-of-%241.05-Billion-Adjusted-EBITDA-of-%242.07-Billion",
      "source": "Business Wire",
      "published": "20251111T164630",
      "overall_sentiment_score": 0.585942,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.541269,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.643493
    },
    {
      "title": "Occidental Petroleum Scales Back Spending As Oil Prices Slide",
      "summary": "Occidental Petroleum plans to reduce its 2026 capital spending to $6.3-6.7 billion, down from $7.1-7.3 billion in 2025, primarily focusing on US onshore projects, especially in the Permian Basin. Despite a nearly 13% drop in Brent crude prices this year, the company expects steady to 2% higher production in 2026 thanks to unconventional drilling tech. This strategy reflects a broader trend among US oil producers to prioritize financial health and shareholder returns over aggressive growth amid soft global demand and rising supply.",
      "url": "https://finimize.com/content/occidental-petroleum-scales-back-spending-as-oil-prices-slide",
      "source": "Finimize",
      "published": "20251111T224631",
      "overall_sentiment_score": 0.071348,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.037516,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.641558
    },
    {
      "title": "SLB OneSubsea Awarded Subsea Boosting Contract for bp’s Tiber Project in Gulf of America",
      "summary": "SLB OneSubsea has been awarded an engineering, procurement, and construction (EPC) contract by bp for a subsea boosting system for the Tiber project in the deepwater U.S. Gulf of America. This contract follows a similar award for bp's Kaskida development, both of which utilize a standardized high-pressure subsea pump system. This standardized solution aims to free up topside space and reduce power requirements, bringing substantial cost and time savings to bp's Paleogene developments.",
      "url": "https://www.slb.com/news-and-insights/newsroom/press-release/2025/slb-oss-bp-tiber-pr",
      "source": "SLB",
      "published": "20251118T134841",
      "overall_sentiment_score": 0.260822,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.224847,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.640448
    },
    {
      "title": "Delixy Holdings Prepares For Nasdaq Debut With $4 IPO Price",
      "summary": "Delixy Holdings, a Singapore-based oil trader, is debuting on the Nasdaq Capital Market with an IPO priced at $4 per share, aiming to raise $5.4 million. The funds will be used to diversify product offerings, strengthen its market position through acquisitions and partnerships, and support strategic growth. This Nasdaq listing is a strategic move to enhance its global presence and capitalize on emerging opportunities in the oil trading sector.",
      "url": "https://finimize.com/content/delixy-holdings-prepares-for-nasdaq-debut-with-4-ipo-price",
      "source": "Finimize",
      "published": "20251121T132146",
      "overall_sentiment_score": 0.308364,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.155047,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.631785
    },
    {
      "title": "Is ConocoPhillips a Value Opportunity After 19% Drop and New Permian Basin Moves?",
      "summary": "ConocoPhillips has experienced a 19.1% stock drop over the past year, prompting an evaluation of its value opportunity, especially given its strategic moves in the Permian Basin. Through Discounted Cash Flow (DCF) analysis and Price vs. Earnings (PE) ratio, the company appears significantly undervalued, with DCF suggesting a 58.5% discount and its PE ratio sitting below its tailored Fair Ratio. The article emphasizes using \"Narratives\" for personalized valuation, allowing investors to integrate their own assumptions with financial forecasts.",
      "url": "https://simplywall.st/stocks/us/energy/nyse-cop/conocophillips/news/is-conocophillips-a-value-opportunity-after-19-drop-and-new/amp",
      "source": "Simply Wall Street",
      "published": "20251123T173544",
      "overall_sentiment_score": 0.164003,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.121855,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.627965
    },
    {
      "title": "Lebedin Louis, airship AI director, buys $159000 in AISP stock By Investing.com",
      "summary": "Airship AI Holdings Inc. (NASDAQ:AISP) director Louis Lebedin purchased 50,000 shares of common stock for $159,000. Following this transaction, Lebedin directly owns 100,000 shares and holds options for an additional 250,000 shares. The company recently announced a warrant exercise agreement expected to generate approximately $9.7 million and secured 16 new contracts from the Department of Justice and Department of Homeland Security for its AI-driven surveillance solutions.",
      "url": "https://uk.investing.com/news/insider-trading-news/lebedin-louis-airship-ai-director-buys-159000-in-aisp-stock-93CH-4380525",
      "source": "Investing.com UK",
      "published": "20251117T190930",
      "overall_sentiment_score": 0.042023,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.118364,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.620699
    },
    {
      "title": "Chevron Picks Texas for First AI Data Center Power Project",
      "summary": "Chevron Corp. has selected West Texas for its inaugural project to supply natural gas-fired power to a data center, aiming to capitalize on the growing energy demand from artificial intelligence. This new venture, expected to be operational in 2027 with a potential capacity of 5,000 megawatts, will leverage Chevron's significant natural gas output in the Permian Basin. The oil giant is also forecasting production growth, reduced capital spending, and increased free cash flow through 2030, alongside substantial stock repurchases.",
      "url": "https://www.insurancejournal.com/news/southcentral/2025/11/14/847551.htm",
      "source": "Insurance Journal",
      "published": "20251114T185121",
      "overall_sentiment_score": 0.184759,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": -0.111587,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.610518
    },
    {
      "title": "All News about Apache Corp",
      "summary": "This article provides a comprehensive list of recent news and financial updates related to APA Corporation (Nasdaq:APA), showcasing events from January to March 2025. It covers significant oil discoveries, earnings reports, analyst verdicts, dividend declarations, and market performance of APA stock.",
      "url": "https://markets.financialcontent.com/stocks/quote/news?CurrentPage=6&Symbol=NQ%3AAPA",
      "source": "Markets Financial Content",
      "published": "20251121T160000",
      "overall_sentiment_score": 0.123904,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.147997,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.610142
    },
    {
      "title": "Global Partners' Retail Network Down 49 Sites Amid Optimization Effort",
      "summary": "Global Partners LP reported its third-quarter 2025 results, highlighting continued operational strength and a strategic optimization of its retail network, which saw a reduction of 49 sites. Despite the smaller footprint, the company saw higher wholesale margins and focused investments on reimagined store brands like Alltown Fresh and Honey Farms Market, alongside a new loyalty program.",
      "url": "https://csnews.com/global-partners-retail-network-down-49-sites-amid-optimization-effort",
      "source": "Convenience Store News",
      "published": "20251112T050912",
      "overall_sentiment_score": 0.166855,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.341349,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.605438
    },
    {
      "title": "Fitch Rates Steel Dynamics' New Senior Unsecured Notes 'BBB+'",
      "summary": "Fitch Ratings has assigned Steel Dynamics, Inc.'s new senior unsecured notes a 'BBB+' rating, anticipating sustained EBITDA leverage below 1.8x and EBITDA margins at or above 14%. The rating takes into account the company's strategic aluminum mill investment, low-cost structure, leading capacity utilization, and favorable product mix, which strengthen its market position. Fitch expects the Section 232 tariffs to benefit Steel Dynamics by increasing selling prices without negatively impacting demand or raw material sourcing.",
      "url": "https://www.tradingview.com/news/reuters.com,2025-11-18:newsml_FIT6ggg38:0-fitch-rates-steel-dynamics-new-senior-unsecured-notes-bbb/",
      "source": "TradingView",
      "published": "20251118T143658",
      "overall_sentiment_score": 0.201875,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.064846,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.587478
    },
    {
      "title": "New Era Posts $4.2MM Q3 Operating Loss amid Transition",
      "summary": "New Era Energy & Digital Inc. reported an operating loss of over $4.2 million in Q3 2025 as it transitions from a helium and natural gas operator to an integrated power and digital infrastructure company. The company is investing in engineering, site preparation, and its digital infrastructure platform, including the Texas Critical Data Centers (TCDC) joint venture and a new large-scale AI data center campus in New Mexico. Its strategy involves integrating behind-the-meter power and real estate tailored for the expanding AI compute market.",
      "url": "https://www.rigzone.com/news/new_era_posts_42mm_q3_operating_loss_amid_transition-17-nov-2025-182330-article/",
      "source": "Rigzone",
      "published": "20251117T050800",
      "overall_sentiment_score": -0.055064,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.012724,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.582933
    },
    {
      "title": "[424B2] BANK OF AMERICA CORP /DE/ Prospectus Supplement",
      "summary": "BofA Finance LLC is offering contingent income auto-callable yield notes guaranteed by Bank of America Corporation, linked to the performance of the Energy Select Sector SPDR Fund (XLE), the Russell 2000 Index (RTY), and the VanEck Semiconductor ETF (SMH). These notes have an approximate five-year term, offer potential monthly contingent coupon payments, and can be automatically called if the underlying assets meet certain conditions. Investors face risks including potential loss of principal if the least performing underlying asset falls below a specified threshold.",
      "url": "https://www.stocktitan.net/sec-filings/BAC/424b2-bank-of-america-corp-de-prospectus-supplement-1d7c9c2146ed.html",
      "source": "Stock Titan",
      "published": "20251121T020544",
      "overall_sentiment_score": 0.038654,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.062413,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.563231
    },
    {
      "title": "Halliburton Announces Dividend",
      "summary": "Halliburton Company (NYSE: HAL) announced that its board of directors has declared a fourth quarter 2025 dividend of seventeen cents ($0.17) a share on the Company’s common stock, payable on December 24, 2025, to shareholders of record at the close of business on December 3, 2025. Halliburton is a leading provider of products and services to the energy industry, founded in 1919. This news was released alongside other company updates, including its third quarter 2025 financial results and an announcement for a separate third quarter dividend.",
      "url": "https://www.businesswire.com/news/home/20251119321175/en/Halliburton-Announces-Dividend",
      "source": "Business Wire",
      "published": "20251119T223554",
      "overall_sentiment_score": 0.331137,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.300045,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.536233
    },
    {
      "title": "Is Exxon Mobil at an Attractive Price After Low-Carbon Investments and 11% Year-to-Date Rise?",
      "summary": "This article analyzes Exxon Mobil's valuation, considering its recent low-carbon investments and stock performance. Using Discounted Cash Flow (DCF) and Price-to-Earnings (PE Ratio) analyses, Simply Wall St suggests that Exxon Mobil appears undervalued. The piece also introduces \"Narratives\" as an innovative tool for investors to develop personalized valuation perspectives.",
      "url": "https://simplywall.st/stocks/us/energy/nyse-xom/exxon-mobil/news/is-exxon-mobil-at-an-attractive-price-after-low-carbon-inves",
      "source": "Simply Wall Street",
      "published": "20251117T072635",
      "overall_sentiment_score": 0.00754,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.028098,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.337591
    },
    {
      "title": "UK government: No financial support for Mossmorran plant",
      "summary": "The UK government has stated it will not provide financial assistance to keep ExxonMobil's Fife Ethylene Plant (FEP) in Mossmorran open, citing an inefficient business plan requiring nearly £1bn in investment. The plant is set to close in February, putting 179 directly employed jobs and 250 contractors at risk due to the UK's economic and policy environment, as confirmed by ExxonMobil. This closure reflects challenges in the UK's industrial landscape, drawing criticism from unions and politicians regarding job losses and the broader impact on the economy.",
      "url": "https://www.bbc.co.uk/news/articles/cy0kxq0zp47o",
      "source": "BBC",
      "published": "20251118T185213",
      "overall_sentiment_score": 0.042077,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.036824,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.319188
    }
  ]
}