{
  "ticker": "XOM",
  "date": "2025-06-30",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T13:42:52.611385",
  "source": "alpha_vantage",
  "article_count": 15,
  "articles": [
    {
      "title": "Occidental Petroleum, Exxon Mobil, Chevron Surge In Monday Pre-Market: What's Going On?",
      "summary": "Occidental Petroleum, Exxon Mobil, and Chevron saw pre-market surges after crude oil prices hit five-month highs following reports of U.S. and Israeli military action against Iranian nuclear sites. Geopolitical tensions are contributing to a risk premium in oil markets, with Goldman Sachs predicting prices could reach $110 per barrel. The potential closure of the Strait of Hormuz by Iran, warned by U.S. Secretary of State Marco Rubio and Shell CEO Wael Sawan, poses a significant threat to global oil trade.",
      "url": "https://www.benzinga.com/markets/equities/25/06/46048220/occidental-petroleum-exxon-mobil-chevron-surge-in-monday-pre-market-whats-going-on",
      "source": "Benzinga",
      "published": "20250623T064900",
      "overall_sentiment_score": 0.325898,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.398764,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "ExxonMobil CEO talks oil supply amid Iran-Israel conflict",
      "summary": "ExxonMobil CEO Darren Woods stated that there is sufficient global oil supply to handle disruptions to Iranian exports, but highlighted the Strait of Hormuz as a critical choke point. The conflict between Israel and Iran has raised concerns about potential disruptions in the Strait, which could significantly impact oil prices. While the loss of Iranian oil would increase prices, a closure of the Strait of Hormuz could lead to a more dramatic price surge.",
      "url": "https://www.foxbusiness.com/markets/exxonmobil-ceo-talks-oil-supply-amid-iran-israel-conflict",
      "source": "Fox Business",
      "published": "20250617T161200",
      "overall_sentiment_score": -0.067749,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.092517,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 1.0
    },
    {
      "title": "Exxon's Profitability Defies Energy Sector Challenges",
      "summary": "Exxon Mobil achieved profitability despite a challenging macroeconomic environment and falling oil prices, outperforming in its latest earnings. CEO Darren Woods lauded the company's ability to profit amidst industry challenges. Traders looking to capitalize on potential bullish or bearish trends in Exxon stock can use single-stock ETFs like Direxion Daily XOM Bull 2X Shares (XOMX) or Direxion Daily XOM Bear 1X Shares (XOMZ).",
      "url": "https://www.etftrends.com/leveraged-inverse-content-hub/exxons-profitability-defies-energy-sector-challenges/",
      "source": "ETF Trends",
      "published": "20250616T044436",
      "overall_sentiment_score": 0.314943,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.330437,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.931362
    },
    {
      "title": "Israel-Iran Conflict Lifts Crude Above $77: What It Means For Oil ETFs",
      "summary": "The Israel-Iran conflict has pushed West Texas Intermediate crude prices above $77 a barrel, leading to a significant geopolitical risk premium for oil. This rise in prices has spurred increased interest in various oil and energy-themed ETFs, as investors use them for tactical plays and hedging strategies. The Strait of Hormuz poses a major wild card, with potential disruptions threatening global oil flows and causing market volatility.",
      "url": "https://www.sahmcapital.com/news/content/israel-iran-conflict-lifts-crude-above-77-what-it-means-for-oil-etfs-2025-06-19",
      "source": "Sahm",
      "published": "20250619T225600",
      "overall_sentiment_score": 0.389136,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.306379,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.812309
    },
    {
      "title": "What’s New With BP Stock?",
      "summary": "BP stock is up 7% year-to-date, but its valuation is nuanced due to strategic shifts towards oil and gas from previous low-carbon ambitions. The company reported mixed Q1 earnings, with oil production performing well but the Gas & Low Carbon segment underperforming. Despite a seemingly attractive valuation, investor caution remains due to BP's shifting strategy and structural headwinds, though its renewed focus on hydrocarbons could offer upside.",
      "url": "https://www.trefis.com/stock/bp/articles/566578/whats-new-with-bp-stock/2025-06-18",
      "source": "Trefis",
      "published": "20250618T000000",
      "overall_sentiment_score": 0.198034,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.298936,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.737154
    },
    {
      "title": "How a contrarian trade can help you as an investor stay ahead of the Israel-Iran conflict",
      "summary": "As tensions rise between Israel and Iran, with the potential for disruptions to oil flow through the Strait of Hormuz, investors are considering their options. While the obvious trade would be to invest in oil-related assets, a contrarian approach is also suggested by BCA Research's chief strategist, Marko Papic. The article also touches on AI reminders, retirement annuities, and areas where home sellers are more likely to cut prices.",
      "url": "https://www.marketwatch.com/story/how-a-contrarian-trade-can-help-you-as-an-investor-stay-ahead-of-the-israel-iran-conflict-e2b21ca2?gaa_at=eafs&gaa_n=AWEtsqeM0ZHtgQk7haBLpQw738EOkEx0oDVVdFoUv6bm2nwYCJpx9foLw7n9&gaa_ts=69074081&gaa_sig=mvY0HY-Jv2CZQ50EcURzm-LLfufFVpAvedeq3_A1dD-m21UkKyH8tmxW9uAJSdbhW8GGzKSVNS9ZoW9tkoRxNw%3D%3D",
      "source": "MarketWatch",
      "published": "20250620T122100",
      "overall_sentiment_score": 0.198297,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.225938,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.715576
    },
    {
      "title": "Microsoft Corp: AI and Fossil Fuels",
      "summary": "A shareholder resolution requests Microsoft to report on the climate and financial risks associated with providing advanced technology, including AI and machine learning, to facilitate oil and gas development. Despite Microsoft's climate commitments to be carbon-negative by 2030, the company is a global leader in providing technological platforms for new oil and gas production projects, which carries significant reputational and legal risks for both Microsoft and its investors. The resolution aims to increase transparency regarding Microsoft's climate impact and exposure to climate-related financial risk.",
      "url": "https://www.asyousow.org/resolutions/2025/06/27-microsoft-ai-and-fossil-fuels",
      "source": "As You Sow",
      "published": "20250627T000000",
      "overall_sentiment_score": -0.054157,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.121506,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.633061
    },
    {
      "title": "Shell says ‘no talks are taking place’ after report of BP takeover discussions",
      "summary": "Shell has denied reports from the Wall Street Journal that it was in early discussions to acquire its rival BP. A Shell spokesperson explicitly stated that \"No talks are taking place,\" emphasizing the company's focus on internal value creation through performance, discipline, and simplification. This rebuttal follows CEO Wael Sawan's consistent stance that Shell has a high bar for large acquisitions, preferring share buybacks over such deals.",
      "url": "https://www.theglobeandmail.com/business/international-business/article-shell-early-talks-to-buy-bp-report/",
      "source": "The Globe and Mail",
      "published": "20250625T222841",
      "overall_sentiment_score": -0.109266,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.123895,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.610512
    },
    {
      "title": "DNOW and MRC Global to Combine in All-Stock Transaction Creating a Premier Energy and Industrial Solutions Provider",
      "summary": "DNOW Inc. and MRC Global Inc. announced an all-stock merger valued at approximately $1.5 billion, including MRC Global’s net debt, to form a premier energy and industrial solutions provider. The combination will create a global entity with over 350 service locations across more than 20 countries, leveraging both companies' expertise to serve energy, gas utility, and industrial customers. The transaction, unanimously approved by both boards, is expected to generate $70 million in annual cost synergies within three years and be accretive to Adjusted EPS in the first year.",
      "url": "https://www.phcppros.com/articles/21753-dnow-and-mrc-global-to-combine-in-all-stock-transaction-creating-a-premier-energy-and-industrial-solutions-provider",
      "source": "PHCPPros",
      "published": "20250627T070937",
      "overall_sentiment_score": 0.304582,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.137219,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.610212
    },
    {
      "title": "Shell Won’t Buy BP, Should You?",
      "summary": "Despite recent speculation driven by a Wall Street Journal report, a full Shell acquisition of BP remains highly unlikely due to regulatory hurdles, political backlash, and BP's significant debt. However, the market's reaction and BP's discounted valuation suggest a reevaluation of its strategic worth for investors, especially given its strategic shift back toward oil and gas. For value-minded investors, BP's stock might offer upside if the company successfully implements its renewed oil-centric strategy and improves confidence in its margins.",
      "url": "https://www.forbes.com/sites/greatspeculations/2025/06/26/shell-wont-buy-bp-should-you/",
      "source": "Forbes",
      "published": "20250626T101900",
      "overall_sentiment_score": -0.031875,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.068893,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.600103
    },
    {
      "title": "BlackRock launches Texas-focused fund to tap into state’s ‘dynamic’ economy",
      "summary": "BlackRock has launched a new index fund, the iShares Texas Equity ETF (TEXN), focused exclusively on publicly traded companies headquartered in Texas. This move aims to provide investors with targeted exposure to the state's robust economy, citing its \"twin engines\" of business and population growth that have made Texas the world's eighth-largest economy if standalone. The launch follows a period of friction between BlackRock and the state over ESG policies, and the firm recently withdrew from the Net-Zero Asset Managers Initiative.",
      "url": "https://www.expressnews.com/business/article/blackrock-texas-etf-fund-valero-energy-frost-bank-20394159.php",
      "source": "San Antonio Express-News",
      "published": "20250625T230853",
      "overall_sentiment_score": 0.288682,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.213496,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.597318
    },
    {
      "title": "IVE ETF: How It Tracks the S&P 500 Value Index",
      "summary": "The iShares S&P 500 Value ETF (IVE) is a popular choice for investors seeking exposure to large-cap US value stocks. This article explains how IVE tracks the S&P 500 Value Index using a passive, full replication strategy with periodic rebalancing, highlighting its cost-efficiency and diversification benefits. Key features, top holdings, and performance data are provided to assist traders in understanding its role in portfolio construction.",
      "url": "https://www.ebc.com/forex/ive-etf-how-it-tracks-the-s-and-amp-p--value-index",
      "source": "EBC Financial Group",
      "published": "20250626T000000",
      "overall_sentiment_score": 0.337421,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.26621,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.587016
    },
    {
      "title": "Canada's historic first cargo of LNG sets sail for buyers in Asia",
      "summary": "Canada's first cargo of liquefied natural gas from LNG Canada has set sail from British Columbia, marking the commercial startup of the $18-billion Shell PLC-led export terminal and Canada's entry into the global LNG market. The GasLog Glasgow vessel is chartered by Shell and is expected to deliver LNG to Asia in the coming days. This event is seen as historic, diversifying Canada's export markets and providing secure energy to Asia, with hopes that it will catalyze further LNG investments in Canada.",
      "url": "https://financialpost.com/commodities/energy/oil-gas/canada-first-cargo-lng-sets-sail-buyers-asia",
      "source": "Financial Post",
      "published": "20250630T000000",
      "overall_sentiment_score": 0.151712,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.215025,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.578632
    },
    {
      "title": "Archrock Inc. (AROC) Stock Slides as Market Rises: Facts to Know Before You Trade",
      "summary": "Archrock Inc. (AROC) saw its stock decline by 2.33% to $24.36, underperforming the broader market despite overall market gains. Analysts anticipate significant year-over-year growth in earnings and revenue for Archrock's upcoming disclosure and the full fiscal year, with a current Zacks Rank of #4 (Sell). The company's valuation metrics, including a Forward P/E of 15.36 and a PEG ratio of 1.28, are in line with or favorable compared to its industry.",
      "url": "https://finance.yahoo.com/news/archrock-inc-aroc-stock-slides-220003552.html",
      "source": "Yahoo Finance",
      "published": "20250623T030000",
      "overall_sentiment_score": 0.042909,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.140491,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.568318
    },
    {
      "title": "Oil ETFs Down Despite Surging Middle East Tensions",
      "summary": "Oil ETFs, including USO and BNO, dropped despite escalating Middle East tensions following US strikes on Iran and reports of possible missile retaliation. Traders remain cautiously optimistic that global supply will remain largely unaffected, and ample supply from OPEC has also contributed to capping oil price gains. Despite this, USO and BNO are up over 7% year-to-date due to favorable futures market dynamics.",
      "url": "https://www.etf.com/sections/news/oil-etfs-down-despite-surging-middle-east-tensions",
      "source": "ETF.com",
      "published": "20250623T000000",
      "overall_sentiment_score": -0.074525,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.117052,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.560519
    }
  ]
}