{
  "ticker": "XOM",
  "date": "2025-12-15",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T13:44:44.975166",
  "source": "alpha_vantage",
  "article_count": 50,
  "articles": [
    {
      "title": "ExxonMobil Unveils Graphite Invention To Extend EV Battery Life By 30%",
      "summary": "ExxonMobil has developed a new synthetic graphite designed to extend electric vehicle battery life by 30%, improve charging speed, and increase driving range. This innovation utilizes oil refining byproducts, reducing reliance on mined graphite and furthering the company's expansion into advanced battery materials. The development is part of ExxonMobil's broader strategy to enhance profitability and cash flow through new ventures in low-carbon solutions and high-value chemicals.",
      "url": "https://oilprice.com/Latest-Energy-News/World-News/ExxonMobil-Unveils-Graphite-Invention-To-Extend-EV-Battery-Life-By-30.html",
      "source": "Crude Oil Prices Today | OilPrice.com",
      "published": "20251215T223136",
      "overall_sentiment_score": 0.481746,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.470674,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Exxon Mobil VP Talley sells $356k in common stock By Investing.com",
      "summary": "Darrin L. Talley, VP of Corporate Strategic Planning at Exxon Mobil Corp (NYSE:XOM), sold 3,000 shares of common stock for $356,250 on December 15, 2025. This transaction leaves Talley with substantial direct and indirect holdings in the company. The sale follows recent positive updates in ExxonMobil's earnings and revenue forecasts, which have led several financial firms to raise their price targets for the company.",
      "url": "https://uk.investing.com/news/insider-trading-news/exxon-mobil-vp-talley-sells-356k-in-common-stock-93CH-4418269",
      "source": "Investing.com UK",
      "published": "20251215T194224",
      "overall_sentiment_score": 0.321531,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.255745,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.97069
    },
    {
      "title": "WFW advises Borr on US$360 million acquisition of five premium jack-up rigs from Noble",
      "summary": "Watson Farley & Williams (WFW) advised Borr Drilling Limited on its US$360 million acquisition of five premium jack-up rigs from Noble Corporation Plc. This acquisition, expected to close in 1Q26, will increase Borr's fleet from 24 to 29 rigs and includes a bareboat charter arrangement for two rigs back to Noble. The deal is set to generate significant earnings and strategic growth for Borr.",
      "url": "https://www.oilfieldtechnology.com/drilling-and-production/15122025/wfw-advises-borr-on-us360-million-acquisition-of-five-premium-jack-up-rigs-from-noble/",
      "source": "Oilfield Technology",
      "published": "20251215T180908",
      "overall_sentiment_score": 0.170743,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.125345,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.608246
    },
    {
      "title": "Exxon CEO Says New Form of Graphite Boosts EV Battery Life, Extends Range",
      "summary": "Exxon Mobil Corp. announced a new form of synthetic graphite that can increase EV battery life by up to 30%, extend range, and allow for faster charging. CEO Darren Woods stated the invention is being tested by EV manufacturers, with commercial production aimed for 2029 following the acquisition of Superior Graphite assets. While not becoming a battery maker, Exxon plans to leverage its existing infrastructure to produce key energy transition materials, including graphite and lithium, and has a long history in battery innovation.",
      "url": "https://thebusinessdownload.com/exxon-ceo-says-new-form-of-graphite-boosts-ev-battery-life-extends-range/",
      "source": "The Business Download |",
      "published": "20251215T155357",
      "overall_sentiment_score": 0.192841,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.310463,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.958193
    },
    {
      "title": "Imperial Oil aiming for $2B-$2.2B capital budget for 2026",
      "summary": "Imperial Oil Ltd. is forecasting a capital and exploration budget of $2 billion to $2.2 billion for 2026, a modest increase from its 2025 targets. The company expects upstream production to rise due to better performance at its Kearl and Cold Lake oilsands operations, while refinery throughput is projected to decrease.",
      "url": "https://www.richmond-news.com/the-mix/imperial-oil-aiming-for-2b-22b-capital-budget-for-2026-11628337",
      "source": "Richmond News",
      "published": "20251215T140900",
      "overall_sentiment_score": 0.224275,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.144647,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.641864
    },
    {
      "title": "BofA Remains Bullish On Chevron Corporation (CVX)",
      "summary": "BofA maintains a Buy rating on Chevron Corporation (CVX) but recently reduced its price target from $183 to $180. The company is involved in the Gorgon Stage 3 project in Western Australia, an initiative expected to bolster local gas supply and LNG exports. Despite Chevron's potential, the article suggests specific AI stocks may offer greater upside and less risk for investors.",
      "url": "https://finviz.com/news/253960/bofa-remains-bullish-on-chevron-corporation-cvx",
      "source": "Finviz",
      "published": "20251215T134904",
      "overall_sentiment_score": 0.346706,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.248722,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.645286
    },
    {
      "title": "York Water Has Raised Its Dividend for 13 Years and the Streak Looks Secure",
      "summary": "York Water (YORW) declared a quarterly dividend of $0.228 per share in November 2025, marking a 4.0% increase and extending its payment streak to 13 years. While the company's dividend payout ratios are healthy, significant capital expenditures have led to negative free cash flow and increased debt load. Despite rising interest costs, management's commitment and the regulated utility model make the dividend currently safe, though future growth may moderate.",
      "url": "https://247wallst.com/investing/2025/12/15/york-water-has-raised-its-dividend-for-13-years-and-the-streak-looks-secure/",
      "source": "24/7 Wall St.",
      "published": "20251215T120851",
      "overall_sentiment_score": 0.259711,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.219463,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.635282
    },
    {
      "title": "BigBear.ai (BBAI) Stock News Today: Share Authorization Vote, Ask Sage Deal, and Analyst Forecasts as of Dec. 15, 2025",
      "summary": "BigBear.ai (BBAI) is navigating mid-December with key developments including a definitive agreement to acquire generative AI platform Ask Sage, the opening of a new office in the UAE, and an upcoming shareholder vote on increasing authorized common shares. These initiatives aim to fuel growth, broaden its market footprint, and enhance its capital structure, while recent financial results show mixed performance with a focus on backlog conversion and integration challenges. Analysts remain cautiously optimistic, with price targets ranging from $6.00 to $8.00 depending on the source.",
      "url": "https://ts2.tech/en/bigbear-ai-bbai-stock-news-today-share-authorization-vote-ask-sage-deal-and-analyst-forecasts-as-of-dec-15-2025/",
      "source": "ts2.tech",
      "published": "20251215T120849",
      "overall_sentiment_score": 0.121287,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.139757,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.632289
    },
    {
      "title": "SLB, Shell Sign AI Collaboration Agreement to Develop Upstream Digital Solutions",
      "summary": "SLB and Shell have signed a strategic collaboration agreement to develop digital and artificial intelligence (AI) solutions for upstream operations. This partnership will focus on agentic AI-powered solutions to enhance technical experts' capabilities in subsurface operations, well construction, and production, using SLB’s Lumi data and AI platform. The collaboration aims to unify data and workflows, inform Shell’s digital strategy, and develop commercially viable digital solutions for the industry.",
      "url": "https://egyptoil-gas.com/news/slb-shell-sign-ai-collaboration-agreement-to-develop-upstream-digital-solutions/",
      "source": "Egypt Oil & Gas",
      "published": "20251215T115950",
      "overall_sentiment_score": 0.349953,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.338886,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.61974
    },
    {
      "title": "CVR Energy (CVI) Gets a Sell from Mizuho Securities",
      "summary": "Mizuho Securities analyst Nitin Kumar maintained a Sell rating on CVR Energy (CVI) with a price target of $28.00. The analyst's average return is 4.5% with a 59.84% success rate in the Energy sector, focusing on companies like Chevron and EQT. CVR Energy's latest quarterly revenue was $1.94 billion with a net profit of $374 million.",
      "url": "https://www.theglobeandmail.com/investing/markets/markets-news/Tipranks/36617979/cvr-energy-cvi-gets-a-sell-from-mizuho-securities/",
      "source": "The Globe and Mail",
      "published": "20251215T070956",
      "overall_sentiment_score": 0.18059,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.328629,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.632459
    },
    {
      "title": "SLB and Shell join forces to supercharge AI in upstream energy operations",
      "summary": "SLB and Shell have announced a strategic collaboration to develop advanced digital and AI solutions for upstream energy operations. This partnership will leverage SLB’s Lumi data and AI platform to create agentic AI-powered tools, enhancing the capabilities of technical experts and decision-makers across subsurface, well construction, and production workflows. The initiative aims to boost performance, efficiency, and accelerate digital transformation for both companies and the broader industry.",
      "url": "https://www.indianchemicalnews.com/digitization/slb-and-shell-join-forces-to-supercharge-ai-in-upstream-energy-operations-28563",
      "source": "Indian Chemical News",
      "published": "20251215T070831",
      "overall_sentiment_score": 0.33548,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.305812,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.723967
    },
    {
      "title": "Valaris wins multiyear Shell contract",
      "summary": "Valaris Ltd, a Bermudian-based offshore drilling company, has secured a multiyear contract with Shell for its Valaris DS-8 drillship in Brazil's Orca project, valued at approximately $300 million and commencing in early 2027. This agreement, with options for extension, highlights increasing interest from international oil companies in Brazil’s deepwater sector. Valaris's president and CEO, Anton Dibowitz, noted that the company has accumulated over $2.5 billion in contract backlog this year.",
      "url": "https://www.royalgazette.com/international-business/business/article/20251214/valaris-wins-multiyear-shell-contract/",
      "source": "Royal Gazette | Bermuda",
      "published": "20251214T174200",
      "overall_sentiment_score": 0.375161,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.201367,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.629474
    },
    {
      "title": "Petróleo Brasileiro - Petrobras (NYSE:PBR) - Stock Analysis",
      "summary": "This Simply Wall St analysis provides a detailed overview of Petróleo Brasileiro S.A. - Petrobras (NYSE:PBR), highlighting its market valuation, future growth prospects, past performance, financial health, and dividend reliability. The report indicates that Petrobras is trading significantly below its estimated fair value despite stable share price volatility, with earnings projected to grow at 3.65% annually. Various financial metrics, recent news, and shareholder returns are also presented to offer a comprehensive financial snapshot of the company.",
      "url": "https://simplywall.st/stocks/us/energy/nyse-pbr/petroleo-brasileiro-petrobras",
      "source": "Simply Wall Street",
      "published": "20251214T160934",
      "overall_sentiment_score": 0.02827,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.045942,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.701105
    },
    {
      "title": "Exxon Mobil (XOM) Stock Outlook: 2030 Plan Lifts Targets, Analysts Raise Price Goals — What to Watch This Week (Updated Dec. 14, 2025)",
      "summary": "Exxon Mobil's recent corporate plan through 2030 aims to boost long-term earnings and cash flow targets without increasing capital spending, driven by \"advantaged assets\" like the Permian Basin, Guyana, and LNG. This update has led to momentum in XOM stock and several analysts raising their price targets, despite a controversial reduction in low-carbon spending. The stock's performance in the coming week will largely depend on oil market signals, broader macro factors, and investor sentiment regarding the updated strategy.",
      "url": "https://ts2.tech/en/exxon-mobil-xom-stock-outlook-2030-plan-lifts-targets-analysts-raise-price-goals-what-to-watch-this-week-updated-dec-14-2025/",
      "source": "ts2.tech",
      "published": "20251214T130203",
      "overall_sentiment_score": 0.251898,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.274827,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "BP PLC Stock News & Forecast: Castrol Sale Talk, Buybacks, and Oil Price Headwinds — Week Ahead Outlook (Updated Dec. 14, 2025)",
      "summary": "This article examines BP PLC's stock performance and outlook for the week ahead, focusing on key drivers such as crude oil prices, potential sale of Castrol, ongoing share buybacks, and a new Gulf of Mexico project. Despite company-specific positive developments, BP faces headwinds from a projected oil supply surplus in 2026. The article also discusses analyst forecasts and critical catalysts like the Bank of England decision and any updates on the Castrol divestment.",
      "url": "https://ts2.tech/en/bp-plc-stock-news-forecast-castrol-sale-talk-buybacks-and-oil-price-headwinds-week-ahead-outlook-updated-dec-14-2025/",
      "source": "ts2.tech",
      "published": "20251214T110932",
      "overall_sentiment_score": -0.24037,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.202356,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.720282
    },
    {
      "title": "Shell Plc (SHEL) Today: UBS Downgrade, Ferrari Green Power Deal and LNG Dispute – 26 November 2025",
      "summary": "Shell Plc is facing a UBS downgrade to 'Neutral' due to valuation concerns despite strong cash flow. Concurrently, Shell announced a 10-year renewable power partnership with Ferrari and is embroiled in a complex LNG dispute with Venture Global. The company continues its aggressive $3.5 billion share buyback program and is reinforcing its upstream positions, including increasing its stake in Nigeria's Bonga field.",
      "url": "https://ts2.tech/en/shell-plc-shel-today-ubs-downgrade-ferrari-green-power-deal-and-lng-dispute-26-november-2025/",
      "source": "TechStock²",
      "published": "20251213T225748",
      "overall_sentiment_score": -0.038961,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.091226,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.559074
    },
    {
      "title": "Key facts: BP buys back 1.57M shares; purchases E10 gasoline barge",
      "summary": "BP p.l.c. recently completed a buyback of 1,572,184 shares on December 12, 2025, as part of a program initiated on November 4, 2025. Additionally, BP purchased an E10 gasoline barge from Exxon Mobil, indicating its active participation in the Northwest European gasoline market.",
      "url": "https://www.tradingview.com/news/tradingview:7944a871a5de1:0-key-facts-bp-buys-back-1-57m-shares-purchases-e10-gasoline-barge/",
      "source": "TradingView — Track All Markets",
      "published": "20251213T010855",
      "overall_sentiment_score": 0.200754,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.131909,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.717272
    },
    {
      "title": "ConocoPhillips (COP) Stock: This Week’s Moves, Fresh Alaska Lawsuit News, Analyst Forecasts, and the Week-Ahead Outlook (Updated Dec. 12, 2025)",
      "summary": "ConocoPhillips (COP) stock experienced a volatile week ending December 12, 2025, driven by falling oil prices, a new Alaska lawsuit challenging an exploration program, and mixed analyst price target updates. While the company's long-term outlook remains supported by its project pipeline and shareholder returns, near-term sentiment is heavily influenced by crude price instability and the ongoing debate about the 2026 supply-demand balance. Investors are watching oil market narratives, U.S. supply outlooks, inventory reports, macro data, and further legal developments in Alaska, with next major scheduled catalyst being earnings in early February 2026.",
      "url": "https://ts2.tech/en/conocophillips-cop-stock-this-weeks-moves-fresh-alaska-lawsuit-news-analyst-forecasts-and-the-week-ahead-outlook-updated-dec-12-2025/",
      "source": "ts2.tech",
      "published": "20251212T220740",
      "overall_sentiment_score": -0.074874,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.107731,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.618988
    },
    {
      "title": "Exxon Mobil (XOM) Stock News Today: 2030 Plan Upgrade, Buybacks, and Fresh Wall Street Price Targets (Dec. 12, 2025)",
      "summary": "Exxon Mobil's stock (XOM) is trading near its yearly high, driven by an upgraded 2030 corporate plan that boosts financial targets without increasing capital spending. The company also emphasizes shareholder returns through consistent dividends and a $20 billion share repurchase plan maintained through 2026. This positive outlook has led to several Wall Street analysts raising their price targets for XOM.",
      "url": "https://ts2.tech/en/exxon-mobil-xom-stock-news-today-2030-plan-upgrade-buybacks-and-fresh-wall-street-price-targets-dec-12-2025/",
      "source": "ts2.tech",
      "published": "20251212T160857",
      "overall_sentiment_score": 0.468888,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.461977,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "BP Starts Up Atlantis Expansion Project in US Gulf",
      "summary": "BP PLC has started an expansion project in its Atlantis field in the U.S. Gulf, adding 15,000 barrels of oil equivalent per day to its production capacity. This \"Atlantis Drill Center 1 Expansion\" is BP's seventh major project startup of the year and was delivered two months ahead of schedule. The company aims to grow its upstream business, targeting around one million barrels of oil equivalent per day from U.S. production by 2030.",
      "url": "https://www.rigzone.com/news/bp_starts_up_atlantis_expansion_project_in_us_gulf-12-dec-2025-182519-article/",
      "source": "Rigzone",
      "published": "20251212T130900",
      "overall_sentiment_score": 0.235371,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.132185,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.594606
    },
    {
      "title": "3 High-Yielding ETFs That Retirees Will Love",
      "summary": "This article highlights three high-yielding ETFs (SCHD, DGRO, NOBL) that are suitable for retirees and income-seeking investors due to their dividend payouts, low beta values, and diversified holdings. Each ETF is analyzed for its specific characteristics, such as expense ratio, yield, and portfolio composition, emphasizing their stability and potential for long-term income generation. The article stresses the importance of ETFs in reducing risk compared to investing in individual dividend stocks.",
      "url": "https://finviz.com/news/252565/3-high-yielding-etfs-that-retirees-will-love",
      "source": "Finviz",
      "published": "20251212T063500",
      "overall_sentiment_score": 0.375812,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.306094,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.615993
    },
    {
      "title": "Woodside Energy Group Ltd Stock (WDS): Latest News, Analyst Forecasts, and What Investors Are Watching on Dec. 12, 2025",
      "summary": "Woodside Energy Group Ltd (WDS) is under market scrutiny due to its LNG growth plans, U.S. expansion, and significant labor risks at its Pluto LNG 2 project. Analyst forecasts show a mixed-to-moderately constructive outlook with a wide range of target prices, reflecting debates over execution risk and commodity price assumptions. Investors are closely watching industrial action outcomes, sustainability approvals, and updates to the company's 2030-2032 financial targets amid its long-term LNG growth strategy.",
      "url": "https://ts2.tech/en/woodside-energy-group-ltd-stock-wds-latest-news-analyst-forecasts-and-what-investors-are-watching-on-dec-12-2025/",
      "source": "ts2.tech",
      "published": "20251212T050953",
      "overall_sentiment_score": 0.116569,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.050211,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.588307
    },
    {
      "title": "What Has ExxonMobil (XOM) Stock Done For Investors?",
      "summary": "ExxonMobil's strategic transformation over the past five years has led to market-crushing total returns, despite underperforming in shorter periods. The company's focus on advantaged resources, structural cost savings, and disciplined capital allocation has significantly increased its profitability. This strategy, including consistent dividend increases and share repurchases, positions ExxonMobil for continued strong performance.",
      "url": "https://finviz.com/news/252476/what-has-exxonmobil-xom-stock-done-for-investors",
      "source": "Finviz",
      "published": "20251212T044606",
      "overall_sentiment_score": 0.64489,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.649796,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Canadian Natural Resources Flexes Low Costs And Steady Cash Flow",
      "summary": "Canadian Natural Resources Limited (CNQ), Canada's largest independent oil producer, is positioned as a compelling investment due to its low operating costs, strong free cash flow, and healthy balance sheet. Despite challenges from weak oil prices and regulatory changes in Alberta, CNQ is targeting a significant production increase in 2025 and offers an attractive 5% dividend yield with a discounted valuation. However, investors should monitor commodity price volatility, high capital expenditures, and potential regulatory shifts as key risks.",
      "url": "https://finimize.com/content/cnq-asset-snapshot",
      "source": "Finimize",
      "published": "20251212T041004",
      "overall_sentiment_score": 0.191551,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.149695,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.634495
    },
    {
      "title": "TechnipFMC Bags Production Systems Contract for Gorgon Stage 3",
      "summary": "TechnipFMC PLC has secured a \"significant\" contract from Chevron Corp for the Gorgon Stage 3 project in Western Australia, which aims to expand the Gorgon domestic and liquefied natural gas project. The contract, valued between $75-$250 million, involves TechnipFMC delivering its Subsea 2.0 configure-to-order products, including the first seven-inch series of Subsea 2.0® horizontal subsea trees. This development will utilize existing infrastructure and connect new fields to processing facilities on Barrow Island.",
      "url": "https://www.rigzone.com/news/technipfmc_bags_production_systems_contract_for_gorgon_stage_3-12-dec-2025-182517-article/",
      "source": "Rigzone",
      "published": "20251212T022500",
      "overall_sentiment_score": 0.388895,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.336533,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.614476
    },
    {
      "title": "Don't Ignore The Insider Selling In CSW Industrials",
      "summary": "An executive at CSW Industrials recently sold US$1.2 million worth of shares, reducing their holding by 17%. While this is the largest insider sale in the past year, insiders have not purchased any shares during the same period. Despite caution raised by this selling and a non-outstanding level of insider ownership, the company is profitable and growing.",
      "url": "https://simplywall.st/stocks/us/capital-goods/nyse-csw/csw-industrials/news/dont-ignore-the-insider-selling-in-csw-industrials-1",
      "source": "Simply Wall Street",
      "published": "20251212T011027",
      "overall_sentiment_score": 0.161388,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.00671,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.644152
    },
    {
      "title": "Epsilon Energy Ltd. Announces Sale of Dewey Energy Holdings, LLC and Western Anadarko Basin Assets for $2.5 Million",
      "summary": "Epsilon Energy Ltd. has announced the sale of its wholly owned subsidiary, Dewey Energy Holdings, LLC, including its Western Anadarko basin assets, to an undisclosed private buyer for $2.5 million in cash. This transaction involved the transfer of approximately 813 Mcfe/d of production, 6,400 net deep acres, and 2,200 net shallow acres of leasehold in Dewey County, Oklahoma. RedOaks Energy Advisors LLC facilitated the sale, allowing Epsilon Energy to streamline operations and potentially focus on other core assets.",
      "url": "https://www.quiverquant.com/news/Epsilon+Energy+Ltd.+Announces+Sale+of+Dewey+Energy+Holdings%2C+LLC+and+Western+Anadarko+Basin+Assets+for+%242.5+Million",
      "source": "Quiver Quantitative",
      "published": "20251211T211509",
      "overall_sentiment_score": -0.072693,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.141477,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.647223
    },
    {
      "title": "Cenovus, Suncor aim for production boosts next year without big spending increases",
      "summary": "Two of Canada's major oilsands producers, Cenovus Energy Inc. and Suncor Energy Inc., plan to increase their output in 2026 without significantly increasing their capital expenditures year-over-year. Cenovus projects upstream production growth of about four percent, while Suncor focuses on operational excellence and returning excess funds to shareholders through buybacks. Both companies have provided detailed capital budgets and production forecasts for the upcoming year, highlighting strategic acquisitions and commitments to shareholder returns.",
      "url": "https://www.rmoutlook.com/oil-gas-and-mining-news/cenovus-suncor-aim-for-production-boosts-next-year-without-big-spending-increases-11609799",
      "source": "Rocky Mountain Outlook",
      "published": "20251211T191116",
      "overall_sentiment_score": 0.15333,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.089217,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.594222
    },
    {
      "title": "Exxon Is Slashing Low-Carbon Spending — And Quietly Betting On A Fossil-Fuel Supercycle",
      "summary": "Exxon Mobil's updated 2030 Plan shows a clear shift, with less investment in low-carbon initiatives and increased focus on current fossil fuel assets. The company projects significant earnings and cash flow growth by 2030, primarily from its upstream oil and gas operations like the Permian and Guyana. This strategy suggests a belief that fossil fuel cash flows will remain strong for an extended period, positioning Exxon as a leader in a trend back towards traditional energy fundamentals.",
      "url": "https://www.benzinga.com/trading-ideas/long-ideas/25/12/49342849/exxon-low-carbon-spending-fossil-fuel-supercycle",
      "source": "Benzinga",
      "published": "20251211T180904",
      "overall_sentiment_score": 0.481042,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.458725,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "How WD-40’s (WDFC) Dividend Hike Amid Earnings Miss Has Changed Its Investment Story",
      "summary": "WD-40 (WDFC) recently reported quarterly revenues exceeding analyst expectations but missed EBITDA estimates, while simultaneously approving an over 8% dividend increase. This mixed performance of stronger sales but weaker profitability, coupled with a higher dividend, prompts a re-evaluation of how the company balances growth, margins, and shareholder returns. The dividend hike, in particular, attracts attention to WD-40's ability to fund increasing payouts amidst sustained cost inflation and rising operating expenses.",
      "url": "https://simplywall.st/stocks/us/household/nasdaq-wdfc/wd-40/news/how-wd-40s-wdfc-dividend-hike-amid-earnings-miss-has-changed",
      "source": "Simply Wall Street",
      "published": "20251211T161005",
      "overall_sentiment_score": 0.147739,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.12494,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.626731
    },
    {
      "title": "SLB, Shell Form Alliance to Streamline Digital Oil and Gas Solutions",
      "summary": "SLB and Shell have formed a strategic alliance to develop advanced digital and AI solutions aimed at improving performance and efficiency in upstream oil and gas operations. This collaboration leverages SLB’s Lumi data and AI platform to unify data and workflows across subsurface, well construction, and production in a secure digital environment. The initiative builds on an existing technical partnership between the two companies to standardize infrastructure and accelerate scalable digital solutions.",
      "url": "https://www.oedigital.com/news/533413-slb-shell-form-alliance-to-streamline-digital-oil-and-gas-solutions",
      "source": "Offshore Engineer Magazine",
      "published": "20251211T140831",
      "overall_sentiment_score": 0.313204,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.22222,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.575876
    },
    {
      "title": "Why XOM's Permian & Guyana Operations Could Drive Long-Term Returns",
      "summary": "Exxon Mobil Corporation (XOM) is positioned for strong long-term returns due to its robust upstream operations in the Permian Basin and offshore Guyana, which generate the majority of its earnings. The company has achieved record production in both regions, and its low breakeven costs in these advantageous assets enable it to manage market fluctuations. While XOM's valuation is above its industry average, its strong operational outlook and significant acreage acquisition in the Midland sub-basin signal continued growth potential.",
      "url": "https://finviz.com/news/251583/why-xoms-permian-guyana-operations-could-drive-long-term-returns",
      "source": "Finviz",
      "published": "20251211T131156",
      "overall_sentiment_score": 0.37372,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.417695,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "SLB Enters Collaboration Agreement to Accelerate New Digital Solutions",
      "summary": "SLB (NYSE: SLB) has entered a strategic collaboration agreement with Shell to develop advanced digital and AI solutions, aiming for significant performance and efficiency gains in upstream operations. This partnership will focus on creating agentic AI-powered solutions that enhance the capabilities of technical experts and decision-makers. The objective is to establish an open data and AI infrastructure using SLB’s Lumi™ platform to unify data and workflows across various aspects of energy exploration and production.",
      "url": "https://www.businesswire.com/news/home/20251211832051/en/SLB-Enters-Collaboration-Agreement-to-Accelerate-New-Digital-Solutions",
      "source": "Business Wire",
      "published": "20251211T130847",
      "overall_sentiment_score": 0.303878,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.296362,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.615602
    },
    {
      "title": "2024 tax contributions for Equinor",
      "summary": "Equinor's total tax contribution for 2024 reached USD 25.8 billion, including employment taxes, reflecting strong financial results despite normalizing energy markets. Of this, USD 23.1 billion was paid globally in tax, host government entitlement, royalty, and fee payments, with USD 19.2 billion directed to Norway where the company has major operations. CFO Torgrim Reitan emphasized the importance of stable tax regimes for large-scale energy projects and transparency in tax contributions for societal progress.",
      "url": "https://www.equinor.com/news/20251211-tax-contributions-2024",
      "source": "Equinor",
      "published": "20251211T112000",
      "overall_sentiment_score": 0.385339,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.287975,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.635894
    },
    {
      "title": "Cenovus announces 2026 capital budget and corporate guidance",
      "summary": "Cenovus Energy Inc. announced its 2026 capital budget and corporate guidance. The company plans capital investment between $5.0 billion and $5.3 billion, with upstream production targeting 945,000 to 985,000 BOE/d and downstream crude throughput between 430,000 and 450,000 bbls/d. This guidance reflects a planned reduction in growth investments from 2025 and integration of MEG Energy Corp. operations.",
      "url": "https://boereport.com/2025/12/11/cenovus-announces-2026-capital-budget-and-corporate-guidance/",
      "source": "BOE Report",
      "published": "20251211T040000",
      "overall_sentiment_score": 0.182932,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.135579,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.621414
    },
    {
      "title": "Exxon Mobil Ups Growth Targets And Lowers Spending Plans",
      "summary": "Exxon Mobil has increased its long-term growth targets and reduced spending plans, projecting an additional $25 billion in earnings and $35 billion in extra cash flow from 2024 to 2030, driven by strong Permian basin output and $20 billion in cost cuts. This revised outlook indicates a higher production target of 5.5 million barrels of oil equivalent per day and $145 billion in surplus cash flow, enabling more shareholder returns through dividends and buybacks. Morgan Stanley raised its price target for Exxon Mobil to $137 per share, citing the company's efficiency and resilience in adapting to evolving energy markets.",
      "url": "https://finimize.com/content/exxon-mobil-ups-growth-targets-and-lowers-spending-plans",
      "source": "Finimize",
      "published": "20251210T160636",
      "overall_sentiment_score": 0.447295,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.42712,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Exxon Mobil (XOM) Upgraded to Neutral by BNPP",
      "summary": "Exxon Mobil (XOM) has been upgraded to 'Neutral' from 'Underperform' by BNPP analyst Lucas Herrmann, with a price target of $114. This follows UBS initiating coverage with a 'Buy' rating and a $145 price target due to positive earnings revisions and strong shareholder returns. The company reported free cash flow of $6.3 billion in Q3, with $9.4 billion in shareholder returns, and increased its quarterly dividend.",
      "url": "https://finviz.com/news/251050/exxon-mobil-xom-upgraded-to-neutral-by-bnpp",
      "source": "Finviz",
      "published": "20251210T151200",
      "overall_sentiment_score": 0.022955,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.035448,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.31539
    },
    {
      "title": "These Analysts Cut Their Forecasts On Ollie's Bargain Outlet After Q3 Earnings",
      "summary": "Ollie's Bargain Outlet reported mixed third-quarter results, beating analyst consensus for earnings per share but missing on sales. Despite raising its full-year sales and earnings guidance, the company's shares experienced a slight decline. Following the earnings announcement, analysts from UBS and Piper Sandler adjusted their price targets for the stock.",
      "url": "https://www.sahmcapital.com/news/content/these-analysts-cut-their-forecasts-on-ollies-bargain-outlet-after-q3-earnings-2025-12-10",
      "source": "Sahm",
      "published": "20251210T140919",
      "overall_sentiment_score": 0.155905,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.237037,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.637494
    },
    {
      "title": "Can Air Products (APD) Use Yara Partnership Talks to Reframe Its Clean-Energy Capital Strategy?",
      "summary": "Air Products and Chemicals and Yara International are in advanced talks to partner on low-emission ammonia projects, which could significantly impact Air Products' funding and monetization strategies for its clean-energy ventures. This partnership could help Air Products convert large capital projects into sustainable earnings and cash flow, but investors should still monitor potential free cash flow strain from long-duration projects like the NEOM Green Hydrogen Project and the Louisiana Clean Energy Complex. The article suggests that Air Products has a projected fair value of $308.86, representing a 34% upside.",
      "url": "https://simplywall.st/stocks/us/materials/nyse-apd/air-products-and-chemicals/news/can-air-products-apd-use-yara-partnership-talks-to-reframe-i",
      "source": "Simply Wall Street",
      "published": "20251210T140741",
      "overall_sentiment_score": 0.144663,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.06308,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.583339
    },
    {
      "title": "Goldman Sachs CFO on the company’s AI reboot, talent, and growth",
      "summary": "Goldman Sachs CFO Denis Coleman discusses the firm's OneGS 3.0 initiative, a multiyear effort to integrate AI across all operations to boost productivity and growth. He also addresses the company's selective talent acquisition, despite recent headcount reductions, and offers an optimistic outlook on the U.S. economy, including a forecast for Fed rate cuts and a strong M&A environment. The article highlights how Goldman Sachs is fundamentally rethinking operations through AI and maintaining a high bar for talent.",
      "url": "https://fortune.com/2025/12/10/goldman-sachs-cfo-on-the-companys-ai-reboot-talent-and-growth/",
      "source": "Fortune",
      "published": "20251210T131433",
      "overall_sentiment_score": 0.253023,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.125811,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.718255
    },
    {
      "title": "Retirement Stock Portfolio: 11 Energy Stocks To Buy",
      "summary": "This article is part of a larger list detailing 11 energy stocks suitable for a retirement portfolio, focusing specifically on Consolidated Edison, Inc. (NYSE:ED). It highlights ED's role as a major energy provider in New York, its recent divestment of a Mountain Valley Pipeline stake for $357.5 million, and political pressure regarding its rates. The article presents a snapshot of investment considerations for Consolidated Edison.",
      "url": "https://www.insidermonkey.com/blog/retirement-stock-portfolio-11-energy-stocks-to-buy-1657425/4",
      "source": "Insider Monkey",
      "published": "20251210T115900",
      "overall_sentiment_score": 0.121975,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.218385,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.626186
    },
    {
      "title": "Kontoor Brands (KTB) Stock on December 9, 2025: Q3 Beat, Analyst Upgrades and Volatile Trading Create a 2026 Upside Story",
      "summary": "Kontoor Brands (KTB) is described as being in an \"interesting sweet spot\" as of December 9, 2025, with strong fundamentals and bullish analyst targets, despite share price volatility due to broader consumer and interest-rate concerns. Analysts have raised price targets, and the company reported a strong Q3 2025 earnings beat and raised its full-year outlook. The article highlights KTB's dividend growth and the debate among investors regarding its current valuation amidst macro-economic pressures.",
      "url": "https://ts2.tech/en/kontoor-brands-ktb-stock-on-december-9-2025-q3-beat-analyst-upgrades-and-volatile-trading-create-a-2026-upside-story/",
      "source": "ts2.tech",
      "published": "20251210T110945",
      "overall_sentiment_score": 0.038557,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.20567,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.583268
    },
    {
      "title": "Exxon CFO to Retire",
      "summary": "Kathy Mikells, Exxon Mobil Corp.'s CFO and the first outsider to reach such a senior executive position, is retiring on February 1 to focus on her health. Mikells joined Exxon in 2021 and was instrumental in modernizing its finance function and improving investor communications. She will be succeeded by Neil Hansen, a 25-year Exxon veteran.",
      "url": "https://www.rigzone.com/news/wire/exxon_cfo_to_retire-10-dec-2025-182502-article/",
      "source": "Rigzone",
      "published": "20251210T103600",
      "overall_sentiment_score": 0.144145,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.135761,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 1.0
    },
    {
      "title": "WD-40 (WDFC) Valuation Check After Revenue Beat But EBITDA Miss In Latest Earnings",
      "summary": "WD-40 (WDFC) reported mixed Q3 results with a revenue beat but an EBITDA miss, leading to a reassessment of its valuation by investors, especially given its stock's significant year-to-date decline. While a narrative fair value suggests the stock is 27.9% undervalued due to premiumization efforts, traditional valuation metrics like P/E ratio indicate it is rich compared to its industry and peers. Investors are now weighing the potential for future growth from product mix shifts against current market sentiment and a fading momentum for the stock.",
      "url": "https://simplywall.st/stocks/us/household/nasdaq-wdfc/wd-40/news/wd-40-wdfc-valuation-check-after-revenue-beat-but-ebitda-mis",
      "source": "Simply Wall Street",
      "published": "20251210T041106",
      "overall_sentiment_score": -0.065094,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.009567,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.617451
    },
    {
      "title": "Fluor, JGC Complete First Phase of LNG Canada Project",
      "summary": "A joint venture between Fluor and JGC Corporation has completed Train 2 of the LNG Canada project, marking the initial phase of Canada's first large-scale liquefied natural gas export facility. The liquefaction unit was handed over to LNG Canada on December 1, and the JV is now working on the front-end engineering and design for the second phase of the expansion plan. The facility in Kitimat, British Columbia, has an annual production capacity of 14 million tons of LNG, with plans to double this under a 40-year export license.",
      "url": "https://breakbulk.com/articles/fluor-jgc-complete-first-phase-lng-canada",
      "source": "Breakbulk Events & Media",
      "published": "20251209T190932",
      "overall_sentiment_score": 0.162049,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.340023,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.642397
    },
    {
      "title": "Exxon Mobil (NYSE: XOM) appoints Neil Hansen CFO as Mikells retires",
      "summary": "Exxon Mobil announced that Neil A. Hansen will succeed Kathryn A. Mikells as Senior Vice President and Chief Financial Officer, effective February 1, 2026. Mikells is retiring to focus on her recovery from a debilitating health issue. Hansen, currently President of ExxonMobil Global Business Solutions, will receive an annual salary of $1.02 million and be eligible for bonus and equity incentive programs.",
      "url": "https://www.stocktitan.net/sec-filings/XOM/8-k-exxon-mobil-corp-reports-material-event-7b4607d6d9a2.html",
      "source": "Stock Titan",
      "published": "20251209T181845",
      "overall_sentiment_score": 0.015387,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.010668,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 1.0
    },
    {
      "title": "Exxon Mobil Corp. CFO Kathy Mikells to retire for health reasons, successor named",
      "summary": "Exxon Mobil CFO Kathy Mikells is retiring on February 1st for health reasons, a decision she expressed disappointment about. She praised her successor who will take over the finance leadership role. The article, however, does not name the successor.",
      "url": "https://www.bizjournals.com/houston/news/2025/12/09/exxon-mobil-corp-cfo-kathy-mikells-retire-health.html",
      "source": "The Business Journals",
      "published": "20251209T171450",
      "overall_sentiment_score": -0.126699,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.104048,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 1.0
    },
    {
      "title": "ExxonMobil shares rise after raising earnings and cash flow targets",
      "summary": "ExxonMobil has significantly raised its targets for future earnings and cash flow, projecting $25 billion and $35 billion in growth respectively by 2030, driven by key assets and cost savings. The company expects upstream production to reach 5.5 million oil-equivalent barrels per day by 2030, with a focus on advantaged assets in the Permian Basin, Guyana, and LNG projects. These strong projections, including annual earnings growth of 13% and substantial surplus cash flow, led to a 3.1% increase in ExxonMobil's shares during early trading.",
      "url": "https://www.proactiveinvestors.com/companies/news/1084078/exxonmobil-shares-rise-after-raising-earnings-and-cash-flow-targets-1084078.html",
      "source": "Proactive financial news",
      "published": "20251209T165649",
      "overall_sentiment_score": 0.845324,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.808988,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Exxon Mobil Sees Higher Earnings, Greater Returns in New 2030 Plan",
      "summary": "Exxon Mobil has raised its financial outlook for 2030, projecting higher earnings and cash flow due to stronger assets, a more profitable business mix, and cost reductions from its transformation efforts. The company now expects $25 billion in earnings growth and $35 billion in cash flow growth between 2024 and 2030, which is a $5 billion improvement over previous forecasts.",
      "url": "https://www.wsj.com/business/energy-oil/exxon-mobil-sees-higher-earnings-greater-returns-in-new-2030-plan-1fa7590d?gaa_at=eafs&gaa_n=AWEtsqcrbplWg2LgEXklO98lnQ8bcj5pUWo969cKBpKiapdOd0y4yJMQQp-C&gaa_ts=6938cb42&gaa_sig=kBj8_e7jqYjB-IOEgyEN6qxvwRsU5WYSk4Ts_OvqpWSnpbdB9_JRys55-BRyTQBXqSulnJlPZYEGyiU371X9sQ%3D%3D",
      "source": "The Wall Street Journal",
      "published": "20251209T151014",
      "overall_sentiment_score": 0.4992,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.459796,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Exxon Mobil Sees Higher Earnings, Greater Returns in New 2030 Plan",
      "summary": "Exxon Mobil has updated its financial outlook for 2030, projecting an increase of $5 billion in both earnings and cash flow growth compared to previous forecasts. The company now expects $25 billion in earnings growth and $35 billion in cash flow growth between 2024 and 2030, attributing this improvement to stronger assets, a more profitable business mix, and cost reductions from its transformation efforts.",
      "url": "https://www.wsj.com/business/energy-oil/exxon-mobil-sees-higher-earnings-greater-returns-in-new-2030-plan-1fa7590d?gaa_at=eafs&gaa_n=AWEtsqdiO19WPMUpfPSnDxG7aseCdN4d3huK6aR8pLKCPFT-zLzA8jE2Bl8C&gaa_ts=6938d95d&gaa_sig=Pl-GBEU54tN-km77CvfBinbInprCEqsqHObz6Vz6Y5V71Ddi-9N4S7e3UZIkOMr5bXT8J9tkMi2opbAg0nzJvQ%3D%3D",
      "source": "The Wall Street Journal",
      "published": "20251209T151005",
      "overall_sentiment_score": 0.450352,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.487438,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    }
  ]
}