{
  "ticker": "XOM",
  "date": "2025-06-09",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T13:42:38.770046",
  "source": "alpha_vantage",
  "article_count": 8,
  "articles": [
    {
      "title": "North Atlantic in Talks with ExxonMobil to Buy French Refinery Complex",
      "summary": "ExxonMobil has entered exclusive negotiations with North Atlantic for the potential sale of its refining and petrochemical complex in Gravenchon, Normandy, France. The deal involves divesting an 82.89 percent stake in Esso Société Anonyme Française SA and 100 percent of ExxonMobil Chemical France SAS, with North Atlantic committing to retain all current employees under the same terms. This acquisition aligns with North Atlantic's strategy to enhance its transatlantic presence and ExxonMobil's ongoing efforts to high-grade its portfolio through the sale of non-strategic assets.",
      "url": "https://www.rigzone.com/news/north_atlantic_in_talks_with_exxonmobil_to_buy_french_refinery_complex-29-may-2025-180678-article/",
      "source": "Rigzone",
      "published": "20250529T052100",
      "overall_sentiment_score": 0.142174,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.134739,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 1.0
    },
    {
      "title": "U.S. cancels $3.7 billion for clean energy, including $331 million Exxon grant",
      "summary": "The Energy Department has canceled $3.7 billion in government support for clean energy projects, deeming them economically unviable and not a positive return on taxpayer investment. This includes a $331 million grant to Exxon Mobil Corp. for a hydrogen project and other significant awards to Eastman Chemical Co. and Calpine Corp. The cancellations follow an audit policy and an internal proposal to shut down the $27 billion clean energy office.",
      "url": "https://www.worldoil.com/news/2025/6/2/u-s-cancels-3-7-billion-for-clean-energy-including-331-million-exxon-grant/",
      "source": "World Oil",
      "published": "20250602T000000",
      "overall_sentiment_score": -0.318792,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.332425,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 1.0
    },
    {
      "title": "Shell, Occidental Petroleum And Exxon Mobil Rise In Monday Premarket: What's Going On?",
      "summary": "Shell, Occidental Petroleum, Exxon Mobil, and Chevron saw pre-market increases on Monday after oil prices surged over 3%. This rise was a result of the OPEC+ group's decision to maintain its existing output increase for July, marking the third consecutive month of such hikes. The decision comes amidst ongoing significant changes in the global oil industry, including a battle for a share in a massive Guyanese oil project.",
      "url": "https://www.sahmcapital.com/news/content/shell-occidental-petroleum-and-exxon-mobil-rise-in-monday-premarket-whats-going-on-2025-06-02",
      "source": "Sahm",
      "published": "20250602T134000",
      "overall_sentiment_score": 0.238148,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.13738,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.838706
    },
    {
      "title": "CrossAmerica Partners LP",
      "summary": "CrossAmerica Partners LP is a major petroleum distributor and convenience store operator, ranking 24th among convenience store chains with 365 stores. In 2024, the company acquired 59 convenience stores from Applegreen Midwest and Applegreen Florida for $16.9 million, expanding its footprint across multiple states. CrossAmerica operates various retail brands and distributes fuel to approximately 1,750 locations with relationships across major oil brands.",
      "url": "https://cspdailynews.com/top-202-convenience-stores-2025/crossamerica-partners-lp",
      "source": "CSP Daily News",
      "published": "20250530T052225",
      "overall_sentiment_score": 0.157887,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.135947,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.63501
    },
    {
      "title": "Earnings Summary: Old Dominion Freight Line issues update on second quarter 2025",
      "summary": "Old Dominion Freight Line, Inc. provided operating metrics for May 2025, showing a 5.8% decrease in revenue per day compared to the prior year, primarily due to an 8.4% decrease in LTL tons per day. This decline was attributed to continued softness in the domestic economy and lower fuel prices, despite an increase in LTL revenue per hundredweight for the quarter-to-date period. The company remains focused on its long-term strategic plan amidst an uncertain macroeconomic environment.",
      "url": "https://news.alphastreet.com/earnings-summary-old-dominion-freight-line-issues-update-on-second-quarter-2025/",
      "source": "AlphaStreet",
      "published": "20250605T000000",
      "overall_sentiment_score": -0.173984,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.243063,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.617551
    },
    {
      "title": "Key highlights from Best Buy’s (BBY) Q1 2026 earnings results",
      "summary": "Best Buy (NYSE: BBY) reported its Q1 2026 earnings, with enterprise revenue slightly down to $8.76 billion from $8.84 billion in the prior year and comparable sales falling 0.7%. Net earnings decreased to $202 million ($0.95 per share), with adjusted EPS at $1.15. The company provided fiscal year 2026 guidance, expecting revenue between $41.1-41.9 billion, comparable sales ranging from down 1% to up 1%, and adjusted EPS of $6.15-6.30.",
      "url": "https://news.alphastreet.com/key-highlights-from-best-buys-bby-q1-2026-earnings-results/",
      "source": "AlphaStreet",
      "published": "20250529T000000",
      "overall_sentiment_score": -0.256036,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.39137,
      "ticker_sentiment_label": "Bearish",
      "relevance_score": 0.610153
    },
    {
      "title": "Gold Just Got Cheaper and It’s Jet Fuel for This 8.3% Dividend",
      "summary": "This article argues that a recent dip in gold prices presents a unique opportunity for investors to consider two high-dividend gold-related plays, paying up to 8.3%. It explains that a \"no-landing\" economy, combined with stimulative government policies and Fed actions aimed at curbing long-term rates while allowing for inflation, will fuel gold's rise. The author recommends the GAMCO Global Gold, Natural Resources & Income Trust (GGN) for income and Newmont Corp. (NEM) for dividend growth and price appreciation, highlighting their potential benefits in the current economic climate.",
      "url": "https://contrarianoutlook.com/gold-just-got-cheaper-and-its-jet-fuel-for-this-8-3-dividend/",
      "source": "Contrarian Outlook",
      "published": "20250603T000000",
      "overall_sentiment_score": 0.398826,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.214799,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.59151
    },
    {
      "title": "Baker Hughes and Cactus form joint venture for surface pressure control services",
      "summary": "Baker Hughes and Cactus Inc. are forming a joint venture for surface pressure control services. Baker Hughes will transfer its surface pressure control product line to the new entity, retaining a 35% stake, while Cactus will hold a 65% ownership and operational control. This partnership aims to combine their complementary portfolios to drive technological innovation, expand into international markets for Cactus, and supports Baker Hughes' strategy to optimize its portfolio and enhance earnings.",
      "url": "https://www.energyconnects.com/news/technology/2025/june/baker-hughes-and-cactus-form-joint-venture-for-surface-pressure-control-services/",
      "source": "Energy Connects",
      "published": "20250603T002854",
      "overall_sentiment_score": 0.244241,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.057216,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.550714
    }
  ]
}