{
  "ticker": "XOM",
  "date": "2025-10-13",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T13:44:02.636424",
  "source": "alpha_vantage",
  "article_count": 50,
  "articles": [
    {
      "title": "ExxonMobil (XOM): Strong Cash Flow and Strategic Investments Drive Dividend Confidence - Insider Monkey",
      "summary": "Exxon Mobil Corporation (XOM) is positioned for strong earnings and cash flow growth through 2030 due to increasing global energy demand and strategic investments in development projects and the Permian Basin. The company anticipates these investments will significantly boost annual earnings and cash flow, enabling it to maintain and grow its dividend, which it has increased for 42 consecutive years. While acknowledging XOM's potential, the article also highlights the author's conviction in other AI stocks with higher return potential.",
      "url": "https://www.insidermonkey.com/blog/exxonmobil-xom-strong-cash-flow-and-strategic-investments-drive-dividend-confidence-1627241/?amp=1",
      "source": "Insider Monkey",
      "published": "20251013T235546",
      "overall_sentiment_score": 0.427815,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.449855,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "ExxonMobil (XOM): Strong Cash Flow and Strategic Investments Drive Dividend Confidence - Insider Monkey",
      "summary": "Exxon Mobil Corporation (XOM) is well-positioned for strong earnings and cash flow growth through 2030, driven by strategic investments in major development projects and the Permian Basin. The company expects these investments to generate significant annual earnings and cash flow, supporting its ability to maintain and grow dividends, having already increased them for 42 consecutive years. Despite XOM's potential, the article suggests that certain AI stocks may offer even greater promise for higher returns and limited downside risk.",
      "url": "https://www.insidermonkey.com/blog/exxonmobil-xom-strong-cash-flow-and-strategic-investments-drive-dividend-confidence-1627241/",
      "source": "Insider Monkey",
      "published": "20251013T235227",
      "overall_sentiment_score": 0.491252,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.456838,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Exxon Mobil's Steadfast Dividend Signals Stability in a Volatile Market",
      "summary": "Exxon Mobil's consistent quarterly dividend declarations serve as a beacon of financial resilience and commitment to shareholder returns, especially for income-focused investors amidst market uncertainties. The company boasts an impressive track record of increasing its dividend for 43 consecutive years, positioning it as a cornerstone for portfolios prioritizing stable income. This steadfast dividend strategy also sets a high benchmark for the energy sector, highlighting Exxon Mobil's financial strength and disciplined management as it navigates energy transition complexities.",
      "url": "https://markets.financialcontent.com/stocks/article/marketminute-2025-10-13-exxon-mobils-steadfast-dividend-signals-stability-in-a-volatile-market",
      "source": "FinancialContent",
      "published": "20251013T212300",
      "overall_sentiment_score": 0.53994,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.72835,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Tracy Shuchart: JPMorgan Chase launches $1.5 trillion initiative - Traders Union",
      "summary": "JPMorgan Chase has announced a $1.5 trillion Security and Resiliency Initiative aimed at strengthening critical industries. This ambitious plan is highlighted by industry observer Tracy Shuchart, who emphasizes its importance in the current global economic environment. The initiative underscores a broader industry shift toward strategic investment and collaboration.",
      "url": "https://tradersunion.com/news/market-voices/show/658679-jpmorgan-launches-initiative/",
      "source": "Traders Union",
      "published": "20251013T210019",
      "overall_sentiment_score": 0.284984,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.116116,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.414841
    },
    {
      "title": "JPMorgan Taps Energy, Critical Minerals in $10B U.S. Security Investment - Crude Oil Prices Today | OilPrice.com",
      "summary": "JPMorgan Chase plans to invest up to $10 billion in U.S. companies crucial for national security, focusing on energy, nuclear power, grid infrastructure, and critical minerals. This \"Security and Resiliency Initiative\" aims to strengthen the country's industrial base, aligning with forecasts predicting a global oil market deficit and emphasizing the importance of securing critical minerals. JPMorgan will offer direct lending, equity stakes, and advisory services to support these strategic sectors.",
      "url": "https://oilprice.com/Latest-Energy-News/World-News/JPMorgan-Taps-Energy-Critical-Minerals-in-10B-US-Security-Investment.html",
      "source": "Crude Oil Prices Today | OilPrice.com",
      "published": "20251013T203000",
      "overall_sentiment_score": 0.295042,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.277371,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.486714
    },
    {
      "title": "JPMorgan Taps Energy, Critical Minerals in $10B U.S. Security Investment - Crude Oil Prices Today | OilPrice.com",
      "summary": "JPMorgan Chase plans to invest up to $10 billion in U.S. companies involved in national security, including energy, nuclear power, grid infrastructure, and critical minerals. This initiative, labeled \"Security and Resiliency Initiative,\" aims to strengthen the country's industrial base by focusing on energy independence, defense manufacturing, critical minerals, and advanced technologies. The investment strategy aligns with JPMorgan's prior forecasts about global oil market deficits and the importance of critical minerals for global economic strategy, seeking to reduce dependence on China.",
      "url": "https://oilprice.com/Latest-Energy-News/World-News/JPMorgan-Taps-Energy-Critical-Minerals-in-10B-US-Security-Investment.amp.html",
      "source": "Crude Oil Prices Today | OilPrice.com",
      "published": "20251013T203000",
      "overall_sentiment_score": 0.325276,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.206225,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.335568
    },
    {
      "title": "ExxonMobil retreats from Europe, credits Trump for pro-oil stance - Oil & Gas 360",
      "summary": "ExxonMobil is reducing its investments and selling assets in Europe, citing the bloc's \"unpractical\" climate and human rights regulations. Conversely, the company credits former President Trump for a \"more balanced conversation\" and explicit recognition of energy's vital role. Despite this political alignment, ExxonMobil expresses concerns about the declining growth in U.S. shale oil output and notes that its recent return to Iraq, specifically the Majnoon oil field, still faces a \"long road ahead.\"",
      "url": "https://www.oilandgas360.com/exxonmobil-retreats-from-europe-credits-trump-for-pro-oil-stance/",
      "source": "Oil & Gas 360",
      "published": "20251013T194054",
      "overall_sentiment_score": -0.210449,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.227875,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 1.0
    },
    {
      "title": "ExxonMobil to Release Third Quarter 2025 Financial Results - The AI Journal",
      "summary": "Exxon Mobil Corporation (NYSE: XOM) announced it will release its third-quarter 2025 financial results on Friday, October 31, 2025. A press release will be issued at 5:30 a.m. CT, followed by a live conference call at 8:30 a.m. CT with Chairman and CEO Darren Woods, Senior Vice President and CFO Kathy Mikells, and Vice President Jim Chapman to review the results.",
      "url": "https://aijourn.com/exxonmobil-to-release-third-quarter-2025-financial-results/",
      "source": "The AI Journal",
      "published": "20251013T193051",
      "overall_sentiment_score": 0.033871,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.022401,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 1.0
    },
    {
      "title": "ExxonMobil to Release Third Quarter 2025 Financial Results - Exxon Mobil Corporation",
      "summary": "Exxon Mobil Corporation (NYSE: XOM) announced it will release its third-quarter 2025 financial results on Friday, October 31, 2025, via a press release at 5:30 a.m. CT. A live conference call to review the results will be held at 8:30 a.m. CT, featuring Darren Woods, Kathy Mikells, and Jim Chapman.",
      "url": "https://investor.exxonmobil.com/company-information/press-releases/detail/1195/exxonmobil-to-release-third-quarter-2025-financial-results",
      "source": "Exxon Mobil Corporation",
      "published": "20251013T192522",
      "overall_sentiment_score": 0.086373,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.064352,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 1.0
    },
    {
      "title": "ExxonMobil to Release Third Quarter 2025 Financial Results - MarketScreener",
      "summary": "Exxon Mobil Corporation (XOM) announced it will release its third-quarter 2025 financial results on Friday, October 31, 2025, via a press release. Top executives, including Chairman and CEO Darren Woods and CFO Kathy Mikells, will host a live conference call to discuss the results. An archive replay and presentation materials will be available online for public access.",
      "url": "https://www.marketscreener.com/news/exxonmobil-to-release-third-quarter-2025-financial-results-ce7d5ad8d08ef027",
      "source": "MarketScreener",
      "published": "20251013T192108",
      "overall_sentiment_score": 0.19033,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.221473,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.934931
    },
    {
      "title": "Chord Energy Drills Deeper For Growth In Williston Basin - Finimize",
      "summary": "Chord Energy is focusing on long lateral wells and its recent acquisition of ExxonMobil assets to boost efficiency and scale in the Williston Basin. The company's strategy includes 4-mile lateral drilling and maintaining steady oil output, with an expected increase in efficient growth through 2026. This move reflects a broader industry trend in US shale towards longer wells and significant buyouts for improved financial discipline and scale.",
      "url": "https://finimize.com/content/chord-energy-drills-deeper-for-growth-in-williston-basin",
      "source": "Finimize",
      "published": "20251013T191431",
      "overall_sentiment_score": 0.104691,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.113604,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.645693
    },
    {
      "title": "Energy Fuels (UUUU) Shares Are Trading Higher Monday: What's Going On? - Sahm",
      "summary": "Energy Fuels Inc. shares are trading higher after China's Commerce Ministry announced new export controls on rare earth materials, requiring approval for foreign suppliers. These restrictions, effective December 1, expand China's oversight from raw materials to intellectual property and technologies, which analysts believe could deepen global dependence on Chinese rare earth know-how. The move is expected to limit global supply, boosting demand for non-Chinese producers like Energy Fuels and impacting rare earth stocks positively.",
      "url": "https://www.sahmcapital.com/news/content/energy-fuels-uuuu-shares-are-trading-higher-monday-whats-going-on-2025-10-13",
      "source": "Sahm",
      "published": "20251013T174845",
      "overall_sentiment_score": 0.176684,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.1439,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.323232
    },
    {
      "title": "Barclays Lowers EOG Resources (EOG) PT to $136, Cites Broader Oil and E&P Sector Cuts - Insider Monkey",
      "summary": "Barclays has lowered its price target for EOG Resources (EOG) to $136 from $140, maintaining an Equal Weight rating, citing broader cuts across the oil and E&P sector for 2026. This adjustment follows EOG Resources' Q2 2025 financial results, where adjusted net income was $1.3 billion and total revenue was $5.478 billion, despite production volumes exceeding guidance across all commodities. EOG Resources, a company involved in the exploration, development, production, and marketing of crude oil, NGLs, and natural gas, is considered a good value stock but the article suggests that some AI stocks may offer higher returns.",
      "url": "https://www.insidermonkey.com/blog/barclays-lowers-eog-resources-eog-pt-to-136-cites-broader-oil-and-ep-sector-cuts-1626642/",
      "source": "Insider Monkey",
      "published": "20251013T133339",
      "overall_sentiment_score": 0.088308,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.123692,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.321852
    },
    {
      "title": "ExxonMobil retreats from Europe, credits Trump for pro-oil stance - World Oil",
      "summary": "Exxon Mobil Corp. CEO Darren Woods criticized the European Union's energy policies while praising former U.S. President Donald Trump's pro-oil stance. Exxon is slowing investment and selling assets in Europe, with Woods citing the bloc's \"unpractical\" climate and human rights regulations. Woods also expressed concerns about the declining growth in U.S. shale oil output and acknowledged the long road ahead for their return to Iraq.",
      "url": "https://www.worldoil.com/news/2025/10/13/exxonmobil-retreats-from-europe-credits-trump-for-pro-oil-stance/",
      "source": "World Oil",
      "published": "20251013T130056",
      "overall_sentiment_score": 0.128507,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.142306,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.917991
    },
    {
      "title": "ExxonMobil retreats from Europe, credits Trump for pro-oil stance - World Oil",
      "summary": "Exxon Mobil Corp. CEO Darren Woods criticized the European Union's energy policies, describing them as over-prescriptive and hindering. In contrast, Woods praised U.S. President Donald Trump's pro-oil stance for recognizing energy's vital role in economic growth. As a result, Exxon is slowing investment and selling assets in Europe, while also noting challenges in increasing U.S. shale oil output.",
      "url": "https://worldoil.com/news/2025/10/13/exxonmobil-retreats-from-europe-credits-trump-for-pro-oil-stance/",
      "source": "World Oil",
      "published": "20251013T130056",
      "overall_sentiment_score": -0.226361,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.20238,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 1.0
    },
    {
      "title": "Here is Why Murphy Oil Corporation (MUR) Fell This Week - Insider Monkey",
      "summary": "Murphy Oil Corporation (NYSE:MUR) saw its share price drop by 12.09% between October 3 and October 10, 2025, primarily due to a downturn in global crude oil prices and escalating trade tensions between the US and China. Despite the stock's decline, Scotiabank raised its price target for MUR from $26 to $30 while maintaining a \"Sector Perform\" rating, and the company declared a quarterly dividend of $0.325 per share. The article also touches on a broader discussion about AI stocks and their potential, suggesting that some AI investments might offer higher returns.",
      "url": "https://www.insidermonkey.com/blog/here-is-why-murphy-oil-corporation-mur-fell-this-week-1626804/",
      "source": "Insider Monkey",
      "published": "20251013T114652",
      "overall_sentiment_score": -0.211064,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.20055,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.32535
    },
    {
      "title": "Here is Why SM Energy Company (SM) Fell This Week - Insider Monkey",
      "summary": "SM Energy Company (NYSE:SM) saw its share price fall by 12.57% due to a sharp drop in global crude oil prices and renewed trade tensions between the US and China. Mizuho also lowered its price target for SM, although maintaining an 'Outperform' rating. The company is reportedly considering a merger with Civitas Resources amidst consolidation in the American shale industry.",
      "url": "https://www.insidermonkey.com/blog/here-is-why-sm-energy-company-sm-fell-this-week-1626806/",
      "source": "Insider Monkey",
      "published": "20251013T114652",
      "overall_sentiment_score": 0.122692,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.1208,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.345928
    },
    {
      "title": "BP to sell North Sea asset stakes to Serica Energy for at least $232M (BP:NYSE) - Seeking Alpha",
      "summary": "Serica Energy announced its agreement to acquire BP's stakes in the P111 and P2544 licenses in the U.K. North Sea. The deal is valued at $232 million in upfront cash.",
      "url": "https://seekingalpha.com/news/4503552-bp-to-sell-north-sea-asset-stakes-to-serica-energy-for-at-least-232m",
      "source": "Seeking Alpha",
      "published": "20251013T113025",
      "overall_sentiment_score": 0.042009,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.043824,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.340025
    },
    {
      "title": "Exxon Says EU Business Retreating, Trump Approach ‘Balanced’ - Bloomberg.com",
      "summary": "Exxon Mobil Corp. CEO Darren Woods criticized the European Union's climate and human rights legislation, stating it causes the company to slow investment and sell assets in Europe. Woods contrasted this with what he described as a \"balanced\" approach from the Trump administration in the US regarding energy strategy.",
      "url": "https://www.bloomberg.com/news/articles/2025-10-13/exxon-says-eu-business-retreating-trump-approach-balanced",
      "source": "Bloomberg.com",
      "published": "20251013T101721",
      "overall_sentiment_score": -0.236936,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.218705,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 1.0
    },
    {
      "title": "ENI, YPF finalise agreement for LNG project in Argentina - Offshore Technology",
      "summary": "Italy's Eni and Argentina's state-owned YPF have finalized an agreement for an LNG project in the Vaca Muerta field, following a meeting between Eni CEO Claudio Descalzi and Argentinian President Javier Milei. The project involves developing the Vaca Muerta gas field for both upstream and midstream operations, aiming to export up to 30 million tonnes per annum (mtpa) of LNG through floating liquefaction units. This initiative aligns with Eni's strategy to support energy transition by prioritizing gas production and is expected to require significant investment in infrastructure and upstream development.",
      "url": "https://www.offshore-technology.com/news/eni-ypf-finalise-lng-project-agreement/",
      "source": "Offshore Technology",
      "published": "20251013T101143",
      "overall_sentiment_score": 0.348125,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.30866,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.305856
    },
    {
      "title": "Oil Prices Rebound from Five-Month Lows as U.S.–China Trade Talks Offer Hope",
      "summary": "Oil prices rebounded from five-month lows due to anticipated trade talks between the U.S. and China, offering hope for eased tensions. Brent crude rose by 1.5% to $63.67 per barrel, and WTI increased by 1.54% to $59.81. Analysts suggest a potential meeting between President Trump and President Xi Jinping could stabilize oil prices, despite recent volatility caused by trade threats and geopolitical events.",
      "url": "https://investorsking.com/2025/10/13/oil-prices-rebound-from-five-month-lows-as-u-s-china-trade-talks-offer-hope/",
      "source": "Investors King",
      "published": "20251013T095729",
      "overall_sentiment_score": 0.31066,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.345996,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.512501
    },
    {
      "title": "Aramco, NVIDIA Expect Gusher of Energy Insights From New Quantum Computing Emulator - The Quantum Insider",
      "summary": "Saudi Aramco has developed Dammam 7Q, one of the region's largest quantum computing emulators, to enhance energy exploration and computational research. Built on Aramco’s Dammam 7 supercomputer and powered by NVIDIA’s CUDA-Q platform, the emulator simulates up to 30 qubits per GPU, enabling researchers to test hybrid quantum algorithms and process massive seismic datasets. This initiative positions Aramco as a leader in hybrid supercomputing, preparing for future quantum-enabled exploration technologies and demonstrating the practical application of quantum-based techniques in seismic fault detection.",
      "url": "https://thequantuminsider.com/2025/10/13/aramco-nvidia-expect-gusher-of-energy-insights-from-new-quantum-computing-emulator/",
      "source": "The Quantum Insider",
      "published": "20251013T072658",
      "overall_sentiment_score": 0.322848,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.245582,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.346439
    },
    {
      "title": "Serica Energy Eyes Acquisition of BP’s North Sea Assets - AskTraders.com",
      "summary": "Serica Energy plc is pursuing the acquisition of BP's stakes in the P111 and P2544 licenses in the UK Central North Sea, which includes a 32% interest in the Culzean gas condensate field. The deal, valued at an upfront cash consideration of $232 million, aims to significantly boost Serica's production and cash flow. The acquisition is subject to pre-emption rights from other Culzean field partners and will be funded through a mix of cashflows and existing financial resources.",
      "url": "https://www.asktraders.com/analysis/serica-energy-eyes-transformative-acquisition-of-bps-north-sea-assets/",
      "source": "AskTraders.com",
      "published": "20251013T065955",
      "overall_sentiment_score": 0.0196,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.021303,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.33351
    },
    {
      "title": "Serica Energy to acquire BP’s stake in UK North Sea gas field - Investing.com",
      "summary": "Serica Energy plc announced an agreement to acquire BP’s entire stake in the P111 and P2544 licences in the UK Central North Sea, which includes a 32% non-operated working interest in the Culzean gas condensate field. The deal has an upfront cash consideration of $232 million and is subject to a 30-day pre-emption period, with funding planned through interim cashflows and existing financial resources. Serica's CEO Chris Cox stated this acquisition would be a significant step, adding material production and cash flows from the UK's largest producing gas field.",
      "url": "https://m.investing.com/news/stock-market-news/serica-energy-to-acquire-bps-stake-in-uk-north-sea-gas-field-93CH-4283147?ampMode=1",
      "source": "Investing.com",
      "published": "20251013T065200",
      "overall_sentiment_score": 0.151111,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.142836,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.332504
    },
    {
      "title": "UK's Serica Energy to buy BP's stake in some North Sea assets for $232 million - MarketScreener",
      "summary": "Serica Energy is set to acquire BP's stake in certain North Sea exploration licenses for $232 million. The deal involves the P111 and P2544 licenses in the UK Central North Sea. This acquisition will expand Serica Energy's presence in the critical North Sea region.",
      "url": "https://www.marketscreener.com/news/uk-s-serica-energy-to-buy-bp-s-stake-in-some-north-sea-assets-for-232-million-ce7d5ad8da8cf02d",
      "source": "MarketScreener",
      "published": "20251013T061930",
      "overall_sentiment_score": 0.227792,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.203046,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.327359
    },
    {
      "title": "New study urges SA to mimic Namibia’s oil appetite - BusinessLIVE",
      "summary": "A new study commissioned by US-based EnerGeo Alliance and conducted by FTI Consulting suggests that South Africa should leverage Namibia's recent oil discoveries in the Orange Basin. The study proposes that SA could establish a regional hub to de-risk its own upstream development, add billions to its GDP annually, and create a sovereign wealth fund similar to Norway's. This strategic move would allow South Africa to capitalize on the Namibian oil boom and invest in various sectors of its economy.",
      "url": "https://www.businesslive.co.za/bd/national/2025-10-13-new-study-urges-sa-to-mimic-namibias-oil-appetite/",
      "source": "BusinessLIVE",
      "published": "20251013T030000",
      "overall_sentiment_score": 0.312521,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.345565,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.635136
    },
    {
      "title": "Eni Reports 20% Crude Output Rise in Abo Field, Lauds NUPRC’s Reforms - THISDAYLIVE",
      "summary": "International Oil Company (IOC), Eni, announced a 20 percent increase in crude production at its Abo asset in the Niger Delta, attributing the rise to reduced vandalism, improved asset security, and enhanced operational capacity. Eni lauded the Nigerian Upstream Petroleum Regulatory Commission (NUPRC) for its reforms, which have created an enabling environment and boosted investor confidence in Nigeria's oil and gas sector. The NUPRC confirmed a significant reduction in vandalism incidents and an increase in rig count, further underscoring the positive shift in the operational landscape.",
      "url": "https://www.thisdaylive.com/2025/10/13/eni-reports-20-crude-output-rise-in-abo-field-lauds-nuprcs-reforms/",
      "source": "THISDAYLIVE",
      "published": "20251013T022933",
      "overall_sentiment_score": 0.101277,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.117231,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.345591
    },
    {
      "title": "Oil rebounds 1% after sharp losses on US-China tensions - The Economic Times",
      "summary": "Oil prices rose by 1% on Monday, recovering from five-month lows, as investors anticipate potential talks between the U.S. and Chinese presidents could de-escalate trade tensions. The rebound follows sharp declines triggered by new U.S. tariff threats and Chinese export controls. Analysts are watching how these geopolitical developments will impact global oil demand.",
      "url": "https://economictimes.indiatimes.com/markets/commodities/news/oil-rebounds-1-after-sharp-losses-on-us-china-tensions/articleshow/124514982.cms?from=mdr",
      "source": "The Economic Times",
      "published": "20251013T010606",
      "overall_sentiment_score": 0.216373,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.250229,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.607782
    },
    {
      "title": "Energy Stocks Climb As Oil Prices And Deals Heat Up - Finimize",
      "summary": "Energy stocks gained this week due to stable oil prices, a significant $5 billion fuel cell partnership between Bloom Energy and Brookfield, and strategic adjustments by energy giants in response to new tariffs and regulations. While solid oil prices and demand boosted funds and oil service stocks, companies like Baker Hughes and Exxon Mobil are navigating increased costs and stricter rules by scaling back investments. The sector faces a balancing act between innovation and regulation, potentially leading to more volatility but also a more adaptable industry.",
      "url": "https://finimize.com/content/energy-stocks-climb-as-oil-prices-and-deals-heat-up",
      "source": "Finimize",
      "published": "20251012T235901",
      "overall_sentiment_score": -0.264207,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.230414,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.876257
    },
    {
      "title": "Murphy Oil Corp. Experiences Revision in Stock Evaluation Amid Market Dynamics - Markets Mojo",
      "summary": "Murphy Oil Corp. has seen its stock evaluation revised due to challenging market conditions, despite outperforming the S&P 500 over longer timeframes. The stock has shown significant volatility and resilience, particularly over a five-year horizon, with technical indicators presenting a mixed but somewhat bullish outlook. The company's recent performance has seen slight gains, contrasting with a broader year-long decline.",
      "url": "https://www.marketsmojo.com/news/stocks-in-action/murphy-oil-corp-technical-trend-shifts-from-mildly-bearish-to-mildly-bullish-amid-stock-price-increase-3601104",
      "source": "Markets Mojo",
      "published": "20251012T214533",
      "overall_sentiment_score": 0.109952,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.115087,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.320689
    },
    {
      "title": "Analyzing Tamboran Resources (TBN) and Its Peers - Defense World",
      "summary": "This article provides a comparative analysis of Tamboran Resources (TBN) against its competitors, focusing on institutional and insider ownership, profitability, analyst recommendations, volatility, earnings, and valuation. It highlights Tamboran Resources' strong institutional ownership, higher potential upside according to analysts, and lower volatility compared to peers, despite trailing in revenue and earnings. The company profile details its focus on unconventional gas resources in Australia.",
      "url": "https://www.defenseworld.net/2025/10/12/analyzing-tamboran-resources-tbn-and-its-peers.html",
      "source": "Defense World",
      "published": "20251012T062813",
      "overall_sentiment_score": 0.135324,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.124172,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.349903
    },
    {
      "title": "Xcel shares vision for power mix at breakfast - hometownsource.com",
      "summary": "Xcel Energy presented its vision for a carbon-free future at the Monticello and Becker Area Community Breakfast, discussing plans for the Monticello nuclear plant, the transition of the Sherco plant from coal to solar, and challenges posed by the electricity demands of new data centers. Speakers highlighted reliability upgrades, the development of one of the nation's largest solar farms, and the company's approach to integrating massive new loads while protecting existing customers from cost burdens.",
      "url": "https://www.hometownsource.com/elk_river_star_news/xcel-shares-vision-for-power-mix-at-breakfast/article_67938707-0e3d-4906-88c4-577f6ff710a5.html",
      "source": "hometownsource.com",
      "published": "20251012T050000",
      "overall_sentiment_score": 0.227159,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.142479,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.329044
    },
    {
      "title": "Eni signs an agreement with Argentina's YPF to produce and export liquefied natural gas. Value: approximately €25 billion.",
      "summary": "Eni and Argentina's state-owned oil company YPF have signed an agreement worth approximately €25 billion to produce and export liquefied natural gas (LNG) from the Vaca Muerta deposit. Eni will serve as a strategic partner across the entire value chain, aiming to produce 12 million tonnes per year of LNG and reach the market by 2029. This project is expected to significantly boost Argentina's energy transformation and serve as a crucial supply source for international markets, particularly Europe.",
      "url": "https://www.firstonline.info/en/Eni-signs-an-agreement-with-Argentina-YPF-to-produce-and-export-liquefied-natural-gas-worth-approximately-25-billion/",
      "source": "firstonline.info",
      "published": "20251012T042000",
      "overall_sentiment_score": 0.281303,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.208379,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.347524
    },
    {
      "title": "Eni signs an agreement with Argentina's YPF to produce and export liquefied natural gas. Value: approximately €25 billion.",
      "summary": "Eni and Argentina's state-owned oil company YPF have signed an approximately €25 billion agreement to produce and export liquefied natural gas from the Vaca Muerta deposit. Eni will act as a strategic partner across the entire value chain, including development, transportation, liquefaction, and export, with the goal of reaching international markets by 2029. This project aims to establish Argentina as a significant player in the global LNG market and provide a crucial new energy source for international consumption.",
      "url": "https://www.firstonline.info/en/Eni-signs-an-agreement-with-Argentina-YPF-to-produce-and-export-liquefied-natural-gas-worth-approximately-25-billion/amp/",
      "source": "firstonline.info",
      "published": "20251012T022000",
      "overall_sentiment_score": 0.264437,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.232016,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.346731
    },
    {
      "title": "Industry experts see ‘steep barriers’ to Keystone XL revival - CTV News",
      "summary": "Industry experts believe there are significant challenges to reviving the Keystone XL pipeline project, despite recent discussions between Prime Minister Mark Carney and U.S. President Donald Trump. While the project could offer economic benefits and trade leverage, financial risks, potential future cancellations by a different U.S. administration, and environmental policy conflicts with the Canadian government are identified as major hurdles. Experts also point to the need for explicit financial guarantees from Washington and certainty regarding climate change targets from Alberta and industry.",
      "url": "https://www.ctvnews.ca/canada/article/i-see-a-lot-of-steep-barriers-industry-experts-weigh-in-on-likelihood-of-keystone-xl-revival/",
      "source": "CTV News",
      "published": "20251011T233548",
      "overall_sentiment_score": 0.124278,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.149511,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.443832
    },
    {
      "title": "Exxon eyes Iraq re-entry to explore Majnoon oil field, Bloomberg News reports",
      "summary": "Exxon Mobil is reportedly considering re-entering Iraq to explore the Majnoon oil field after a two-year hiatus, according to Bloomberg News. The oil major plans to sign a heads of agreement with Basra Oil and Iraq's state oil company SOMO, with discussions also covering export infrastructure and oil marketing projects in southern Iraq. Exxon had confirmed it was in discussions with the Iraqi oil ministry to optimize its portfolio.",
      "url": "https://www.reuters.com/business/energy/exxon-eyes-return-iraq-explore-majnoon-oil-field-bloomberg-news-reports-2025-10-07/",
      "source": "Reuters",
      "published": "20251008T125600",
      "overall_sentiment_score": 0.335329,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.420278,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Tesla: Shares Fall as Company Begins Taking Orders for Cheaper Model Y and Model 3 Vehicles",
      "summary": "Tesla shares fell 3% as the company began taking orders for cheaper versions of its Model Y SUV and Model 3 sedan, priced under $40,000. Morningstar maintains a $250 fair value estimate, considering the stock significantly overvalued despite expectations that these new models will drive deliveries growth in 2027 and beyond. The market is seen as pricing in perfection for deliveries growth and the rollout of robotaxis, which Morningstar views as a long-term success but doubts will be fully rolled out by next year.",
      "url": "https://www.morningstar.com/stocks/tesla-shares-fall-company-begins-taking-orders-cheaper-model-y-model-3-vehicles",
      "source": "Morningstar",
      "published": "20251008T000000",
      "overall_sentiment_score": -0.176106,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": 0.148369,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.603251
    },
    {
      "title": "Spring-based Exxon Mobil to cut 2,000 jobs globally as part of consolidation plan",
      "summary": "Exxon Mobil (NYSE: XOM) plans to cut 2,000 jobs globally as part of a restructuring plan to consolidate smaller offices into regional hubs. These job cuts represent about 3% of Exxon's 2024 workforce and are specifically focused outside of the U.S. The company states this move aims to foster innovation, strengthen execution, and improve teamwork through enhanced collaboration.",
      "url": "https://www.khou.com/article/money/business/houston-business-journal/exxon-mobil-job-cuts/285-e50e5422-eaaa-4dec-9b65-6216ec617673",
      "source": "KHOU",
      "published": "20250930T154400",
      "overall_sentiment_score": -0.241923,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.24022,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 1.0
    },
    {
      "title": "Exxon Mobil เตรียมเลิกจ้าง 2,000 ตำแหน่งทั่วโลก เดินหน้าปรับโครงสร้าง-ลดต้นทุน | การเงินธนาคาร",
      "summary": "Exxon Mobil กำลังจะเลิกจ้างพนักงานราว 2,000 ตำแหน่งทั่วโลก ซึ่งคิดเป็น 3-4% ของจำนวนพนักงานทั้งหมด เพื่อปรับโครงสร้างองค์กรและลดต้นทุน โดยจะควบรวมสำนักงานขนาดเล็กเข้ากับศูนย์ปฏิบัติการระดับภูมิภาค การปรับลดครั้งนี้เป็นส่วนหนึ่งของแผนการลดต้นทุนต่อเนื่องที่เริ่มมาตั้งแต่ปี 2562 ซึ่งช่วยประหยัดไปแล้ว 1.35 หมื่นล้านดอลลาร์ และมีเป้าหมายจะเพิ่มการประหยัดอีก 30% ภายในสิ้นทศวรรษนี้",
      "url": "https://today.line.me/th/v3/article/2DjjKWj",
      "source": "LINE TODAY",
      "published": "20250930T101600",
      "overall_sentiment_score": 0.221558,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.207186,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Exxon to Cut 2,000 Jobs",
      "summary": "Exxon Mobil Corp. plans to eliminate approximately 2,000 jobs globally, representing 3% to 4% of its workforce, as part of an ongoing efficiency drive and long-term restructuring plan. These cuts, concentrated in Europe and Canada, are aimed at consolidating smaller offices into regional hubs and building on efforts to improve competitiveness and reduce annual costs, which have already seen a $13.5 billion reduction since 2019. The company's CEO, Darren Woods, indicated these changes will strengthen Exxon's market position, mirroring similar job reductions by other major oil companies.",
      "url": "https://www.rigzone.com/news/wire/exxon_to_cut_2000_jobs-30-sep-2025-181957-article/",
      "source": "Rigzone",
      "published": "20250930T083100",
      "overall_sentiment_score": 0.172831,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.284805,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "TechnipFMC Bags Contract for Newest Stabroek Project",
      "summary": "TechnipFMC has secured a \"substantial contract\" from ExxonMobil to supply subsea production systems for the Hammerhead field in Guyana's Stabroek block. This marks TechnipFMC's seventh greenfield project award from ExxonMobil Guyana, further expanding production capacity in the Stabroek block, which is targeted to reach 1.5 million bpd by 2029 with the Hammerhead project. The contract, valued between $250 million and $500 million, reinforces the ongoing development and significant investment in the region's oil and gas sector.",
      "url": "https://www.rigzone.com/news/technipfmc_bags_contract_for_newest_stabroek_project-30-sep-2025-181932-article/",
      "source": "Rigzone",
      "published": "20250930T023000",
      "overall_sentiment_score": 0.471081,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.529349,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.903532
    },
    {
      "title": "|Oil Prices Struggle after Crashing to Lowest Since May",
      "summary": "|Oil prices, including Nigeria's Brent Crude and US West Texas Intermediate (WTI), plunged to their lowest levels since May, with Brent settling at $62.73 a barrel and WTI at $58.90. This decline followed a Gaza ceasefire deal, which reduced concerns about oil supply disruptions. However, prices saw a slight rebound on Monday due to anticipated talks between the US and Chinese Presidents, aiming to ease trade tensions between the two major oil consumers.",
      "url": "https://www.thisdaylive.com/2025/10/14/oil-prices-struggle-after-crashing-to-lowest-since-may/",
      "source": "THISDAYLIVE",
      "published": "20251013T233541",
      "overall_sentiment_score": 0.104086,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.12777,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.624637
    },
    {
      "title": "DHT Holdings Clarifies Ownership Structure Amid China's Port Fee Announcement - GuruFocus",
      "summary": "DHT Holdings clarified its ownership structure following China's new port fees on vessels linked to the US, emphasizing its non-US nationality and diverse international management. The company, incorporated in the Marshall Islands and headquartered in Bermuda, noted that while two US entities hold over 5% of its shares, they do not collectively meet the 25% ownership or voting rights threshold. Despite geopolitical challenges, DHT Holdings maintains a strong financial position and robust market presence in crude oil shipping.",
      "url": "https://www.gurufocus.com/news/3141148/dht-holdings-clarifies-ownership-structure-amid-chinas-port-fee-announcement",
      "source": "GuruFocus",
      "published": "20251013T205412",
      "overall_sentiment_score": 0.149175,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.115251,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.303814
    },
    {
      "title": "Best Oil Stocks To Watch Today - October 13th",
      "summary": "This article identifies five top oil stocks to watch: Exxon Mobil, Chevron, Schlumberger, ConocoPhillips, and Baker Hughes. These companies were selected based on high dollar trading volume and represent various aspects of the oil and energy industry. The article provides a brief overview of each company's operations and links to their latest research reports.",
      "url": "https://www.marketbeat.com/instant-alerts/best-oil-stocks-to-watch-today-october-13th-2025-10-13/",
      "source": "MarketBeat",
      "published": "20251013T191805",
      "overall_sentiment_score": 0.038837,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.042285,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.305505
    },
    {
      "title": "Rapidan Energy Group Announces Formation of Distinguished Board of Advisors - Morningstar",
      "summary": "Rapidan Energy Group announced the formation of its Board of Advisors, comprising global leaders in energy markets, finance, policy, and geopolitics. The Board will provide strategic counsel as the firm expands its research offerings and global reach amidst changes in global energy systems. Bob McNally, Founder and President, and Scott Modell, CEO, highlighted the Board's role in supporting the firm's mission with their decades of experience and commitment to analytical rigor.",
      "url": "https://www.morningstar.com/news/pr-newswire/20251013dc96405/rapidan-energy-group-announces-formation-of-distinguished-board-of-advisors",
      "source": "Morningstar",
      "published": "20251013T173200",
      "overall_sentiment_score": 0.13797,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.117879,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.314244
    },
    {
      "title": "California oil workers face an uncertain future in the state's energy transition - KCRA",
      "summary": "California's transition away from fossil fuels is creating an uncertain future for thousands of oil workers, with refinery closures and job losses expected. The state is grappling with how to support displaced workers and address concerns about high gas prices, while workers like Wilfredo Cruz are seeking new careers and feel forgotten by the lack of clear plans. Industry representatives argue that climate policies are destroying blue-collar jobs.",
      "url": "https://www.kcra.com/article/california-oil-workers-energy-transition-gas-prices/69018776",
      "source": "KCRA",
      "published": "20251013T155400",
      "overall_sentiment_score": -0.14711,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.029744,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.32971
    },
    {
      "title": "Octyl Alcohol Market Hits New High | Major Giants BASF, Sasol, Eastman Chemical - newstrail.com",
      "summary": "The global Octyl Alcohol Market is projected to grow at a CAGR of 7.1% from USD 1.9 Billion in 2024 to USD 3.3 Billion by 2033, driven by demand from plasticizers and the expanding chemical industry. Key players include BASF, Sasol, and Eastman Chemical. The Asia-Pacific region currently dominates production, while the Middle East & Africa is the fastest-growing market.",
      "url": "https://www.newstrail.com/octyl-alcohol-market/",
      "source": "newstrail.com",
      "published": "20251013T130556",
      "overall_sentiment_score": 0.309998,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.301484,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.734944
    },
    {
      "title": "Oil recoups some losses after US-China trade tensions",
      "summary": "Oil prices rose on Monday after reaching five-month lows, driven by investor focus on potential trade talks between the US and China. Market sentiment was also boosted by a US-brokered ceasefire deal between Palestinian group Hamas and Israel, seen as a step towards ending the war in Gaza. The near-term outlook for oil prices now depends on the outcome of the US-China trade negotiations.",
      "url": "https://www.brecorder.com/news/40387120",
      "source": "Business Recorder",
      "published": "20251013T125638",
      "overall_sentiment_score": 0.397406,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.385806,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.419035
    },
    {
      "title": "Glycol Ether Market Is Going to Boom | Major Giants Dow Chemical, - openPR.com",
      "summary": "The global Glycol Ether market is projected to grow from USD 6.9 billion in 2024 to USD 10.8 billion by 2033, exhibiting a compound annual growth rate (CAGR) of 5.8%. Key market drivers include demand for industrial cleaning, growth in the paints industry, and expanding construction, with Asia-Pacific dominating and North America showing the fastest growth. Major companies like BASF SE, Dow Chemical, and Eastman Chemical are profiled in this HTF Market Intelligence report.",
      "url": "https://www.openpr.com/news/4221000/glycol-ether-market-is-going-to-boom-major-giants-dow-chemical",
      "source": "openPR.com",
      "published": "20251013T123657",
      "overall_sentiment_score": 0.283776,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.201008,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.629663
    },
    {
      "title": "Civitas Resources (CIVI) Falls Amid a Plunge in Oil Prices - Insider Monkey",
      "summary": "Civitas Resources (CIVI) saw its share price fall by 15.46% between October 3 and October 10, 2025, due to a plunge in global crude oil prices caused by escalating trade tensions between the US and China. The company's stock has declined over 38% since the start of 2025, amidst considerations of a major merger with SM Energy and ongoing asset sales to reduce debt.",
      "url": "https://www.insidermonkey.com/blog/civitas-resources-civi-falls-amid-a-plunge-in-oil-prices-1626805/",
      "source": "Insider Monkey",
      "published": "20251013T114653",
      "overall_sentiment_score": -0.219368,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.245375,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.317324
    }
  ]
}