{
  "ticker": "XOM",
  "date": "2025-01-13",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T13:40:00.872321",
  "source": "alpha_vantage",
  "article_count": 19,
  "articles": [
    {
      "title": "Chart Industries signs global master goods and services agreement with ExxonMobil",
      "summary": "Chart Industries has signed a global master goods and services agreement with ExxonMobil to provide LNG equipment, technology, and services for ExxonMobil's global projects. This agreement includes the supply of cold boxes and Chart’s proprietary IPSMR® process technology, aiming to optimize cost, schedule, and quality for LNG projects worldwide. The collaboration expands on Chart’s prior involvement in ExxonMobil’s Mozambique LNG project and strengthens their partnership in advancing global LNG production.",
      "url": "https://www.lngindustry.com/liquefaction/09012025/chart-industries-signs-global-master-goods-and-services-agreement-with-exx-onmobil/",
      "source": "LNG Industry",
      "published": "20250109T090000",
      "overall_sentiment_score": 0.404088,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.444134,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.980667
    },
    {
      "title": "Why the S&P 500 ESG Index Continues to Outperform the S&P 500",
      "summary": "The S&P 500 ESG Index has consistently outperformed the S&P 500, especially since Q4 2021, driven primarily by stock selection through the exclusion of lower ESG-scoring companies. This outperformance is attributed to factors like strong climate strategy, risk management, and governance. The article also details the index's construction, recent rebalance additions and exclusions, and anticipates future ESG catalytic regulations.",
      "url": "https://www.cmegroup.com/openmarkets/equity-index/2024/Why-the-SP-500-ESG-Index-Continues-to-Outperform-the-SP-500.html",
      "source": "CME Group",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.141288,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.272633,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.676687
    },
    {
      "title": "California Resources Corporation Completes Combination with Aera Energy",
      "summary": "California Resources Corporation (CRC) announced the completion of its all-stock combination with Aera Energy, LLC, following shareholder approval on June 26, 2024. This merger aims to create the leading energy producer and carbon management solutions provider in California, projecting $150 million in annual synergies within 15 months. The combined entity also updated its preliminary outlook for the second half of 2024, showing pro forma net daily production of 146 Mboe/d for April and May 2024.",
      "url": "https://www.businesswire.com/news/home/20240701728016/en/California-Resources-Corporation-Completes-Combination-with-Aera-Energy",
      "source": "Business Wire",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.344012,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.317001,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.641991
    },
    {
      "title": "Hess CEO drags $53 billion Chevron deal over the line amid grapple with Exxon",
      "summary": "Hess Corp. shareholders have approved Chevron Corp.'s $53 billion takeover despite concerns from some investors regarding a dispute with Exxon Mobil Corp. over a key Guyanese asset. CEO John Hess successfully lobbied shareholders to back the deal, which aims to secure Chevron a stake in a significant oil discovery. The transaction still faces hurdles with the U.S. Federal Trade Commission and an ongoing arbitration case initiated by Exxon concerning its right-of-first refusal on Hess's Guyanese interest.",
      "url": "https://fortune.com/2024/05/28/hess-ceo-drags-53-billion-chevron-deal-over-the-line-amid-grapple-with-exxon/",
      "source": "Fortune",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.237013,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.132157,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.836612
    },
    {
      "title": "Dow Inc. CEO promotes clean energy initiatives at Detroit Economic Club forum",
      "summary": "Dow Inc. CEO Jim Fitterling discussed the company's strategies for decarbonization and energy efficiency at a Detroit Economic Club luncheon. He highlighted Dow's investments in projects like a net-zero carbon emissions ethylene cracker complex in Canada and the conversion of a Fort Saskatchewan site to produce hydrogen, aiming for significant carbon reductions. Fitterling also emphasized the importance of smart international policies, such as a global carbon price, and energy efficiency for transitioning to cleaner energy and meeting future electricity demands.",
      "url": "https://www.detroitnews.com/story/business/2024/04/17/dow-inc-ceo-promotes-clean-energy-initiatives-at-detroit-economic-club/73344536007/",
      "source": "The Detroit News",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.295345,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.138528,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.56622
    },
    {
      "title": "IPG Sells Huge to Private Equity firm AEA Investors",
      "summary": "Interpublic Group has sold its experience design and technology agency, Huge, to private equity firm AEA Investors. AEA Investors will combine Huge with its existing customer experience company, Hero Digital, to create one of the largest independent experience transformation businesses globally. Huge, founded in 1999, boasts a client roster including major companies like ExxonMobil, Google, McDonald’s, NBCUniversal, and Nike.",
      "url": "https://www.adweek.com/agencies/ipg-sells-huge-to-private-equity-firm-aea-investors/",
      "source": "ADWEEK",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.182001,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.156837,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.601367
    },
    {
      "title": "Eli Lilly's new CFO is a 23-year company veteran—showing how pharma firms rely on a 'deep bench of qualified talent'",
      "summary": "Eli Lilly has promoted 23-year company veteran Lucas Montarce to CFO, continuing a trend of internal promotions for executive roles within pharmaceutical companies. Montarce succeeds Anat Ashkenazi, who also spent two decades at Lilly before becoming CFO and recently moved to Google and Alphabet. Lilly's reliance on internal talent highlights its strong internal development programs, especially as the company experiences significant growth and invests heavily in expanding manufacturing for its top-selling drugs like Mounjaro and Zepbound.",
      "url": "https://fortune.com/2024/09/10/eli-lilly-cfo-montarce-23-year-company-veterans-pharma-firms/",
      "source": "Fortune",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.098775,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.141198,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.556478
    },
    {
      "title": "Marathon Petroleum's next CEO plans an 'unwavering focus on safety, the environment, and operational performance'",
      "summary": "Maryann T. Mannen will become Marathon Petroleum's first female CEO on August 1, succeeding Michael J. Hennigan. Having previously served as the company's first female CFO, Mannen brings a strong financial background to the role. Her priorities include an unwavering focus on safety, the environment, and operational performance, reflecting a growing trend of CFOs rising to CEO positions and women leading major corporations.",
      "url": "https://fortune.com/2024/05/15/marathon-petroleum-new-ceo-maryann-mannen/",
      "source": "Fortune",
      "published": "20241231T235959",
      "overall_sentiment_score": -0.051595,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.078315,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.624796
    },
    {
      "title": "Engineered AI: Unapologetically optimized for the energy industry",
      "summary": "This article discusses the concept of \"engineered AI,\" a specialized form of artificial intelligence optimized specifically for the energy industry. It highlights how this tailored AI, trained with energy-specific data and physics-driven insights, is already being deployed across the value chain to solve complex problems like production optimization, waterflood management in remote oil fields, and pipeline debottlenecking, leading to significant economic and environmental benefits, including increased production and reduced CO2 emissions. The author argues that this focused approach to AI, born from collaborative efforts and robust data infrastructure, represents a massive opportunity for value creation and addressing the energy trilemma.",
      "url": "https://www.slb.com/resource-library/insights-articles/engineered-ai-unapologetically-optimized-for-the-energy-industry",
      "source": "SLB",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.355805,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.348221,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.607096
    },
    {
      "title": "AI boom propels stock of Wild-West-era landowner up 200%",
      "summary": "Texas Pacific Land Corporation (TPL), a 136-year-old landowner, has seen its stock nearly triple in the past year due to speculative interest from investors betting on its land being used for data centers, Bitcoin mines, and renewable power projects driven by the AI boom. With 873,000 acres in West Texas and access to cheap natural gas, TPL is positioning itself to capitalize on the massive energy demands of the burgeoning AI industry, despite Big Tech also exploring nuclear power options. The company's unique position has led to a market capitalization exceeding $35 billion, significantly outpacing much larger corporations like American Airlines.",
      "url": "https://fortune.com/2024/11/26/ai-boom-wild-west-landowner/",
      "source": "Fortune",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.321446,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.223711,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.629319
    },
    {
      "title": "ConocoPhillips to acquire Marathon Oil Corporation in all-stock transaction; provides shareholder distribution update",
      "summary": "ConocoPhillips announced it will acquire Marathon Oil in an all-stock transaction valued at $22.5 billion, including net debt. The acquisition is expected to boost earnings, cash flows, and return of capital per share for ConocoPhillips, with anticipated synergies of at least $500 million annually. ConocoPhillips also plans to increase its ordinary base dividend by 34% to 78 cents per share and repurchase over $20 billion in shares within the first three years post-acquisition.",
      "url": "https://www.businesswire.com/news/home/20240529051958/en/ConocoPhillips-to-acquire-Marathon-Oil-Corporation-in-all-stock-transaction-provides-shareholder-distribution-update",
      "source": "Business Wire",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.258033,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.119984,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.61639
    },
    {
      "title": "Ecopetrol acquires Repsol’s onshore Colombia asset to increase production by 7,000 bopd",
      "summary": "Ecopetrol S.A. has acquired Repsol's remaining 45% stake in block CPO-09 in Colombia, making Ecopetrol the sole owner of this strategic asset. This transaction is expected to add approximately 41 million barrels to Ecopetrol's reserves and increase its daily production by an estimated 7,000 barrels of oil. The acquisition strengthens Ecopetrol's position in the Llanos Orientales basin and reaffirms its commitment to Colombia's energy future.",
      "url": "https://www.worldoil.com/news/2024/12/30/ecopetrol-acquires-repsol-s-onshore-colombia-asset-to-increase-production-by-7-000-bopd/",
      "source": "World Oil",
      "published": "20241230T000000",
      "overall_sentiment_score": 0.39558,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.32415,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.648451
    },
    {
      "title": "Occidental Petroleum says it realized lower prices for oil in fourth quarter",
      "summary": "Occidental Petroleum reported lower realized prices for oil production in the fourth quarter compared to the prior three months, attributing the decline to weakening global demand. Despite this, the company saw higher prices for its total natural gas output due to a significant rise in U.S. natural gas prices. Occidental's realized oil price was $69.73 a barrel, while natural gas prices averaged $1.41 per thousand cubic feet.",
      "url": "https://www.reuters.com/business/energy/occidental-petroleum-says-it-realized-lower-prices-oil-fourth-quarter-2025-01-10/",
      "source": "Reuters",
      "published": "20250110T221700",
      "overall_sentiment_score": -0.086282,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.018765,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.615878
    },
    {
      "title": "Canadian Natural Resources Limited Announces 2025 Budget",
      "summary": "Canadian Natural Resources Limited announced its 2025 budget, targeting a capital expenditure of approximately $6 billion and production growth of about 12% over 2024 levels. The company aims for annual average production between 1,510 MBOE/d and 1,555 MBOE/d, supported by strategic acquisitions and its flexible capital allocation strategy. The budget emphasizes strong shareholder returns, with a commitment to increasing dividends and reducing net debt through effective operations and free cash flow generation.",
      "url": "https://www.newsfilecorp.com/release/236538/Canadian-Natural-Resources-Limited-Announces-2025-Budget",
      "source": "Newsfile",
      "published": "20250109T050000",
      "overall_sentiment_score": 0.257379,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.118683,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.583159
    },
    {
      "title": "One of the Hottest Stocks in the Oil Patch Is a Defunct 19th-Century Railroad",
      "summary": "Shares of Texas Pacific Land, a company with roots in a defunct 19th-century railroad, have nearly tripled in 2024, making it one of the top-performing stocks in the oil sector despite stagnant oil prices. The company's success stems from a new strategy for monetizing its vast land holdings in the prolific Permian Basin. Texas Pacific Land owns approximately 873,000 surface acres and leases them to energy producers.",
      "url": "https://www.wsj.com/business/energy-oil/one-of-the-hottest-stocks-in-the-oil-patch-is-a-defunct-19th-century-railroad-4b10a483?gaa_at=eafs&gaa_n=AWEtsqfUtO9wV8PtqlpT47v3khA5rura6VEgtXmOCvQe5P-SFHGYYAhn0Op7&gaa_ts=690763ae&gaa_sig=ikIrGoSWCEpAJLsMQfCcbN87O1n7LEsb-LHKcKp09MAJC39ntr6eninNKkvMRXMfQeVjQju586JydMH7UpsUzQ%3D%3D",
      "source": "The Wall Street Journal",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.195034,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.141823,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.587933
    },
    {
      "title": "Electricity Demand Growth in the US: Challenges and Opportunities for Utilities",
      "summary": "ICF's new report forecasts a significant increase in U.S. electricity demand by 2030 and 2050, driven by cloud computing, AI, industrial resurgence, and electrification. This growth presents challenges for the power grid due to limited capacity and complex permitting, potentially impacting reliability and affordability. The article outlines recommendations for utilities, state energy offices, energy developers, and federal agencies to manage these challenges effectively.",
      "url": "https://www.icf.com/insights/energy/demand-growth-challenges-opportunities-utilities",
      "source": "ICF International",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.211491,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.180765,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.56889
    },
    {
      "title": "XLE, VDE, FENY: 3 Must-Know ETFs as Energy Stocks Surge",
      "summary": "This article highlights three energy ETFs, XLE, VDE, and FENY, that offer investors exposure to the surging energy sector. All three ETFs are praised for their top oil and energy stock holdings, strong Smart Scores, attractive dividends, and low fees. The author is bullish on these ETFs given the current energy bull market driven by rising oil prices, demand increases, and geopolitical tensions, alongside the relatively cheap valuations of energy stocks.",
      "url": "https://www.tipranks.com/news/xle-vde-feny-3-must-know-etfs-as-energy-stocks-surge",
      "source": "TipRanks",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.459885,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.440827,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.741402
    },
    {
      "title": "Cenovus sinking $1.5 billion in local oil refineries despite EV threat",
      "summary": "Cenovus Energy is investing $1.5 billion into its two U.S. refineries, including the Toledo refinery, over the next five years. This significant investment aims to enhance operational reliability, efficiency, and safety, even as the company acknowledges the growing threat of electric vehicles to future gasoline demand. The projects prioritize maintaining the refineries' ability to process a high volume of oil from Alberta's oil sands.",
      "url": "https://www.toledoblade.com/business/energy/2024/04/15/cenovus-sinking-1-5-billion-in-local-oil-refineries-despite-ev-threat/stories/20240411119",
      "source": "Toledo Blade",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.264551,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.23748,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.604681
    },
    {
      "title": "US Methanation Project",
      "summary": "Mitsubishi Corporation is engaged in a detailed joint study with Tokyo Gas, Toho Gas, and Sempra Infrastructure to develop a supply chain for \"e-methane\" (synthetic methane) in the US. This project aims to produce e-methane from hydrogen, CO2, and water, utilizing the Cameron LNG Terminal to export e-methane to Japan from 2030. The initiative seeks to decarbonize heat demand by leveraging existing gas infrastructure, thereby minimizing additional social costs.",
      "url": "https://www.mitsubishicorp.com/jp/en/about/project/e-methane/",
      "source": "Mitsubishi Corporation",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.20388,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.131392,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.58418
    }
  ]
}