{
  "ticker": "XOM",
  "date": "2025-09-22",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T13:43:48.468117",
  "source": "alpha_vantage",
  "article_count": 19,
  "articles": [
    {
      "title": "Exxon greenlights $6.8 billion investment for Hammerhead project in Guyana",
      "summary": "Exxon Mobil has approved a $6.8 billion investment for its seventh development project in Guyana, dubbed Hammerhead, targeting 1.7 million barrels of oil equivalent per day by 2030 from the Stabroek Block. The project, expected to produce first oil in Q2 2029 with a capacity of 150,000 barrels per day, also includes plans to utilize associated gas for a gas-to-energy project in Guyana. Exxon operates the project with partners Chevron and CNOOC while construction continues on other joint venture projects, Uaru and Whiptail.",
      "url": "https://www.reuters.com/business/energy/exxon-greenlights-investment-hammerhead-project-guyana-2025-09-22/",
      "source": "Reuters",
      "published": "20250922T162100",
      "overall_sentiment_score": 0.31344,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.324388,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.929034
    },
    {
      "title": "Exxon Says Demand Makes Case for Fossil Fuel Growth",
      "summary": "Exxon Mobil Corp. plans to pursue fossil fuel growth to meet energy demand, which it expects will \"not materially change\" between now and 2050. The company, undeterred by global climate goals, will invest in oil and gas projects based on a long-term view that global energy demand will continue to grow. Exxon aims to double its sales of liquefied natural gas by 2030 and sees oil and gas maintaining 55% of the global energy mix by 2050.",
      "url": "https://www.rigzone.com/news/wire/exxon_says_demand_makes_case_for_fossil_fuel_growth-19-sep-2025-181855-article/",
      "source": "Rigzone",
      "published": "20250919T160000",
      "overall_sentiment_score": 0.443127,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.430711,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Why FENY Is an ETF To Buy ? at $24.31 3.11% Yield, Exxon & Chevron Drive Buy Call",
      "summary": "The Fidelity MSCI Energy Index ETF (FENY) is presented as a stable, income-producing investment due to its significant holdings in major oil companies like Exxon, Chevron, and ConocoPhillips, which contribute to a 3.11% dividend yield. The ETF benefits from macroeconomic tailwinds such as inflation, fiscal expansion, and underinvestment in the energy sector, which create tight supply and support higher crude oil prices. Despite lagging the broader market, FENY outperforms energy peers and offers a hedge against inflation for income-focused investors.",
      "url": "https://www.tradingnews.com/news/feny-etf-at-24-usd-with-3-11-percent-yield",
      "source": "TradingNEWS",
      "published": "20250919T035319",
      "overall_sentiment_score": 0.349975,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.332016,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.70145
    },
    {
      "title": "Mach Natural Closes Acquisition of Assets in Permian, San Juan Basins",
      "summary": "Mach Natural Resources LP has completed the acquisition of oil and gas assets from Sabinal Energy and entities managed by IKAV Energy Inc., totaling approximately $1.3 billion. This strategic move nearly doubles Mach's production and establishes significant positions in the Permian and San Juan Basins, creating a more balanced, multi-basin portfolio. The company's credit facility has also been amended, increasing its borrowing base to $1.45 billion.",
      "url": "https://www.rigzone.com/news/mach_natural_closes_acquisition_of_assets_in_permian_san_juan_basins-18-sep-2025-181835-article/",
      "source": "Rigzone",
      "published": "20250918T090000",
      "overall_sentiment_score": 0.206777,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.101622,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.601042
    },
    {
      "title": "Earnings Summary: Progressive Corporation’s August profit jumps",
      "summary": "Progressive Corporation reported a significant increase in net income and premiums for August 2025. Net income jumped to $1.22 billion, with earnings per share rising 30% year-over-year. The company also saw substantial growth in net premiums written and earned, alongside an improved combined ratio.",
      "url": "https://news.alphastreet.com/earnings-summary-progressive-corporations-august-profit-jumps/",
      "source": "AlphaStreet",
      "published": "20250918T000000",
      "overall_sentiment_score": 0.29732,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.127775,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.625082
    },
    {
      "title": "Chord Energy expanding Williston Basin footprint with $500M acquisition from Exxon Mobil subsidiaries",
      "summary": "Houston-based Chord Energy Corp. is set to acquire additional Williston Basin assets in North Dakota from XTO Energy for $500 million. This acquisition marks a continuation of similar deals between the companies, though this transaction involves a higher price point for a smaller acreage.",
      "url": "https://www.bizjournals.com/houston/news/2025/09/16/chord-energy-buy-williston-basin-assets-from-xto.html",
      "source": "The Business Journals",
      "published": "20250916T190920",
      "overall_sentiment_score": 0.441354,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.428867,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.723782
    },
    {
      "title": "What’s Happening With BP Stock?",
      "summary": "BP plc stock is up roughly 15% year-to-date and has recently made a major oil discovery offshore Brazil, leading to increased attention. Despite strategic pivots, mixed earnings, and evolving energy ambitions, the company's renewed focus on upstream production amid higher energy prices could lead to a rebound. BP is also trading at a discount compared to peers, and continues to prioritize shareholder returns and some hydrogen projects despite a pullback in other renewables.",
      "url": "https://www.trefis.com/stock/bp/articles/575256/whats-happening-with-bp-stock-2/2025-09-15",
      "source": "Trefis",
      "published": "20250915T000000",
      "overall_sentiment_score": 0.160665,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.121481,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.742624
    },
    {
      "title": "Equipment Check: Charts Show Energy Services Stocks Poised to Rally",
      "summary": "Technical analysis suggests a potential rally for energy services stocks. After a period of underperformance, oil equipment stocks are showing encouraging signs, as indicated by the one-year daily chart of the VanEck Oil Services ETF. This signals a possible turnaround for the sector.",
      "url": "https://www.barrons.com/articles/energy-services-stocks-charts-e1ea3015?gaa_at=eafs&gaa_n=AWEtsqdE6W2XgkE9BUAJ4O6X5c30SrXUBBpkz4bU23KxNAumHSDjz6iaRSfd&gaa_ts=69382272&gaa_sig=NTXatQoLm4SO2h5_0fLsgtWcXKJvbFBnN-lVImF4_O3J6la7femSaxPcQP5UEXIyLOLPd6gi3FRgeCvTR29DNA%3D%3D",
      "source": "Barron's",
      "published": "20250911T130925",
      "overall_sentiment_score": 0.339616,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.392066,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.644478
    },
    {
      "title": "IXC: Oil Holding In The $60s, High Near-4% Yield, Monitoring The Macro (NYSEARCA:IXC)",
      "summary": "The author reiterates a \"Buy\" rating for IXC, the iShares Global Energy ETF, citing its attractive valuation, global diversification, and high dividend yield compared to the S&P 500. The ETF offers exposure to global energy leaders, trades at a modest 14.5x P/E, and has a strong 10.2% long-term EPS growth rate. Despite recent underperformance, the author anticipates upside potential due to oil prices above $60 and a falling dollar, making it a compelling value.",
      "url": "https://seekingalpha.com/article/4821559-ixc-oil-holding-in-the-60s-high-near-4-percent-yield-monitoring-the-macro",
      "source": "Seeking Alpha",
      "published": "20250910T115400",
      "overall_sentiment_score": 0.379093,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.31961,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.727
    },
    {
      "title": "Exxon CEO Warns of ‘Bone-Crushing’ EU Climate, Human Rights Law",
      "summary": "Exxon Mobil Corp. is calling for the repeal of a new European Union law, the Corporate Sustainability Due Diligence Directive, which its CEO warns could be \"bone-crushing\" for corporations. The directive aims to address human rights abuses and environmental standards, but critics argue it has become overly broad, mandating net-zero plans and applying to global supply chains outside Europe, potentially sparking US-EU trade tensions.",
      "url": "https://www.bloomberg.com/news/articles/2025-09-18/exxon-ceo-warns-of-bone-crushing-eu-climate-human-rights-law",
      "source": "Bloomberg.com",
      "published": "20250918T110000",
      "overall_sentiment_score": -0.344378,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.312858,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 1.0
    },
    {
      "title": "FENY: Reliable Dividend Income Despite Low Growth (NYSEARCA:FENY)",
      "summary": "The Fidelity MSCI Energy Index ETF (FENY) is rated a \"hold\" due to its ability to provide stable income through dividends from its energy company holdings, despite expectations of limited capital appreciation. Key holdings like XOM, CVX, and COP sustain strong dividends through cost-cutting and profitability, even in a low-growth sector. With a low 0.08% expense ratio and over 3% dividend yield, FENY appeals to income-focused investors looking for U.S. energy exposure, as its leading companies have reduced break-even costs, ensuring reliable income amidst oil price volatility.",
      "url": "https://seekingalpha.com/article/4823262-feny-reliable-dividend-income-despite-low-growth",
      "source": "Seeking Alpha",
      "published": "20250916T091300",
      "overall_sentiment_score": 0.287912,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.322332,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.723253
    },
    {
      "title": "Chord Energy Announces Strategic Acquisition of Williston Basin Assets",
      "summary": "Chord Energy Corporation announced a definitive agreement to acquire Williston Basin assets from XTO Energy Inc., a subsidiary of Exxon Mobil Corporation, for $550 million. This strategic acquisition adds 48,000 net acres with low breakeven economics, extending Chord's inventory life with 90 net 10,000-foot equivalent locations and is expected to be highly accretive to key financial metrics. The company anticipates maintaining a strong balance sheet while enhancing shareholder returns through its established capital allocation framework.",
      "url": "https://www.prnewswire.com/news-releases/chord-energy-announces-strategic-acquisition-of-williston-basin-assets-302556775.html",
      "source": "PR Newswire",
      "published": "20250915T170000",
      "overall_sentiment_score": 0.286448,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.129806,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.726001
    },
    {
      "title": "Kolibri Global Energy Faces Shareholder-Requested Special Meeting on Share Cap",
      "summary": "Kolibri Global Energy Inc. will hold a special general meeting on November 25, 2025, to address a shareholder requisition regarding the company's maximum authorized share count. The requisition, submitted by CDS & Co. on behalf of TFG Asset Management UK LLP, proposes setting the cap at 37,367,894 shares. This move reflects increased investor focus on capital discipline and potential dilution in the energy sector.",
      "url": "https://finance.yahoo.com/news/kolibri-global-energy-faces-shareholder-100000127.html",
      "source": "Yahoo Finance",
      "published": "20250915T140947",
      "overall_sentiment_score": -0.175066,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.199101,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.580415
    },
    {
      "title": "Exxon, other oil companies defeat climate lawsuit by Puerto Rican towns",
      "summary": "A federal judge dismissed a lawsuit brought by 37 Puerto Rican municipalities against Exxon, Shell, BP, Chevron, and other energy companies, which accused them of misleading the public about climate change. The judge ruled that the claims were filed outside the four-year statute of limitations for antitrust plaintiffs. While the claims against some companies were dismissed with prejudice, the plaintiffs plan to appeal and amend their case against other defendants.",
      "url": "https://www.reuters.com/legal/government/exxon-other-oil-companies-defeat-climate-lawsuit-by-puerto-rican-towns-2025-09-12/",
      "source": "Reuters",
      "published": "20250912T135900",
      "overall_sentiment_score": 0.364119,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.440906,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "FuelCell Energy CEO Points To Carbonate Tech As Key To Future Profitability",
      "summary": "FuelCell Energy (FCEL) reported mixed Q3 fiscal 2025 results, with revenue up 97% year-over-year but below analyst expectations, while adjusted net loss per share beat estimates. The company's CEO, Jason Few, emphasized the importance of scaling core carbonate technologies for future profitability and meeting energy leadership goals, citing strong demand for data centers and cost benefits from restructuring. FCEL shares are trading higher after initially slipping on the earnings report.",
      "url": "https://finance.yahoo.com/news/fuelcell-energy-ceo-points-carbonate-134946980.html",
      "source": "Yahoo Finance",
      "published": "20250909T000000",
      "overall_sentiment_score": 0.104281,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.105891,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.742058
    },
    {
      "title": "Exxon Mobil Buys Kentucky Battery Factory to Expand Energy Storage",
      "summary": "Exxon Mobil Corp. is acquiring a battery materials factory in Kentucky from Superior Graphite, marking a significant push into the energy storage market. The facility will produce synthetic graphite for batteries, aiming for faster charging and longer lifespan, with commercial production expected by 2029. This move is part of Exxon's broader strategy to invest in low-carbon energy solutions like carbon capture and hydrogen, leveraging its technological edge.",
      "url": "https://financialpost.com/pmn/business-pmn/exxon-mobil-buys-kentucky-battery-factory-to-expand-energy-storage",
      "source": "Financial Post",
      "published": "20250909T000000",
      "overall_sentiment_score": 0.404572,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.417319,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "California Resources Corporation Announces 2024 Sustainability Report and New Responsible Net Zero Strategy",
      "summary": "California Resources Corporation (CRC) has released its 2024 Sustainability Report, detailing its new Responsible Net Zero (RNZ) strategy and significant progress in decarbonization following its merger with Aera Energy. Key achievements include obtaining EPA permits for California’s first commercial-scale carbon capture and storage project and substantial reductions in greenhouse gas and methane emissions. The report emphasizes CRC's commitment to environmental stewardship, community impact, and leading California's energy transition.",
      "url": "https://www.quiverquant.com/news/California+Resources+Corporation+Announces+2024+Sustainability+Report+and+New+Responsible+Net+Zero+Strategy",
      "source": "Quiver Quantitative",
      "published": "20250918T151000",
      "overall_sentiment_score": 0.12447,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.074603,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.538127
    },
    {
      "title": "Chord Energy Announces $500 Mln Senior Notes Offering",
      "summary": "Chord Energy Corporation announced its intention to offer $500 million in senior unsecured notes due in 2030. The proceeds from this offering are earmarked to finance the company's recently disclosed acquisition of oil and gas assets in the Williston Basin from XTO Energy, Inc., and to cover associated expenses. A special mandatory redemption clause is included, requiring the notes to be redeemed at 100% of principal plus interest if the XTO acquisition is not completed by June 30, 2026, with an extension possibility to September 30, 2026, at which point the redemption price would be 101%.",
      "url": "https://www.nasdaq.com/articles/chord-energy-announces-500-mln-senior-notes-offering",
      "source": "Nasdaq",
      "published": "20250916T072722",
      "overall_sentiment_score": -0.075391,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.128506,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.622309
    },
    {
      "title": "Exxon Buys Kentucky Battery Factory to Expand Energy Storage",
      "summary": "Exxon Mobil Corp. is acquiring a battery materials factory in Hopkinsville, Kentucky, and other assets from Superior Graphite to expand into the energy storage market. The company plans to produce synthetic graphite for batteries, aiming for faster charging and longer lifespan, and also intends to become a major supplier of mined lithium. This move signifies Exxon's strategic push into low-carbon energy solutions alongside its traditional fossil fuel operations.",
      "url": "https://www.ttnews.com/articles/exxon-buys-battery-factory",
      "source": "Transport Topics",
      "published": "20250909T110300",
      "overall_sentiment_score": 0.283084,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.448738,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    }
  ]
}