{
  "ticker": "XOM",
  "date": "2026-01-26",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T13:45:13.196387",
  "source": "alpha_vantage",
  "article_count": 50,
  "articles": [
    {
      "title": "Exxon launches commercial carbon capture project with CF industries in Louisiana (XOM:NYSE)",
      "summary": "Exxon Mobil has initiated commercial operations for a carbon capture and storage project with CF Industries in Louisiana. The project aims to transport and store up to 2 million metric tons of carbon dioxide annually. This move is part of Exxon's efforts in sustainable energy solutions.",
      "url": "https://seekingalpha.com/news/4542695-exxon-launches-commercial-carbon-capture-project-with-cf-industries-in-louisiana",
      "source": "Seeking Alpha",
      "published": "20260126T232929",
      "overall_sentiment_score": 0.394191,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.413671,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Cameco (CCJ) Price Target Raised by C$15",
      "summary": "Raymond James analyst Brian MacArthur raised the price target for Cameco Corporation (NYSE:CCJ) shares from C$150 to C$165, maintaining an ‘Outperform’ rating due to the latest mining update. The company, a major global uranium fuel provider, also benefited from a surge in uranium futures prices to an 18-month high, driven by increased demand for nuclear energy. Despite the positive outlook for CCJ, the article suggests that some AI stocks may offer greater promise for higher returns with limited downside risk.",
      "url": "https://www.insidermonkey.com/blog/cameco-ccj-price-target-raised-by-c15-1681683/",
      "source": "Insider Monkey",
      "published": "20260126T221600",
      "overall_sentiment_score": 0.32796,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.288544,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.569948
    },
    {
      "title": "EQT Price Target Raised to $71, ‘Buy’ Rating Maintained",
      "summary": "Jefferies analyst Lloyd Byrne raised the price target for EQT Corporation (NYSE:EQT) from $68 to $71, while maintaining a 'Buy' rating. This adjustment follows a 9.85% surge in EQT's share price and is based on expectations for strong Q4 earnings and a recent jump in natural gas prices. The revised target suggests a potential upside of nearly 28% from current levels for the natural gas producer.",
      "url": "https://www.insidermonkey.com/blog/eqt-price-target-raised-to-71-buy-rating-maintained-1681686/",
      "source": "Insider Monkey",
      "published": "20260126T221600",
      "overall_sentiment_score": 0.219869,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.118571,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.596698
    },
    {
      "title": "Halliburton Prepares for Quick Comeback in Venezuela With US Approval",
      "summary": "Halliburton (HAL) is preparing for a swift return to Venezuela, pending U.S. government approval and payment safeguards, to capitalize on the country's vast oil reserves. This move aims to offset weakening demand in the U.S. shale market and is part of Halliburton's broader Latin American growth strategy, which also includes Brazil, Argentina, Ecuador, and Guyana. Other major players like Chevron, ExxonMobil, and ConocoPhillips are also eyeing Venezuela’s oil sector as political shifts and potential easing of sanctions create new opportunities.",
      "url": "https://www.theglobeandmail.com/investing/markets/stocks/XOM/pressreleases/37230654/halliburton-prepares-for-quick-comeback-in-venezuela-with-us-approval/",
      "source": "The Globe and Mail",
      "published": "20260126T154039",
      "overall_sentiment_score": 0.332481,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.343351,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.61263
    },
    {
      "title": "Exxon Mobil (XOM) stock rises premarket as winter storm hits Baytown, Tengiz restart watched",
      "summary": "Exxon Mobil (XOM) stock saw a premarket rise amidst a winter storm hitting its Baytown complex, leading to unit closures, and continued uncertainty surrounding the restart of Kazakhstan’s Tengiz operation. Traders are closely watching the company's upcoming January 30 earnings report for insights into production, refining, and margin trends. The situation highlights the challenges Exxon faces with market volatility influenced by weather disruptions and geopolitical factors, impacting crude prices and operational costs.",
      "url": "https://ts2.tech/en/exxon-mobil-xom-stock-rises-premarket-as-winter-storm-hits-baytown-tengiz-restart-watched/",
      "source": "TechStock²",
      "published": "20260126T145252",
      "overall_sentiment_score": 0.191797,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.202749,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Should Schwab U.S. Large-Cap Value ETF (SCHV) Be on Your Investing Radar?",
      "summary": "The article analyzes the Schwab U.S. Large-Cap Value ETF (SCHV), highlighting its low expense ratio, significant assets under management ($14.74 billion), and focus on large-cap value stocks. It discusses SCHV's sector exposure, top holdings, and performance, noting a Zacks ETF Rank of 2 (Buy) due to its strong asset class return, low expense ratio, and momentum. The piece concludes that SCHV is an excellent option for investors seeking exposure to the Large Cap Value segment, also comparing it to similar ETFs like SCHD and VTV.",
      "url": "https://www.sharewise.com/us/news_articles/Should_Schwab_US_LargeCap_Value_ETF_SCHV_Be_on_Your_Investing_Radar_Zacks_20260126_1220",
      "source": "sharewise.com",
      "published": "20260126T132724",
      "overall_sentiment_score": 0.234829,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.239753,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.649861
    },
    {
      "title": "Two new wells on 63,000 acres: Indonesia Energy's next drilling move",
      "summary": "Indonesia Energy Corporation (INDO) announced that its President, Frank Ingriselli, will present at the DealFlow Discovery Conference on January 28, 2026. He will update on drilling operations at the 63,000-acre Kruh Block, where pre-drilling work for two new wells, K-29 and WK-5, has begun, with drilling expected to commence before the end of Q1 2026. The company has already constructed drilling pads and delivered necessary equipment, maintaining its schedule for these operations.",
      "url": "https://www.stocktitan.net/news/INDO/indonesia-energy-to-present-at-3rd-annual-deal-flow-discovery-wfm16prsl6j1.html",
      "source": "Stock Titan",
      "published": "20260126T125910",
      "overall_sentiment_score": 0.160363,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.114431,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.582751
    },
    {
      "title": "Should Schwab U.S. Large-Cap Value ETF (SCHV) Be on Your Investing Radar?",
      "summary": "The Schwab U.S. Large-Cap Value ETF (SCHV), launched in December 2009, is a passively managed ETF offering exposure to the Large Cap Value segment of the US equity market. With over $14.74 billion in assets and a low expense ratio of 0.04%, it's considered a cost-effective option. The ETF holds a Zacks ETF Rank of 2 (Buy) and has performed well, gaining about 3.95% year-to-date and 15.15% in the last year as of January 26, 2026.",
      "url": "https://sg.finance.yahoo.com/news/schwab-u-large-cap-value-112002698.html",
      "source": "Yahoo Finance Singapore",
      "published": "20260126T112000",
      "overall_sentiment_score": 0.37067,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.318412,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.636391
    },
    {
      "title": "Assessing Core Natural Resources (CNR) Valuation After EBITDA Beat And Key Mine Restarts",
      "summary": "Core Natural Resources (CNR) has garnered investor attention following a strong third-quarter adjusted EBITDA of $141 million and the restart of key mining operations at Leer South and improved safety at Mountaineer II. Despite being near a 52-week high, analysts suggest it is undervalued, with one narrative indicating a 13.5% undervaluation and another DCF model pointing to a significantly steeper discount. The company is poised for sustained growth due to robust energy demand, particularly from AI/data centers and Asian infrastructure expansion, though this hinges on coal demand and operational execution.",
      "url": "https://simplywall.st/stocks/us/energy/nyse-cnr/core-natural-resources/news/assessing-core-natural-resources-cnr-valuation-after-ebitda",
      "source": "Simply Wall Street",
      "published": "20260126T085722",
      "overall_sentiment_score": 0.244887,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.133047,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.580191
    },
    {
      "title": "‘It’s Time to Build It’: The Standard Lithium Saga",
      "summary": "Standard Lithium's joint venture, Smackover Lithium, is moving closer to a final investment decision for a $1.5 billion lithium extraction plant in Lafayette County, Arkansas. Despite previous skepticism from Hindenburg Research, the project has gained significant momentum through new equity financing, a $225 million grant from the U.S. Department of Energy, and interest from export credit agencies. CEO David Park highlights the favorable shift in investor sentiment and the project's derisking through partnerships and regulatory approvals, aiming for construction to start in mid-2026.",
      "url": "https://www.arkansasbusiness.com/article/its-time-to-build-it-the-standard-lithium-saga/",
      "source": "Arkansas Business",
      "published": "20260126T055821",
      "overall_sentiment_score": 0.28834,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.113945,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.586856
    },
    {
      "title": "3 Safe Dividend Stocks Yielding At Least 3% to Buy Without Hesitation Right Now",
      "summary": "This article highlights three safe dividend stocks—Brookfield Infrastructure, ExxonMobil, and Prologis—that offer yields of at least 3% and have strong growth prospects. Brookfield Infrastructure aims for 5-9% annual dividend growth, ExxonMobil expects significant earnings and cash flow growth by 2030 to fuel its dividend, and Prologis has multiple drivers, including development projects and acquisitions, to support its rising payout. These companies are presented as high-quality investments for income-seeking investors.",
      "url": "https://finviz.com/news/286359/3-safe-dividend-stocks-yielding-at-least-3-to-buy-without-hesitation-right-now",
      "source": "Finviz",
      "published": "20260125T212719",
      "overall_sentiment_score": 0.456556,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.423739,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.796402
    },
    {
      "title": "Devon Energy Corp (DVN): Quiet Stock, Loud Moves – Are You Sleeping on This Play?",
      "summary": "Devon Energy Corp (DVN) is presented as a potentially overlooked oil and gas stock with significant cash flow and a shareholder-focused capital return strategy, including a variable dividend and share buybacks. The article discusses DVN's performance relative to commodity prices, its dividend structure, and its position against competitors like Pioneer Natural Resources and ExxonMobil. It advises potential investors to consider their tolerance for volatility and their investment thesis before buying DVN.",
      "url": "https://www.ad-hoc-news.de/boerse/news/ueberblick/devon-energy-corp-dvn-quiet-stock-loud-moves-are-you-sleeping-on/68518840",
      "source": "AD HOC NEWS",
      "published": "20260125T175919",
      "overall_sentiment_score": 0.227727,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.102924,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.704072
    },
    {
      "title": "Trek Financial LLC Sells 8,144 Shares of Exxon Mobil Corporation $XOM",
      "summary": "Trek Financial LLC reduced its stake in Exxon Mobil Corporation (NYSE:XOM) by 16% in the third quarter, selling 8,144 shares and retaining 42,817 shares valued at approximately $4.83 million. Other institutional investors showed mixed activity, with some increasing and others reducing their positions. Exxon Mobil recently reported beating EPS estimates, increased its quarterly dividend to $1.03, and has a \"Moderate Buy\" consensus rating from analysts with an average target price of $131.84.",
      "url": "https://www.marketbeat.com/instant-alerts/filing-trek-financial-llc-sells-8144-shares-of-exxon-mobil-corporation-xom-2026-01-25/",
      "source": "MarketBeat",
      "published": "20260125T115937",
      "overall_sentiment_score": 0.292187,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.267099,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Citi Downgrades Chord Energy (CHRD) as Oil and Gas Macro Risks Take Center Stage",
      "summary": "Citi downgraded Chord Energy Corporation (CHRD) to Neutral from Buy, lowering its price target to $97 from $105, citing a market shift towards broader macro risks in the oil and gas sector over Chord's execution story. Despite the downgrade, Citi still sees value in small- to mid-cap oil E&Ps that offer double-digit yields. Earlier, Chord Energy acquired Williston Basin assets from Exxon Mobil's XTO Energy unit for $550 million, expecting this deal to be accretive to cash flow and free cash flow.",
      "url": "https://finviz.com/news/286064/citi-downgrades-chord-energy-chrd-as-oil-and-gas-macro-risks-take-center-stage",
      "source": "Finviz",
      "published": "20260124T122726",
      "overall_sentiment_score": -0.042282,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.347865,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.626934
    },
    {
      "title": "Teacher Retirement System of Texas Acquires 99,395 Shares of Devon Energy Corporation $DVN",
      "summary": "The Teacher Retirement System of Texas increased its holdings in Devon Energy Corporation by 13.8% in Q3, purchasing an additional 99,395 shares and bringing their total ownership to 818,713 shares valued at $28.7 million. Other institutional investors like TD Asset Management Inc., Natixis, CWM LLC, and Stephens Inc. AR also boosted their positions in DVN. Analyst sentiment for Devon Energy is largely positive, with several firms raising price targets and maintaining \"Buy\" or \"Outperform\" ratings, reflecting confidence in its resilient portfolio and growth potential.",
      "url": "https://www.marketbeat.com/instant-alerts/filing-teacher-retirement-system-of-texas-acquires-99395-shares-of-devon-energy-corporation-dvn-2026-01-24/",
      "source": "MarketBeat",
      "published": "20260124T121247",
      "overall_sentiment_score": 0.085787,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.082211,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.555125
    },
    {
      "title": "Envestnet Portfolio Solutions Inc. Cuts Stock Position in Exxon Mobil Corporation $XOM",
      "summary": "Envestnet Portfolio Solutions Inc. reduced its stake in Exxon Mobil Corporation by 25.0% in Q3, selling over 71,000 shares but still retaining a significant holding valued at $23.99 million. Analysts maintain a \"Moderate Buy\" consensus rating with an average target price of $131.84, influenced by recent price target adjustments and company developments like refinery expansions and dividend increases. Despite positive news, the article highlights potential near-term pressures from softer oil prices, geopolitical risks, and mixed analyst views compared to other energy investments.",
      "url": "https://www.marketbeat.com/instant-alerts/filing-envestnet-portfolio-solutions-inc-cuts-stock-position-in-exxon-mobil-corporation-xom-2026-01-24/",
      "source": "MarketBeat",
      "published": "20260124T115731",
      "overall_sentiment_score": 0.125519,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.135523,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 1.0
    },
    {
      "title": "Exclusive: Exxon's XTO unit seeks buyers for select Eagle Ford assets",
      "summary": "Exxon Mobil's subsidiary XTO Energy is looking to sell some of its assets in the Eagle Ford shale basin in South Texas, valued at over $1 billion. This move is part of Exxon's strategy to optimize its portfolio and focus on more profitable assets like the Permian Basin and Guyana, amidst a trend of divestment among U.S. oil producers. The assets include over a thousand wells and span about 168,000 net acres.",
      "url": "https://www.reuters.com/legal/litigation/exxons-xto-unit-seeks-buyers-select-eagle-ford-assets-2026-01-23/",
      "source": "Reuters",
      "published": "20260123T235100",
      "overall_sentiment_score": -0.082976,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.13093,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 1.0
    },
    {
      "title": "Kimmeridge to nominate ex-Pioneer CEO to Coterra board in shakeup effort, source says (free to read)",
      "summary": "Activist investor Kimmeridge plans to nominate Scott Sheffield, founder of Pioneer Natural Resources, to Coterra Energy's board. This nomination is part of a larger initiative to transform the Houston-based company's leadership and strategic direction. Sheffield previously led Pioneer Natural Resources, which was acquired by Exxon Mobil Corp. for $59.5 billion.",
      "url": "https://www.bizjournals.com/houston/news/2026/01/23/kimmeridge-scott-sheffield-coterra-nomination-plan.html",
      "source": "The Business Journals",
      "published": "20260123T193937",
      "overall_sentiment_score": 0.122577,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.139032,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.726825
    },
    {
      "title": "PAAS Stock Price, Forecast & Analysis | PAN AMERICAN SILVER CORP (NYSE:PAAS)",
      "summary": "This article provides a detailed analysis of Pan American Silver Corp. (PAAS) stock, including its current price, technical and fundamental ratings, financial highlights, and analyst forecasts. PAAS has shown significant price appreciation over the past year and receives strong technical ratings, though analysts predict a price decrease in the next year despite expected EPS and revenue growth.",
      "url": "https://www.chartmill.com/stock/quote/PAAS/profile",
      "source": "Chartmill",
      "published": "20260123T192838",
      "overall_sentiment_score": 0.077946,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.033344,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.627427
    },
    {
      "title": "YPF and Pluspetrol swap upstream stakes to deepen Vaca Muerta push and feed Argentina LNG plan",
      "summary": "Argentina’s state-run oil company YPF and local producer Pluspetrol have agreed to swap upstream stakes in the Vaca Muerta shale play. This deal aims to reshape their positions and strengthen supply for YPF’s significant liquefied natural gas (LNG) export initiative, Argentina LNG. The strategic move positions YPF to consolidate key blocks for future LNG exports, while Pluspetrol expands its presence in Neuquén.",
      "url": "https://en.mercopress.com/2026/01/23/ypf-and-pluspetrol-swap-upstream-stakes-to-deepen-vaca-muerta-push-and-feed-argentina-lng-plan",
      "source": "MercoPress",
      "published": "20260123T142858",
      "overall_sentiment_score": 0.340654,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.118552,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.60162
    },
    {
      "title": "SLB builds momentum on production systems and digital as global markets stabilize",
      "summary": "SLB concluded 2025 with strong fourth-quarter growth, driven by stabilizing global upstream activity and an increased focus from operators on production optimization and digital efficiency. The company's Production Systems, Digital, and Reservoir Performance divisions showed significant momentum, bolstered by the acquisition of ChampionX and expansion in digital and data-driven services. SLB anticipates continued improvement in 2026, particularly in the Middle East, as it aligns its portfolio with production enhancement and digital integration strategies.",
      "url": "https://worldoil.com/news/2026/1/23/slb-builds-momentum-on-production-systems-and-digital-as-global-markets-stabilize/",
      "source": "World Oil",
      "published": "20260123T142737",
      "overall_sentiment_score": 0.220077,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.102722,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.602081
    },
    {
      "title": "Simplicity Wealth LLC Has $5.79 Million Stock Holdings in Exxon Mobil Corporation $XOM",
      "summary": "Simplicity Wealth LLC decreased its stake in Exxon Mobil Corporation (NYSE:XOM) by 27.3% during the third quarter, holding 51,391 shares valued at $5.79 million. Despite this reduction, other institutional investors, including Norges Bank, First Trust Advisors LP, Cerity Partners LLC, and Laurel Wealth Advisors LLC, significantly increased their holdings in Exxon Mobil. Analysts maintain a \"Moderate Buy\" consensus rating for XOM with an average price target of $132.00, while the company recently increased its quarterly dividend to $1.03 per share.",
      "url": "https://www.marketbeat.com/instant-alerts/filing-simplicity-wealth-llc-has-579-million-stock-holdings-in-exxon-mobil-corporation-xom-2026-01-23/",
      "source": "MarketBeat",
      "published": "20260123T121132",
      "overall_sentiment_score": 0.300362,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.302949,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Earnings Preview: Chevron (CVX) Q4 Earnings Expected to Decline",
      "summary": "Chevron (CVX) is projected to report a year-over-year decline in Q4 earnings despite higher revenues, with an expected EPS of $1.53 per share, down 25.7%, and revenues of $52.66 billion, up 0.8%. The Zacks Earnings ESP indicates a potential negative surprise for Chevron, as the Most Accurate Estimate is lower than the Zacks Consensus Estimate, making it difficult to conclusively predict an earnings beat despite the stock's Zacks Rank #3. Investors should consider these factors alongside the company's past performance, where it has beaten consensus EPS estimates in three of the last four quarters.",
      "url": "https://finviz.com/news/285428/earnings-preview-chevron-cvx-q4-earnings-expected-to-decline",
      "source": "Finviz",
      "published": "20260123T100000",
      "overall_sentiment_score": 0.094648,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.102984,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.553105
    },
    {
      "title": "3 Reasons to Buy Chevron Stock Like There's No Tomorrow",
      "summary": "This article suggests Chevron (CVX) as a strong investment in the energy sector due to its diversified business model across the entire energy value chain, an attractive 4.1% dividend yield with a 30-year increase streak, and a robust balance sheet with low debt. While acknowledging the cyclical nature of oil prices, the author argues that Chevron's fundamental strength makes it a good investment almost always.",
      "url": "https://finviz.com/news/284254/3-reasons-to-buy-chevron-stock-like-theres-no-tomorrow",
      "source": "Finviz",
      "published": "20260123T062735",
      "overall_sentiment_score": 0.19358,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.268719,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.73587
    },
    {
      "title": "Exxon Mobil (XOM) Projected to Post Earnings on Friday",
      "summary": "Exxon Mobil (XOM) is anticipated to release its Q4 2025 earnings before market open on Friday, January 30th, with analysts forecasting EPS of $1.63 and revenue of $77.98 billion. The company recently increased its quarterly dividend to $1.03, equating to an annualized yield of 3.1%. Despite a broadly positive-to-neutral analyst sentiment, recent insider selling and shifts in institutional investor holdings have been noted.",
      "url": "https://www.marketbeat.com/instant-alerts/exxon-mobil-xom-projected-to-post-earnings-on-friday-2026-01-23/",
      "source": "MarketBeat",
      "published": "20260123T062723",
      "overall_sentiment_score": 0.315041,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.343324,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "How Investors Are Reacting To Custom Truck One Source (CTOS) Focused Power Grid Exposure And Capital Choices",
      "summary": "Custom Truck One Source (CTOS) is gaining analyst attention due to its focus on power grid and T&D spending, supported by its specialized utility equipment and North American presence. Management's efforts to balance debt reduction, potential ownership changes, and rental fleet expansion are key factors influencing the company's financial profile and investor sentiment. While the stock shows upward movement, its fair value estimates vary significantly among investors, highlighting the sensitivity of its narrative to changes in expectations.",
      "url": "https://simplywall.st/stocks/us/capital-goods/nyse-ctos/custom-truck-one-source/news/how-investors-are-reacting-to-custom-truck-one-source-ctos-f/amp",
      "source": "Simply Wall Street",
      "published": "20260122T202948",
      "overall_sentiment_score": 0.248009,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.201837,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.565449
    },
    {
      "title": "How Exxon Mobil's Integrated Strengths Offset Crude Price Weakness",
      "summary": "Exxon Mobil's integrated business model and strong balance sheet allow it to navigate crude price volatility, even when prices are lower. The company leverages its refining operations to benefit from cheaper feedstock and is resilient to market fluctuations due to its low debt exposure. While its valuation is above the industry average, analysts have positively revised earnings estimates for 2025.",
      "url": "https://finviz.com/news/284456/how-exxon-mobils-integrated-strengths-offset-crude-price-weakness",
      "source": "Finviz",
      "published": "20260122T201311",
      "overall_sentiment_score": 0.366269,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.429322,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Brazil starts 2026 with more than 40 offshore rigs under contract",
      "summary": "Brazil begins 2026 with a significant offshore drilling presence, boasting 42 rigs under contract according to the National Agency of Petroleum, Natural Gas and Biofuels (ANP). Brazilian companies Constellation and Foresea, along with U.S.-based Transocean, are the leading operators, while Petrobras is the primary charterer with 37 rigs. The article details the specific rigs, their operators, and chartering companies, and discusses the promising outlook for the Brazilian offshore rig market due to anticipated future tenders and Petrobras's plans for extensive drilling in various fields.",
      "url": "https://www.bnamericas.com/en/analysis/brazil-starts-2026-with-more-than-40-offshore-rigs-under-contract",
      "source": "BNamericas",
      "published": "20260122T175811",
      "overall_sentiment_score": 0.320669,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.270875,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.616999
    },
    {
      "title": "ExxonMobil vs. EPD: Which Energy Stock Boasts Better Prospects?",
      "summary": "This article compares the investment prospects of Exxon Mobil Corporation (XOM) and Enterprise Products Partners LP (EPD) in the energy sector. While XOM has shown higher stock gains over the past year, its upstream business is vulnerable to soft oil prices. EPD, a midstream player, has a more resilient, fee-based business model, making it a potentially more stable investment despite XOM's strong balance sheet.",
      "url": "https://sg.finance.yahoo.com/news/exxonmobil-vs-epd-energy-stock-172700545.html",
      "source": "Yahoo Finance Singapore",
      "published": "20260122T175729",
      "overall_sentiment_score": 0.01179,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.024093,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.309854
    },
    {
      "title": "News Content Hub - Container vessel specialist Danaos dives into LNG with Alaska project investment",
      "summary": "Danaos Corp, a container vessel specialist, has invested $50M in the Alaska LNG project, expanding its footprint into the energy sector. As part of the agreement, Danaos will also be the preferred tonnage provider for at least six LNG carriers to serve Glenfarne Alaska LNG, the majority owner and developer of the project. This move further diversifies Danaos's portfolio, which already includes container vessels and dry bulk carriers, and leverages its shipping expertise for LNG delivery to global customers, particularly in Asia due to Alaska LNG's strategic location.",
      "url": "https://www.rivieramm.com/news-content-hub/news-content-hub/container-vessel-specialist-danaos-dives-into-lng-with-alaska-project-investment-87497",
      "source": "Riviera Maritime Media",
      "published": "20260122T165743",
      "overall_sentiment_score": 0.418073,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.28353,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.591682
    },
    {
      "title": "Exclusive | Scott Sheffield, the Shale Boss Spurned by Exxon, Joins Fight Against Coterra - WSJ",
      "summary": "Former Pioneer Natural Resources CEO Scott Sheffield is reportedly set to join forces with investment firm Kimmeridge in an activist campaign against Coterra Energy. Kimmeridge plans to nominate Sheffield to Coterra’s board as part of an effort to revamp the company. This move marks a new chapter for Sheffield, a prominent figure in the U.S. shale industry, following Exxon's acquisition of Pioneer.",
      "url": "https://www.wsj.com/business/energy-oil/scott-sheffield-the-shale-boss-spurned-by-exxon-joins-fight-against-coterra-5d576348?gaa_at=eafs&gaa_n=AWEtsqdAZW6eRSqqdFCsAOtQk-R7sKBb1zWw_0tOgTs4QDBEoR01FHvjXvG4&gaa_ts=697283ff&gaa_sig=5Gydt4ch-6HrR9C1J2eGfuDMjCvBd5lmZ9JfqUwdirll5i52vCE8aJl9gfehH-OrjXrTaHh-ZFvxAnHQX1J6cQ%3D%3D",
      "source": "The Wall Street Journal",
      "published": "20260122T145640",
      "overall_sentiment_score": -0.171728,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": 0.12007,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.711989
    },
    {
      "title": "Cenovus weighs $3 billion Alberta sale to cut post-MEG debt",
      "summary": "Cenovus Energy is reportedly considering selling up to $3 billion in Deep Basin assets in Alberta to reduce its debt, which increased significantly after its acquisition of MEG Energy. This move would allow the company to focus more intently on its core oil sands business. The Calgary-headquartered producer aims to lower its net debt from approximately $10.7 billion to $4 billion.",
      "url": "https://www.wealthprofessional.ca/news/industry-news/cenovus-weighs-3-billion-alberta-sale-to-cut-post-meg-debt/391401",
      "source": "Wealth Professional Canada",
      "published": "20260122T132726",
      "overall_sentiment_score": 0.023043,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.116458,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.631548
    },
    {
      "title": "Ovintiv (OVV) Price Target Raised to $54",
      "summary": "BofA and Jefferies have both raised their price targets on Ovintiv Inc. (OVV) to $54, maintaining 'Buy' ratings. Analysts favor Ovintiv due to its disciplined portfolio shift towards high-return assets, expected reduction in net debt through acquisitions and divestments, and its potential for increased buybacks and a cash-return framework. BofA considers Ovintiv its top oil pick for 2026.",
      "url": "https://finviz.com/news/283296/ovintiv-ovv-price-target-raised-to-54",
      "source": "Finviz",
      "published": "20260122T095801",
      "overall_sentiment_score": 0.35085,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.347042,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.636356
    },
    {
      "title": "SOCAR Ventures into Africa through Baleine Deal with Eni",
      "summary": "The State Oil Company of the Azerbaijan Republic (SOCAR) has signed an agreement with Italy's Eni to acquire a 10 percent stake in the producing Baleine field offshore Côte d’Ivoire, marking SOCAR's entry into the African oil and gas market. This deal is part of a broader collaboration between the two companies, focusing on hydrocarbon exploration, production for European energy security, and emission reduction projects, including carbon capture and biofuel development. The Baleine field, a significant West African discovery, currently produces over 62,000 barrels of oil and 75 million cubic feet of natural gas daily, with plans for increased capacity.",
      "url": "https://www.rigzone.com/news/socar_ventures_into_africa_through_baleine_deal_with_eni-22-jan-2026-182825-article/",
      "source": "Rigzone",
      "published": "20260122T095751",
      "overall_sentiment_score": 0.195694,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.343147,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.641942
    },
    {
      "title": "Chevron Fire, Asset Sales And New Partnerships Create Mixed Value Picture",
      "summary": "A fire at Chevron's Tengiz oil field in Kazakhstan has led to a shutdown, raising questions about near-term supply, while the company is also looking to sell its Singapore refining assets and explore partnerships in Turkey, Mexico (Pemex), and Russia (Lukoil). These developments create a mixed picture of risk and opportunity for Chevron, whose stock has shown positive short-term momentum, trading below analyst consensus targets and Simply Wall St's estimated fair value. Investors are advised to monitor production updates, asset sales, and new deals, while noting concerns about dividend coverage and insider selling.",
      "url": "https://simplywall.st/stocks/us/energy/nyse-cvx/chevron/news/chevron-fire-asset-sales-and-new-partnerships-create-mixed-v",
      "source": "Simply Wall Street",
      "published": "20260122T034743",
      "overall_sentiment_score": 0.177237,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.141337,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.647784
    },
    {
      "title": "Does Geopolitics-Driven Oil Spike Reshape the Bull Case For Cenovus Energy (TSX:CVE)?",
      "summary": "Geopolitical tensions in the Middle East and delays in Venezuelan crude entering the U.S. market have caused a sharp rise in oil prices, benefiting Cenovus Energy in the near term. While this strengthens the company's cash flow and position among North American suppliers, it doesn't fundamentally alter its long-term investment narrative as a value-oriented, oil price-sensitive company with forecast revenue declines. Investors hold varied perspectives on Cenovus's fair value and long-term appeal, highlighting the importance of considering multiple viewpoints and the company's dependency on oil prices and capital returns.",
      "url": "https://simplywall.st/stocks/ca/energy/tsx-cve/cenovus-energy-shares/news/does-geopolitics-driven-oil-spike-reshape-the-bull-case-for",
      "source": "Simply Wall Street",
      "published": "20260122T012822",
      "overall_sentiment_score": 0.119042,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.095218,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.634729
    },
    {
      "title": "Exxon Mobil (XOM) Price Target Raised by $9 at JPMorgan",
      "summary": "JPMorgan analyst Arun Jayaram raised the price target for Exxon Mobil (XOM) from $124 to $133, maintaining an 'Overweight' rating, based on valuation concerns and a more constructive outlook for the downstream sector. This adjustment is part of the bank's 2026 outlook for the integrated oils sector, emphasizing U.S. oil majors over Canadian counterparts due to geopolitical tensions. Despite the positive outlook from JPMorgan, Exxon Mobil anticipates a significant drop in Q4 upstream earnings due to low prices.",
      "url": "https://finviz.com/news/283303/exxon-mobil-xom-price-target-raised-by-9-at-jpmorgan",
      "source": "Finviz",
      "published": "20260121T225000",
      "overall_sentiment_score": 0.117256,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.209893,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "CrossAmerica Partners LP Maintains Quarterly Distribution",
      "summary": "CrossAmerica Partners LP announced its Board of Directors approved a quarterly distribution of $0.5250 per unit for the fourth quarter of 2025, totaling an annualized $2.10 per unit. This distribution will be payable on February 12, 2026, to unitholders of record as of February 2, 2026. The company also plans to host a conference call on February 26th to discuss its fourth-quarter and full-year 2025 earnings.",
      "url": "https://www.globenewswire.com/news-release/2026/01/21/3223263/0/en/CrossAmerica-Partners-LP-Maintains-Quarterly-Distribution.html",
      "source": "GlobeNewswire",
      "published": "20260121T162000",
      "overall_sentiment_score": 0.33143,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.325723,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.606282
    },
    {
      "title": "Exxon Mobil stock hits all-time high at 132.29 USD",
      "summary": "Exxon Mobil's stock has reached an all-time high of $132.29, marking a 21.67% increase over the past year and reflecting strong investor confidence and market position. The company maintains an impressive 55-year streak of dividend payments and is rated \"GOOD\" for financial health by InvestingPro. This achievement occurs amidst a broader rally in energy stocks and strategic industry-wide activities, including potential oil exploration projects in Venezuela and Mexico, and a retained Buy rating from UBS based on global refining operations.",
      "url": "https://www.investing.com/news/company-news/exxon-mobil-stock-hits-alltime-high-at-13229-usd-93CH-4457999",
      "source": "Investing.com",
      "published": "20260121T145722",
      "overall_sentiment_score": 0.32759,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.422791,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Exxon Mobil stock hits all-time high at 132.29 USD By Investing.com",
      "summary": "Exxon Mobil's stock has reached an all-time high of $132.29, marking a 21.67% increase over the last year. This milestone reflects strong investor confidence and the company's robust performance, supported by 55 consecutive years of dividend payments and a \"GOOD\" financial health rating from InvestingPro. The achievement comes amidst a broader rally in energy stocks and recent strategic activities including discussions with the Mexican government for oil exploration and a reiteration of a Buy rating from UBS.",
      "url": "https://za.investing.com/news/company-news/exxon-mobil-stock-hits-alltime-high-at-13229-usd-93CH-4071797",
      "source": "Investing.com South Africa",
      "published": "20260121T144435",
      "overall_sentiment_score": 0.30854,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.422913,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Slb stock hits 52-week high at $47.73",
      "summary": "SLB (formerly Schlumberger) has reached a 52-week stock high of $47.73, trading currently at $47.97, reflecting significant investor confidence and a 14.99% increase over the past year. The company's robust performance is supported by strategic initiatives, a 2.45% dividend yield, and major contract wins, including a five-year agreement with Aramco. Despite appearing slightly overvalued by some metrics, analyst upgrades and expectations of increased activity in international markets suggest continued positive momentum for SLB.",
      "url": "https://www.investing.com/news/company-news/slb-stock-hits-52week-high-at-4773-93CH-4458011",
      "source": "Investing.com",
      "published": "20260121T144413",
      "overall_sentiment_score": 0.163527,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": -0.415762,
      "ticker_sentiment_label": "Bearish",
      "relevance_score": 0.622391
    },
    {
      "title": "Century Aluminum stock hits 52-week high at 49.87 USD By Investing.com",
      "summary": "Century Aluminum (CENX) stock has reached a new 52-week high of $49.87, marking a 155.87% surge over the past year due to favorable market conditions and company strategies. Despite a recent earnings miss for Q3 2025, the stock saw a modest aftermarket increase, and Texas Capital Securities initiated coverage with a \"Buy\" rating and a $42 price target. Concurrently, Glencore Plc is looking to sell 9 million shares of Century Aluminum, aiming to raise $284.9 million.",
      "url": "https://uk.investing.com/news/company-news/century-aluminum-stock-hits-52week-high-at-4987-usd-93CH-4463340",
      "source": "Investing.com UK",
      "published": "20260121T143600",
      "overall_sentiment_score": 0.232163,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.134593,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.635681
    },
    {
      "title": "Are Southern Copper’s (SCCO) Byproduct Metals Quietly Redefining Its Margin Resilience Story?",
      "summary": "This article examines Southern Copper's (SCCO) investment narrative, focusing on its vertically integrated operations, extensive copper reserves, and the role of byproduct metals like zinc and silver in stabilizing profitability. While analysts are optimistic about the company's long-term prospects due to constrained copper supply, the article suggests that the current share price may already reflect these positive factors, with near-term volatility heavily influenced by copper prices and project execution. It also highlights varying fair value estimates among investors, cautioning against overlooking potential risks.",
      "url": "https://simplywall.st/stocks/us/materials/nyse-scco/southern-copper/news/are-southern-coppers-scco-byproduct-metals-quietly-redefinin",
      "source": "Simply Wall Street",
      "published": "20260121T125730",
      "overall_sentiment_score": 0.164736,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.101608,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.582428
    },
    {
      "title": "Pacific Heights Asset Management LLC Buys 10,000 Shares of Exxon Mobil Corporation $XOM",
      "summary": "Pacific Heights Asset Management LLC increased its stake in Exxon Mobil Corporation (NYSE:XOM) by 5% during the third quarter, acquiring an additional 10,000 shares to hold a total of 210,000 shares valued at approximately $23.68 million. This makes Exxon Mobil its 24th largest holding, representing 1.0% of the firm's portfolio. The article also details other institutional investor activity, Exxon's dividend increase, recent earnings, and mixed analyst sentiment with an average price target of $130.25.",
      "url": "https://www.marketbeat.com/instant-alerts/filing-pacific-heights-asset-management-llc-buys-10000-shares-of-exxon-mobil-corporation-xom-2026-01-21/",
      "source": "MarketBeat",
      "published": "20260121T115712",
      "overall_sentiment_score": 0.221154,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.223787,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Allstate Corp Purchases 148,654 Shares of Exxon Mobil Corporation $XOM",
      "summary": "Allstate Corp significantly increased its stake in Exxon Mobil Corporation by 1,745.6% during the third quarter, acquiring an additional 148,654 shares. Other institutional investors like Maryland State Retirement & Pension System and U.S. Capital Wealth Advisors LLC also boosted their holdings. The article details Exxon Mobil's financial performance, dividend increase, insider transactions, and recent analyst ratings, which currently average a \"Hold\" with a price target of $130.25.",
      "url": "https://www.marketbeat.com/instant-alerts/filing-allstate-corp-purchases-148654-shares-of-exxon-mobil-corporation-xom-2026-01-21/",
      "source": "MarketBeat",
      "published": "20260121T082054",
      "overall_sentiment_score": 0.287847,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.257563,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Best Dividend Stock to Buy Right Now: Realty Income vs. BP",
      "summary": "This article compares Realty Income (O) and BP (BP) as dividend stock investments, despite their different business models. While BP offers a slightly higher yield, Realty Income is presented as a more reliable dividend stock due to its consistent dividend increases over 30 years and stable net lease real estate business model, unlike BP which cut its dividend in 2020 and operates in the volatile oil market. The author concludes that for investors prioritizing reliable income, Realty Income is the superior choice.",
      "url": "https://finviz.com/news/280666/best-dividend-stock-to-buy-right-now-realty-income-vs-bp",
      "source": "Finviz",
      "published": "20260121T013009",
      "overall_sentiment_score": 0.085413,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.129178,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.62333
    },
    {
      "title": "Ecopetrol Announces Hydrocarbon-Producing Departments' Nominee to the Board of Directors on Slate Proposed by Government of Colombia",
      "summary": "Ecopetrol S.A. announced that Mr. Ricardo Rodriguez Yee has been nominated by the hydrocarbon-producing departments as their candidate for the Board of Directors. This nominee will be presented for shareholder election as the eighth director on the slate proposed by the Government of Colombia. Ecopetrol is the largest company in Colombia and a major integrated energy company in the Americas, with extensive operations in hydrocarbon production, transportation, and refining, as well as significant international presence in energy transmission and other sectors.",
      "url": "https://finviz.com/news/281038/ecopetrol-announces-hydrocarbon-producing-departments-nominee-to-the-board-of-directors-on-slate-proposed-by-government-of-colombia",
      "source": "Finviz",
      "published": "20260120T172722",
      "overall_sentiment_score": 0.137182,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.105314,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.624228
    },
    {
      "title": "Turkey seeks Chevron partnership for oil and gas exploration projects",
      "summary": "Turkey's state energy company, Turkish Petroleum Corp (TPAO), is in discussions with Chevron for joint oil and gas exploration. This potential partnership aligns with Ankara's strategy to boost domestic energy production and follows a recent agreement with ExxonMobil. Chevron has confirmed it assesses potential opportunities globally but declined to comment on specific commercial matters.",
      "url": "https://worldoil.com/news/2026/1/20/turkey-seeks-chevron-partnership-for-oil-and-gas-exploration-projects/",
      "source": "World Oil",
      "published": "20260120T162618",
      "overall_sentiment_score": 0.207082,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.226941,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.636772
    },
    {
      "title": "Exxon Mobil (XOM) Reaffirmed Buy by UBS on Underrated Refining Capabilities",
      "summary": "UBS has reaffirmed a Buy rating and $145 price target for Exxon Mobil Corporation (XOM), highlighting the company's strong global refining capabilities. These capabilities, encompassing 4.1 million barrels per day across 15 refineries, provide financial stability and act as a hedge against falling crude prices. UBS anticipates a significant increase in free cash flow for ExxonMobil's energy products division due to improved refining margins.",
      "url": "https://finviz.com/news/281449/exxon-mobil-xom-reaffirmed-buy-by-ubs-on-underrated-refining-capabilities",
      "source": "Finviz",
      "published": "20260120T144700",
      "overall_sentiment_score": 0.400421,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.408963,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Stenger Family Office LLC Sells 11,910 Shares of Exxon Mobil Corporation $XOM",
      "summary": "Stenger Family Office LLC reduced its stake in Exxon Mobil Corporation by 9.2% in the third quarter, selling 11,910 shares and ending with 117,643 shares valued at $13.64 million. Exxon Mobil represents 2.5% of the firm's portfolio. The article also covers analyst ratings, recent dividend increases, earnings performance, and insider trading activity for Exxon Mobil.",
      "url": "https://www.marketbeat.com/instant-alerts/filing-stenger-family-office-llc-sells-11910-shares-of-exxon-mobil-corporation-xom-2026-01-20/",
      "source": "MarketBeat",
      "published": "20260120T130122",
      "overall_sentiment_score": 0.261624,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.293822,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 1.0
    }
  ]
}