{
  "ticker": "JPM",
  "date": "2021-11-15",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T12:04:42.658253",
  "source": "alpha_vantage",
  "article_count": 33,
  "articles": [
    {
      "title": "JPMorgan files $162 million lawsuit against Tesla over warrants, citing Musk tweet",
      "summary": "JPMorgan Chase has filed a $162 million lawsuit against Tesla, alleging breach of contract over stock warrants. The lawsuit stems from Elon Musk's 2018 tweet about taking Tesla private at $420, which JPMorgan claims significantly decreased the value of the warrants. JPMorgan asserts Tesla flagrantly ignored its contractual obligation to pay when the warrants expired.",
      "url": "https://www.axios.com/2021/11/16/jpmorgan-tesla-lawsuit-elon-musk-tweets",
      "source": "Axios",
      "published": "20211115T212700",
      "overall_sentiment_score": -0.246114,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.113277,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.866461
    },
    {
      "title": "MercadoLibre, Inc. Announces Equity Offering",
      "summary": "MercadoLibre, Inc. announced its intention to make a public offering of common stock and expects to grant underwriters a 30-day option to purchase additional shares. The company plans to use the net proceeds for general corporate purposes. Morgan Stanley & Co. LLC, J.P. Morgan Securities LLC, and Goldman Sachs & Co. LLC are serving as lead managing bookrunners for the offering.",
      "url": "https://investor.mercadolibre.com/news-and-events/mercadolibre-inc-announces-equity-offering",
      "source": "Mercado Libre",
      "published": "20211115T204632",
      "overall_sentiment_score": 0.10513,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.149319,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.623751
    },
    {
      "title": "American Tower to buy data center operator CoreSite for $7.5 bln",
      "summary": "American Tower (AMT.N) has agreed to acquire U.S. data center operator CoreSite Realty Corp (COR.N) for $7.51 billion in cash, capitalizing on the increased demand in the data center sector. The offer of $170 per share represents a 5.7% premium over CoreSite's closing price on November 9, with the deal expected to close by the end of the year. CoreSite operates over 24 data center facilities across North America, leasing space to companies for computing power.",
      "url": "https://www.reuters.com/breakingviews/american-tower-buy-data-center-operator-coresite-75-bln-2021-11-15/",
      "source": "Reuters",
      "published": "20211115T130200",
      "overall_sentiment_score": 0.310522,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.117794,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.608609
    },
    {
      "title": "ClearTrace and EDF Partner to Provide 24/7 Renewable Energy to JPMorgan Chase’s UK Operations",
      "summary": "ClearTrace and EDF have partnered to provide 24/7 renewable energy to JPMorgan Chase's UK operations, ensuring 100% of electricity consumption is matched in real-time with renewable generation using ClearTrace's blockchain-based tracking technology. This collaboration with EDF, Britain's largest producer of zero-carbon electricity, aims to help JPMorgan Chase achieve its commitment to carbon-neutral operations and serves as a model for other large businesses seeking to decarbonize their electricity supply and improve their carbon footprint. This is the second agreement between ClearTrace and JPMorgan Chase, following a similar initiative for New York operations announced in 2020.",
      "url": "https://www.businesswire.com/news/home/20211111005367/en/ClearTrace-and-EDF-Partner-to-Provide-247-Renewable-Energy-to-JPMorgan-Chases-UK-Operations",
      "source": "Business Wire",
      "published": "20211111T203644",
      "overall_sentiment_score": 0.454207,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.461839,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "CI&T Announces Pricing of Initial Public Offering (IPO)",
      "summary": "CI&T Inc. announced the pricing of its initial public offering of 13,043,478 Class A common shares at US$15.00 per share. The offering is expected to begin trading on the NYSE under the ticker \"CINT\" on November 10, 2021, and close on November 12, 2021. Goldman Sachs & Co. LLC and Citigroup are leading the underwriting group for the offering.",
      "url": "https://markets.financialcontent.com/stocks/article/bizwire-2021-11-10-ci-and-t-announces-pricing-of-initial-public-offering-ipo?Language=english",
      "source": "FinancialContent",
      "published": "20211109T205300",
      "overall_sentiment_score": 0.372555,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.328307,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.604888
    },
    {
      "title": "Whittier Daily News: Local News, Sports, Things to Do - Expensify Announces Pricing of Initial Public Offering",
      "summary": "Expensify, a payments superapp, announced the pricing of its initial public offering, offering 9,730,776 shares of Class A common stock at $27.00 per share. The company expects to raise approximately $70.4 million from its portion of the offering, with shares set to trade on Nasdaq under the ticker \"EXFY\" starting November 10, 2021. J.P. Morgan Securities LLC, Citigroup Global Markets Inc., and BofA Securities are lead bookrunning managers for the offering.",
      "url": "https://markets.financialcontent.com/whittierdailynews/article/bizwire-2021-11-10-expensify-announces-pricing-of-initial-public-offering",
      "source": "FinancialContent",
      "published": "20211109T201500",
      "overall_sentiment_score": 0.287146,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.222668,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.608214
    },
    {
      "title": "General Electric to split into 3 public companies",
      "summary": "General Electric announced its plan to split into three public companies focused on aviation, healthcare, and energy, with the healthcare spinoff planned for early 2023 and the energy segment for early 2024. This move aims to provide each new company with greater focus and strategic flexibility, marking an end to GE's conglomerate era. CEO Lawrence Culp Jr. stated the separation will drive long-term growth and value for stakeholders, following years of unwinding the company's vast empire and improving its stock performance.",
      "url": "https://www.syracuse.com/business/2021/11/general-electric-to-split-into-3-public-companies.html",
      "source": "Syracuse.com",
      "published": "20211109T112100",
      "overall_sentiment_score": 0.297919,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.206781,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.640308
    },
    {
      "title": "Braze IPO: What to Know About Price Terms and More",
      "summary": "Customer engagement platform Braze is preparing for its initial public offering, targeting a multi-billion-dollar valuation with shares priced between $55 and $60. The company aims to raise $402 million by offering 6.7 million Class A common stock shares. Braze seeks a $5.41 billion valuation and plans to list on the Nasdaq Exchange under the ticker symbol \"BRZE.\"",
      "url": "https://marketrealist.com/p/braze-ipo-price/",
      "source": "Market Realist",
      "published": "20211108T122300",
      "overall_sentiment_score": 0.194061,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.126809,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.624749
    },
    {
      "title": "Methanex Egypt Announces the Early Settlement of its Joint Venture Financing Facility",
      "summary": "Methanex Egypt has announced the full and early settlement of its US$530 million EMethanex Joint Venture project financing facility. This collaboration spanned 15 years with an international and local banking consortium, enabling a US$1 billion investment in Damietta for their methanol production plant. The early settlement marks a significant milestone, highlighting the venture's successful financial management despite economic challenges.",
      "url": "https://egyptoil-gas.com/features/methanex-egypt-announces-the-early-settlement-of-its-joint-venture-financing-facility/",
      "source": "Egypt Oil & Gas",
      "published": "20211107T204632",
      "overall_sentiment_score": 0.514844,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.434255,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.625016
    },
    {
      "title": "Sallie Mae Appoints Samuel Ramsey to Its Board of Directors",
      "summary": "Sallie Mae (Nasdaq: SLM) announced the appointment of Samuel Ramsey to its board of directors, effective immediately. Mr. Ramsey brings over 30 years of experience in consumer and commercial banking, with significant expertise in risk management, finance, treasury, and capital markets from roles at Chase, Ally Financial, and Bank of America. His appointment is expected to deepen the company's expertise in critical risk management areas.",
      "url": "https://www.citybiz.co/article/170710/sallie-mae-appoints-samuel-ramsey-to-its-board-of-directors/",
      "source": "citybiz",
      "published": "20211104T211636",
      "overall_sentiment_score": 0.304308,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.244261,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.62841
    },
    {
      "title": "Schwab CEO Defends PFOF, Claims It Nets Investors Better Pricing",
      "summary": "Charles Schwab CEO Walt Bettinger defended his firm's use of payment for order flow (PFOF), asserting that it has resulted in better pricing for investors and lowered commissions, despite concerns about conflicts of interest raised by SEC Chairman Gary Gensler. Bettinger argued that PFOF provides economic value and that outlawing it would merely transfer that value elsewhere. Gensler, however, remains focused on potential conflicts, especially regarding how PFOF might incentivize increased trading or steer investors toward riskier accounts.",
      "url": "https://www.advisorhub.com/schwab-ceo-defends-pfof-claims-it-nets-investors-better-pricing/",
      "source": "AdvisorHub",
      "published": "20211102T211142",
      "overall_sentiment_score": -0.077651,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.137718,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.618027
    },
    {
      "title": "JPMorgan Chase to restrict purchases of cannabis-related stocks, securities, report says",
      "summary": "JPMorgan Chase informed its brokerage clients that they would no longer be allowed to purchase cannabis-related stocks and securities starting November 8, 2021. This restriction applies to any company with a \"direct nexus to marijuana-related activities\" and follows a similar move by Credit Suisse Group earlier in the year. U.S. Cannabis Council CEO Steve Hawkins criticized the decision, calling it \"regressive\" and \"self-defeating.\"",
      "url": "https://mjbizdaily.com/jpmorgan-chase-to-restrict-purchases-of-cannabis-related-stocks-securities/",
      "source": "MJBizDaily",
      "published": "20211102T203645",
      "overall_sentiment_score": -0.208463,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.231278,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 1.0
    },
    {
      "title": "Jefferies hires senior bankers for financials investment banking -memo",
      "summary": "Jefferies Financial Group has bolstered its investment banking unit by hiring senior bankers from rivals such as JPMorgan Chase & Co and Barclays PLC. Matthias Kristol will lead asset and wealth management investment banking globally, and Aaron Bruker will head sidecars and third-party capital. These hires are part of Jefferies' strategy to capitalize on record-breaking mergers and acquisitions activity.",
      "url": "https://www.reuters.com/legal/transactional/jefferies-hires-senior-bankers-financials-investment-banking-memo-2021-11-02/",
      "source": "Reuters",
      "published": "20211102T151500",
      "overall_sentiment_score": 0.175596,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.136686,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.879511
    },
    {
      "title": "J.P. Morgan Asset Management Launches Active Fixed Income ETF: JPMorgan Income ETF (JPIE)",
      "summary": "J.P. Morgan Asset Management has launched the JPMorgan Income ETF (JPIE), an active fixed-income ETF designed to offer attractive distributions with lower volatility by investing across various debt securities. The fund aims to maximize income while minimizing portfolio risk through sector allocation shifts, combining the expertise of the firm's Global Fixed Income Currency and Commodities (GFICC) platform. JPIE is managed by experienced portfolio managers Andrew Norelli, Andrew Headley, and Thomas Hauser, further expanding J.P. Morgan Asset Management's active fixed-income product suite.",
      "url": "https://www.prnewswire.com/news-releases/jp-morgan-asset-management-launches-active-fixed-income-etf-jpmorgan-income-etf-jpie-301414143.html",
      "source": "PR Newswire",
      "published": "20211102T093000",
      "overall_sentiment_score": 0.216202,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.410898,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Fluence Announces Closing of Initial Public Offering and Full Exercise of Underwriters’ Option to Purchase Additional Shares; Raises Gross Proceeds of $998,200,000",
      "summary": "Fluence Energy, Inc. announced the closing of its initial public offering, including the full exercise of the underwriters' option to purchase additional shares, raising gross proceeds of $998.2 million. The company's Class A common stock began trading on the Nasdaq Global Select Market under the ticker symbol \"FLNC\" on September 28, 2021, at an initial public offering price of $28.00 per share.",
      "url": "https://www.stocktitan.net/news/FLNC/fluence-announces-closing-of-initial-public-offering-and-full-ek9jfx4ykdkz.html",
      "source": "Stock Titan",
      "published": "20211102T083300",
      "overall_sentiment_score": 0.364499,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.23169,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.696006
    },
    {
      "title": "CI&T Announces Launch of Initial Public Offering (IPO)",
      "summary": "CI&T Inc., a global digital transformation partner, has announced the launch of its initial public offering. The offering includes Class A common shares from both CI&T and certain selling shareholders, with an estimated price range of US$17.00 to US$19.00 per share, and the company intends to list on the New York Stock Exchange under the ticker symbol \"CINT.\" Proceeds from the offering will be used for strategic acquisitions, working capital, capital expenditures, investments, and general corporate purposes.",
      "url": "https://markets.financialcontent.com/stocks/article/bizwire-2021-11-1-ci-and-t-announces-launch-of-initial-public-offering-ipo?Language=english",
      "source": "FinancialContent",
      "published": "20211101T110800",
      "overall_sentiment_score": 0.213541,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.145798,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.642846
    },
    {
      "title": "Expensify Announces Closing of Initial Public Offering and Exercise in Full of the Underwriters’ Option to Purchase Additional Shares",
      "summary": "Expensify, Inc. announced the closing of its initial public offering of over 11 million shares of its Class A common stock, including the full exercise of the underwriters' option to purchase additional shares. The shares were offered at $27.00 per share and are listed on The Nasdaq Global Select Market under the ticker symbol \"EXFY.\" J.P. Morgan Securities LLC, Citigroup Global Markets Inc., and BofA Securities acted as joint lead bookrunning managers for the offering.",
      "url": "https://markets.financialcontent.com/whittierdailynews/article/bizwire-2021-11-15-expensify-announces-closing-of-initial-public-offering-and-exercise-in-full-of-the-underwriters-option-to-purchase-additional-shares",
      "source": "FinancialContent",
      "published": "20211115T171600",
      "overall_sentiment_score": 0.275429,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.237332,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.628383
    },
    {
      "title": "Chase Bank opens first branch in MetroWest",
      "summary": "Chase Bank has opened its first branch in the MetroWest area of Massachusetts, located in Framingham. This new branch at 120 Worcester Road is part of a larger redevelopment and offers customized financial solutions, ATM services, and financial health workshops. Although it's the first full-service branch in MetroWest, Chase has had ATMs in Marlborough and Natick and serves over a million customers across Massachusetts.",
      "url": "https://www.metrowestdailynews.com/story/business/2021/11/14/chase-finally-opened-branch-metrowest-area/6384230001/",
      "source": "MetroWest Daily News",
      "published": "20211114T203645",
      "overall_sentiment_score": 0.423455,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.407922,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Gen Z Set to Adopt Fintech Apps at Record Rates: 155% Growth from 2020 to 18.9 Billion Sessions in 2022",
      "summary": "Gen Z is rapidly adopting fintech apps, with usage growing 155% from 2020 to 18.9 billion sessions in 2022. Cryptocurrencies are a significant driver of this increase, with Robinhood, Coinbase, and Wellbull Stocks being top crypto-trading apps among US Gen Z and Millennial users. This presents an unprecedented opportunity for financial institutions to engage mobile-first Gen Z users and cultivate loyalty as they approach financial independence.",
      "url": "https://financialit.net/news/cryptocurrencies/gen-z-set-adopt-fintech-apps-record-rates-155-growth-2020-189-billion-sessions",
      "source": "Financial IT",
      "published": "20211111T153000",
      "overall_sentiment_score": 0.354249,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.114081,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.648477
    },
    {
      "title": "CMU Invites Students To Explore Artificial Intelligence With Opening of JPMorgan Chase & Co. AI Maker Space",
      "summary": "Carnegie Mellon University has opened the JPMorgan Chase & Co. AI Maker Space, an initiative designed to provide students from diverse disciplines with access to advanced AI technology. The 2,000-square-foot facility, supported by JPMorgan Chase & Co., offers robots, drones, smart appliances, and high-end computers, encouraging interdisciplinary collaboration and innovation in artificial intelligence. This space aims to foster creativity and equip students with the tools to develop cutting-edge AI solutions for real-world problems.",
      "url": "https://www.cmu.edu/news/stories/archives/2021/november/jp-morgan-ai-maker-space.html",
      "source": "Carnegie Mellon University",
      "published": "20211110T203643",
      "overall_sentiment_score": 0.483411,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.461091,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Hertz Relists on NASDAQ Global Select Market as HTZ",
      "summary": "Hertz Global Holdings Inc. has relisted its shares on the Nasdaq Global Select Market under the ticker HTZ, following its emergence from bankruptcy earlier this year. Shareholder sold 44.5 million shares in an upsized public offering, though Hertz itself did not receive proceeds and plans to repurchase $300 million worth of shares. The company is also focusing on electric vehicles, with plans to acquire 100,000 Teslas and rent 50,000 EVs to Uber.",
      "url": "https://www.investopedia.com/public-offering-as-hertz-relists-on-nasdaq-5209051",
      "source": "Investopedia",
      "published": "20211110T130500",
      "overall_sentiment_score": 0.061227,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.14835,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.613561
    },
    {
      "title": "How a new JPMorgan Chase branch on Beatties Ford Road goes beyond just banking",
      "summary": "JPMorgan Chase & Co. opened a new branch on Beatties Ford Road in Charlotte, attracting neighborhood and civic leaders to the celebration. This article highlights the opening of the latest local branch in the Historic West End.",
      "url": "https://www.bizjournals.com/charlotte/news/2021/11/04/chase-opens-13th-local-branch.html",
      "source": "The Business Journals",
      "published": "20211104T203644",
      "overall_sentiment_score": 0.27755,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.343131,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.957188
    },
    {
      "title": "Trii ofrece gratis 1.500 transacciones del fondo bursátil Hcolsel de Global X en la bolsa",
      "summary": "Trii is offering 1,500 free transactions for the Hcolsel ETF from Global X on the Colombian Stock Exchange, along with cashbacks and referral codes. This initiative follows the recent authorization for Trii to allow trading of international stocks in Colombia, including major US and Chilean companies. The Hcolsel ETF itself is composed of significant Colombian companies like Ecopetrol and Bancolombia.",
      "url": "https://www.larepublica.co/finanzas/trii-ofrece-gratis-1-500-transacciones-del-fondo-bursatil-hcolsel-de-global-x-en-la-bolsa-3257134",
      "source": "LaRepublica.co",
      "published": "20211104T125758",
      "overall_sentiment_score": 0.353992,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.310522,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.573001
    },
    {
      "title": "JPMorgan Will No Longer Allow Prime Brokerage Clients to Purchase Certain Cannabis-Related Securities",
      "summary": "JPMorgan Chase & Co. has informed its prime brokerage clients that, effective Nov. 8, they can no longer purchase certain U.S. cannabis-related securities, particularly those not listed on major stock exchanges and with a direct nexus to marijuana activities. This restriction aims to comply with U.S. money laundering laws, following similar actions by other banks after the Archegos Capital collapse. The U.S. Cannabis Council CEO Steven Hawkins criticized the move, calling it \"regressive\" and suggesting JPMorgan will regret not participating in the rapidly growing cannabis industry.",
      "url": "https://www.cannabisbusinesstimes.com/business-issues-benchmarks/finance/news/15694275/jpmorgan-will-no-longer-allow-prime-brokerage-clients-to-purchase-certain-cannabis-related-securities",
      "source": "Cannabis Business Times",
      "published": "20211103T203644",
      "overall_sentiment_score": 0.043703,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.003108,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.325525
    },
    {
      "title": "Jeffrey Epstein ties cost Barclays CEO his job",
      "summary": "Barclays Plc CEO Jes Staley has resigned following a UK regulatory probe into how he characterized his past relationship with convicted sex offender Jeffrey Epstein. C.S. Venkatakrishnan, head of the Barclays markets division, will replace him. The investigation's findings have not been made public, but Staley intends to contest them.",
      "url": "https://www.aljazeera.com/economy/2021/11/1/jeffrey-epstein-ties-cost-barclays-ceo-his-job",
      "source": "Al Jazeera",
      "published": "20211101T194725",
      "overall_sentiment_score": -0.18792,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.131105,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.629332
    },
    {
      "title": "Discredit history: 10 years of Barclays scandals",
      "summary": "This article details a decade of scandals at Barclays, leading to the resignation of two chief executives. It covers controversies such as the 2008 financial crisis fundraising, the Libor rigging scandal, and various issues involving former CEO Jes Staley, including a whistleblowing scandal and his relationship with Jeffrey Epstein.",
      "url": "https://www.theguardian.com/business/2021/nov/01/discredit-history-10-years-of-barclays-scandals",
      "source": "The Guardian",
      "published": "20211101T142900",
      "overall_sentiment_score": -0.311088,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.12428,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.625318
    },
    {
      "title": "Six firms connect for KKR, Global Infrastructure Partners' CyrusOne buy",
      "summary": "Six law firms, including Cravath, Swaine & Moore and Kirkland & Ellis, have been engaged for KKR & Co Inc and Global Infrastructure Partners' $15 billion acquisition of data center operator CyrusOne Inc. This deal comes amidst a boom in M&A activity within the data center industry, coinciding with American Tower Corp's $10.1 billion acquisition of CoreSite Realty Corp. Various law firms and financial advisors are involved in facilitating these major transactions.",
      "url": "https://www.reuters.com/legal/transactional/six-firms-connect-kkr-global-infrastructure-partners-cyrusone-buy-2021-11-15/",
      "source": "Reuters",
      "published": "20211115T215600",
      "overall_sentiment_score": 0.288467,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.264891,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.709353
    },
    {
      "title": "I.CON panel: For spec builders in top logistics markets, it pays to wait to sign a lease",
      "summary": "A panel at I.CON East discussed the strategic advantage for speculative industrial developers in top logistics markets to delay signing leases. With rents rapidly increasing and supply at historic lows, waiting allows developers to secure better deals. However, this strategy needs to be balanced with the certainty a credit tenant offers, and it is most effective in supply-constrained, high-barrier locations.",
      "url": "https://re-nj.com/i-con-panel-for-spec-builders-in-top-logistics-markets-it-pays-to-wait-to-sign-a-lease/",
      "source": "Real Estate NJ",
      "published": "20211112T201655",
      "overall_sentiment_score": 0.319409,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.345614,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.645439
    },
    {
      "title": "Anti-Woke ETFs Are Pitching to Conservatives Mad at Corporate America",
      "summary": "2ndVote Advisers, led by former JPMorgan Chase & Co. banker Dan Grant, is launching exchange-traded funds (ETFs) aimed at conservative investors who are displeased with companies taking liberal stances on social justice issues. Grant believes that the millions of Trump voters are ready to invest in companies that align with politically conservative values or remain neutral, pushing back against the trend of left-leaning socially conscious investing. This initiative attempts to blend politics and investing by catering to those who feel neglected by \"woke\" corporations.",
      "url": "https://www.bloomberg.com/news/articles/2021-11-12/maga-etf-anti-woke-investing-targets-trump-loving-conservative-traders",
      "source": "Bloomberg.com",
      "published": "20211112T090000",
      "overall_sentiment_score": -0.08419,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.116755,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.600795
    },
    {
      "title": "JP Morgan Chase: Why Your Business Needs to be Certified as a Diverse Supplier – or hire more Diverse Suppliers",
      "summary": "This article from JP Morgan Chase emphasizes the importance for businesses to become certified as diverse suppliers or to actively hire more diverse suppliers. It highlights how supplier diversity promotes innovation, networking, and addresses racial equity gaps, with significant financial commitments from large corporations like those in the Billion Dollar Roundtable and government agencies. The piece also details the certification process and the benefits for both diverse-owned businesses and large corporations, including opportunities for growth and access to substantial procurement budgets.",
      "url": "https://fortworthbusiness.com/banking/why-your-business-needs-to-be-certified-as-a-diverse-supplier/",
      "source": "The Business Press",
      "published": "20211102T203644",
      "overall_sentiment_score": 0.409312,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.406765,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Bank of America to seek approval for securities firm in China - Bloomberg News",
      "summary": "Bank of America is reportedly planning to file an application to establish a securities firm in China as part of its strategy to expand into the country's growing financial services market. This move follows similar actions by other major Western banks like JPMorgan Chase and Goldman Sachs, leveraging China's loosened rules for foreign banks to operate fully-controlled businesses. The expansion into China's multi-trillion-dollar financial sector is driven by lucrative underwriting fees and the prospect of full ownership of business units.",
      "url": "https://www.reuters.com/business/finance/bank-america-seek-approval-securities-firm-china-bloomberg-news-2021-11-01/",
      "source": "Reuters",
      "published": "20211101T150400",
      "overall_sentiment_score": 0.370761,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.33984,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.601554
    },
    {
      "title": "Hedge Fund and Insider Trading News: Kyle Bass, Ken Griffin, Elliott Management, Soros Fund Management, Sachem Head Capital Management, Renaissance Technologies, Regional Management Corp. (RM), Aon PLC (AON), and More",
      "summary": "This article covers recent hedge fund activities, including Renaissance Technologies quadrupling its Tesla stake and boosting its AMC bet, Kyle Bass's skepticism about Bitcoin's future due to regulation, and Soros Fund Management's increased investments in real estate and financial stocks. It also details Elliott Management securing board seats at Duke Energy and Sachem Head Capital Management's strong performance.",
      "url": "https://www.insidermonkey.com/blog/hedge-fund-and-insider-trading-news-kyle-bass-ken-griffin-elliott-management-soros-fund-management-sachem-head-capital-management-renaissance-technologies-regional-management-corp-rm-aon-pl-1003442/",
      "source": "Insider Monkey",
      "published": "20211115T135900",
      "overall_sentiment_score": 0.222083,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.211699,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.617814
    },
    {
      "title": "JP Morgan Asset Management Launches JPIE",
      "summary": "J.P. Morgan Asset Management has launched the JPMorgan Income ETF (JPIE), an actively managed fixed income ETF designed to offer attractive distributions with lower volatility. JPIE leverages the firm's Global Fixed Income Currency and Commodities (GFICC) platform and is managed by a team with extensive experience in fixed income. This new ETF expands J.P. Morgan Asset Management's active fixed income suite to 10 products, further solidifying its presence in the ETF market.",
      "url": "https://etfdb.com/news/2021/11/02/jp-morgan-asset-management-launches-jpie/",
      "source": "ETF Database",
      "published": "20211102T201125",
      "overall_sentiment_score": 0.212569,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.431354,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    }
  ]
}