{
  "ticker": "JPM",
  "date": "2022-09-26",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T12:08:27.165995",
  "source": "alpha_vantage",
  "article_count": 20,
  "articles": [
    {
      "title": "Houston-based space tech company to go public via SPAC merger",
      "summary": "Houston-based space exploration company Intuitive Machines plans to go public through a SPAC merger with Inflection Point Acquisition Corp., valuing the combined company at $815 million. Anticipated to close in Q1 2023, the deal will list Intuitive Machines on Nasdaq under the ticker LUNR. The company, which has a $262 million backlog in NASA contracts and a history of significant revenue growth, is also expanding its facilities and has secured $105 million in capital commitments to fuel future growth in the expanding space exploration market.",
      "url": "https://houston.innovationmap.com/intuitive-machines-nasa-spac-ipo-2658311354.html",
      "source": "InnovationMap",
      "published": "20220921T124300",
      "overall_sentiment_score": 0.107828,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.144758,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.609498
    },
    {
      "title": "Horizon Kinetics Inflation Beneficiaries ETF (NYSEARCA:INFL) Holdings Boosted by Lowe Wealth Advisors LLC",
      "summary": "Lowe Wealth Advisors LLC increased its stake in Horizon Kinetics Inflation Beneficiaries ETF (INFL) by 7.3% in the second quarter, making it their 8th biggest position. Other institutional investors like Flow Traders U.S. LLC, Newman Dignan & Sheerar Inc., Wedbush Securities Inc., and JPMorgan Chase & Co. also modified their holdings, with JPMorgan Chase & Co. significantly raising its stake. The ETF's shares traded down recently, with a 1-year low of $27.26 and a 1-year high of $34.84.",
      "url": "https://news.futunn.com/en/post/19615263/horizon-kinetics-inflation-beneficiaries-etf-nysearca-infl-holdings-boosted-by",
      "source": "富途牛牛",
      "published": "20220917T011200",
      "overall_sentiment_score": 0.236443,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.307681,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.625901
    },
    {
      "title": "AIG unit Corebridge Financial's IPO prices at low end of range to raise $1.6 billion and mark biggest IPO of the year so far",
      "summary": "AIG's life insurance unit, Corebridge Financial Inc., priced its initial public offering at $21 per share, the low end of its price range, raising $1.68 billion. This makes it the biggest IPO of the year to date, despite falling short of an initial target of $1.8 billion due to market conditions. The shares are set to begin trading on the NYSE under the ticker \"CRBG\" and the IPO surpasses the $1 billion raised by TPG Inc. earlier in what has been a subdued year for IPOs.",
      "url": "http://www.marketwatch.com/story/aig-unit-corebridge-financials-ipo-prices-at-low-end-of-range-to-raise-16-billion-and-mark-biggest-ipo-of-the-year-so-far-2022-09-15?gaa_at=eafs&gaa_n=AWEtsqevgZtyiZ0F78974oZ3D5vqcO-2tBmWACmmeWT9BeZmIwRbKrtVAkzw&gaa_ts=6907848f&gaa_sig=oLBW75sXkEylvkiog6-4fOhiekIu1F3EjUWdTCDe1p-pYswLFmPeTM_q2qJssWNgDJzU_yY4xh_wS8ZIR5xQ2Q%3D%3D",
      "source": "MarketWatch",
      "published": "20220915T073400",
      "overall_sentiment_score": 0.222957,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.104542,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.632753
    },
    {
      "title": "AIG unit Corebridge Financial's IPO prices at low end of range to raise $1.6 billion and mark biggest IPO of the year so far",
      "summary": "AIG's life insurance unit, Corebridge Financial Inc., priced its initial public offering at $21 a share, the low end of its target range, raising $1.68 billion. This makes it the biggest IPO of the year to date, despite facing investor pushback after a market selloff. The shares are set to begin trading on the New York Stock Exchange under the ticker \"CRBG.\"",
      "url": "http://www.marketwatch.com/story/aig-unit-corebridge-financials-ipo-prices-at-low-end-of-range-to-raise-16-billion-and-mark-biggest-ipo-of-the-year-so-far-2022-09-15?gaa_at=eafs&gaa_n=AWEtsqdREASgbQB9wBiPc2HBXlCIb386TSO3SXa55pTmgUwu02GTLullrH92&gaa_ts=6907894c&gaa_sig=ZemtmMVxMe3OrOg6S6VzZVIKsjChEWUvUyyNok4LbuEdZX6Y14VRGeB0FkBoUdfpJ9PQDYRDY5Ow9uWSYgo_Xw%3D%3D",
      "source": "MarketWatch",
      "published": "20220915T073400",
      "overall_sentiment_score": 0.148203,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.140718,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.602807
    },
    {
      "title": "AIG unit Corebridge Financial's IPO prices at low end of range to raise $1.6 billion and mark biggest IPO of the year so far",
      "summary": "AIG's life insurance unit, Corebridge Financial Inc., priced its initial public offering at $21 a share, the low end of its anticipated range, successfully raising $1.68 billion. This makes it the largest IPO of the year despite a challenging market environment and a recent selloff in the Dow Jones Industrial Average. The shares are set to begin trading on the New York Stock Exchange under the ticker \"CRBG.\"",
      "url": "http://www.marketwatch.com/story/aig-unit-corebridge-financials-ipo-prices-at-low-end-of-range-to-raise-16-billion-and-mark-biggest-ipo-of-the-year-so-far-2022-09-15?gaa_at=eafs&gaa_n=AWEtsqdo1wCvRmI7H0Y-hS1iNc7nLr1rTwqo3OQ04V9aygmxoDUdtgoOYK06&gaa_ts=6907894c&gaa_sig=qWMleXlQPI3goQv4sHDYj4FzAznUNf9IDJqW7h3x1f-GxD4TxTIyeS2eV3CWDS_UImcZNcWI1u-h-oqd24suYg%3D%3D",
      "source": "MarketWatch",
      "published": "20220915T073400",
      "overall_sentiment_score": 0.078516,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.102407,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.631765
    },
    {
      "title": "Comerica Bank Is Building a New Business and Innovation Hub at The Star in Frisco",
      "summary": "Comerica Bank is constructing a new Business & Innovation Hub at The Star in Frisco, slated to open in late 2023 or early 2024, which will house approximately 300 employees and feature an innovation center and \"tech genius bar.\" This expansion aims to enhance cross-functional collaboration and meet evolving needs, complementing its downtown Dallas headquarters. The facility will be located in a new Class A+ tower at 17 Cowboys Way and is designed by HKS Architects.",
      "url": "https://dallasinnovates.com/comerica-bank-is-building-a-new-business-and-innovation-hub-at-the-star-in-frisco/",
      "source": "Dallas Innovates",
      "published": "20220914T162622",
      "overall_sentiment_score": 0.080938,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.029431,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.596509
    },
    {
      "title": "AIG Announces Pricing of Corebridge Financial, Inc. Initial Public Offering",
      "summary": "American International Group, Inc. (AIG) announced the pricing of the initial public offering (IPO) of Corebridge Financial, Inc. at $21 per share. The offering involves AIG selling 80 million shares of Corebridge common stock, expecting to generate approximately $1.7 billion in gross proceeds. Corebridge shares are set to begin trading on the New York Stock Exchange under the ticker symbol \"CRBG\" on September 15, 2022.",
      "url": "https://www.businesswire.com/news/home/20220914006004/en/AIG-Announces-Pricing-of-Corebridge-Financial-Inc.-Initial-Public-Offering",
      "source": "Business Wire",
      "published": "20220914T040000",
      "overall_sentiment_score": 0.235805,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.223473,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.625192
    },
    {
      "title": "US bank CEOs say they would stop working with China in event of Taiwan attack",
      "summary": "Top US bank CEOs stated they would cease operations in China if the US government instructed them to do so following a Taiwan invasion by mainland forces. This commitment was made during a House of Representatives Financial Services Committee hearing where lawmakers questioned their institutions' business ties to both Russia and China. The CEOs of JPMorgan Chase, Wells Fargo, Bank of America, Citigroup, US Bancorp, PNC Financial, and Truist were present.",
      "url": "https://www.scmp.com/news/world/united-states-canada/article/3193346/us-bank-ceos-say-they-would-stop-working-china",
      "source": "South China Morning Post",
      "published": "20220922T054700",
      "overall_sentiment_score": 0.149718,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.118212,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.85964
    },
    {
      "title": "Bank CEOs push back on capital requirements in Capitol Hill hearings",
      "summary": "CEOs from seven of the largest U.S. banks, including JPMorgan Chase, Citigroup, Wells Fargo, and Bank of America, engaged in two days of public hearings on Capitol Hill. They addressed various topics such as inflation, racial equality in home lending, regulatory burdens, and their perspectives on an impending economic slowdown. A key point of discussion was their pushback on capital requirements.",
      "url": "https://www.marketwatch.com/story/bank-ceos-push-back-on-capital-requirements-in-capitol-hill-hearings-11663779201?gaa_at=eafs&gaa_n=AWEtsqeAETzIDJYpZWW6a9VovlDAR9N7a9Nkmb4bXtYmeezR6bzZVEl2hSBK&gaa_ts=6907ac89&gaa_sig=Ir0c6NwYK6o_jDhObhTDiI7965Q2sZm6lMhfeCA_Xm9WYAghOg1s2GaL_yUT2ktJHDP7RTOeItuWkulqfTevRQ%3D%3D",
      "source": "MarketWatch",
      "published": "20220921T125300",
      "overall_sentiment_score": 0.034658,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.005563,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.945897
    },
    {
      "title": "United Community Bank’s CEO Lynn Harton Sees Two Dimensions to Leadership",
      "summary": "Lynn Harton, CEO of United Community Bank, defines leadership as having a positive vision and followers, emphasizing continuous personal growth. United Community Bank, known for its customer service and having $24.2 billion in assets, fosters employee development through programs like Career Pathing and Leadership Academy. Harton aims for United to be a \"legendary bank\" recognized by employees, customers, and shareholders.",
      "url": "https://www.greenvillebusinessmag.com/2022/09/20/412182/united-community-bank-s-ceo-lynn-harton-sees-two-dimensions-to-leadership",
      "source": "Greenville Business Magazine",
      "published": "20220920T172300",
      "overall_sentiment_score": 0.073924,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.121204,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.577168
    },
    {
      "title": "Nikko unveils metaverse ETF in Hong Kong",
      "summary": "Nikko Asset Management has launched a new actively managed metaverse thematic equity ETF in Hong Kong, the NikkoAM Metaverse Theme Active ETF, listed in HKD (3091 HK) and USD (9091 HK). The ETF offers exposure to companies globally involved in developing and enabling the metaverse, with estimated ongoing charges of 1.25%. This new offering joins the CSOP Metaverse Concept ETF (3034 HK) and the Samsung Asia Pacific ex NZ Metaverse Theme ETF (3172 HK) in the Hong Kong market.",
      "url": "https://www.etfstrategy.com/nikko-unveils-metaverse-etf-in-hong-kong-10339/",
      "source": "ETF Strategy",
      "published": "20220916T161124",
      "overall_sentiment_score": 0.278431,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.343927,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.710122
    },
    {
      "title": "AIG’s Corebridge Is Year’s Largest IPO at $1.7B",
      "summary": "AIG's life insurance and retirement division, Corebridge Financial Inc., successfully raised $1.68 billion in its initial public offering, marking the largest IPO of the year despite significant market volatility. AIG sold 80 million shares at $21 each, valuing Corebridge at $13.6 billion, with all proceeds going to AIG as the company seeks to focus on its property and casualty business. This listing also represents the biggest U.S. IPO of 2022, surpassing TPG Inc.'s $1.1 billion listing in January.",
      "url": "https://www.carriermanagement.com/news/2022/09/15/240389.htm",
      "source": "Carrier Management",
      "published": "20220915T162708",
      "overall_sentiment_score": 0.139815,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.104871,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.626358
    },
    {
      "title": "JP Morgan Chase’s Rhea Marpu: Helping to boost security and diversity",
      "summary": "Rhea Pritham Marpu, Vice President for JPMorgan Chase, plays a critical role in boosting the cybersecurity posture of the largest bank in the U.S., overseeing data protection for over 300,000 internal users within a zero-trust architecture. Beyond her technical contributions, Marpu is dedicated to promoting diversity by leading mentorship programs and representing JPMorgan Chase at women in tech conferences. Her work highlights the blend of technical expertise and human skills essential for robust security and career development in the financial industry.",
      "url": "https://www.scworld.com/feature/jp-morgan-chases-rhea-marpu-helping-to-boost-security-and-diversity",
      "source": "SC Media",
      "published": "20220912T171647",
      "overall_sentiment_score": 0.401942,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.442009,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "JPMorgan Chase buys payments firm Renovite",
      "summary": "JPMorgan Chase has acquired Renovite Technologies, a California-based payments services company, to enhance its merchant card payment processing services and expand globally. The acquisition aims to boost JPMorgan's merchant-acquiring revenue and help it better compete with fintech rivals after a recent leveling off in that segment. This deal continues JPMorgan's strategy of acquiring nonbank entities, particularly those with an overseas or fintech focus, due to regulatory restrictions on acquiring U.S. deposit-taking institutions.",
      "url": "https://www.bankingdive.com/news/jpmorgan-buys-payments-firm-renovite-nonbank-mergers-acquisitions/631637/",
      "source": "Banking Dive",
      "published": "20220912T171647",
      "overall_sentiment_score": 0.080922,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.41168,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Why Japanese Equities Are “The Lone TINA Trade”",
      "summary": "The article argues that Japanese equities represent the \"lone TINA trade\" (There Is No Alternative) as bond yields rise in most other countries, but remain negative in Japan. With a weakening yen and attractive valuations, Japanese stocks offer significant investment potential, particularly for those hedging against currency fluctuations. WisdomTree Japan Hedged Equity Fund (DXJ) is highlighted as a vehicle to capture these opportunities.",
      "url": "https://www.etftrends.com/model-portfolio-channel/why-japanese-equities-are-the-lone-tina-trade/",
      "source": "ETF Trends",
      "published": "20220926T163208",
      "overall_sentiment_score": 0.089403,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.148388,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.627722
    },
    {
      "title": "Shorting Bonds? The Case for a Seldom-Used Tactic",
      "summary": "A new research paper argues that rising interest rates present an ideal opportunity for investors to consider shorting bonds, a seldom-used tactic. Despite historical investor hesitancy, with rates turning around and bond prices falling, 2022 has shown profitability for shorting government bonds. The paper by Kathryn Kaminski of AlphaSimplex suggests that when rates are increasing, shorting bonds can often be profitable and even boasts a generally positive Sharpe ratio.",
      "url": "https://www.ai-cio.com/news/shorting-bonds-the-case-for-a-seldom-used-tactic/",
      "source": "Chief Investment Officer",
      "published": "20220921T181620",
      "overall_sentiment_score": 0.213649,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.101498,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.628302
    },
    {
      "title": "Questioning CEOs of America’s Largest Banks on Efforts to Block Gun Purchases, Legal Commerce",
      "summary": "Senator Kevin Cramer questioned the CEOs of major U.S. banks during a Senate Banking Committee hearing regarding their commitment to processing transactions for legal goods and services, particularly in light of pressures to block gun purchases. Senator Cramer specifically challenged the banks on a new Merchant Category Code for gun and ammunition stores and sought assurances that legal transactions would not be discriminated against. All seven bank CEOs present committed to processing transactions for legal goods and services, including guns and ammunition.",
      "url": "https://www.cramer.senate.gov/news/press-releases/sen-cramer-questions-ceos-of-americas-largest-banks-on-efforts-to-block-gun-purchases-legal-commerce",
      "source": "Senator Kevin Cramer (.gov)",
      "published": "20220922T190610",
      "overall_sentiment_score": 0.059603,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.124179,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.92621
    },
    {
      "title": "Hashdex Launches ’33 Act Bitcoin ETF With DEFI",
      "summary": "Hashdex, a cryptocurrency asset manager, has launched the Hashdex Bitcoin Futures ETF (DEFI), the world's first bitcoin futures ETF registered under the Securities Act of 1933. Developed with Teucrium Trading and Victory Capital Management, DEFI will be available on NYSE Arca from September 16, offering investors regulated exposure to the digital asset class with a different tax treatment than ’40 Act Bitcoin futures ETFs. This launch signifies Hashdex's commitment to providing innovative and regulated products globally, building on its work with the Nasdaq Crypto Index and other crypto offerings.",
      "url": "https://etfdb.com/crypto-channel/hashdex-launches-33-act-bitcoin-etf-with-defi/",
      "source": "ETF Database",
      "published": "20220916T174648",
      "overall_sentiment_score": 0.128754,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.134687,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.601478
    },
    {
      "title": "Powell Says Money Not Important for Inflation",
      "summary": "Federal Reserve Chairman Jerome Powell contends that high inflation is due to the pandemic and that monetary aggregates are no longer important for inflation. Former Bank of England Governor Mervyn King rebutted this view, asserting that \"money matters\" and that central bankers have been wrong to ignore the link between money supply and inflation. The article also includes Adrian Day's comments on Osisko Gold Royalties Ltd.'s recent copper royalty acquisition and lists several gold and silver mining companies as \"Best Buys.\"",
      "url": "https://www.streetwisereports.com/article/2022/09/12/powell-says-money-not-important-for-inflation.html",
      "source": "Streetwise Reports",
      "published": "20220912T175648",
      "overall_sentiment_score": 0.237413,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.071456,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.593213
    },
    {
      "title": "Bank CEOs questioned on consumer protections, social issues",
      "summary": "Bank CEOs faced a second day of questioning on Capitol Hill regarding consumer protections and social issues. Senate Democrats pressed for more consumer safeguards amidst high inflation, while Republicans questioned banks' involvement in social issues. Topics included overdraft fees, Zelle fraud, and banks' stances on abortion costs, gun rights, and environmental policies.",
      "url": "https://www.cbs42.com/news/business/ap-big-bank-ceos-face-2nd-day-of-questioning-from-lawmakers/",
      "source": "CBS 42",
      "published": "20220922T090100",
      "overall_sentiment_score": 0.148103,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.140353,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.90495
    }
  ]
}