{
  "ticker": "JPM",
  "date": "2022-08-15",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T12:07:58.972993",
  "source": "alpha_vantage",
  "article_count": 17,
  "articles": [
    {
      "title": "J.P. Morgan hires trio of private bankers in Chicago",
      "summary": "J.P. Morgan Private Bank has hired a three-person team of private bankers from Citigroup in Chicago. This team previously managed over $2 billion in client assets. The move is part of J.P. Morgan's broader strategy to expand its wealth management operation, with plans to hire more advisors in the Chicago region and nationally.",
      "url": "https://www.investmentnews.com/practice-management/jp-morgan-hires-trio-of-private-bankers-in-chicago/224838",
      "source": "InvestmentNews",
      "published": "20220802T171647",
      "overall_sentiment_score": 0.185878,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.442412,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "5 Minutes With ... Jamie Dimon, chairman and CEO of JPMorgan Chase & Co.",
      "summary": "JPMorgan Chase CEO Jamie Dimon was in Boston to announce plans for Chase Bank to significantly expand its footprint in Massachusetts, aiming to grow from 36 to nearly 90 branches by 2025. This expansion follows Dimon's previous visit to open a new branch in Mattapan and poses a potential long-term threat to current Boston banks.",
      "url": "https://www.bizjournals.com/boston/news/2022/08/04/jamie-dimon-5-minutes-jpmorganchase.html",
      "source": "The Business Journals",
      "published": "20220804T171647",
      "overall_sentiment_score": 0.317066,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.31991,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "JPMorgan Chase Avoided Public Punishment From CFPB Under Trump After Discovery of Alleged Fake Accounts",
      "summary": "JPMorgan Chase (JPM) allegedly avoided public sanctions from the Consumer Financial Protection Bureau (CFPB) during the Trump administration for creating fake accounts, despite the agency identifying serious instances at four banks after the Wells Fargo scandal. The CFPB's enforcement unit investigated Chase for several years but closed the matter in early 2020. This incident highlights a broader trend during the Trump administration where financial institutions like TD Bank (TD) also faced private reprimands instead of public penalties for similar misconduct, drawing criticism from lawmakers like Senator Elizabeth Warren.",
      "url": "https://thecapitolforum.com/jpmorgan-chase-avoided-public-punishment-from-cfpb-under-trump-after-discovery-of-alleged-fake-accounts/",
      "source": "The Capitol Forum",
      "published": "20220810T190611",
      "overall_sentiment_score": -0.108765,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.014665,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.926045
    },
    {
      "title": "J.P. Morgan Asset Management Announces Liquidation of Two Exchange-Traded Funds",
      "summary": "J.P. Morgan Asset Management announced the upcoming liquidation and dissolution of two exchange-traded funds, JPMorgan U.S. Minimum Volatility ETF (JMIN) and JPMorgan U.S. Dividend ETF (JDIV). Shareholders can sell their holdings on NYSE Arca until September 6, 2022, with the liquidation date set for September 14, 2022. Those holding shares after this date will receive a cash distribution equal to the net asset value.",
      "url": "https://www.stocktitan.net/news/JDIV/j-p-morgan-asset-management-announces-liquidation-of-two-exchange-3u76q56o7ybg.html",
      "source": "Stock Titan",
      "published": "20220812T093000",
      "overall_sentiment_score": -0.150673,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": 0.122948,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.727162
    },
    {
      "title": "Groupon lays off hundreds of employees",
      "summary": "Groupon, the Chicago-based e-commerce marketplace, has laid off more than 500 employees, approximately 15% of its workforce, across various departments. This decision comes as the company restructures to focus on \"self-service merchant acquisition capabilities,\" reduce cloud infrastructure, and rationalize its real estate footprint, citing that its overall business performance is not meeting anticipated levels and its cost structure is not aligned with its performance. Groupon joins a growing list of companies including Fender, Robinhood, Apple, Google, Vox Media, 7-Eleven, Meta, JPMorgan Chase & Co., Coinbase, Netflix, and Tesla that have recently announced layoffs or slowing hiring efforts ahead of an anticipated economic downturn.",
      "url": "https://www.hcamag.com/us/specialization/industrial-relations/groupon-lays-off-hundreds-of-employees/416220",
      "source": "HRD America",
      "published": "20220809T165603",
      "overall_sentiment_score": -0.440417,
      "overall_sentiment_label": "Bearish",
      "ticker_sentiment_score": -0.307471,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.690213
    },
    {
      "title": "Morgan Stanley Advisor Uses Sustainable Investing Expertise To Manage $2.5 Billion For Clients",
      "summary": "Katy Zhao, a Senior Vice President at Morgan Stanley Wealth Management, manages $2.5 billion in assets for clients, leveraging her expertise in sustainable investing. She developed Morgan Stanley's first ESG model portfolio and integrates ESG factors into her investment philosophy, an approach popular with her client base. Zhao focuses on direct investments rather than mutual funds or ETFs, positioning client portfolios defensively amidst a deleveraging cycle, and aims to help clients navigate market volatility and avoid social media-driven investment misconceptions.",
      "url": "https://www.forbes.com/sites/jasonbisnoff/2022/08/03/morgan-stanley-advisor-uses-sustainable-investing-expertise-to-manage-25-billion-for-clients/",
      "source": "Forbes",
      "published": "20220803T094500",
      "overall_sentiment_score": 0.167738,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.202119,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.649664
    },
    {
      "title": "Most Influential Women: Emily Nachlas, Western Alliance Bancorporation",
      "summary": "Emily Nachlas, Chief Risk Officer at Western Alliance Bancorporation, has been recognized as one of Arizona's Most Influential Women of 2022 by Az Business and AZRE magazines. The article highlights her extensive experience, her role as a mentor, and her philanthropic efforts in fostering over 50 small dogs. Nachlas also cites Judy Sheindlin (Judge Judy) as a significant source of inspiration.",
      "url": "https://azbigmedia.com/business/most-influential-women-emily-nachlas-western-alliance-bancorporation/",
      "source": "AZ Big Media",
      "published": "20220803T233025",
      "overall_sentiment_score": 0.152763,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.129943,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.642944
    },
    {
      "title": "Breaking: Class Action Lawsuits Filed Against Coinbase As It Reaches Supreme Court",
      "summary": "Three new class action lawsuits have been filed against Coinbase and its executives, accusing the company of making false and misleading statements, failing to disclose bankruptcy risks, and violating securities law. These lawsuits follow Coinbase's move to the Supreme Court to settle two previous class actions related to scam and Dogecoin sweepstakes. The new litigation alleges Coinbase failed to communicate regulatory scrutiny and that its shares dropped due to these issues, even as CEO Brian Armstrong apologized for late disclosure.",
      "url": "https://coingape.com/breaking-class-action-lawsuits-filed-against-coinbase-as-it-reaches-supreme-court/",
      "source": "CoinGape",
      "published": "20220805T162645",
      "overall_sentiment_score": 0.02951,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.10848,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.637154
    },
    {
      "title": "Faulty Equifax Credit Score Reporting Prevents Consumers From Getting Auto Loans, Mortgages and Credit Cards",
      "summary": "Equifax erroneously reported faulty credit scores to millions of American consumers between mid-March and April, affecting applications for auto loans, mortgages, and credit cards. The errors, some as significant as 20 points, led to some consumers being rejected or receiving incorrect interest rates. Equifax attributed the issue to a coding error, stating it has been fixed, and that only a small number of consumers may have been negatively impacted.",
      "url": "https://finance.yahoo.com/news/faulty-equifax-credit-score-reporting-124615629.html",
      "source": "Yahoo Finance",
      "published": "20220803T163627",
      "overall_sentiment_score": -0.177542,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.115931,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.633606
    },
    {
      "title": "Wells Fargo plans retreat from mortgage business",
      "summary": "Wells Fargo & Co. is planning to significantly reduce its mortgage business after years of regulatory scrutinized and changes in leadership. The bank, which once held a dominant share of the U.S. home loan market, aims to focus on lending to existing customers and scale back operations like correspondent mortgage lending and third-party servicing. This strategic shift reflects a broader industry trend among large banks to moderate their mortgage exposure following the 2008 financial crisis and ongoing regulatory challenges.",
      "url": "https://www.investmentnews.com/wirehouses/wells-fargo-plans-retreat-from-mortgage-business/225378",
      "source": "InvestmentNews",
      "published": "20220815T191619",
      "overall_sentiment_score": -0.104355,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.124815,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.629285
    },
    {
      "title": "Staten Island’s Best Dressed: 2022 SIEDC Annual Awards Gala at Angelina’s Ristorante",
      "summary": "The 2022 SIEDC Annual Awards Gala, themed \"Off to the Races,\" celebrated community and business leaders on Staten Island. Honorees included Diane Arneth, Carol Decina, Joseph Ferrara, Gina Laine, and Dr. Joanne Gerenser, with awards for \"Best Dressed\" attendees. The event, presented by Northfield Bank, featured entertainment, a silent auction, and horse racing games.",
      "url": "https://www.silive.com/gracelyn/2022/08/staten-islands-best-dressed-2022-siedc-annual-awards-gala-at-angelinas-ristorante.html",
      "source": "SILive.com",
      "published": "20220810T105900",
      "overall_sentiment_score": 0.262053,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.24166,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.624534
    },
    {
      "title": "Watkins Advises on Global Blood Therapeutics’ US$5.4 Billion Sale to Pfizer",
      "summary": "Latham & Watkins LLP advised J.P. Morgan Securities LLC and Centerview Partners LLC, financial advisors to Global Blood Therapeutics (GBT), on its US$5.4 billion sale to Pfizer Inc. The acquisition aims to enhance Pfizer's rare hematology offerings and reinforce its commitment to addressing critical needs in the underserved sickle cell disease community with GBT's pipeline.",
      "url": "https://www.lw.com/en/news/2022/08/latham-watkins-advises-on-global-blood-therapeutics-billion-sale-to-pfizer",
      "source": "Latham & Watkins LLP",
      "published": "20220808T180644",
      "overall_sentiment_score": 0.355193,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.306725,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.624243
    },
    {
      "title": "Has Inflation Peaked? Here's What the Experts Are Saying",
      "summary": "Inflation decelerated more than expected in July, leading to a split among economists and market strategists on whether this marks a peak in inflation and how it will impact Federal Reserve policy. While some see the report as positive evidence for a softer landing and less aggressive rate hikes, others emphasize the need for sustained slowdowns before the Fed becomes confident in controlling price pressures.",
      "url": "https://www.kiplinger.com/personal-finance/inflation/605064/has-inflation-peaked-heres-what-the-experts-are-saying",
      "source": "Kiplinger",
      "published": "20220810T171614",
      "overall_sentiment_score": 0.205977,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.249953,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.621446
    },
    {
      "title": "Disney class action alleges Visa, Mastercard charge high transaction fees",
      "summary": "The Walt Disney Co. has filed a class action lawsuit against Visa and Mastercard, alleging that the payment companies colluded to force merchants to pay excessively high transaction fees for over a decade, violating antitrust laws. Disney claims these \"interchange fees\" are supracompetitive and seeks damages, fees, and costs, arguing that more competition between card-issuers would benefit both merchants and consumers. This action follows Disney's decision to opt out of a previous $6 billion multidistrict litigation settlement with Visa and Mastercard regarding similar fee-fixing allegations.",
      "url": "https://topclassactions.com/lawsuit-settlements/money/fees/disney-class-action-alleges-visa-mastercard-charge-high-transaction-fees/",
      "source": "Class Action Lawsuits",
      "published": "20220803T173615",
      "overall_sentiment_score": -0.229741,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.144722,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.608707
    },
    {
      "title": "PNC Drops Another Type of Fee After Overhauling Overdraft Policy",
      "summary": "PNC Financial Services Group Inc. has eliminated non-sufficient fund (NSF) fees, joining other large banks in removing charges that have drawn criticism from politicians and consumer advocates. These fees were previously charged when a transaction was returned due to insufficient funds in a customer's account. PNC had already removed NSF fees from its Virtual Wallet Spend feature and is now extending this policy to other personal checking-account options.",
      "url": "https://www.bloomberg.com/news/articles/2022-08-11/pnc-ditches-non-sufficient-fund-fees-in-latest-charge-overhaul",
      "source": "Bloomberg.com",
      "published": "20220811T161400",
      "overall_sentiment_score": 0.336044,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.342632,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.608465
    },
    {
      "title": "Principal Financial’s benefits business jumps while AUM slumps in 2Q",
      "summary": "Principal Financial Group saw a strong performance in its employee benefits business in the second quarter, driven by growth in the small- and medium-sized business market, with premium and fees increasing by 11%. This growth partially offset a 9% decline in overall earnings to $423 million year-over-year, largely due to volatile markets, high inflation, and a slump in assets under management following the sale of its U.S. retail fixed annuity and universal life businesses. The company also returned $1.3 billion of capital to shareholders.",
      "url": "https://insurancenewsnet.com/innarticle/principal-financials-benefits-business-jumps-while-aum-slumps-in-2q",
      "source": "InsuranceNewsNet",
      "published": "20220809T180647",
      "overall_sentiment_score": 0.143495,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.130731,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.576985
    },
    {
      "title": "Ron Kruszewski, Chairman and CEO of Stifel Financial Corp.",
      "summary": "This article provides a profile of Ron Kruszewski, the Chairman and CEO of Stifel Financial Corp. It details his extensive career at Stifel since 1997, his leadership roles in prominent financial industry associations like the American Securities Association and SIFMA, and his involvement in various community and philanthropic organizations. The piece also highlights his recognition with the Horatio Alger Award and his membership in The Wall Street Journal’s CEO Council.",
      "url": "https://www.advisorhub.com/resources/advisorhub-industry-in-transition-speaker-ron-kruszewski-chairman-and-ceo-of-stifel-financial-corp/",
      "source": "AdvisorHub",
      "published": "20220801T183608",
      "overall_sentiment_score": 0.171928,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.023082,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.55143
    }
  ]
}