{
  "ticker": "JPM",
  "date": "2022-07-25",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T12:07:44.820607",
  "source": "alpha_vantage",
  "article_count": 13,
  "articles": [
    {
      "title": "Finexio Raises $14 Million in Initial Close of Series B, Company Valued at $100 Million",
      "summary": "Finexio announced the initial close of its $30 million Series B funding round, raising $14 million at a pre-money valuation of $100 million. This round was co-led by Mendon Venture Partners and National Bank Holdings Corporation (NYSE: NBHC), with additional participation from Discover Financial Services (NYSE: DFS) and other investors. The funding will accelerate the adoption of Finexio's \"B2B Payments-as-a-Service platform,\" foster team growth, and advance product development.",
      "url": "https://www.newswire.com/news/finexio-raises-14-million-in-initial-close-of-series-b-company-valued-21773658",
      "source": "Newswire.com",
      "published": "20220725T174646",
      "overall_sentiment_score": 0.325708,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.252239,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.572393
    },
    {
      "title": "MasTec Acquires IEA for Wind, Solar Energy Infrastructure Expertise",
      "summary": "MasTec has entered into a definitive agreement to acquire Infrastructure and Energy Alternatives Inc. (IEA) in a cash-and-stock transaction valued at $14 per IEA share, totaling approximately $1.1 billion. This acquisition aims to expand MasTec's service capabilities in renewable energy infrastructure, particularly wind and solar projects, and is expected to close in late Q4 2022. The deal combines IEA's expertise in utility-scale wind and solar projects with MasTec's existing infrastructure services, anticipating increased scale and capacity to meet growing demand for renewable power generation.",
      "url": "https://nawindpower.com/mastec-acquires-iea-for-wind-solar-energy-infrastructure-expertise",
      "source": "North American Windpower",
      "published": "20220725T174630",
      "overall_sentiment_score": 0.310207,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.219302,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.628767
    },
    {
      "title": "Bank of Montreal Taps North Texas for its Newest Tech Hub",
      "summary": "The Bank of Montreal (BMO) is establishing a new tech hub in North Texas, planning to hire 50 new employees to add to its existing 250-person DFW workforce. This move is part of BMO's strategy to expand its U.S. operations and follows similar investments by other major banks like JPMorgan Chase, Bank of America, and PNC Bank in the Dallas-Fort Worth region. The Irving tech hub will be BMO's first outside of Toronto and Chicago, focusing on areas like cybersecurity and engineering.",
      "url": "https://dallasinnovates.com/bank-of-montreal-taps-north-texas-for-its-newest-tech-hub/",
      "source": "Dallas Innovates",
      "published": "20220725T161620",
      "overall_sentiment_score": 0.250678,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.343112,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.60244
    },
    {
      "title": "State Street Corp. stock underperforms Wednesday when compared to competitors",
      "summary": "State Street Corp. (STT) stock underperformed on Wednesday, July 20, 2022, falling 0.53% to $66.97, despite a generally positive trading session for the broader market. The stock closed significantly below its 52-week high and lagged behind some of its key competitors like JPMorgan Chase & Co., Bank of America Corp., and Citigroup Inc. Trading volume for State Street Corp. was also below its 50-day average.",
      "url": "https://www.marketwatch.com/story/state-street-corp-stock-underperforms-wednesday-when-compared-to-competitors-01658352113-100c63edb971?gaa_at=eafs&gaa_n=AWEtsqe2NWfoY0EIPrnWZjOP811dyrwTWr93keYDg8vi-sVu8SERp7jqFDFr&gaa_ts=6907aa35&gaa_sig=QQmrVvgTTcb2zzPUcGLmwtOUNjr5_yTV9PzubXJsCJ4thiw8dnFS4tjzjKthHA4EmFIsGPXGQLWC-fq0dA4a3Q%3D%3D",
      "source": "MarketWatch",
      "published": "20220720T172100",
      "overall_sentiment_score": -0.076992,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.184963,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.618467
    },
    {
      "title": "Jefferies to spin off Vitesse Energy, merge companies and sell unit to focus on core banking business",
      "summary": "Jefferies Financial Group Inc. announced plans to spin off its Vitesse Energy LLC holdings to shareholders by the end of the year, aiming to list Vitesse Energy on the New York Stock Exchange. This move is part of an effort to reduce its merchant bank holdings and concentrate on its core investment banking and capital markets units. Additionally, Jefferies will book a $140 million gain from the sale of Idaho Timber, merge Jefferies Group LLC into Jefferies Financial Group Inc., and implement changes in its CFO leadership in 2023.",
      "url": "http://www.marketwatch.com/story/jefferies-to-spin-off-vitesse-energy-merge-companies-and-sell-unit-to-focus-on-core-banking-business-2022-07-19?gaa_at=eafs&gaa_n=AWEtsqf06qGzvgGLQfHEUtUseJDv4CMoT5jIUTOSGT646W_KnuhJMl4FPTOp&gaa_ts=6907aef0&gaa_sig=CaGcmTRBwerZrkllwZa1KxJ0iwfk2XJnTqRJAZCV_tFhN_Q5MMy8JaWnmDskH61WPKdnoUiEBLCQnVsh15Ny0A%3D%3D",
      "source": "MarketWatch",
      "published": "20220719T070500",
      "overall_sentiment_score": 0.193916,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.22849,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.717732
    },
    {
      "title": "FIRST HORIZON LAUNCHES SOUTH FLORIDA PRIVATE WEALTH GROUP WITH OFFICES IN CORAL GABLES AND DOWNTOWN MIAMI",
      "summary": "First Horizon Corporation announced the formation of the First Horizon Advisors South Florida Private Wealth Group, catering to high net worth clients. Headquartered in Coral Gables with satellite offices in South Miami and Downtown Miami, the group is led by Damian Pardo, Oui Coulson, and Siby Vizoso, focusing on comprehensive financial planning and community involvement.",
      "url": "https://communitynewspapers.com/coral-gables-news/first-horizon-launches-south-florida-private-wealth-group-with-offices-in-coral-gables-and-downtown-miami/",
      "source": "Miami's Community News",
      "published": "20220711T164150",
      "overall_sentiment_score": 0.294196,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.115498,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.624308
    },
    {
      "title": "JPMorgan adds former J&J chief Gorsky to board",
      "summary": "JPMorgan Chase & Co has elected Alex Gorsky, the former chief executive officer of Johnson & Johnson, as a director of the bank. Gorsky, who is currently an executive chairman at J&J, previously led the development of J&J's COVID-19 vaccine and steered the company through significant crises. His appointment to JPMorgan's board is effective immediately.",
      "url": "https://www.reuters.com/business/finance/jpmorgan-adds-former-jj-chief-gorsky-board-2022-07-19/",
      "source": "Reuters",
      "published": "20220719T204100",
      "overall_sentiment_score": 0.191525,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.333834,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "JPMorgan Chase CEO Jamie Dimon on potential recession, the business climate and more",
      "summary": "JPMorgan Chase & Co. CEO Jamie Dimon stated the company is not planning drastic pullbacks despite economic turbulence. He noted that customers are generally in a better financial position now compared to previous recessions.",
      "url": "https://www.bizjournals.com/bizjournals/news/2022/07/15/jpmorgan-chase-co-ceo-jamie-dimon.html",
      "source": "The Business Journals",
      "published": "20220715T214100",
      "overall_sentiment_score": 0.121495,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.102232,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 1.0
    },
    {
      "title": "Morgan Stanley fined $200 million for WhatsApp use",
      "summary": "Morgan Stanley has been fined $200 million for inadequately recording communications made on unapproved personal devices like WhatsApp, mirroring a similar fine against JPMorgan. This highlights the ongoing struggle for financial institutions and even governments to ensure compliance and proper record-keeping as employees use convenient messaging apps for work. The article also touches on a UK High Court ruling that found the use of WhatsApp by government ministers to be legal despite concerns over transparency and record-keeping.",
      "url": "https://www.thestack.technology/morgan-stanley-fined-for-whatsapp-use/",
      "source": "The Stack",
      "published": "20220715T174612",
      "overall_sentiment_score": -0.382448,
      "overall_sentiment_label": "Bearish",
      "ticker_sentiment_score": -0.349548,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.71105
    },
    {
      "title": "Mortgages are in free fall at JPMorgan Chase",
      "summary": "JPMorgan Chase reported significant declines in mortgage originations, margins, and revenues for the second quarter of 2022, primarily due to higher mortgage rates stemming from the Federal Reserve's tightening monetary policy. The bank's origination volume fell to $21.9 billion, an 11% decline quarter-over-quarter and 45% year-over-year, with the retail channel experiencing the sharpest decrease. Despite a cautious outlook on a potential recession, CEO Jamie Dimon noted that consumers are in a relatively strong financial position compared to previous economic downturns.",
      "url": "https://www.housingwire.com/articles/opening-2q-earnings-season-jpmorgan-reports-mortgages-in-free-fall/",
      "source": "HousingWire",
      "published": "20220714T121200",
      "overall_sentiment_score": -0.4037,
      "overall_sentiment_label": "Bearish",
      "ticker_sentiment_score": -0.410956,
      "ticker_sentiment_label": "Bearish",
      "relevance_score": 1.0
    },
    {
      "title": "Equities Ownership: Concentration on the Rise?",
      "summary": "The article analyzes the increasing concentration of equities ownership, showing that controlled companies constitute nearly 46% of MSCI ACWI Index constituents, a 44% rise since 2015. It highlights the growing influence of \"universal managers\" like BlackRock and Vanguard, which hold significant stakes in numerous companies, and discusses the implications for corporate governance and shareholder engagement. While seemingly indicating concentration, the article suggests this could also reflect a new way of managing widely dispersed ownership if these managers enable clients to exercise shareholder rights effectively.",
      "url": "https://www.msci.com/research-and-insights/blog-post/equities-ownership-concentration-on-the-rise",
      "source": "MSCI",
      "published": "20220711T174615",
      "overall_sentiment_score": 0.114515,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.134319,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.622927
    },
    {
      "title": "Why Invest in CLOs?",
      "summary": "The article highlights Collateralized Loan Obligations (CLOs) as a compelling investment due to their historical combination of above-average yield, strong risk profiles, and potential for appreciation. It details how CLOs have demonstrated strong risk-adjusted returns compared to other corporate debt categories, particularly through economic crises, and offer lower sensitivity to interest rate changes. The piece also introduces the VanEck CLO ETF (CLOI) as an efficient way for investors to access the largely institutional CLO market.",
      "url": "https://www.etftrends.com/tactical-allocation-channel/why-invest-in-clos/",
      "source": "ETF Trends",
      "published": "20220717T162618",
      "overall_sentiment_score": 0.286678,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.316387,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.621353
    },
    {
      "title": "BNY Mellon Wealth Management Named Rob Zaccardi Senior Client Strategist in Boston",
      "summary": "BNY Mellon Wealth Management has appointed Rob Zaccardi as Senior Client Strategist in Boston. He will work with ultra-high-net-worth families, business owners, corporate executives, and foundations/endowments on their comprehensive wealth needs. Zaccardi brings over 12 years of financial services experience, previously serving as executive director at JP Morgan Private Bank.",
      "url": "https://www.prnewswire.com/news-releases/bny-mellon-wealth-management-named-rob-zaccardi-senior-client-strategist-in-boston-301590845.html",
      "source": "PR Newswire",
      "published": "20220721T083000",
      "overall_sentiment_score": 0.281098,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.121951,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.642516
    }
  ]
}