{
  "ticker": "JPM",
  "date": "2022-11-07",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T12:08:55.510416",
  "source": "alpha_vantage",
  "article_count": 18,
  "articles": [
    {
      "title": "Goldman launches digital asset classification system",
      "summary": "Goldman Sachs has launched Datonomy, a new digital asset classification system developed with MSCI and Coin Metrics, to provide institutional investors with a standardized way to analyze the crypto ecosystem. This subscription-based tool aims to bring transparency to the market by classifying digital assets based on investor usage and helping with portfolio performance review and risk management. This move signifies Goldman's continued strategic re-engagement with digital assets after previously halting and then relaunching its crypto trading desk.",
      "url": "https://www.bankingdive.com/news/goldman-launches-digital-asset-classification-system/635823/",
      "source": "Banking Dive",
      "published": "20221104T165608",
      "overall_sentiment_score": 0.296561,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.237779,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.636566
    },
    {
      "title": "Atlanticus Launches Aspire® Banking Platform, New Debit",
      "summary": "Atlanticus Holdings Corporation launched the Aspire® Banking platform, a new debit product designed to provide a clear path to credit for the financially underserved. This program offers a bank account and debit card with no minimums or nuisance fees, and upon completing specific activities in as little as 90 days, customers are presented with an Aspire® Credit Card offer. The initiative aims to help the nearly 44 million unbanked or underbanked Americans establish positive financial habits and access credit.",
      "url": "https://www.globenewswire.com/news-release/2022/11/03/2548456/0/en/Atlanticus-Launches-Aspire-Banking-Platform-New-Debit-Product-with-Path-to-Credit-for-the-Financially-Underserved-Amended-Link.html",
      "source": "GlobeNewswire",
      "published": "20221103T192800",
      "overall_sentiment_score": 0.218893,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.101017,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.526709
    },
    {
      "title": "Voya Financial acquires benefits administration company",
      "summary": "Voya Financial Inc. announced its acquisition of Benefitfocus Inc., a cloud-based benefits administration company, for approximately $570 million. This acquisition will expand Voya's services to roughly 38 million individuals and accelerate its workplace-centered strategy, enhancing its ability to provide comprehensive benefits and savings solutions. Benefitfocus is expected to continue as a distinct business with its existing management team.",
      "url": "https://www.investmentnews.com/retirement-planning/voya-financial-acquires-benefits-administration-company/228749",
      "source": "InvestmentNews",
      "published": "20221103T190653",
      "overall_sentiment_score": 0.256882,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.108758,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.587826
    },
    {
      "title": "LPL buying one of its own giant branches",
      "summary": "LPL Financial Holdings Inc. is acquiring Financial Resources Group Investment Services, one of its largest branch offices, for a base price of $140 million. This acquisition brings new management capabilities to banks and credit unions, according to LPL, and addresses Financial Resources Group's needs for capital and a succession plan. The deal highlights a trend of large broker-dealers actively participating in the mergers and acquisitions market for wealth management firms.",
      "url": "https://www.investmentnews.com/independent-broker-dealers/lpl-buying-one-of-its-own-giant-branches/228737",
      "source": "InvestmentNews",
      "published": "20221103T173548",
      "overall_sentiment_score": 0.263626,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.118515,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.572
    },
    {
      "title": "Goldman Sachs seeks to impose order on expanding crypto universe with classification system",
      "summary": "Goldman Sachs, in partnership with MSCI and Coin Metrics, is launching \"Datonomy,\" a data service to classify hundreds of digital coins and tokens for institutional investors. This system aims to standardize how the financial industry understands and invests in digital assets, providing a framework for performance tracking, risk management, and product creation in the crypto space. Datonomy will allow for more granular analysis of digital assets, similar to sector analysis in traditional equities.",
      "url": "https://www.cnbc.com/2022/11/03/goldman-sachs-unveils-crypto-classification-system-aimed-at-institutional-investors.html",
      "source": "CNBC",
      "published": "20221103T093800",
      "overall_sentiment_score": 0.246825,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.134574,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.645984
    },
    {
      "title": "CLIENT FIRST TAX & WEALTH ADVISORS ANNOUNCES NEW ADAPTIV™ SELECT ETF (TICKER: ADPV); A PROPRIETARY ACTIVELY MANAGED, LARGE CAP STOCK SELECTION ETF",
      "summary": "Client First Tax & Wealth Advisors has announced the Adaptiv™ Select ETF (ADPV), an actively managed, large-cap stock selection exchange-traded fund. This ETF aims to identify and own the top 25 U.S. Large Cap stocks in an uptrend, shifting to cash and short-term Treasury Bills during downtrends. The fund leverages proprietary rules-based calculations and weekly reconstitutions to manage risk and pursue returns.",
      "url": "https://www.prnewswire.com/news-releases/client-first-tax--wealth-advisors-announces-new-adaptiv-select-etf-ticker-adpv-a-proprietary-actively-managed-large-cap-stock-selection-etf-301666650.html",
      "source": "PR Newswire",
      "published": "20221102T142100",
      "overall_sentiment_score": 0.342911,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.284937,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.631694
    },
    {
      "title": "JPMorgan Chase launches Story",
      "summary": "JPMorgan Chase & Co. has launched Story, a new multifamily rental management platform for property owners. The platform is currently being piloted with Chase customers and offered free for 12 months, allowing users to create leases and invoices, and collect rent payments online. Landlords not currently Chase customers will be able to sign up when it's released more broadly next year.",
      "url": "https://coverager.com/jpmorgan-chase-launches-story/",
      "source": "Coverager",
      "published": "20221031T171647",
      "overall_sentiment_score": 0.436509,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.438063,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "J.P. Morgan San Diego Grows, Overcomes Economic Pressures",
      "summary": "J.P. Morgan San Diego has consolidated its multiple business lines into a single corporate office at One Paseo, leading to significant growth in headcount and revenue despite economic headwinds. The firm attributes its success to specialized teams focusing on key San Diego industries, strong client communication, and the region's appeal for talent. They emphasize personalized advice and collaboration to help clients navigate economic challenges and seize opportunities.",
      "url": "https://www.sdbj.com/finance/banks/j-p-morgan-san-diego-grows-overcomes-economic-pressures/",
      "source": "San Diego Business Journal",
      "published": "20221025T171648",
      "overall_sentiment_score": 0.483942,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.46164,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Amtrak and First National Bank of Omaha Launch Two New Amtrak Guest Rewards Mastercards",
      "summary": "Amtrak and First National Bank of Omaha (FNBO) have launched two new Amtrak Guest Rewards Mastercard Credit Cards. These co-branded cards offer enhanced benefits and rewards for Amtrak loyalty program members, allowing them to earn points for travel, upgrades, dining, and more. The new offerings include a Preferred Mastercard with an annual fee and a standard Mastercard with no annual fee, both designed to improve the customer travel experience.",
      "url": "https://media.amtrak.com/2022/10/amtrak-and-first-national-bank-of-omaha-launch-two-new-amtrak-guest-rewards-mastercards/",
      "source": "Amtrak Media",
      "published": "20221031T173615",
      "overall_sentiment_score": 0.318059,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.230766,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.578948
    },
    {
      "title": "Follow the Money: ParkHub Acquires Parking Software Startup, UpSmith Raises $3.3M, Maverick Bancshares Seeks $17M for new Fort Worth Bank, and More",
      "summary": "This article details various financial activities and developments in North Texas, including ParkHub's acquisition of Smarking, UpSmith's $3.3 million pre-seed funding round to address the skilled worker shortage, and Maverick Bancshares' bid to raise $17 million for a new bank in Fort Worth. It also covers significant investments, acquisitions, and funding rounds for companies like Taysha Gene Therapies, RumbleOn, MAX, Zirtue, 4 Impact Data, NaturalShrimp, Crescent Real Estate, Dallas Venture Capital, Acqueon, Tyler Technologies, Integrity Marketing Group, and Centurion American Development Group.",
      "url": "https://dallasinnovates.com/follow-the-money-parkhub-acquires-parking-software-startup-upsmith-raises-3-3m-to-combat-skilled-worker-shortage-maverick-bancshares-looks-to-raise-17m-for-new-fort-worth-bank-and-more/",
      "source": "Dallas Innovates",
      "published": "20221028T185740",
      "overall_sentiment_score": 0.245248,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.262714,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.647169
    },
    {
      "title": "How SMBC Group became a leader in transformation and digital perseverance",
      "summary": "SMBC Group, one of Japan's largest banks, is undergoing a significant digital transformation by partnering with Microsoft as its strategic cloud provider. This collaboration aims to modernize IT infrastructure, develop innovative products like Embedded Finance and digital supply chain solutions, and support customers in achieving their sustainability goals. The article highlights how SMBC's approach to digital transformation also involves a cultural shift, emphasizing talent empowerment and a customer-first mindset, positioning them for \"digital perseverance\" in a changing industry.",
      "url": "https://news.microsoft.com/apac/2022/10/28/how-smbc-group-became-a-leader-in-transformation-and-digital-perseverance/",
      "source": "Microsoft Source",
      "published": "20221028T174617",
      "overall_sentiment_score": 0.362504,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.323368,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.612869
    },
    {
      "title": "JPMorgan Chase merchants can now receive payments through Meta Pay",
      "summary": "JPMorgan Chase & Co's merchants can now accept payments via Meta Pay, offering customers a new secure online payment option. This integration allows users to utilize Meta Pay across Meta's platforms, like WhatsApp and Instagram, for online purchases. Meta Pay, formerly Facebook Pay, was launched in 2019 to unify payment services within Meta's ecosystem.",
      "url": "https://www.reuters.com/technology/jpmorgan-chase-merchants-can-now-receive-payments-through-meta-pay-2022-10-25/",
      "source": "Reuters",
      "published": "20221025T183200",
      "overall_sentiment_score": 0.301513,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.348661,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Banking in 2022: Digital-first or dead last",
      "summary": "This article describes a webinar from Comscore discussing the rapid changes in the banking industry, emphasizing the need for banks to adapt to digital and social platforms to reach evolving consumer audiences. The webinar highlights the growth of online banking and neobanks, and provides insights into consumer engagement, market competition, and strategies for success in the digital banking landscape.",
      "url": "https://www.comscore.com/esl/Prensa-y-Eventos/Eventos-y-webinars/Webinar/2022/Banking-in-2022-Digital-first-or-dead-last",
      "source": "Comscore",
      "published": "20221025T110000",
      "overall_sentiment_score": 0.13321,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.144926,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.642945
    },
    {
      "title": "Women of Influence honoree: Thelma Ferguson, JPMorgan Chase & Co.",
      "summary": "Thelma Ferguson, vice chair of commercial banking at JPMorgan Chase & Co., has been honored as a Woman of Influence. This article previews an interview with Ferguson, where she discusses offering advice to women in corporate leadership and the importance of supporting small businesses.",
      "url": "https://www.bizjournals.com/newyork/news/2022/11/01/women-of-influence-thelma-ferguson-jpmorgan-chase.html",
      "source": "The Business Journals",
      "published": "20221101T171648",
      "overall_sentiment_score": 0.318722,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.300603,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Why bonds may beat stocks in coming months, after ‘safe’ and ‘risky’ assets broadly moved in same direction in 2022, says Capital Economics",
      "summary": "Capital Economics predicts that bonds may outperform stocks in the coming months, diverging from their similar performance in 2022. This shift is attributed to increasing recession concerns and the belief that long-dated government bond yields have peaked and will decline further as inflation eases. John Higgins, chief markets economist at Capital Economics, suggests that while bond yields have peaked, risky assets may face more challenges until mid-next year.",
      "url": "https://www.marketwatch.com/story/why-bonds-may-beat-stocks-in-coming-months-after-safe-and-risky-assets-broadly-moved-in-same-direction-in-2022-says-capital-economics-11667328629?gaa_at=eafs&gaa_n=AWEtsqdxDQF2PMzxjPmJrC4bOFO6WHryh-IerB6It6ADnOTHWkcn-vxMTnf5&gaa_ts=6907ac77&gaa_sig=5fH2te4kA9cU9QzgWCqsc7PzP44ATAi5bCluphMrM4EBFuwxC-q-0Fx3QBVxmSEFOqtUKj2o9PxoGGdSWwHI9w%3D%3D",
      "source": "MarketWatch",
      "published": "20221101T145000",
      "overall_sentiment_score": 0.074193,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.118845,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.607212
    },
    {
      "title": "JPMorgan Chase teams with Vera Whole Health to open primary care clinics for employees",
      "summary": "JPMorgan Chase is launching primary care clinics for its employees in the Columbus, Ohio area, partnering with Vera Whole Health and Central Ohio Primary Care. This initiative will offer comprehensive in-person and virtual health services to over 20,000 employees and their families, with Morgan Health, JPMorgan Chase's healthcare arm, playing a key role. The move aims to provide high-quality and integrated healthcare, building on Morgan Health's prior investment in Vera Whole Health.",
      "url": "https://www.fiercehealthcare.com/providers/jpmorgan-chase-teams-vera-whole-health-open-primary-care-clinics-employees",
      "source": "Fierce Healthcare",
      "published": "20221025T112300",
      "overall_sentiment_score": 0.201197,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.425602,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Apple Moves iPhone 14 Production to India",
      "summary": "Apple announced it will begin manufacturing its latest iPhone 14 models in India, marking a significant step in the company's efforts to diversify production away from China. This move aligns with India's push for local manufacturing and is expected to boost India's smartphone market. Investors can capitalize on India's digital growth through ETFs like the EMQQ Global’s India Internet and Ecommerce ETF (INQQ).",
      "url": "https://www.etftrends.com/emerging-markets-channel/apple-moves-iphone-14-manufacturing-to-india/",
      "source": "ETF Trends",
      "published": "20221024T170657",
      "overall_sentiment_score": 0.280385,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.143742,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.641871
    },
    {
      "title": "Leaders in Trading 2022: Meet the nominees for… Outstanding Alternative Liquidity Provider",
      "summary": "The article announces the shortlisted nominees for the 2022 Editors’ Choice Outstanding Alternative Liquidity Provider Award: Citadel Securities, Flow Traders, Hudson River Trading, Jane Street, and XTX Markets. It then provides detailed overviews of each firm's activities, market presence, strategic investments, and contributions to liquidity provision across various asset classes, including their engagement in digital assets and DeFi.",
      "url": "https://www.thetradenews.com/leaders-in-trading-2022-meet-the-nominees-for-outstanding-alternative-liquidity-provider/",
      "source": "The TRADE",
      "published": "20221031T125600",
      "overall_sentiment_score": 0.108772,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.278695,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.604794
    }
  ]
}