{
  "ticker": "JPM",
  "date": "2022-03-21",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T12:06:19.937062",
  "source": "alpha_vantage",
  "article_count": 19,
  "articles": [
    {
      "title": "J.P. Morgan agrees to acquire Global Shares, a leading provider of share plan management software",
      "summary": "J.P. Morgan announced an agreement to acquire Global Shares, a cloud-based provider of share plan management software, to bolster its services for corporate clients and expand wealth management client acquisition. The acquisition, which is subject to regulatory approvals and expected to close in the second half of 2022, will integrate Global Shares into J.P. Morgan's Asset & Wealth Management business. Global Shares will retain its headquarters in Cork, Ireland, and continue its growth trajectory with J.P. Morgan's support.",
      "url": "https://www.jpmorganchase.com/newsroom/press-releases/2022/JP-morgan-agrees-to-acquire-global-shares",
      "source": "JPMorganChase",
      "published": "20220315T171646",
      "overall_sentiment_score": 0.432773,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.440081,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "JPMorgan joins Goldman Sachs in pulling back from Russia",
      "summary": "JPMorgan Chase & Co. and Goldman Sachs Group Inc. are pulling back from Russia in response to the country’s invasion of Ukraine, joining other major companies in halting business operations. JPMorgan specifies its activities are limited to helping clients and managing risk, while Goldman Sachs plans to close operations and has minimal exposure to Russia. This move further isolates Russia economically as other financial and consumer companies also restrict their presence.",
      "url": "https://www.aljazeera.com/economy/2022/3/10/jpmorgan-joins-goldman-sachs-in-pulling-back-from-russia",
      "source": "Al Jazeera",
      "published": "20220310T165606",
      "overall_sentiment_score": -0.106563,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.105938,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.977777
    },
    {
      "title": "JP Morgan AM to merge global emerging market index fund with ESG ETF",
      "summary": "JP Morgan Asset Management (JPMAM) is merging its $47m Global Emerging Markets Research Enhanced Index Equity fund with the $686m JP Morgan Global Emerging Markets Research Enhanced Index Equity ESG UCITS ETF (JREM), effective May 20. This merger aims to benefit shareholders by combining into a larger ETF with lower total expenses, reducing ongoing charges from 0.40% to 0.30% for investors. JREM is an actively managed ESG ETF that seeks to outperform the MSCI Emerging Market index and is classified as Article 8 under SFDR.",
      "url": "https://www.etfstream.com/articles/jp-morgan-am-to-merge-global-emerging-market-index-fund-with-esg-etf",
      "source": "ETF Stream",
      "published": "20220310T163636",
      "overall_sentiment_score": 0.148608,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.255101,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.963868
    },
    {
      "title": "Goldman Sachs becomes first Wall St. firm to exit Russia",
      "summary": "Goldman Sachs has become the first Wall Street firm to suspend its operations in Russia following the country's invasion of Ukraine, winding down its business in compliance with regulatory requirements. JPMorgan Chase is also actively unwinding its Russian business, while other financial giants like Citigroup, Credit Suisse, and BlackRock have disclosed their exposure and are taking steps to limit their involvement. Several financial service companies, including Visa, Mastercard, American Express, and PayPal, have also suspended operations in Russia.",
      "url": "https://www.foxbusiness.com/markets/goldman-sachs-first-wall-st-firm-to-exit-russia",
      "source": "Fox Business",
      "published": "20220310T105000",
      "overall_sentiment_score": -0.102116,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.075443,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.81057
    },
    {
      "title": "Rivian is sued for allegedly misleading investors about electric vehicle prices",
      "summary": "Rivian Automotive Inc is facing a class-action lawsuit from a shareholder who claims the company misled investors by initially underpricing its electric vehicles, leading to unpopular price hikes that were later rolled back. The lawsuit alleges Rivian concealed that its R1S SUV and R1T pickup trucks were so underpriced they would require rapid price increases after its November IPO, damaging the company's reputation and risking pre-order cancellations. The plaintiff, Charles Larry Crews, cites the swift rollback of price increases and an apology from CEO R.J. Scaringe as \"futile attempts at damage control.\"",
      "url": "https://www.reuters.com/legal/transactional/rivian-is-sued-by-shareholder-after-rolling-back-electric-vehicle-price-hikes-2022-03-08/",
      "source": "Reuters",
      "published": "20220308T202200",
      "overall_sentiment_score": -0.220167,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.248323,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.736036
    },
    {
      "title": "Commodity ETFs Could Be Overbought After 'Extreme Herding'",
      "summary": "Retail investors \"herding\" into commodity ETFs, as seen by significant inflows, could indicate an overbought market and potential short-term underperformance, according to JPMorgan strategists. This behavior aligns with historical academic data suggesting heightened volatility and subsequent reversals after extreme investor rushes. An ETF analyst also notes that retail investors often enter these markets after much of the performance has already occurred.",
      "url": "https://www.etftrends.com/alternatives-content-hub/commodity-etfs-could-be-overbought-after-extreme-herding/",
      "source": "ETF Trends",
      "published": "20220310T180634",
      "overall_sentiment_score": -0.08129,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.23442,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.734586
    },
    {
      "title": "Wells Fargo CEO Scharf's 2021 compensation up by 20% at $24.5 mln",
      "summary": "Wells Fargo & Co CEO Charles Scharf's total compensation for 2021 increased by nearly 20% to $24.5 million, as disclosed in a regulatory filing. This rise follows a recovery year for the bank, with its shares jumping almost 59% in 2021, and compares to compensation packages of other major Wall Street bank CEOs like JPMorgan Chase & Co's Jamie Dimon and Citigroup Inc's Jane Fraser.",
      "url": "https://www.reuters.com/business/finance/wells-fargo-ceo-scharfs-2021-compensation-up-by-20-245-mln-2022-03-14/",
      "source": "Reuters",
      "published": "20220314T231400",
      "overall_sentiment_score": 0.117533,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.140964,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.70369
    },
    {
      "title": "BNY Mellon expects $100-mln revenue hit in first quarter from Russia pullback",
      "summary": "BNY Mellon anticipates a $100 million revenue impact in the first quarter and an annual reduction of $80 million to $100 million due to pausing new banking business in Russia. This move follows Russia's invasion of Ukraine and aligns with other companies pulling out of the country. The bank has also halted buying Russian securities under its investment management business.",
      "url": "https://www.reuters.com/business/finance/bny-mellon-expects-100-mln-revenue-hit-first-quarter-russia-pullback-2022-03-17/",
      "source": "Reuters",
      "published": "20220317T085000",
      "overall_sentiment_score": -0.311294,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.247498,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.700596
    },
    {
      "title": "Does Your Portfolio Need Private Equity?",
      "summary": "This article explores whether private equity is a suitable investment for individual investors, highlighting its potential for higher returns but also its complexities and high barriers to entry. It discusses various aspects of private equity, including how its returns are measured, the wide dispersion of returns, and alternative options for gaining exposure to this asset class for different investor profiles. Ultimately, it concludes that while private equity offers potential benefits, its risks and high costs make it generally unsuitable for most individual investors.",
      "url": "https://www.morningstar.com/portfolios/does-your-portfolio-need-private-equity",
      "source": "Morningstar",
      "published": "20220321T180643",
      "overall_sentiment_score": -0.034921,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.00289,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.646396
    },
    {
      "title": "Tetra Tech Appoints Prashant Gandhi as New Board Member",
      "summary": "Tetra Tech Inc., a Pasadena-based consulting and engineering company, has appointed Prashant Gandhi to its Board of Directors, effective May 1. Mr. Gandhi brings over 20 years of experience in digital systems, data analytics, and digital transformation from his roles at McKinsey and Co., JP Morgan Chase, and Melio Payments. He will serve on the Nominating and Corporate Governance Committee and the Compensation Committee, contributing his expertise to Tetra Tech's strategic focus on expanding its Delta technologies.",
      "url": "https://pasadenanow.com/main/tetra-tech-appoints-prashant-gandhi-as-new-board-member",
      "source": "Pasadena Now",
      "published": "20220309T175100",
      "overall_sentiment_score": 0.265435,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.104953,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.646147
    },
    {
      "title": "Metals Acquisition clinches $1.1 billion deal for Glencore’s CSA copper mine",
      "summary": "Metals Acquisition Corp has secured a $1.1 billion deal to acquire Glencore's CSA copper mine in Australia, outbidding competitors like IGO Ltd. The acquisition provides access to a high-grade copper mine expected to produce 41,000 to 49,000 tonnes of copper annually, capitalizing on strong demand fueled by electric vehicle production. For Glencore, this sale contributes to its business streamlining efforts, with analysts noting the attractive price received for the asset.",
      "url": "https://www.mining.com/web/metals-acquisition-clinches-1-1-billion-deal-for-glencores-csa-copper-mine/",
      "source": "Mining.com",
      "published": "20220317T074100",
      "overall_sentiment_score": 0.340929,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.210957,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.636208
    },
    {
      "title": "Russia risks \"imminent\" default on its debt, Wall Street analysts say",
      "summary": "Russia is facing an \"imminent\" default on its debt due to groaning under Western sanctions, according to credit ratings agencies and Wall Street firms. Fitch downgraded Russia's debt for the second time in a week, citing the high likelihood of default and the impact of sanctions on its ability and willingness to repay. With $700 million in payments due in March and a 30-day grace period, a default could occur as early as mid-April, further isolating Russia from international financial flows.",
      "url": "https://www.cbsnews.com/news/russia-debt-default-fitch-credit-rating-wall-street/",
      "source": "CBS News",
      "published": "20220309T172000",
      "overall_sentiment_score": 0.208462,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.225875,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.636098
    },
    {
      "title": "Inside Volatility Trading: Sometimes, Smaller is Better",
      "summary": "This article discusses the Cboe's introduction of \"Nanos,\" a smaller, more affordable index option product designed to make options trading more accessible to a wider range of investors. It highlights the historical trend towards shorter-dated maturities and smaller contract sizes in options trading, emphasizing how Nanos can cater to individual traders with smaller portfolios and lower risk tolerances. The author also touches on the concept of \"VIX Backwardation\" and how starting small is beneficial for learning and adapting in volatile markets.",
      "url": "https://www.cboe.com/insights/posts/inside-volatility-trading-sometimes-smaller-is-better/",
      "source": "Cboe Global Markets",
      "published": "20220315T162156",
      "overall_sentiment_score": 0.167766,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.134353,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.632422
    },
    {
      "title": "Stanley Black & Decker shutting down Russian business",
      "summary": "Stanley Black & Decker announced it is shutting down its business operations in Russia. The toolmaker, with a significant presence in Greater Baltimore, stated it stands in solidarity with the people of Ukraine. This decision follows similar actions by other major companies in response to the conflict.",
      "url": "https://www.bizjournals.com/baltimore/news/2022/03/10/stanley-black-decker-shuts-down-russia-business.html",
      "source": "The Business Journals",
      "published": "20220310T184639",
      "overall_sentiment_score": -0.070599,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.111323,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.606628
    },
    {
      "title": "Webroot sues CrowdStrike, Sophos, others over alleged patent infringement",
      "summary": "Webroot and its parent company OpenText are suing Trend Micro, Sophos, Kaspersky, and CrowdStrike for alleged infringement of several malware detection patents, some dating back to 2005. The lawsuits, filed in the Western District of Texas, claim these defendants infringe upon Webroot's intellectual property related to endpoint security products and platforms. Competitors and observers criticized the move, with CrowdStrike calling it typical of a \"patent troll\" and others viewing it as \"patent bullying.\"",
      "url": "https://www.thestack.technology/webroot-sues-competitors-for-patent-infringement/",
      "source": "The Stack",
      "published": "20220315T180604",
      "overall_sentiment_score": 0.01074,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.032331,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.601639
    },
    {
      "title": "Metals Acquisition clinches $1.1 bln deal for Glencore's CSA copper mine",
      "summary": "Metals Acquisition Corp has acquired Glencore's CSA copper mine in Australia for $1.1 billion, winning a years-long race for the asset. The deal allows Glencore to continue streamlining its portfolio and provides Metals Acquisition access to a high-grade copper mine, a critical commodity for electric vehicle production and the global energy transition. Metals Acquisition will fund the deal through IPO proceeds and debt, with Glencore receiving both cash and shares.",
      "url": "https://www.reuters.com/business/metals-acquisition-buy-csa-copper-mine-glencore-11-bln-2022-03-17/",
      "source": "Reuters",
      "published": "20220317T155800",
      "overall_sentiment_score": 0.264983,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.12293,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.588532
    },
    {
      "title": "KWEB Aims to Fully Transition to Hong Kong Shares In Coming Months",
      "summary": "The KraneShares CSI China Internet ETF (KWEB) is transitioning its holdings to Hong Kong-listed counterparts to address delisting risks for Chinese American Depository Receipts (ADRs) under the Holding Foreign Companies Accountable Act (HFCAA). KraneShares expects KWEB's portfolio to be solely comprised of Hong Kong listings by the end of the year, providing daily updates on its conversion progress. This strategy aims to protect client interests amidst unresolved regulatory issues between US and Chinese authorities regarding audit paper access.",
      "url": "https://kraneshares.com/kweb-aims-to-fully-transition-to-hong-kong-shares-in-coming-months/",
      "source": "KraneShares",
      "published": "20220311T172627",
      "overall_sentiment_score": 0.10134,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.114876,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.561157
    },
    {
      "title": "JPMorgan Chase Appoints Michael Woodfield as Market Executive for Middle Market Banking in Southern Nevada",
      "summary": "JPMorgan Chase Commercial Banking announced the appointment of Michael Woodfield as Market Executive of Middle Market Banking & Specialized Industries in southern Nevada. With 17 years of experience, Woodfield will focus on serving the financial needs of middle market companies in the region, leveraging JPMorgan Chase's global capabilities. This appointment aims to strengthen the bank's commitment to businesses in southern Nevada.",
      "url": "https://nevadabusiness.com/2022/03/jpmorgan-chase-appoints-michael-woodfield-as-market-executive-for-middle-market-banking-in-southern-nevada/",
      "source": "Nevada Business Magazine",
      "published": "20220309T171647",
      "overall_sentiment_score": 0.024295,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.00024,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.337969
    },
    {
      "title": "JPMorgan is winding down its Russia operations amid widening business exodus over Ukraine war",
      "summary": "JPMorgan Chase is winding down its operations in Russia, following directives from governments globally and amid a broader business exodus due to the Ukraine war. The bank's remaining dealings in Russia are limited to helping global clients manage existing obligations, risks, and taking care of employees, with fewer than 200 staff primarily in the corporate and investment bank. This move by JPMorgan comes shortly after Goldman Sachs also announced its exit from the country.",
      "url": "https://www.cnbc.com/2022/03/10/jpmorgan-is-winding-down-its-russia-operations-amid-widening-business-exodus-over-ukraine-war.html",
      "source": "CNBC",
      "published": "20220310T150900",
      "overall_sentiment_score": 0.007056,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.023487,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.330448
    }
  ]
}