{
  "ticker": "JPM",
  "date": "2022-10-17",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T12:08:41.353084",
  "source": "alpha_vantage",
  "article_count": 20,
  "articles": [
    {
      "title": "Chase Bank launches first local virtual call center in Detroit",
      "summary": "JPMorgan Chase has announced the launch of its first virtual call center in Detroit, aiming to create dozens of jobs for local residents and support financial inclusion. The initiative builds on the firm's $200 million investment in the city since 2014, offering roles with competitive pay, tuition assistance, and \"second-chance\" opportunities for individuals with criminal backgrounds. This move highlights Chase's commitment to inclusive growth and racial equity, with plans for potential expansion if successful.",
      "url": "https://www.detroitnews.com/story/news/local/detroit-city/2022/10/04/chase-bank-launches-first-local-virtual-call-center-in-detroit/69538763007/",
      "source": "The Detroit News",
      "published": "20221004T171646",
      "overall_sentiment_score": 0.484501,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.489548,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "JPMorgan investment banking chief Hernandez to retire in 2023",
      "summary": "Carlos Hernandez, JPMorgan's executive chair of investment and corporate banking, will retire at the end of the first quarter of next year. Hernandez, a 36-year veteran at the company, has been instrumental in growing several key segments including treasury services, investor services, and global equities business. He will work with Jim Casey and Viswas Raghavan, co-heads of global investment banking, to ensure a smooth transition.",
      "url": "https://www.reuters.com/business/finance/jpmorgan-investment-banking-chief-hernandez-retire-2023-2022-10-17/",
      "source": "Reuters",
      "published": "20221017T200200",
      "overall_sentiment_score": 0.09467,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.066478,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 1.0
    },
    {
      "title": "JPMorgan Chase pilots 'virtual call center' with Detroit remote workers",
      "summary": "JPMorgan Chase is piloting its first virtual call center in the nation, hiring approximately 50 remote workers from Detroit. The new full-time roles offer a starting wage of $22.50 an hour plus benefits, and the company views this as a potential model to replicate elsewhere. This initiative stems from lessons learned during the COVID-19 pandemic regarding remote work viability and is supported by collaboration with Detroit at Work.",
      "url": "https://www.crainsdetroit.com/banking/jpmorgan-chase-plans-virtual-call-center-detroit",
      "source": "Crain's Detroit Business",
      "published": "20221004T145300",
      "overall_sentiment_score": 0.347894,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.346672,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "2022 Diversity & Inclusion award winner: JPMorgan Chase",
      "summary": "JPMorgan Chase was recognized as a 2022 Diversity & Inclusion award winner by the San Antonio Business Journal. The financial institution is committed to teaching its leadership and staff how to be more inclusive towards each other and their clients. Managing Director Robert Perales represented JPMorgan Chase & Co. for this award.",
      "url": "https://www.bizjournals.com/sanantonio/news/2022/10/11/2022-diversity-inclusion-award-win-jpmorgan-chase.html",
      "source": "The Business Journals",
      "published": "20221011T171647",
      "overall_sentiment_score": 0.545597,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.539154,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Hunt Companies Leverages Real-Time Payments",
      "summary": "Hunt Companies partnered with J.P. Morgan and Kyriba to implement Real-Time Payment and Account Balance APIs, aiming to replace expensive and time-consuming wire payments. This integration significantly increased payment efficiencies and resulted in substantial cost savings for the company. The shift to real-time payments has saved Hunt Companies an estimated 10 hours per week and reduced wire costs by 83%, offering instant confirmation and 24/7 availability for transactions.",
      "url": "https://www.jpmorgan.com/insights/technology/application-program-interface/hunt-companies-leverages-real-time-payments",
      "source": "J.P. Morgan",
      "published": "20221005T171646",
      "overall_sentiment_score": 0.415191,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.403099,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.993611
    },
    {
      "title": "CD&R Appoints Former JPMorgan Chase & Co. Executive Gordon Smith as Operating Advisor",
      "summary": "Clayton, Dubilier & Rice (CD&R) announced the appointment of Gordon Smith, former Co-President and Chief Operating Officer of JPMorgan Chase & Co., as an Operating Advisor to CD&R funds. Smith will collaborate with CD&R's financial services team to identify new investments and provide guidance to portfolio companies, leveraging his nearly 40 years of financial services experience. This strategic move aims to broaden opportunities for CD&R funds and enhance the expertise available to their portfolio companies.",
      "url": "https://www.cdr.com/news/cdr-appoints-former-jpmorgan-chase-co-executive-gordon-smith-as-operating-advisor",
      "source": "CD&R",
      "published": "20221004T171645",
      "overall_sentiment_score": 0.271279,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.338806,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.93783
    },
    {
      "title": "Coca-Cola FEMSA recompra 299.8 millones de dólares en bonos",
      "summary": "Coca-Cola FEMSA conducted a public offer to repurchase $299.8 million of its outstanding senior bonds due in 2043 and 2030. HSBC and J.P. Morgan acted as dealer managers for the offer, which initially had a cap of $250 million but was increased due to high demand. The company was advised by Cleary Gottlieb Steen & Hamilton, while the banks received legal support from Skadden, Arps, Slate, Meagher & Flom and Galicia Abogados.",
      "url": "https://lexlatin.com/noticias/coca-cola-femsa-recompra-2998-millones-de-dolares-en-bonos",
      "source": "LexLatin",
      "published": "20221011T172637",
      "overall_sentiment_score": 0.231265,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.130438,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.643346
    },
    {
      "title": "The 3 Most Popular Equity Income ETFs",
      "summary": "Amidst market volatility, bear markets, and high inflation, many investors are turning to dividend stocks and related ETFs for income and less volatility. This article highlights three of the most popular equity income ETFs, detailing their inflows, investment strategies, and expense ratios. The ETFs discussed are SCHD, JEPI, and VYM, each offering distinct approaches to generating income and outperforming the broader market.",
      "url": "https://www.etftrends.com/the-3-most-popular-equity-income-etfs/",
      "source": "ETF Trends",
      "published": "20221004T171632",
      "overall_sentiment_score": 0.328553,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.301584,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.641709
    },
    {
      "title": "PepsiCo Defies Fears of Consumer Slowdown With Strong Earnings and Forecast (Published 2022)",
      "summary": "PepsiCo reported strong third-quarter earnings, exceeding analyst expectations and raising its full-year forecasts for revenue and profit. This performance indicates that consumers are continuing to spend on its products despite high inflation and rising prices. The company's ability to raise prices without significantly impacting sales volumes, even as the U.S. dollar's strength affected international earnings, offered a positive signal for the broader earnings season.",
      "url": "https://www.nytimes.com/2022/10/12/business/pepsi-earnings-inflation.html",
      "source": "The New York Times",
      "published": "20221012T180639",
      "overall_sentiment_score": 0.295946,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.22091,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.637779
    },
    {
      "title": "Citigroup reports $110 mln leveraged-loan loss as other banks avoid sector exposure",
      "summary": "Citigroup reported a $110 million writedown on leveraged loans in the third quarter, contrasting with other major Wall Street banks that largely avoided or reduced their exposure to the sector. This loss reflects the broader struggles in the leveraged finance market, exacerbated by rising interest rates and investor caution, which have also impacted mergers and acquisitions.",
      "url": "https://www.reuters.com/business/finance/citigroup-expects-110-mln-loss-leveraged-loans-3q-cfo-2022-10-14/",
      "source": "Reuters",
      "published": "20221014T183900",
      "overall_sentiment_score": -0.167211,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": 0.232369,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.636586
    },
    {
      "title": "Chart of the Week: Advisors Find Safety Attractive",
      "summary": "Advisors are prioritizing safety and downside protection in fixed income due to rising interest rates, leading to increased interest in ultra-short bond ETFs. These ETFs offer higher yields than before, with popular options including both index-based Treasury ETFs and actively managed funds that incorporate investment-grade corporates and mortgages for better income generation. The article highlights specific ultra-short bond ETFs and their performance in the current rising rate environment.",
      "url": "https://www.etftrends.com/chart-of-the-week-advisors-find-safety-attractive/",
      "source": "ETF Trends",
      "published": "20221013T162652",
      "overall_sentiment_score": 0.081884,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.140093,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.633004
    },
    {
      "title": "Spread the love and you could earn up to 125,000 Rapid Rewards bonus points",
      "summary": "Southwest Airlines is offering new cardholders of their Rapid Rewards® Credit Cards a chance to earn up to 125,000 bonus points through a tiered spending offer. The promotion encourages spending to unlock points, which can be redeemed for flights, gift cards, and more, providing significant value for travel. This offer is designed to attract new cardmembers and reward them for their initial spending.",
      "url": "https://www.swamedia.com/southwest-stories/MC3TPOFMJJ55DRFJUGU44EHEWLIE",
      "source": "Southwest Newsroom",
      "published": "20221017T173604",
      "overall_sentiment_score": 0.373032,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.255751,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.630171
    },
    {
      "title": "Morgan Stanley profit misses estimate as deals drought extends",
      "summary": "Morgan Stanley reported a 30% slump in third-quarter profit, missing analysts' estimates, as a global dealmaking slowdown significantly impacted its investment banking business. The bank's CEO expects clarity on inflation by mid-2023, while its wealth management division surprisingly showed revenue growth. The results highlight broader challenges faced by major banks due to uncertain economic conditions and rising interest rates.",
      "url": "https://www.reuters.com/business/finance/morgan-stanley-profit-falls-deals-drought-extends-2022-10-14/",
      "source": "Reuters",
      "published": "20221014T153400",
      "overall_sentiment_score": -0.373422,
      "overall_sentiment_label": "Bearish",
      "ticker_sentiment_score": -0.344834,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.609533
    },
    {
      "title": "BlackRock Sees “Generational” Fixed Income Opportunities",
      "summary": "Robert Kapito, president of BlackRock, stated there are generational opportunities in the bond market due to rising rates and US stimulus. He highlighted that attractive yields are now available with less duration or credit risk, driving significant inflows into fixed income and bond ETFs. BlackRock also addressed its ESG strategy and Liability-Driven Investing (LDI) in the UK pension industry.",
      "url": "https://www.marketsmedia.com/blackrock-sees-generational-opportunities-in-fixed-income/",
      "source": "Markets Media",
      "published": "20221013T161652",
      "overall_sentiment_score": 0.177742,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.140354,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.603977
    },
    {
      "title": "Morgan Stanley rides wealth management as a third-quarter highlight",
      "summary": "Morgan Stanley's wealth management business was a key highlight in its third-quarter earnings, attracting $65 billion in net new assets and pushing the yearly total to $260 billion despite difficult market conditions. The company's net interest income also saw a significant boost due to rising interest rates, while investment banking revenues declined. Analysts remain bullish on the stock, citing the strength of its wealth management unit.",
      "url": "https://www.investmentnews.com/wirehouses/morgan-stanley-rides-wealth-management-as-a-third-quarter-highlight/227812",
      "source": "InvestmentNews",
      "published": "20221014T174611",
      "overall_sentiment_score": 0.144157,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.127014,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.603276
    },
    {
      "title": "With a stake in Vale, Cosan raises its bet on mining",
      "summary": "Cosan has acquired a minority stake in mining giant Vale, investing R$22 billion to reach 6.5% of the company's capital, signaling a significant bet on the mining sector's future. The move, however, raised concerns among investors and analysts regarding its financing and potential impact on Cosan's financial leverage. Cosan's executives emphasize a friendly approach and strategic alignment, viewing Vale as an \"irreplicable\" asset with high appreciation potential.",
      "url": "https://valorinternational.globo.com/business/news/2022/10/09/with-a-stake-in-vale-cosan-raises-its-bet-on-mining.ghtml",
      "source": "Valor International",
      "published": "20221009T212200",
      "overall_sentiment_score": 0.081361,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.140051,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.6029
    },
    {
      "title": "Experienced Trust Professional and More Join Pinnacle Financial Partners in the National Capital Region",
      "summary": "Pinnacle Financial Partners has announced the addition of experienced trust professional Justin Willis as a trust portfolio manager in the National Capital Region, alongside Marilyn Carrera as a financial advisor assistant and Anita Carter as a treasury management analyst. These new hires bring significant experience to the firm, strengthening its wealth management and client services in the region. The move underscores Pinnacle's commitment to building a full-service bank capable of meeting diverse client needs, leveraging the expertise and community recognition of its new team members.",
      "url": "https://pnfp.com/news/news-releases/experienced-trust-professional-and-more-join-pinnacle-financial-partners-in-the-national-capital-region/",
      "source": "Pinnacle Financial Partners",
      "published": "20221006T180732",
      "overall_sentiment_score": 0.289856,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.110256,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.600727
    },
    {
      "title": "Morgan Stanley CEO James Gorman: “I'm perfectly happy to see our tech spend go up”",
      "summary": "Morgan Stanley CEO James Gorman expressed satisfaction with increased tech spending, viewing it as crucial for efficiency and innovation, despite a 22% drop in bank revenues. He highlighted the importance of cloud technology, robo-advisors, and cybersecurity, while also reflecting on market recalibrations due to past \"ridiculous\" valuations and the return to fundamental economic principles. The bank's wealth management and fixed income sectors performed well, offsetting a decline in investment banking.",
      "url": "https://www.thestack.technology/morgan-stanley-tech-spend-q3-2022/",
      "source": "The Stack",
      "published": "20221017T174613",
      "overall_sentiment_score": 0.190993,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.121255,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.598362
    },
    {
      "title": "Surcharging and What It Means For Your Business",
      "summary": "This article explains credit card surcharging for businesses, detailing how merchants can add a fee for credit card transactions following a class action lawsuit settlement with Visa and Mastercard. It outlines eligibility criteria for the settlement, how to claim, and provides guidance on how to implement surcharging, including notification and disclosure requirements. The article also addresses frequently asked questions regarding surcharging, such as what it is, how it differs from convenience fees, and regional restrictions like those in Quebec.",
      "url": "https://www.cfib-fcei.ca/credit-card-surcharging",
      "source": "Canadian Federation of Independent Business | CFIB",
      "published": "20221014T173615",
      "overall_sentiment_score": 0.182905,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.057278,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.597282
    },
    {
      "title": "Embedded finance: Who will lead the next payments revolution?",
      "summary": "Embedded finance, which integrates financial products into nonfinancial digital experiences, reached $20 billion in US revenues in 2021 and is projected to double within three to five years. The article explores how banks, payments providers, fintechs, and software firms can participate and succeed in this dynamic market by focusing on product breadth, depth, and program management support. Key success factors include choosing a strategic focus, building a modern developer experience, adapting to B2B2C/B2B2B sales, and developing robust support and risk services.",
      "url": "https://www.mckinsey.com/industries/financial-services/our-insights/embedded-finance-who-will-lead-the-next-payments-revolution",
      "source": "McKinsey & Company",
      "published": "20221013T165554",
      "overall_sentiment_score": 0.206698,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.168112,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.571683
    }
  ]
}