{
  "ticker": "JPM",
  "date": "2022-02-28",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T12:06:05.754182",
  "source": "alpha_vantage",
  "article_count": 22,
  "articles": [
    {
      "title": "Wide Moat Stocks Can Get Their Grooves Back",
      "summary": "The VanEck Vectors Morningstar Wide Moat ETF (MOAT) has shown durability amid market turbulence in early 2022 and is outperforming the S&P 500. Analysts believe wide moat equities have the ingredients for continued success, with the ETF's valuation methodology identifying stocks trading at attractive multiples despite their inherent quality. MOAT's sector-agnostic approach and diversified holdings, including non-tech stocks, are helping to buffer against current tech sector weaknesses.",
      "url": "https://www.etftrends.com/tactical-allocation-content-hub/wide-moat-stocks-can-get-their-grooves-back/",
      "source": "ETF Trends",
      "published": "20220228T173722",
      "overall_sentiment_score": 0.319756,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.25115,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.568699
    },
    {
      "title": "Healthcare Realty and Healthcare Trust of America Enter Into $18 Billion Strategic Combination",
      "summary": "Healthcare Realty and Healthcare Trust of America announced an $18 billion strategic business combination, creating a preeminent pure-play medical office building REIT. The merger will result in a company with an $11.6 billion equity market capitalization and $17.6 billion total enterprise value, led by Healthcare Realty's management team. HTA shareholders will receive an implied value of $35.08 per share, including a $4.82 special cash dividend, and the combined entity expects significant cost synergies and operational upside.",
      "url": "https://www.globenewswire.com/news-release/2022/02/28/2392934/0/en/Healthcare-Realty-and-Healthcare-Trust-of-America-Enter-Into-18-Billion-Strategic-Combination.html",
      "source": "GlobeNewswire",
      "published": "20220228T064500",
      "overall_sentiment_score": 0.35085,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.346222,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.627791
    },
    {
      "title": "Announcing JPMorgan Chase & Co.'s Strategic Investment in TRM Labs | TRM Blog",
      "summary": "JPMorgan Chase & Co. has announced a strategic investment in TRM Labs, a company specializing in crypto compliance and risk management technology. This investment highlights the growing significance of the crypto economy and the importance of trust and safety within this ecosystem. TRM Labs provides solutions for financial institutions, cryptocurrency businesses, regulators, and law enforcement agencies to monitor suspicious cryptocurrency transactions and trace illicit funds.",
      "url": "https://www.trmlabs.com/resources/blog/announcing-jpmorgan-chase-co-s-strategic-investment-in-trm-labs",
      "source": "TRM Labs",
      "published": "20220227T171645",
      "overall_sentiment_score": 0.381669,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.391074,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.920528
    },
    {
      "title": "Blackstone Real Estate Launches Affordable Housing Company",
      "summary": "Blackstone Real Estate has launched April Housing, a new portfolio company aimed at being a solutions and capital provider for the creation and preservation of high-quality affordable housing across the U.S. This initiative follows Blackstone Real Estate Income Trust's acquisition of a portfolio of over 90,000 affordable housing units. Industry veteran Alice Carr has been appointed CEO of April Housing, and the company plans to invest over $500 million in community improvements while maintaining affordability.",
      "url": "https://www.housingfinance.com/news/blackstone-real-estate-launches-affordable-housing-company_o",
      "source": "Affordable Housing Finance",
      "published": "20220224T064100",
      "overall_sentiment_score": 0.20034,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.131603,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.638737
    },
    {
      "title": "Waterstone Mortgage Review: Home Purchase Loan Experts Who Strive to Close On Time",
      "summary": "This article reviews Waterstone Mortgage, highlighting its unique position as a subsidiary of a large bank with a local feel, offering an expansive range of loan products. It emphasizes their expertise in home purchase loans, especially in competitive markets, and their commitment to timely closings while noting the absence of online rate disclosures as a potential drawback.",
      "url": "https://www.thetruthaboutmortgage.com/waterstone-mortgage-review/",
      "source": "The Truth About Mortgage",
      "published": "20220222T191641",
      "overall_sentiment_score": 0.15302,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.127266,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.645276
    },
    {
      "title": "Carver Federal Savings, unique in New York, survives by investing in underserved communities",
      "summary": "Carver Federal Savings, the last Black-operated bank in New York City, is thriving by focusing on underserved communities and small businesses often overlooked by larger banks. Despite facing financial precarity in the past, Carver has seen significant asset growth and capital increases, especially during the pandemic, by prioritizing relationship banking and community reinvestment. The bank's commitment to hyper-local lending and partnerships has helped small businesses flourish in neighborhoods like Harlem.",
      "url": "https://www.crainsnewyork.com/small-business/carver-federal-savings-survives-investing-underserved-communities",
      "source": "Crain's New York Business",
      "published": "20220217T163700",
      "overall_sentiment_score": -0.127191,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.332213,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.627507
    },
    {
      "title": "Buyout firm Madison Dearborn to take MoneyGram private in $1.8 billion deal",
      "summary": "Private equity firm Madison Dearborn Partners announced it would acquire MoneyGram International Inc for $1.8 billion, taking the debt-laden money transfer platform private. The deal, valued at $11 per share, represents a significant premium to MoneyGram's recent stock prices and aims to revitalize the company amidst stiff competition. Madison Dearborn will also refinance MoneyGram's outstanding debt, with the acquisition expected to close in the fourth quarter of this year.",
      "url": "https://www.reuters.com/business/buyout-firm-madison-dearborn-take-moneygram-private-18-bln-deal-2022-02-15/",
      "source": "Reuters",
      "published": "20220215T163700",
      "overall_sentiment_score": 0.220684,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.120992,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.648004
    },
    {
      "title": "MoneyGram Enters into Agreement to be Acquired by Madison Dearborn Partners",
      "summary": "MoneyGram International, Inc. announced a definitive agreement to be acquired by funds affiliated with Madison Dearborn Partners, LLC for $11.00 per share in an all-cash transaction valued at approximately $1.8 billion. This acquisition aims to accelerate MoneyGram's digital growth strategy and strengthen its market-leading cross-border capabilities. The transaction is expected to close in the fourth quarter of 2022, after which MoneyGram will become a private company.",
      "url": "https://www.prnewswire.com/news-releases/moneygram-enters-into-agreement-to-be-acquired-by-madison-dearborn-partners-301482467.html",
      "source": "PR Newswire",
      "published": "20220215T080100",
      "overall_sentiment_score": 0.223195,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.14025,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.62576
    },
    {
      "title": "WSJ News Exclusive | Regulators Probe Block Trading at Morgan Stanley, Goldman, Other Wall Street Firms",
      "summary": "Federal investigators, including the SEC and Justice Department, are probing block trading practices at Wall Street firms like Morgan Stanley and Goldman Sachs. The investigation focuses on whether bankers improperly tipped off hedge-fund clients about large share sales before public disclosure. Regulators are examining communication records and trading activities to determine if funds benefited from such insider information.",
      "url": "https://www.wsj.com/finance/regulation/regulators-probe-block-trading-at-morgan-stanley-goldman-other-wall-street-firms-11644875448?gaa_at=eafs&gaa_n=AWEtsqdEjPzNO_7v6UPH2c3wyfXpgJlYQL7u6OROEv2DXlVy5f9moXnqiFoa&gaa_ts=69079c12&gaa_sig=ksLNW8DoeC-E7RCWcDlURMU8U1tVzfLHm6d4cymF7Ez8abMil8wNXKs2rrJ20obgwnnLtpSKFVQMwvT8OdZnBA%3D%3D",
      "source": "The Wall Street Journal",
      "published": "20220214T174613",
      "overall_sentiment_score": -0.10195,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.114942,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.613021
    },
    {
      "title": "Axis Bank set to buy Citigroup’s India retail unit",
      "summary": "Axis Bank is nearing a deal to acquire Citigroup’s India retail banking business for an estimated $2.5 billion. The agreement, expected to be announced in the coming weeks, is contingent on approval from the Reserve Bank of India and would include a cash component of less than $2 billion after accounting for liabilities. This move is part of Citigroup CEO Jane Fraser's restructuring efforts to exit retail banking in 13 countries and focus on high-growth businesses.",
      "url": "https://brandequity.economictimes.indiatimes.com/news/business-of-brands/axis-bank-set-to-buy-citigroups-india-retail-unit/89562298",
      "source": "ET BrandEquity",
      "published": "20220214T131000",
      "overall_sentiment_score": 0.15617,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.1436,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.586314
    },
    {
      "title": "Kennedy Wilson Gets $300M in Preferred Equity",
      "summary": "Toronto-based Fairfax Financial Holdings Ltd. has made a $300 million preferred equity investment in Beverly Hills-based Kennedy-Wilson Holdings Inc. This new investment will be used by Kennedy Wilson for its development pipeline, real estate investments, and to pay off unsecured bank borrowings, further expanding their existing partnership which dates back to 2010. Fairfax has also increased its first mortgage target within Kennedy Wilson’s debt investment platform from $2 billion to $5 billion.",
      "url": "https://labusinessjournal.com/real-estate/kennedy-wilson-gets-300m-in-preferred-equity/",
      "source": "Los Angeles Business Journal",
      "published": "20220228T172648",
      "overall_sentiment_score": 0.381759,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.280628,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.632277
    },
    {
      "title": "SunTrust Bank Permanently Closed",
      "summary": "The SunTrust bank branch at 8700 Georgia Ave. in downtown Silver Spring has permanently closed following the consolidation of operations into Truist after BB&T Bank acquired SunTrust in 2019. This closure is part of Truist's \"core conversion\" process, which has led to some customer issues, including temporary loss of access to debit cards and bank accounts. These conversions are affecting all former BB&T and SunTrust customers as they transition to Truist products and digital platforms.",
      "url": "https://www.sourceofthespring.com/silver-spring-news/2789620/suntrust-bank-permanently-closed/",
      "source": "Source of the Spring",
      "published": "20220228T082500",
      "overall_sentiment_score": -0.134665,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.13553,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.592874
    },
    {
      "title": "JPMorgan, Toshiba, Ciena find new way to protect blockchain with quantum network",
      "summary": "JPMorgan Chase & Co, Toshiba Corp, and Ciena Corp have successfully demonstrated a new encryption network using quantum key distribution (QKD) to protect blockchain communications from potential quantum computing attacks. This marks the first time that such a super-secure, quantum physics-powered network has been tested for safeguarding blockchain technology, addressing future threats posed by advanced quantum computers. JPMorgan views this as a critical step in preparing banking systems for changes to the security landscape that production-quality quantum computers will bring.",
      "url": "https://www.reuters.com/technology/jpmorgan-toshiba-ciena-find-new-way-protect-blockchain-with-quantum-network-2022-02-17/",
      "source": "Reuters",
      "published": "20220217T225400",
      "overall_sentiment_score": 0.387506,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.30775,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.948678
    },
    {
      "title": "JPMorgan Chase, Toshiba and Ciena Build the First Quantum Key Distribution Network Used to Secure Mission-Critical Blockchain Application",
      "summary": "JPMorgan Chase, Toshiba, and Ciena have successfully built and demonstrated the first quantum key distribution (QKD) network for metropolitan areas, securing a mission-critical blockchain application. This groundbreaking research proves the viability of QKD to detect and defend against potential quantum computing attacks, supporting 800 Gbps data rates under real-world conditions. The network secured Liink by J.P. Morgan, the world's first bank-led, production-grade, peer-to-peer blockchain network, showcasing the technology's effectiveness against future quantum threats.",
      "url": "https://www.jpmorganchase.com/newsroom/press-releases/2022/jpmc-toshiba-ciena-build-first-quantum-key-distribution-network",
      "source": "JPMorganChase",
      "published": "20220217T162231",
      "overall_sentiment_score": 0.254297,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.32868,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.918755
    },
    {
      "title": "How to restart your career after taking time off",
      "summary": "Keita Young, who restarted her career at JPMorgan Chase after an 11-year break to raise her children, shares six tips for others looking to re-enter the workforce. Her advice includes getting involved in outside activities, having a compelling career story, directing one's own path, leveraging a support system, finding a mentor, and not stressing over minor issues.",
      "url": "https://www.washingtonpost.com/creativegroup/jpmorgan-chase-co/how-to-restart-your-career-after-taking-time-off/",
      "source": "The Washington Post",
      "published": "20220215T171648",
      "overall_sentiment_score": 0.40629,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.428003,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Black Knight Acquires Remaining Interest in Optimal Blue from Thomas H. Lee Partners, L.P. and Cannae Holdings, Inc.",
      "summary": "Black Knight, Inc. announced the acquisition of the remaining interests in Optimal Blue Holdco, LLC from co-investors Cannae Holdings, Inc. and Thomas H. Lee Partners, L.P. for a total of $1.156 billion, paid in a combination of Dun & Bradstreet stock and cash. This transaction simplifies Black Knight's organizational structure by making Optimal Blue a wholly-owned subsidiary and is expected to increase 2022 Adjusted EPS by $0.11. Black Knight Chairman and CEO Anthony Jabbour highlighted the strong performance of Optimal Blue and the outstanding returns generated from their initial investment in Dun & Bradstreet.",
      "url": "https://www.prnewswire.com/news-releases/black-knight-acquires-remaining-interest-in-optimal-blue-from-thomas-h-lee-partners-lp-and-cannae-holdings-inc-301482177.html",
      "source": "PR Newswire",
      "published": "20220215T064500",
      "overall_sentiment_score": 0.245043,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.115506,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.632358
    },
    {
      "title": "Axis Bank set to buy Citigroup’s $2.5 billion India retail unit",
      "summary": "Axis Bank is close to acquiring Citigroup's India retail banking business for approximately $2.5 billion, a deal expected to be announced within weeks, pending Reserve Bank of India approval. The transaction includes a cash component of less than $2 billion, accounting for liabilities, and Axis Bank anticipates a six-month integration period. This acquisition aligns with Citigroup CEO Jane Fraser's strategy to divest retail banking operations in 13 countries and focus on high-growth areas like wealth management, while Axis Bank aims to boost retail loans in India.",
      "url": "https://m.economictimes.com/industry/banking/finance/banking/axis-bank-set-to-buy-citigroups-2-5-billion-india-retail-unit/articleshow/89560646.cms",
      "source": "The Economic Times",
      "published": "20220214T125800",
      "overall_sentiment_score": 0.184735,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.110118,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.589099
    },
    {
      "title": "How DBMS is Used by Hulu, JPMorgan Chase, and The Weather Company",
      "summary": "This article examines how Database Management Systems (DBMS) are crucial for organizations to efficiently store, retrieve, and manage data. It provides case studies of how major companies like Hulu, JPMorgan Chase, and The Weather Company leverage DBMS to address challenges, optimize operations, and maintain data integrity and security, highlighting the benefits over traditional file systems. The article demonstrates the real-world applications and positive outcomes of integrating DBMS in various industries.",
      "url": "https://www.enterprisestorageforum.com/management/dbms-use-cases/",
      "source": "Enterprise Storage Forum",
      "published": "20220224T171646",
      "overall_sentiment_score": 0.314279,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.325741,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.904402
    },
    {
      "title": "List of Banks and Lenders with SBA Loan Guarantee Agreements",
      "summary": "This article provides a comprehensive list of banks and lenders in New Hampshire that offer small business loans under SBA loan guarantee agreements. It details contact information including addresses, phone numbers, and websites for each institution. The list serves as a valuable resource for small businesses seeking financing options in the region.",
      "url": "https://www.nhbr.com/list-of-banks-and-lenders-with-sba-loan-guarantee-agreements/",
      "source": "NH Business Review",
      "published": "20220224T164640",
      "overall_sentiment_score": 0.113239,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.140966,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.603642
    },
    {
      "title": "Blackstone Launches April Housing",
      "summary": "Blackstone Real Estate Income Trust (BREIT) has formed April Housing, a new portfolio company dedicated to acquiring and preserving affordable housing across the U.S. The new entity will oversee more than 90,000 units and plans to invest over $500 million in property improvements. Alice Carr, formerly of JPMorgan Chase, will lead April Housing as CEO, overseeing Blackstone's commitment to expanding affordable housing solutions.",
      "url": "https://www.multihousingnews.com/blackstone-launches-april-housing/",
      "source": "Multifamily Housing News",
      "published": "20220224T162130",
      "overall_sentiment_score": 0.265477,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.239834,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.619455
    },
    {
      "title": "Pakistani-American woman appointed CIO of top US firm",
      "summary": "Saira Malik, a Pakistani-American, has been appointed as Chief Investment Officer (CIO) of Nuveen, a global asset management firm with $1.2 trillion under management. In her new role, she will lead weekly market and investment insights, client asset allocation views, and chair the Global Investment Committee. Malik has a distinguished career in finance, previously holding senior positions at Nuveen and JP Morgan Asset Management, and is recognized as a top influential woman in US finance.",
      "url": "https://tribune.com.pk/story/2344004/pakistani-american-woman-appointed-cio-of-top-us-firm",
      "source": "The Express Tribune",
      "published": "20220218T171650",
      "overall_sentiment_score": 0.056037,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.12378,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.617428
    },
    {
      "title": "Morningstar: Active ETFs See Surge in Flows, AUM",
      "summary": "Active ETFs experienced a significant surge in investor interest and inflows in 2021, reversing previous trends of outflows for active funds. A Morningstar report highlighted that active ETFs attracted $87 billion in inflows, growing their total assets under management by 44% to $295 billion, despite representing only a small fraction of all active funds and ETFs. Key factors driving this growth included inflation concerns, anticipated Federal Reserve rate hikes, and successful new product launches, with Grayscale Bitcoin Trust (GBTC), JPMorgan Ultra-Short Income ETF (JPST), and ARK Innovation ETF (ARKK) being among the largest active ETFs.",
      "url": "https://www.etftrends.com/active-etf-channel/morningstar-active-etfs-see-surge-in-flows-aum/",
      "source": "ETF Trends",
      "published": "20220218T171625",
      "overall_sentiment_score": 0.133506,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.277514,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.630802
    }
  ]
}