{
  "ticker": "JPM",
  "date": "2022-11-28",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T12:09:09.563706",
  "source": "alpha_vantage",
  "article_count": 15,
  "articles": [
    {
      "title": "M&T Bank Corp. stock outperforms competitors despite losses on the day",
      "summary": "M&T Bank Corp. (MTB) stock fell 1.52% to $169.52 on a generally negative trading day for the stock market, breaking a three-day winning streak. Despite its own losses, the stock outperformed several key competitors including JPMorgan Chase & Co. (JPM), Bank of America Corp. (BAC), and Wells Fargo & Co. (WFC), which experienced larger percentage drops. The stock closed $23.90 below its 52-week high, with trading volume significantly below its 50-day average.",
      "url": "https://www.marketwatch.com/data-news/m-t-bank-corp-stock-outperforms-competitors-despite-losses-on-the-day-01669674022-5277a0519a12?gaa_at=eafs&gaa_n=AWEtsqdDnioD74XJpzPpgpqUSOWtl__r5GJ25ZQMhYKItq6Rv_MKAyKwec_Z&gaa_ts=69079c12&gaa_sig=pbBhSX7NziTBDe0Xh6YZ2JTXCecwn6dFDAa3F6qPZ3GPQrfpJebJSuOfuq9suS1CHb0hBNaeQIVEHSYL7nqd_g%3D%3D",
      "source": "MarketWatch",
      "published": "20221128T172000",
      "overall_sentiment_score": -0.201286,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.206532,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.722476
    },
    {
      "title": "PIMCO ETF hits NYSE trading floor",
      "summary": "PIMCO has listed its PIMCO Active Bond ETF (BOND) on the NYSE trading floor, marking the exchange's first ETF listing in 15 years and the first actively-managed ETF in the open outcry arena. The firm is employing a digital and human hybrid system, including a designated market maker, to enhance liquidity, reduce volatility, and improve price determination. This move follows recent SEC rule changes permitting a wider range of ETFs to list on the NYSE floor, and PIMCO is considering further ETF listings there.",
      "url": "https://www.etfstream.com/articles/pimco-etf-hits-nyse-trading-floor",
      "source": "ETF Stream",
      "published": "20221123T161656",
      "overall_sentiment_score": 0.176709,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.146941,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.572532
    },
    {
      "title": "Manulife takes control of China unit as foreign ownership barriers fall",
      "summary": "Manulife Investment Management has received approval from Beijing to take full control of its mainland Chinese joint venture, Manulife TEDA Fund Management, by acquiring the remaining 51% stake for 1.7 billion yuan (US$237.22 million). This move makes Manulife the first foreign asset manager to convert its joint venture into a wholly-owned fund management company in China, reflecting Beijing's increased willingness to open up its financial markets since foreign ownership restrictions were scrapped in April 2020. The full acquisition will grant Manulife direct access to China's large and rapidly growing retail fund market.",
      "url": "https://www.scmp.com/business/banking-finance/article/3200435/manulife-gets-green-light-take-full-control-china-funds-unit-beijing-tears-down-foreign-ownership",
      "source": "South China Morning Post",
      "published": "20221121T184400",
      "overall_sentiment_score": 0.362602,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.337237,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.631627
    },
    {
      "title": "New chief investment strategist at PNC Asset Management Group",
      "summary": "PNC Asset Management Group has appointed Marc Dizard as its new chief investment strategist. Dizard brings significant experience to the role within PNC Financial Services Group Inc. The Pittsburgh Business Times piece highlights this key personnel change.",
      "url": "https://www.bizjournals.com/pittsburgh/news/2022/11/21/pnc-amg-promotes-cis.html",
      "source": "The Business Journals",
      "published": "20221121T180732",
      "overall_sentiment_score": -0.057026,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.127329,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.627158
    },
    {
      "title": "Leader of Walmart health business leaves for JPMorgan Chase",
      "summary": "Dr. Cheryl Pegus, head of Walmart's health and wellness business, is departing her role to join Morgan Health, a business unit of JPMorgan Chase. Morgan Health focuses on employer-sponsored health care.",
      "url": "https://www.bizjournals.com/bizwomen/news/latest-news/2022/11/walmart-health-and-wellness-business-head-leaves-f.html",
      "source": "The Business Journals",
      "published": "20221121T171647",
      "overall_sentiment_score": 0.194391,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.172083,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Así es Galicia Ventures, el nuevo programa de innovación para escalar startups de América Latina",
      "summary": "Grupo Financiero Galicia launched Galicia Ventures, an open innovation and corporate venturing program aimed at accelerating business transformation by investing in and forming alliances with Latin American startups. The program will focus on Fintech, Agtech, and Insurtech industries, both B2C and B2B, leveraging cross-cutting technologies like Web3, DeFi, Big Data, Blockchain, AI, and Cybersecurity. Galicia Ventures plans to contact 350 regional startups in 2023, aiming for 2-3 investments with an average ticket of US$250,000, and five business alliances.",
      "url": "https://www.forbesargentina.com/innovacion/asi-galicia-ventures-nuevo-programa-innovacion-escalar-startups-america-latina-n25097",
      "source": "Forbes Argentina",
      "published": "20221120T092400",
      "overall_sentiment_score": 0.367702,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.280078,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.555938
    },
    {
      "title": "Bitwise Launches Crypto ETF Despite SEC’s ETF Cold Feet",
      "summary": "Bitwise has launched the Crypto Industry Innovators ETF (BITQ), which invests in 30 companies deriving at least 75% of their income or net assets from cryptocurrency. This ETF offers investors exposure to the crypto economy through a familiar format, circumventing some complexities of direct digital asset ownership. While similar to other funds, BITQ is notable for being the first SEC-approved ETF to include \"crypto\" in its name, addressing investor comfort levels and advisor workflow challenges.",
      "url": "https://blockworks.co/news/bitwise-launches-crypto-etf-despite-secs-etf-cold-feet",
      "source": "Blockworks",
      "published": "20221118T030909",
      "overall_sentiment_score": 0.338459,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.126993,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.648286
    },
    {
      "title": "Peek inside JPMorgan's new downtown Seattle tech center",
      "summary": "JPMorgan has opened a new tech center in downtown Seattle, located in the 1201 Third tower. This center, which features collaborative work areas, is one of 11 such facilities the company operates across the U.S.",
      "url": "https://www.bizjournals.com/seattle/news/2022/11/20/jpmorgan-chase-tech-center-seattle.html",
      "source": "The Business Journals",
      "published": "20221120T171648",
      "overall_sentiment_score": 0.409457,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.422135,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.920295
    },
    {
      "title": "JPMorgan Chase bumps up parental leave to 16 weeks",
      "summary": "JPMorgan Chase is increasing its parental leave to 16 weeks for either parent, effective January 1, alongside expanded bereavement leave and up to four weeks of paid time off to care for seriously ill family members. The bank is also raising its full-time employee sick days from six to ten. These benefit enhancements aim to make JPMorgan competitive with other major banks in attracting and retaining talent.",
      "url": "https://www.bankingdive.com/news/jpmorgan-chase-16-weeks-parental-leave-bereavement-sick-days-stillbirth-miscarriage-parent-illness/636919/",
      "source": "Banking Dive",
      "published": "20221118T171646",
      "overall_sentiment_score": 0.208202,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.338526,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "JPMorgan Chase CEO Jamie Dimon backs spending on energy infrastructure during stop in San Antonio",
      "summary": "JPMorgan Chase CEO Jamie Dimon, during a stop in San Antonio, advocated for increased investment in energy infrastructure, stating that under-investment in oil and gas globally is causing shortages. He also commented on the recent U.S. elections, expressing hope that a divided Congress could lead to progress on issues like immigration and tax reform, and discussed the labor shortage in the San Antonio market. Dimon also reiterated his earlier warning about an impending economic \"hurricane\" and highlighted the war in Ukraine as the biggest geopolitical risk since World War II.",
      "url": "https://www.expressnews.com/business/local/article/JPMorgan-Chase-CEO-Jamie-Dimon-17587381.php",
      "source": "San Antonio Express-News",
      "published": "20221116T063500",
      "overall_sentiment_score": 0.17858,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.25213,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Crypto, unicorns and housing bubbles: JPMorgan Chase CEO Jamie Dimon talks economy in Austin",
      "summary": "JPMorgan Chase CEO Jamie Dimon visited Austin to discuss the economy, the implosion of FTX, and the future of banking. Dimon expressed optimism for Austin's future due to its pro-business environment and growth potential. He emphasized Texas's attractiveness for business and job creation.",
      "url": "https://www.bizjournals.com/austin/news/2022/11/15/jamie-dimon-visits-austin-chase-bank-branch.html",
      "source": "The Business Journals",
      "published": "20221115T171647",
      "overall_sentiment_score": 0.176536,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.427718,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "JPMorgan Chase chief Jamie Dimon bullish on Austin despite economic uncertainty",
      "summary": "JPMorgan Chase CEO Jamie Dimon visited Austin, reasserting the bank's commitment to expansion in the city and Texas despite economic uncertainties and a projected recession. JPMorgan Chase is growing its Austin workforce by 10% and leasing additional office space, contrasting with other tech firms that are retrenching. Dimon expressed concern about global geopolitical factors but indicated he is not worried about a housing market crash similar to 2008.",
      "url": "https://www.statesman.com/story/business/2022/11/15/jpmorgan-chase-chief-dimon-praises-austin-despite-economic-uncertainty/69646095007/",
      "source": "Austin American-Statesman",
      "published": "20221115T171647",
      "overall_sentiment_score": 0.118544,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.46139,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "JPMorgan American - Nov 2022",
      "summary": "This article provides an in-depth analysis of JPMorgan American (JAM) as of November 2022, highlighting its distinctive approach to US equity investing by blending growth and value styles. It discusses the fund's historical outperformance against its benchmark and peers since a strategic change in mid-2019, its low ongoing charge, and its resilient share price rating. The analysis also covers management changes, portfolio construction, and key investment characteristics.",
      "url": "https://www.trustintelligence.co.uk/investor/articles/fund-research-investor-jpmorgan-american-retail-nov-2022",
      "source": "trustintelligence.co.uk",
      "published": "20221121T171649",
      "overall_sentiment_score": 0.249704,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.451673,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Brookfield expands into Saudi Arabia to target kingdom’s riches",
      "summary": "Brookfield Asset Management Inc plans to expand into Saudi Arabia, joining BlackRock Inc and global banks to capitalize on investment opportunities in the Gulf economy. The move follows wide-ranging economic reforms in the kingdom and targets areas such as infrastructure, renewables, private equity, and real estate. Other major firms like Blackstone Inc and KKR & Co are also increasing their presence and efforts in the region, aiming for high-net-worth clients and exploring significant projects.",
      "url": "https://www.businesstimes.com.sg/companies-markets/banking-finance/brookfield-expands-saudi-arabia-target-kingdoms-riches",
      "source": "The Business Times",
      "published": "20221117T223200",
      "overall_sentiment_score": 0.241337,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.257176,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.81898
    },
    {
      "title": "PIMCO's ETF Transfer to NYSE Floor Trading Is a Key Milestone",
      "summary": "PIMCO's Active Bond ETF (BOND) has become the first active ETF to be traded from a booth on the NYSE floor, marking a significant milestone for the industry. This move is expected to enhance liquidity, improve price discovery, and reduce transaction costs for investors by adding human oversight from a Designated Market Maker. PIMCO launched its first active fixed income ETF in 2009 and continues to expand its lineup, with actively managed ETFs seeing accelerated adoption due to market volatility.",
      "url": "https://www.etftrends.com/pimcos-etf-nyse-floor-trading-is-a-key-milestone/",
      "source": "ETF Trends",
      "published": "20221114T161631",
      "overall_sentiment_score": 0.227817,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.337726,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.622718
    }
  ]
}