{
  "ticker": "JPM",
  "date": "2023-03-13",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T12:10:32.535786",
  "source": "alpha_vantage",
  "article_count": 15,
  "articles": [
    {
      "title": "Reininga Says Leading Lake Shore A ‘Privilege’",
      "summary": "Daniel P. Reininga, the retiring president and CEO of Lake Shore Bancorp, Inc., conducted a farewell tour as he concludes his tenure. Reininga led the bank through significant growth, increasing assets from $488 million to nearly $700 million, and oversaw its expansion into more communities. He emphasized the privilege of leading the organization and its focus on \"Putting People First.\"",
      "url": "https://www.post-journal.com/news/local-news/2023/03/reininga-says-leading-lake-shore-a-privilege/",
      "source": "Post Journal",
      "published": "20230310T150552",
      "overall_sentiment_score": 0.224856,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.120002,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.646084
    },
    {
      "title": "US Benchmark Series Announces Launch of the US Treasury 6 Month Bill ETF",
      "summary": "F/m Investments has launched the US Treasury 6 Month Bill ETF (XBIL), expanding its US Benchmark Series to offer simplified access to the US Treasury market. XBIL provides investors with a tax-efficient way to access the highest-yielding US Treasury security, aiming to respond to demand for competitive yields. The ETF offers monthly dividends, automatic rolls for constant benchmark exposure, and the ability to transact in smaller fractions of traditional bond sizing.",
      "url": "https://www.stocktitan.net/news/XBIL/us-benchmark-series-announces-launch-of-the-us-treasury-6-month-bill-mpyhefvhprfn.html",
      "source": "Stock Titan",
      "published": "20230307T220914",
      "overall_sentiment_score": 0.207673,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.094171,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.559961
    },
    {
      "title": "Golden Entertainment divests its slot-route operations",
      "summary": "Golden Entertainment announced the divestment of its distributed-gaming operations in Nevada and Montana to J&J Gaming for $322.5 million plus $39 million in cash. This strategic move allows Golden to focus on its wholly-owned casinos and taverns, and is expected to de-lever its balance sheet, potentially positioning it for further acquisitions or as an acquisition target itself. J.P. Morgan analysts anticipate significant benefits for investors due to the sale premium and business simplification.",
      "url": "https://cdcgaming.com/golden-entertainment-divests-its-slot-route-operations/",
      "source": "CDC Gaming",
      "published": "20230306T162600",
      "overall_sentiment_score": 0.361039,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.316246,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.62176
    },
    {
      "title": "TD completes $1.3 billion Cowen acquisition to advance US investment banking growth strategy",
      "summary": "TD Bank Group has finalized its all-cash $1.3 billion acquisition of Cowen, merging to form TD Cowen and significantly boosting TD's US investment banking capabilities. This acquisition adds Cowen's US equities sales trading, execution, and research expertise, expecting to increase pro-forma global revenues by over a third to approximately $6.8 billion. Jeffrey Solomon, Cowen's current CEO, will join TD Securities' senior leadership.",
      "url": "https://www.thetradenews.com/td-completes-1-3-billion-cowen-acquisition-to-advance-us-investment-banking-growth-strategy/",
      "source": "The TRADE",
      "published": "20230303T114200",
      "overall_sentiment_score": 0.585524,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.516647,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.647203
    },
    {
      "title": "First Trust Invests in Emerging Market Democracies With EMDM",
      "summary": "First Trust Advisors has launched the First Trust Bloomberg Emerging Market Democracies ETF (EMDM), focusing on companies in emerging market countries known for political rights and civil liberties. EMDM aims to address investor concerns about governance in emerging markets while providing exposure to their robust growth potential. This ETF screens countries designated as Electoral Democracies by Freedom House, ensuring a focus on rule of law and civil liberties.",
      "url": "https://etftrends.com/first-trust-invests-in-emerging-market-democracies-with-emdm/",
      "source": "ETF Trends",
      "published": "20230303T050057",
      "overall_sentiment_score": 0.266547,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.243643,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.630491
    },
    {
      "title": "Blackstone and Sixth Street Complete Sale of Kensington Mortgages to Barclays Bank UK PLC",
      "summary": "Blackstone and Sixth Street announced the completion of the sale of Kensington Mortgages to Barclays Bank UK PLC. The specialist mortgage lender, which was jointly owned by Blackstone and Sixth Street since 2015, had originated approximately £1.9 billion of mortgages in the year ended March 31, 2022. The sale, initially announced in June 2022, marks the culmination of Kensington's accelerated growth under their ownership.",
      "url": "https://sixthstreet.com/investment_announce/blackstone-and-sixth-street-complete-sale-of-kensington-mortgages-to-barclays-bank-uk-plc/",
      "source": "Sixth Street",
      "published": "20230301T000000",
      "overall_sentiment_score": 0.275435,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.250449,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.612881
    },
    {
      "title": "Baker Hughes Invests $50 Million to Support Unity Bank of Houston, Texas’ Sole Black-owned Banking Institution",
      "summary": "Baker Hughes announced a $50 million investment in Unity Bank of Houston, Texas' sole Black-owned banking institution, through J.P. Morgan Asset Management's Empower share class. This investment aims to support supplier diversification, advance racial equity by promoting growth for minority-owned businesses, and enhance economic development in underserved communities. The move reinforces Baker Hughes' commitment to community support and follows previous grants to Historically Black Colleges and Universities.",
      "url": "https://www.bakerhughes.com/company/news/baker-hughes-invests-50-million-support-unity-bank-houston-texas-sole-blackowned",
      "source": "Baker Hughes",
      "published": "20230227T000000",
      "overall_sentiment_score": 0.378281,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.315688,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.881077
    },
    {
      "title": "DocuSign makes surprise CFO transition announcement",
      "summary": "DocuSign's CFO, Cynthia Gaylor, who started in September 2022, unexpectedly announced her departure. This transition comes amidst DocuSign's exposure to the Silicon Valley Bank collapse and recent layoffs, causing concern among Wall Street analysts and a drop in the company's stock. DocuSign asserts Gaylor's departure is unrelated to the SVB situation and has initiated a search for her replacement.",
      "url": "https://www.cfodive.com/news/docusign-makes-surprise-cfo-transition-announcement/644844/",
      "source": "CFO Dive",
      "published": "20230313T142955",
      "overall_sentiment_score": -0.155669,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": 0.119218,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.615065
    },
    {
      "title": "TD Bank Completes Cowen Acquisition to Deepen Investment Banking Footprint",
      "summary": "TD Bank Group has completed the acquisition of New York-based Cowen Inc. for $1.3 billion, a move first announced in August 2022. This acquisition aims to significantly deepen TD Bank's investment banking capabilities and expand its presence in the U.S. market, integrating Cowen's expertise and talent into TD Securities. Jeffrey Solomon, Cowen's chairman and CEO, will join TD Securities' senior leadership.",
      "url": "https://www.pymnts.com/acquisitions/2023/td-bank-completes-cowen-acquisition-to-deepen-investment-banking-footprint/",
      "source": "PYMNTS.com",
      "published": "20230301T000000",
      "overall_sentiment_score": 0.470243,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.319105,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.602911
    },
    {
      "title": "Schwab U.S. Large-Cap Value ETF Holdings List (NYSEARCA:SCHV)",
      "summary": "This article provides a list of the top 25 holdings of the Schwab U.S. Large-Cap Value ETF (NYSEARCA: SCHV). The ETF's holdings include major companies like Berkshire Hathaway, JPMorgan Chase & Co., and Exxon Mobil, detailing their current price, weight within the ETF, and shares held. The data reflects the closing prices as of January 2, 2026.",
      "url": "https://www.marketbeat.com/stocks/NYSEARCA/SCHV/holdings/",
      "source": "MarketBeat",
      "published": "20230228T130905",
      "overall_sentiment_score": 0.150726,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.243922,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.648404
    },
    {
      "title": "Chae Initiative Visits New York Private Sector Leaders",
      "summary": "The Chae Initiative in Private Sector Leadership at Yale Law School organized its inaugural student trip to New York City, allowing students to explore finance careers and connect with prominent leaders and alumni. The 21 students visited major financial firms, learned from key executives like Michael Chae and Stephen Schwarzman of Blackstone, and met with other industry figures such as Greg Fleming of Rockefeller Capital Management and Joe Tsai of Alibaba Group. The trip aimed to provide an immersive experience, foster a sense of community among students and alumni, and highlight diverse career paths in the finance sector.",
      "url": "https://law.yale.edu/yls-today/news/chae-initiative-visits-new-york-private-sector-leaders",
      "source": "Yale Law School",
      "published": "20230227T000000",
      "overall_sentiment_score": 0.225298,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.208496,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.607124
    },
    {
      "title": "Chase Bank plans Shorewood branch",
      "summary": "Chase Bank plans to open a new branch office in Shorewood, having leased space for the location. This new branch will take over a site previously occupied by PNC Bank. The expansion continues Chase Bank's presence in the Milwaukee area.",
      "url": "https://www.bizjournals.com/milwaukee/news/2023/03/01/chase-bank-could-add-shorewood-branch.html",
      "source": "The Business Journals",
      "published": "20230301T152539",
      "overall_sentiment_score": 0.111378,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.124378,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 1.0
    },
    {
      "title": "Houston’s Unity National Bank to benefit from $50 million investment by Baker Hughes",
      "summary": "Unity National Bank, Texas's only Black-owned bank, is set to receive a $50 million investment from Baker Hughes through J.P. Morgan Asset Management's Empower share class program. This investment aims to boost Unity's offerings in underserved communities, fostering economic development and advancing racial equality. Baker Hughes' CFO Nancy Buese emphasized the company's commitment to supplier diversity and creating sustainable change through this initiative.",
      "url": "https://www.houstonpublicmedia.org/articles/finances/2023/02/28/444901/houstons-unity-national-bank-receives-50-million-investment-from-baker-hughes/",
      "source": "Houston Public Media",
      "published": "20230228T124800",
      "overall_sentiment_score": 0.259982,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.259127,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.725019
    },
    {
      "title": "'Bond ladders are cool again,' says advisor. Here's how to capture higher Treasury bill yields",
      "summary": "Financial experts suggest Treasury bill ladders as a strategy to capture higher yields amidst rising interest rates. This strategy involves staggered T-bill maturities, allowing investors to reinvest at higher rates or reallocate funds. T-bills are considered a relatively safe asset, backed by the U.S. government, offering an attractive alternative to traditional savings options in the current inverted yield curve environment.",
      "url": "https://www.cnbc.com/2023/02/27/how-to-build-a-treasury-bill-ladder-to-capture-higher-yields.html",
      "source": "CNBC",
      "published": "20230227T144400",
      "overall_sentiment_score": 0.2596,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.121899,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.6096
    },
    {
      "title": "Ax the ‘woke’ American Express philosophy",
      "summary": "This article criticizes American Express for adopting \"woke\" corporate philosophies and diversity training, particularly since 2020. The author, a self-proclaimed happy AmEx customer, argues that these initiatives, which he describes as advancing Critical Race Theory and creating division, are baffling for a company named \"American Express.\" While some companies have reportedly scaled back similar training, the article questions if AmEx has truly done so, despite the company's significant market value growth under CEO Stephen Squeri.",
      "url": "https://nypost.com/2023/03/11/ax-the-woke-american-express-philosophy/",
      "source": "New York Post",
      "published": "20230311T204500",
      "overall_sentiment_score": -0.183124,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.140385,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.625445
    }
  ]
}