{
  "ticker": "JPM",
  "date": "2023-08-07",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T12:13:17.661031",
  "source": "alpha_vantage",
  "article_count": 12,
  "articles": [
    {
      "title": "Nuevo presidente de Banca de Inversión Luis Ignacio Gómez",
      "summary": "Luis Ignacio Gómez has been appointed as the new president of Banca de Inversión Bancolombia S.A. Corporación Financiera, a subsidiary of Grupo Bancolombia. He will assume the role on September 1, 2023, bringing over 20 years of experience within the Grupo Bancolombia, including a decade in investment banking and most recently as vice president of Real Estate and Construction. Gómez aims to further strengthen the company's leadership in capital markets, structured finance, and M&A, building on the $20.6 trillion mobilized last year.",
      "url": "https://www.bancolombia.com/acerca-de/sala-prensa/noticias/resultados-corporativos/nuevo-precidente-banca-inversion-luis-ignacio-gomez",
      "source": "Bancolombia",
      "published": "20230804T000000",
      "overall_sentiment_score": 0.313351,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.206318,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.627629
    },
    {
      "title": "BofA holds No. 1 position in corporate bond underwriting, with Wells Fargo moving up to No. 2 as the overall pie shrinks",
      "summary": "BofA Securities retained its top position in corporate bond underwriting as of August 1, 2023, despite a significant decline in its handled dollar volume compared to the previous year. Wells Fargo Securities LLC ascended to the second spot, surpassing JPMorgan Chase & Co. The overall U.S. corporate debt offerings for the year-to-date experienced a sharp decrease from $137.5 billion to $65.8 billion, reflecting a slowdown in deal-making.",
      "url": "https://www.marketwatch.com/story/bofa-holds-no-1-position-in-corporate-bond-underwriting-with-wells-fargo-moving-up-to-no-2-as-the-overall-pie-shrinks-c5bf7112?gaa_at=eafs&gaa_n=AWEtsqdFjWZX_BAiJ-XsYQ6_0APdS1OWfOS677GcNglboYXakhAdS9UgyGFE&gaa_ts=6907698d&gaa_sig=_61rwKDtt8o1NijM-9VEvH-GyRiaH8KDYdI3JmUvsfM3ksVW3gtATFEuH0tbox_7Jo49p580GHGtL9Vh-hyO5g%3D%3D",
      "source": "MarketWatch",
      "published": "20230803T150100",
      "overall_sentiment_score": 0.068862,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.081277,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.678266
    },
    {
      "title": "Morgan Stanley sells student loan benefits provider to Vestwell",
      "summary": "Morgan Stanley is selling Gradifi Solutions, a student loan benefits provider, to Vestwell, a workplace savings fintech. This acquisition expands Vestwell's offerings beyond retirement savings and into broader workplace benefits, aiming to assist employers with the high student loan debt among U.S. individuals. The deal includes Gradifi's technology, clients, and team members, further strengthening Vestwell's position in the financial services market.",
      "url": "https://www.investmentnews.com/retirement-planning/morgan-stanley-sells-student-loan-benefits-provider-to-vestwell/240513",
      "source": "InvestmentNews",
      "published": "20230728T151052",
      "overall_sentiment_score": 0.156849,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.101154,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.606235
    },
    {
      "title": "BBVA names Luisa Gómez Bravo as CFO and Javier Rodríguez Soler as Head of Sustainability and Corporate & Investment Banking (CIB)",
      "summary": "BBVA has appointed Luisa Gómez Bravo as its new CFO, replacing Rafael Salinas Martínez de Lecea. Concurrently, Javier Rodríguez Soler will assume the additional role of Head of Sustainability and Corporate & Investment Banking (CIB). These appointments aim to bolster BBVA's leadership in profitability, financial strength, and sustainability efforts, while also driving its wholesale banking business.",
      "url": "https://www.bbva.com/en/bbva-names-luisa-gomez-bravo-as-cfo-and-javier-rodriguez-soler-as-head-of-sustainability-and-corporate-investment-banking-cib/",
      "source": "BBVA",
      "published": "20230727T000000",
      "overall_sentiment_score": 0.063477,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.124302,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.633588
    },
    {
      "title": "With market cooking, Ameriprise advisors see boost in revenue",
      "summary": "Ameriprise Financial advisors experienced a 7.4% year-over-year increase in revenue productivity, reaching $874,000 per advisor at the end of June, signaling recovery after the 2022 bear market. This growth is attributed to clients realizing the value of their advisors during market downturns, with the company's advice and wealth management unit reporting a 14% increase in net revenues and a 49% rise in pretax adjusted operating earnings for the quarter. The firm's advisor count remained essentially flat, ending June with 10,274 financial advisors.",
      "url": "https://www.investmentnews.com/practice-management/with-market-cooking-ameriprise-advisors-see-boost-in-revenue/240442",
      "source": "InvestmentNews",
      "published": "20230727T000000",
      "overall_sentiment_score": 0.329117,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.2461,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.610027
    },
    {
      "title": "Amazon set to launch credit card in Brazil with Bradesco",
      "summary": "Amazon.com is partnering with Brazilian lender Banco Bradesco SA to launch a credit card offering in Brazil. The launch is scheduled for next Tuesday, with Bradesco managing the credit risk and Mastercard powering the card. This move expands Amazon's fintech offerings in a market where interest rates are beginning to decline.",
      "url": "https://www.reuters.com/business/finance/amazon-set-launch-credit-card-brazil-with-bradesco-2023-08-04/",
      "source": "Reuters",
      "published": "20230804T195900",
      "overall_sentiment_score": 0.320534,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.149441,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.630503
    },
    {
      "title": "Bank of America Reversed Recession Call on Strong Jobs and Spending, CEO Says",
      "summary": "Bank of America CEO Brian Moynihan announced the firm reversed its recession prediction due to robust job growth and strong consumer spending. Moynihan noted that consumers are employed and actively spending, leading to a \"pretty good equilibrium.\" He also cautioned about potential risks associated with proposed capital rules for large banks.",
      "url": "https://www.bloomberg.com/news/articles/2023-08-03/bofa-ceo-says-reversed-recession-call-on-strong-jobs-spending",
      "source": "Bloomberg.com",
      "published": "20230803T142300",
      "overall_sentiment_score": 0.327393,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.338008,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.624929
    },
    {
      "title": "JP Morgan Maintains Advanced Micro Devices (AMD) Neutral Recommendation",
      "summary": "JP Morgan has maintained a Neutral recommendation for Advanced Micro Devices (AMD), with an average one-year price target suggesting a 19.45% upside. The article highlights strong institutional ownership, projected revenue growth, and key financial holdings in the company. It also includes background information on AMD and its recent financial results for Q2 2023.",
      "url": "https://www.nasdaq.com/articles/jp-morgan-maintains-advanced-micro-devices-amd-neutral-recommendation",
      "source": "Nasdaq",
      "published": "20230802T203800",
      "overall_sentiment_score": 0.118606,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.044194,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.637687
    },
    {
      "title": "Hedge Fund and Insider Trading News: Daniel Loeb, David Einhorn, Balyasny Asset Management, Coatue Management, Man Group, Mobivity Holdings Corp. (MFON), EOS Energy Enterprises Inc (EOSE), and More",
      "summary": "This article compiles recent news from the hedge fund and insider trading world, featuring updates on prominent figures like Daniel Loeb and David Einhorn, and firms such as Balyasny Asset Management, Coatue Management, and Man Group. Key developments include Daniel Loeb reducing bearish bets, Coatue Management raising a smaller-than-target early-stage fund, Man Group facing a stock decline despite increased client assets, and Sculptor Capital Management agreeing to sell itself to Rithm Capital. The article also touches on market commentary from contrarian investor Doug Kass.",
      "url": "https://www.insidermonkey.com/blog/hedge-fund-and-insider-trading-news-daniel-loeb-david-einhorn-balyasny-asset-management-coatue-management-man-group-mobivity-holdings-corp-mfon-eos-energy-enterprises-inc-eose-and-more-1175207/",
      "source": "Insider Monkey",
      "published": "20230801T131700",
      "overall_sentiment_score": 0.038219,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.025973,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.630328
    },
    {
      "title": "Investors Move Into Invesco’s Bank ETF as Sector Rallies",
      "summary": "Invesco's KBW Bank ETF (KBWB) has seen significant inflows, with $197 million in net flows over a week and $546 million over four weeks, driven by a rebound in the banking sector after positive second-quarter earnings. The ETF's top holdings, including Bank of America and JPMorgan Chase, have outperformed the S&P 500. This inflow marks a recovery in investor interest after substantial outflows during the banking crisis in March.",
      "url": "https://etftrends.com/innovative-etfs-channel/investors-move-invescos-bank-etf-sector-rallies/",
      "source": "ETF Trends",
      "published": "20230728T090913",
      "overall_sentiment_score": 0.331986,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.345817,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.718152
    },
    {
      "title": "JPMorgan Gains Ground as BlackRock’s Grip on ETF Market Loosens",
      "summary": "JPMorgan Asset Management is experiencing a stellar year, capturing a significant share of ETF flows in 2023, while BlackRock Inc., though still the largest, is seeing an unusually tepid year in terms of inflows for its ETFs. This shift is partly driven by increasing investor interest in actively managed strategies. Despite a recent resurgence for BlackRock's passive lineup, JPMorgan's actively managed funds like JEPI are challenging the traditional duopoly in the US ETF market.",
      "url": "https://www.wealthmanagement.com/etfs/jpmorgan-gains-ground-as-blackrock-s-grip-on-etf-market-loosens",
      "source": "WealthManagement.com",
      "published": "20230726T145931",
      "overall_sentiment_score": 0.187777,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.445232,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Diversify Emerging Markets Exposure Away From Xi’s Control With ROAM",
      "summary": "Many emerging markets investors are seeking to diversify away from Chinese companies while maintaining performance. The Hartford Multifactor Emerging Markets ETF (ROAM) offers a solution by underweighting mega-cap tech and China compared to its peers and the MSCI Emerging Markets index. ROAM has notably outperformed competitor ETFs like VWO, SPEM, and SCHE over various periods, providing broad emerging market exposure with a multifactor strategy designed to reduce volatility.",
      "url": "https://etfdb.com/multi-factor-content-hub/diversify-emerging-markets-exposure-roam/",
      "source": "ETF Database",
      "published": "20230725T151011",
      "overall_sentiment_score": -0.218708,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.122443,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.639014
    }
  ]
}