{
  "ticker": "JPM",
  "date": "2024-12-02",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T12:57:56.564582",
  "source": "alpha_vantage",
  "article_count": 22,
  "articles": [
    {
      "title": "Talk Your Book: J.P. Morgan’s Guide to ETFs",
      "summary": "This article features a discussion from J.P. Morgan Asset Management on various aspects of ETFs, including the origins of ETF flows, the growth and decline of thematic ETF flows, and why the AGG bond ETF lacks bond variety. The conversation also touches on why fixed income indices are easier to outperform than equity indices and the potential for private assets within an ETF structure.",
      "url": "https://awealthofcommonsense.com/2024/12/talk-your-book-guide-to-etfs/",
      "source": "A Wealth of Common Sense",
      "published": "20241202T000000",
      "overall_sentiment_score": 0.144717,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.130621,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 1.0
    },
    {
      "title": "JPM Ratings Upgraded by S&P Global: A Proof of Strength and Resilience",
      "summary": "S&P Global Ratings has upgraded JPMorgan's long- and short-term issuer credit ratings to A and A-1, respectively, with a stable long-term outlook. This upgrade reflects JPMorgan's strong fundamentals, diverse business model, market leadership, and robust capital position. The company's exceptional profitability, strong asset quality, leading deposit base, and strategic management were key factors in S&P Global's decision.",
      "url": "https://finance.yahoo.com/news/jpm-ratings-upgraded-p-global-115500520.html",
      "source": "Yahoo Finance",
      "published": "20241118T000000",
      "overall_sentiment_score": 0.37171,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.728104,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.971913
    },
    {
      "title": "Will Active ETFs Outnumber Passive ETFs?",
      "summary": "The number of actively managed ETFs is rapidly growing, outpacing the launch of index-tracking funds, leading to speculation that they could soon outnumber passive ETFs in the US. This surge is driven by investor demand for ETF structures over mutual funds and facilitated by regulatory changes, though assets in active ETFs remain significantly lower than passive ones. The growth is particularly notable in systematic and derivatives-based strategies, as well as bond ETFs, rather than traditional stock-picking funds.",
      "url": "https://www.morningstar.com/funds/will-active-etfs-outnumber-passive-etfs",
      "source": "Morningstar",
      "published": "20241119T000000",
      "overall_sentiment_score": 0.238548,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.418505,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.648385
    },
    {
      "title": "Deutsche Bank Sticks Out Among Financiers of Peabody Loan",
      "summary": "Deutsche Bank AG was the sole European lender in Peabody Energy Corp.'s $2.1 billion bridge loan to acquire coal assets from Anglo American Plc. This financing package also involved units of KKR & Co. and Jefferies Financial Group Inc., highlighting Deutsche Bank's unique position given its public environmental, social, and governance (ESG) commitments. The German bank stands out among its peers which are increasingly retracting from financing fossil fuel projects.",
      "url": "https://www.bloomberg.com/news/articles/2024-12-02/deutsche-bank-cuts-a-lonely-figure-in-2-1-billion-peabody-loan",
      "source": "Bloomberg.com",
      "published": "20241202T200000",
      "overall_sentiment_score": 0.139481,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.136258,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.64357
    },
    {
      "title": "ICLV: Value With Some Tech Exposure (NYSEARCA:ILCV)",
      "summary": "The iShares Morningstar Value ETF (ILCV) offers a diversified portfolio of 444 large- and mid-cap U.S. stocks with a low expense ratio of 0.04%. It balances traditional value sectors like Financials and Industrials with growth areas such as Information Technology and Health Care. This mix provides pure domestic market exposure and aims for a balanced risk-return profile, despite some concentration in the Financial sector.",
      "url": "https://seekingalpha.com/article/4739586-ilcv-value-with-some-tech-exposure",
      "source": "Seeking Alpha",
      "published": "20241122T083100",
      "overall_sentiment_score": 0.192152,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.115337,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.641618
    },
    {
      "title": "BlackRock accused of contributing to climate and human rights abuses",
      "summary": "BlackRock, the world's largest asset manager, faces a complaint to the OECD alleging it contributes to climate and human rights abuses by investing in agribusinesses linked to deforestation. Friends of the Earth US and the Articulation of Indigenous Peoples of Brazil filed the complaint, stating BlackRock has increased investments in companies implicated in environmental devastation despite warnings. BlackRock refutes the claims, stating that the complaint is meritless and that the majority of holdings are in index funds chosen by clients.",
      "url": "https://www.theguardian.com/environment/2024/nov/20/blackrock-climate-human-rights",
      "source": "The Guardian",
      "published": "20241120T100000",
      "overall_sentiment_score": -0.460291,
      "overall_sentiment_label": "Bearish",
      "ticker_sentiment_score": -0.428906,
      "ticker_sentiment_label": "Bearish",
      "relevance_score": 0.635022
    },
    {
      "title": "J.P. Morgan Sticks to Their Buy Rating for Newmont Corporation CHESS (NEM)",
      "summary": "J.P. Morgan maintained a Buy rating on Newmont Corporation CHESS (NEM) with a price target of A$178.00. Another firm, TR | OpenAI – 4o, also reiterated a Buy rating with a A$152.00 price target. The company reported strong Q2 earnings with a quarterly revenue of A$5.32 billion and a net profit of A$2.06 billion, demonstrating significant growth from the previous year.",
      "url": "https://www.theglobeandmail.com/investing/markets/stocks/NEM/pressreleases/36179508/jp-morgan-sticks-to-their-buy-rating-for-newmont-corporation-chess-nem/",
      "source": "The Globe and Mail",
      "published": "20241118T122400",
      "overall_sentiment_score": 0.345693,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.209498,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.624186
    },
    {
      "title": "Ovintiv acquires Montney assets from Paramount",
      "summary": "Ovintiv Inc. has announced the acquisition of Montney assets from Paramount Resources Ltd. for approximately US$2.377 billion, adding significant production and land in the Montney oil window. Concurrently, Ovintiv is selling its Uinta Basin assets for about US$2.0 billion. These combined transactions are projected to increase 2025 Non-GAAP Free Cash Flow by approximately US$300 million and enhance free cash flow per share by 20%, supporting the company's \"durable returns strategy.\"",
      "url": "https://www.oilfieldtechnology.com/drilling-and-production/18112024/ovintiv-acquires-montney-assets-from-paramount/",
      "source": "Oilfield Technology",
      "published": "20241118T100000",
      "overall_sentiment_score": 0.230234,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.119038,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.619926
    },
    {
      "title": "Public pressure mounts for Kiwisaver funds to invest ethically",
      "summary": "Public pressure is increasing on New Zealand's Kiwisaver funds to divest from companies with ties to Israel's military and settlements. A campaign is specifically targeting ASB due to its investments in Motorola Solutions, leading to a petition signed by thousands threatening to switch banks if ASB does not divest. Other major banks like BNZ, ANZ, and Westpac have also held investments in such companies, with some having recently divested due to similar pressures.",
      "url": "https://thespinoff.co.nz/business/18-11-2024/public-pressure-mounts-for-kiwisaver-funds-to-invest-ethically",
      "source": "The Spinoff",
      "published": "20241118T000000",
      "overall_sentiment_score": -0.270933,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.248359,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.615477
    },
    {
      "title": "Wynn Al Marjan building structure 55pct complete: promoter",
      "summary": "Wynn Al Marjan Island, a casino resort in the UAE by Wynn Resorts Ltd, is on track for \"topping off in December 2025\" and a Q1 2027 opening. The structural concrete is 55 percent complete, with the main resort tower's concrete structure finished up to the 26th floor. The project, valued at US$5.1 billion, is expected to generate at least US$1.33 billion annually in gross gaming revenue.",
      "url": "https://www.ggrasia.com/wynn-al-marjan-building-structure-55pct-complete-promoter",
      "source": "GGRAsia",
      "published": "20241122T000000",
      "overall_sentiment_score": 0.286475,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.109671,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.615425
    },
    {
      "title": "PG&E Corporation Announces Launch of Concurrent Offerings of Common Stock and Mandatory Convertible Preferred Stock",
      "summary": "PG&E Corporation announced the launch of concurrent public offerings totaling $2.4 billion, consisting of common stock and mandatory convertible preferred stock. The company intends to use the net proceeds for general corporate purposes, including its five-year capital investment plan. J.P. Morgan, Barclays, and Citigroup are acting as joint book-running managers for the offerings.",
      "url": "https://www.prnewswire.com/news-releases/pge-corporation-announces-launch-of-concurrent-offerings-of-common-stock-and-mandatory-convertible-preferred-stock-302319569.html",
      "source": "PR Newswire",
      "published": "20241202T070500",
      "overall_sentiment_score": 0.102245,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.115125,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.610617
    },
    {
      "title": "Santander Asset Management en Chile designa dos nuevos directores luego de renuncias y completa cargos",
      "summary": "Santander Asset Management in Chile has appointed two new directors, Pedro Orellana Piñeiro and Patricia Pérez Pallacán, to fill vacancies created by resignations, including that of Jesús Martín Del Burgo. This move completes its board of directors. The new appointees bring extensive experience from within the Santander Group and are civil engineers by profession.",
      "url": "https://rankiapro.com/latam/noticias/santander-asset-management-en-chile-designa-dos-nuevos-directores-luego-de-renuncias-y-completa-cargos/",
      "source": "RankiaPro",
      "published": "20241120T000000",
      "overall_sentiment_score": 0.130206,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.110984,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.608205
    },
    {
      "title": "Get Active Small Cap Exposure as Russell 2000 Hits New High",
      "summary": "The Russell 2000's recent all-time high suggests small-cap companies could offer significant upside, especially with potential policy changes under a new presidential administration. After a decade of underperformance compared to large caps, actively managed funds like the Neuberger Berman Small-Mid Cap ETF (NBSM) provide diversified exposure and professional analysis to capitalize on this trend. NBSM offers a balanced approach by including both small and mid-cap companies, leveraging active management's flexibility to adjust to market conditions.",
      "url": "https://etftrends.com/megatrends-channel/get-active-small-cap-exposure-russell-2000-hits-new-high/",
      "source": "ETF Trends",
      "published": "20241125T041310",
      "overall_sentiment_score": 0.23643,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.129098,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.606657
    },
    {
      "title": "The Schwab Mortgage-Backed Securities ETF (SMBS) Starts Trading",
      "summary": "Schwab Asset Management has launched the Schwab Mortgage-Backed Securities ETF (SMBS) with an expense ratio of 0.03%. This new ETF aims to track the Bloomberg US MBS Float Adjusted Total Return Index and invests in investment-grade mortgage-backed securities guaranteed by U.S. government agencies. The launch coincides with Schwab Asset Management's 15th anniversary in the ETF space, reinforcing its commitment to low-cost investment solutions.",
      "url": "https://markets.financialcontent.com/stocks/article/bizwire-2024-11-19-the-schwab-mortgage-backed-securities-etf-smbs-starts-trading?Language=english",
      "source": "FinancialContent",
      "published": "20241119T090000",
      "overall_sentiment_score": 0.24643,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.121634,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.604104
    },
    {
      "title": "Kkr sells OneStream shares for $191 million",
      "summary": "KKR, a private equity firm, sold 9,593,134 shares of OneStream, Inc. (NASDAQ:OS) Class A Common Stock for approximately $191.2 million, resulting in KKR entities no longer holding common stock in OneStream. This sale follows a public offering and comes amidst positive analyst ratings and strong financial indicators for OneStream, despite a recent stock dip and current unprofitability. Analysts, however, predict OneStream will become profitable this year, with strong revenue growth and gross profit margins.",
      "url": "https://www.investing.com/news/insider-trading-news/kkr-sells-onestream-shares-for-191-million-93CH-3729250",
      "source": "Investing.com",
      "published": "20241118T212300",
      "overall_sentiment_score": 0.135074,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.103487,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.60279
    },
    {
      "title": "J.P. Morgan Downgrades Alexandria Real Estate on Soft Life Sciences Leasing Demand",
      "summary": "J.P. Morgan downgraded Alexandria Real Estate Equities to neutral from overweight due to weak leasing demand in the life sciences sector and an oversupply of available properties in key markets. The bank also revised down its funds from operations per share forecasts for 2024, 2025, and 2026, citing slower core growth, lease expirations, and rising ground rent charges. Management is expected to address these challenges and outline a plan for FFO per share development at its upcoming investor day.",
      "url": "https://finance.yahoo.com/news/j-p-morgan-downgrades-alexandria-191810949.html",
      "source": "Yahoo Finance",
      "published": "20241127T000000",
      "overall_sentiment_score": -0.109783,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.145059,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.600423
    },
    {
      "title": "FAT Brands Announces Refinancing of Twin Peaks Credit Facility",
      "summary": "FAT Brands Inc. announced the refinancing of Twin Peaks Credit Facility through the issuance of new notes totaling $416,711,000, with a weighted average interest rate of 9.5% per annum. This refinancing, a major step before the planned public listing of Twin Hospitality Group, aims to stabilize Twin Peaks' financial structure and drive growth. Jefferies LLC acted as the sole structuring agent and bookrunner for the transaction.",
      "url": "https://www.globenewswire.com/news-release/2024/11/18/2982558/0/en/FAT-Brands-Announces-Refinancing-of-Twin-Peaks-Credit-Facility.html",
      "source": "GlobeNewswire",
      "published": "20241118T060000",
      "overall_sentiment_score": 0.238762,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.102002,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.600131
    },
    {
      "title": "First Foundation Bank taps new CEO to lead turnaround effort",
      "summary": "First Foundation Bank has appointed Tom Shafer, former TCF Bank CEO, as its new CEO to lead a turnaround effort. Shafer comes out of retirement to succeed the bank's longtime CEO and address challenges faced since the Silicon Valley Bank failure in early 2023. His experience with bank mergers and acquisitions is expected to be key in this role.",
      "url": "https://www.bizjournals.com/dallas/news/2024/11/27/tom-shafer-first-foundation-bank-ceo.html",
      "source": "The Business Journals",
      "published": "20241127T000000",
      "overall_sentiment_score": 0.051581,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.10511,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.5954
    },
    {
      "title": "Dealmaker sees more urge to merge among smaller banks — yours may be among them",
      "summary": "A dealmaker predicts an increase in mergers among smaller banks with $10 billion or less in assets, starting in 2025. This trend is driven by the need for these banks to achieve scale to invest in new technologies like AI. Citizens Vice Chair Don McCree suggests that banks with lower price-to-tangible book value might be prime candidates for these tie-ups.",
      "url": "https://www.marketwatch.com/story/dealmaker-sees-more-urge-to-merge-among-smaller-banks-yours-may-be-among-them-738dc3e7?gaa_at=eafs&gaa_n=AWEtsqezuM_nVMCkmoGQANSmtDrjQYAy_Oa47-iHQ78hrRwTsjdGqb6jwfGo&gaa_ts=69075597&gaa_sig=MF_ykO74U6d-SU_DViogrIndNt84s-7OitOA5-Gom6OOlAT28A8vJ7PAby-2eq8j8d8E1AXMM_PutDhX9SyBhQ%3D%3D",
      "source": "MarketWatch",
      "published": "20241125T130000",
      "overall_sentiment_score": 0.34853,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.42672,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.578902
    },
    {
      "title": "Risk-Off Sentiment Puts Global Bonds Back in Focus",
      "summary": "Escalating global tensions are driving a risk-off sentiment, pushing investors towards safe-haven assets like bonds. The article suggests that international bond exposure is an ideal strategy to diversify portfolios, noting that geopolitical factors can significantly impact financial markets. It highlights the Vanguard Total World Bond ETF (BNDW) as a way to gain broad, diversified exposure to both U.S. and international investment-grade bonds.",
      "url": "https://www.etftrends.com/fixed-income-channel/risk-off-sentiment-global-bonds-focus/",
      "source": "ETF Trends",
      "published": "20241127T000000",
      "overall_sentiment_score": 0.160019,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": -0.121423,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.55738
    },
    {
      "title": "ETFs: No One is Stealing iShares' Crown | Morningstar UK",
      "summary": "iShares maintains its dominant position in the European ETF market, managing 43% of total ETF assets and leading in inflows for the first ten months of 2024. While iShares holds its crown, strong competition exists among other providers like State Street and Vanguard, who have seen significant organic growth due to strategic fee cuts and popular products. The overall trend shows European passive management growing significantly faster than active counterparts.",
      "url": "https://global.morningstar.com/en-gb/etfs/etf-providers-want-be-one-stop-shop",
      "source": "Morningstar Canada",
      "published": "20241127T000000",
      "overall_sentiment_score": 0.238605,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.113987,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.55414
    },
    {
      "title": "Putin’s pipeline: How the Kremlin outmaneuvered Western oil companies to wrest control of vast flows of Kazakhstan’s crude",
      "summary": "This article details how the Kremlin gradually gained control over the Caspian Pipeline Consortium (CPC), outmaneuvering Western oil companies like Chevron, despite significant financial investments and environmental concerns. It highlights allegations of corruption, the use of strong-arm tactics by Russia, and how the pipeline became a geopolitical tool for Putin, especially amid the war in Ukraine. The investigation also reveals how Western companies and governments lobbied to keep the CPC pipeline exempt from sanctions due to its critical role in global oil supply.",
      "url": "https://www.icij.org/investigations/caspian-cabals/kazakhstan-caspian-oil-pipeline-russia-chevron/",
      "source": "International Consortium of Investigative Journalists - ICIJ",
      "published": "20241122T000000",
      "overall_sentiment_score": -0.115336,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.12319,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.551735
    }
  ]
}