{
  "ticker": "JPM",
  "date": "2024-02-12",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T12:15:27.365751",
  "source": "alpha_vantage",
  "article_count": 13,
  "articles": [
    {
      "title": "Banks in Talks to Finance $13 Billion DocuSign Buyout Deal",
      "summary": "JPMorgan Chase & Co. and Bank of America Corp. are among several Wall Street banks in discussions to provide up to $8 billion in financing for a potential $13 billion buyout of DocuSign Inc. Jefferies Financial Group Inc. and Deutsche Bank AG are also considering financing roles for what could be the largest leveraged buyout of the year. The financing package may also involve private credit firms and preferred equity.",
      "url": "https://www.bloomberg.com/news/articles/2024-02-01/jpmorgan-bofa-in-talks-to-finance-13-billion-docusign-buyout",
      "source": "Bloomberg.com",
      "published": "20240201T195900",
      "overall_sentiment_score": 0.145055,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.140333,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.844978
    },
    {
      "title": "BofA cuts CEO pay following 2023 profit decline",
      "summary": "Bank of America reduced CEO Brian Moynihan's total compensation by 3% to $29 million for 2023, following a year where the bank's profit declined and its shares underperformed rivals. This marks the second consecutive year of a pay cut for Moynihan. The board acknowledged Moynihan's leadership amidst economic uncertainty despite the financial performance.",
      "url": "https://www.investmentnews.com/wirehouses/bofa-cuts-ceo-pay-following-2023-profit-decline/248939",
      "source": "InvestmentNews",
      "published": "20240205T000000",
      "overall_sentiment_score": 0.108232,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.300001,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.730495
    },
    {
      "title": "Vanguard Debuts Pair of Muni Bond Funds",
      "summary": "Vanguard has launched two new municipal bond ETFs, the Vanguard Intermediate-Term Tax Exempt Bond ETF (VTEI) and the Vanguard California Tax-Exempt Bond ETF (VTEC). These passively managed funds offer tax benefits, low expense ratios of 0.08%, and aim to protect investors while inflation cools. The introduction of these funds caters to investor demand for low-risk, low-cost options, particularly for those in high tax brackets seeking alternatives to Treasury bonds.",
      "url": "https://www.etf.com/sections/news/vanguard-debuts-pair-muni-bond-funds",
      "source": "ETF.com",
      "published": "20240131T000000",
      "overall_sentiment_score": 0.283295,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.230255,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.64863
    },
    {
      "title": "India is winning over investors as Chinese stocks struggle, these charts show",
      "summary": "India is increasingly attracting investor attention as its stock market outperforms struggling Chinese stocks, as indicated by exchange-traded funds. Analysts anticipate India's economy will grow faster than China's this year, driven by favorable demographics and its position to benefit from global supply chain shifts. Barclays analysts specifically highlight the Indian consumer as a key growth engine for both the domestic and global economies.",
      "url": "https://www.marketwatch.com/story/india-is-winning-over-investors-as-chinese-stocks-struggle-these-charts-show-b2ad213f?gaa_at=eafs&gaa_n=AWEtsqc1t1lB7MDxBFN4FNow2wFq69hanhCamjGZUmQLYwNKoN9D_gfRiha6&gaa_ts=690756cb&gaa_sig=AWqxInjfrhl0zRJ_SXdaOBE9wa8gM7CRcGOMIShS295TkpXQ2NM1MP13COlS0LmYA2eKTrielI1pG7PHWZ-roQ%3D%3D",
      "source": "MarketWatch",
      "published": "20240201T110400",
      "overall_sentiment_score": 0.441587,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.303607,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.648423
    },
    {
      "title": "Best and Worst Performing Funds in January",
      "summary": "In January 2024, India and technology funds led the best-performing list, continuing trends from 2023, while China funds remained at the bottom, with property giant Evergrande's liquidation exacerbating issues. The article highlights strong performance in Indian and Japanese markets, contrasting with ongoing struggles in China and surprisingly poor performance from some energy transition and even last year's top-performing disruptive innovation fund.",
      "url": "https://global.morningstar.com/en-gb/funds/best-and-worst-performing-funds-in-january",
      "source": "Morningstar Canada",
      "published": "20240206T000000",
      "overall_sentiment_score": 0.19282,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.149167,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.635925
    },
    {
      "title": "Regions Tower owners face $75M foreclosure suit after missing loan deadline",
      "summary": "The owners of Regions Tower in downtown Indianapolis are facing a $75 million foreclosure suit after allegedly failing to pay off loans by an October 1, 2023 deadline. Wilmington Trust National Association filed the suit, requesting immediate repayment or foreclosure, and the appointment of a receiver for the property. This marks at least the second major downtown office building in Indianapolis to face foreclosure recently, amidst rising office vacancy rates.",
      "url": "https://www.ibj.com/articles/regions-tower-owners-face-75m-foreclosure-suit-after-missing-loan-deadline",
      "source": "Indianapolis Business Journal",
      "published": "20240205T000000",
      "overall_sentiment_score": -0.183569,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.110121,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.629728
    },
    {
      "title": "Bank of America sends warning letters to employees failing to return to office",
      "summary": "Bank of America is sending warning letters to employees who are not complying with its return-to-office policy, which generally requires staff to be in the office three days a week. These warnings are being issued to employees in various locations, including those based at 555 California Street. The move underscores the bank's commitment to enforcing its hybrid work model.",
      "url": "https://www.bizjournals.com/sanfrancisco/news/2024/01/29/bank-of-america-warning-return-to-office-employees.html",
      "source": "The Business Journals",
      "published": "20240129T000000",
      "overall_sentiment_score": 0.036745,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.026665,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.628845
    },
    {
      "title": "First Citizens’ bold conquest raised the stakes and profile of the family controlled bank",
      "summary": "First Citizens Bancshares' acquisition of Silicon Valley Bank significantly boosted its financial profile, making it the 13th largest U.S. bank by assets. Analysts debated the value of the deal, with some calling it essentially free due to government assistance, resulting in a 250% stock gain by early 2024. The bank leveraged its experience in acquiring distressed institutions and a trusted relationship with the FDIC to navigate the complex acquisition and stabilize SVB's operations and talent base.",
      "url": "https://businessnc.com/first-citizens-bold-conquest-raised-the-stakes-and-profile-of-the-family-controlled-bank/",
      "source": "Business North Carolina",
      "published": "20240131T000000",
      "overall_sentiment_score": 0.306804,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.244787,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.620879
    },
    {
      "title": "After delays, WaFd secures regulatory approvals for acquisition of Luther Burbank",
      "summary": "WaFd Inc. has finally secured all necessary regulatory approvals from the FDIC, Federal Reserve System Board of Governors, and Washington State Department of Financial Institutions to acquire Luther Burbank, after multiple delays. The $654 million transaction, initially announced in November 2022, is now expected to close by the end of February, creating a combined institution with over $30 billion in assets and expanding WaFd's presence into California. Despite past regulatory hurdles and M&A slowdowns in the banking sector, WaFd CEO Brent Beardall expressed confidence in the deal's potential to gain market share following recent bank failures.",
      "url": "https://www.americanbanker.com/news/after-delays-wafd-secures-regulatory-approvals-for-acquisition-of-luther-burbank",
      "source": "American Banker",
      "published": "20240131T141200",
      "overall_sentiment_score": 0.143361,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.070343,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.595626
    },
    {
      "title": "Unpopular Magellan ETF reflects investor scepticism in active funds",
      "summary": "Magellan's Global Fund – Open Class Units (Managed Fund) was the least popular ETF in Australia in 2023, experiencing $2.5 billion in net outflows, according to Global X's analysis. This indicates a broader trend of investor preference for passive index-based products over active ETFs in the Australian market, despite active ETFs making up a significant portion of new fund launches. The firm noted a stark contrast to other global markets like the US, where active ETFs garner significantly more interest.",
      "url": "https://www.investordaily.com.au/markets/54596-unpopular-magellan-etf-reflects-investor-scepticism-in-active-funds",
      "source": "investordaily.com.au",
      "published": "20240131T110914",
      "overall_sentiment_score": 0.03063,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.069602,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.591593
    },
    {
      "title": "Eaton Vance Launches Active Senior Loan ETF EVLN",
      "summary": "Morgan Stanley Investment Management has launched the Eaton Vance Floating-Rate ETF (EVLN), an actively managed senior loan ETF on the NYSE. The fund aims to provide high current income through floating-rate credit investments and will be managed by MSIM's dedicated loan management team. EVLN is the 12th ETF introduced by MSIM, leveraging Eaton Vance's extensive experience in floating-rate investments to offer a new option for income-seeking clients in an ETF structure.",
      "url": "https://www.etftrends.com/etf-yield-channel/eaton-vance-launches-active-senior-loan-etf-evln/",
      "source": "ETF Trends",
      "published": "20240208T035151",
      "overall_sentiment_score": 0.272788,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.082536,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.565239
    },
    {
      "title": "HYXF - iShares ESG Advanced High Yield Corporate Bond ETF Stock Price and Quote",
      "summary": "This page provides a detailed quote and financial data for the iShares ESG Advanced High Yield Corporate Bond ETF (HYXF). It includes performance metrics like return percentages, assets under management (AUM), dividend information, and key statistics, along with a list of recent related news articles. The ETF tracks the Bloomberg MSCI US High Yield Choice ESG Screened Index, focusing on corporate bonds with favorable ESG ratings.",
      "url": "https://finviz.com/quote.ashx?t=HYXF",
      "source": "Finviz",
      "published": "20240210T182757",
      "overall_sentiment_score": 0.038345,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.126979,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.555461
    },
    {
      "title": "KB Financial posts record-high profit on loan growth",
      "summary": "Both KB Financial Group and Kakao Bank reported record-high profits in 2023, driven by significant loan growth. While KB Financial's overall net profit jumped 11.5%, its fourth-quarter results were affected by heavy loan-loss provisions and lending rate cuts, signaling potential earnings growth slowdown. Kakao Bank's net profit surged 34.9% due to a 38.7% increase in its outstanding loan balance.",
      "url": "https://www.kedglobal.com/earnings/newsView/ked202402080008",
      "source": "The Korea Economic Daily Global Edition",
      "published": "20240208T132719",
      "overall_sentiment_score": 0.270637,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.297194,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.411791
    }
  ]
}