{
  "ticker": "JPM",
  "date": "2024-09-30",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T12:18:06.900486",
  "source": "alpha_vantage",
  "article_count": 30,
  "articles": [
    {
      "title": "VYM: A Top High-Yield ETF Choice For Income Investors (NYSEARCA:VYM)",
      "summary": "The Vanguard High Dividend Yield Index Fund ETF (VYM) is presented as a compelling investment choice for income investors due to its diversified portfolio of high-income stocks and low expense ratio of 0.06%. The ETF focuses on high-quality, dividend-paying stocks, with top holdings including Broadcom, JPMorgan Chase, and Exxon Mobil, and has achieved solid long-term returns. With a 2.8% yield and solid NAV growth, VYM is highlighted as a robust option for those seeking a diversified, low-cost ETF.",
      "url": "https://seekingalpha.com/article/4724335-vym-top-high-yield-etf-choice-for-income-investors",
      "source": "Seeking Alpha",
      "published": "20240930T213600",
      "overall_sentiment_score": 0.354782,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.315375,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.613247
    },
    {
      "title": "Amerant Bancorp Inc. Announces Closing of $165 Million Offering of Common Stock",
      "summary": "Amerant Bancorp Inc. announced the closing of a $165 million public offering of 8,684,210 shares of its Class A common stock at $19.00 per share. The net proceeds of approximately $156.7 million will be used for general corporate purposes, including supporting organic growth, resolving non-performing loans, and potential balance sheet optimization strategies. Chairman and CEO Jerry Plush stated that this capital raise completes a multi-year transformation, strengthening the company's ability to pursue continued growth and enhance shareholder value.",
      "url": "https://markets.financialcontent.com/ms.intelvalue/article/bizwire-2024-9-27-amerant-bancorp-inc-announces-closing-of-165-million-offering-of-common-stock",
      "source": "FinancialContent",
      "published": "20240927T110200",
      "overall_sentiment_score": 0.116112,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.092904,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.578467
    },
    {
      "title": "J.P. Morgan Asset Management Launches New Active ETF: JPMorgan Dividend Leaders ETF (JDIV)",
      "summary": "J.P. Morgan Asset Management has launched a new active exchange-traded fund, the JPMorgan Dividend Leaders ETF (JDIV), on the NYSE Arca. The fund aims to provide long-term capital growth and current income by investing in dividend-paying equity securities of companies globally, focusing on those with strong dividend growth and sustainability. Managed by an experienced team, JDIV is benchmarked against the MSCI ACWI Index and is priced at 47 basis points.",
      "url": "https://www.prnewswire.com/news-releases/jp-morgan-asset-management-launches-new-active-etf-jpmorgan-dividend-leaders-etf-jdiv-302260019.html",
      "source": "PR Newswire",
      "published": "20240926T042258",
      "overall_sentiment_score": 0.208563,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.429828,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Sidley Represents Underwriters in InvenTrust Properties' Common Stock Offering",
      "summary": "Sidley represented the underwriters, including JP Morgan, BofA Securities, and Wells Fargo Securities, in InvenTrust Properties Corp.’s SEC-registered offering of 9,200,000 shares of common stock. This offering, which included the full exercise of the underwriters' option to purchase additional shares, raised approximately US$247 million in net proceeds. InvenTrust is a multi-tenant essential retail REIT.",
      "url": "https://www.sidley.com/en/newslanding/newsannouncements/2024/09/sidley-represents-underwriters-in-inventrust-properties-common-stock-offering",
      "source": "Sidley Austin LLP",
      "published": "20240926T000000",
      "overall_sentiment_score": 0.205286,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.258412,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.830437
    },
    {
      "title": "The Roundup: Top Takeaways from Oaktree’s Quarterly Letters – September 2024 Edition",
      "summary": "Oaktree Capital Management's September 2024 \"Roundup\" synthesizes insights from its quarterly letters, highlighting the bifurcation in corporate credit markets and the increasing prevalence of liability management exercises. The article also discusses the growing role of mezzanine finance in bridging funding gaps, the opportunistic real estate market driven by an aging population, and improving corporate governance leading to reratings in emerging Asian markets equities.",
      "url": "https://www.oaktreecapital.com/insights/insight-commentary/market-commentary/the-roundup-top-takeaways-from-oaktree-s-quarterly-letters-september-2024-edition",
      "source": "Oaktree Capital Management",
      "published": "20240926T000000",
      "overall_sentiment_score": 0.109338,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.213591,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.631729
    },
    {
      "title": "Western Alliance sharpens California middle-market focus",
      "summary": "Western Alliance is intensifying its focus on California's middle-market companies, particularly in the aerospace, defense, and food and agriculture sectors, by adding new banking teams. Julian Parra, the bank's national head of commercial and industrial banking, notes the strategy leverages existing industry concentrations in the region and aims to grow C&I lending following a period of investor uncertainty in 2023. The bank differentiates itself by offering comprehensive large-bank capabilities while maintaining nimble, client-focused service for companies earning $20 million to $250 million in revenue.",
      "url": "https://www.bankingdive.com/news/western-alliance-california-middle-market-lending/727797/",
      "source": "Banking Dive",
      "published": "20240923T000000",
      "overall_sentiment_score": 0.217148,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.109432,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.603235
    },
    {
      "title": "Fidelity gatekeepers add JPM as subadvisor on $23.6bn fund",
      "summary": "Fidelity has appointed JP Morgan as the eighth subadvisor for its $23.6bn Strategic Advisers International fund (FILFX). JPM joins a lineup of seven other third-party subadvisors, including Arrowstreet, Causeway, and Wellington. A portion of the fund is also managed by Fidelity teams and allocated to other mutual funds, such as the Oakmark International fund and the JPMorgan International Research Enhanced Equity ETF.",
      "url": "https://citywire.com/pro-buyer/news/fidelity-gatekeepers-add-jpm-as-subadvisor-on-23-6bn-fund/a2450379",
      "source": "Citywire",
      "published": "20240919T110919",
      "overall_sentiment_score": 0.283568,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.266122,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.839297
    },
    {
      "title": "Investors Bet on Emerging Market Bonds Amid Fed Rate Cut Expectations",
      "summary": "Investors are channeling funds into emerging market bond ETFs, anticipating a Federal Reserve rate cut will boost their returns. Major ETFs like the iShares J.P. Morgan USD Emerging Markets Bond ETF and Vanguard Emerging Markets Government Bond ETF have seen significant inflows. This trend reflects an increasing appetite for higher yields and longer-duration assets found in developing markets as US interest rates are expected to drop.",
      "url": "https://dabafinance.com/en/news/investors-bet-on-emerging-market-bonds-amid-fed-rate-cut-expectations",
      "source": "Dabafinance",
      "published": "20240917T190911",
      "overall_sentiment_score": 0.346628,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.331361,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.640386
    },
    {
      "title": "Casella Waste Systems Announces Proposed Public Offering of Class A Common Stock",
      "summary": "Casella Waste Systems, Inc. announced a proposed underwritten public offering of $400 million of its Class A common stock, with an option for underwriters to purchase an additional 15%. The company intends to use the net proceeds to finance the acquisition of Royal Carting and Welsh Sanitation, repay revolving credit facility borrowings, and for general corporate purposes. Raymond James, J.P. Morgan, and Stifel are acting as joint book-running managers for the offering.",
      "url": "https://www.globenewswire.com/news-release/2024/9/17/2947825/8693/en/Casella-Waste-Systems-Announces-Proposed-Public-Offering-of-Class-A-Common-Stock.html",
      "source": "GlobeNewswire",
      "published": "20240917T160200",
      "overall_sentiment_score": 0.108954,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.134939,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.682015
    },
    {
      "title": "CLO ETFs in Focus: Virtus, Blondbloxx, Nuveen Plot Entrance",
      "summary": "Several firms, including Virtus, BondBloxx, and Nuveen, are preparing to launch collateralized loan obligation (CLO) ETFs, expanding access to this asset class for noninstitutional investors. CLO ETFs have demonstrated attractive risk-adjusted returns due to their structural features, such as being backed by leveraged loans and varying subordination levels among tranches. This new wave of ETFs follows recent launches by Palmer Square Capital and adds to existing funds from major players like Janus Henderson and BlackRock, highlighting growing interest in the CLO market.",
      "url": "https://www.etftrends.com/clo-etfs-focus-virtus-blondbloxx-nuveen-plot-entrance/",
      "source": "ETF Trends",
      "published": "20240917T000000",
      "overall_sentiment_score": 0.246979,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.206053,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.646113
    },
    {
      "title": "Dallas’ P10 to Acquire Madrid-Based PE Investing Platform Qualitas Funds in $63M Deal",
      "summary": "Dallas-based P10 Inc. is set to acquire Madrid-based Qualitas Equity Funds SGEIC S.A. for an initial $63 million, with potential for an additional $35 million earnout. Qualitas Funds, with approximately $1 billion in assets under management, offers private equity investment opportunities in the European lower-middle market. This acquisition aims to expand P10's global presence and investor base, integrating Qualitas' expertise while maintaining its current management and operations.",
      "url": "https://dallasinnovates.com/dallas-p10-to-acquire-madrid-based-pe-investing-platform-qualitas-funds-in-63m-deal/",
      "source": "Dallas Innovates",
      "published": "20240917T000000",
      "overall_sentiment_score": 0.265599,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.328379,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.597385
    },
    {
      "title": "Citigroup undeterred by fossil fuel protests",
      "summary": "Citigroup increased its bond underwriting for fossil fuel companies, arranging $4.2 billion in bonds between June 10 and September 5, despite widespread climate protests outside its Manhattan offices. The bank views the protests as an irritation and remains committed to supporting clients in an \"orderly transition to a low-carbon economy,\" while activists aim to draw attention to the issue and expect larger protests in the future.",
      "url": "https://www.investmentnews.com/ria-news/citigroup-undeterred-by-fossil-fuel-protests/257196",
      "source": "InvestmentNews",
      "published": "20240917T000000",
      "overall_sentiment_score": -0.019934,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.036228,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.720719
    },
    {
      "title": "Nuvalent Announces Pricing of Upsized Public Offering of Common Stock",
      "summary": "Nuvalent, Inc. announced the pricing of an upsized underwritten public offering of 5,000,000 shares of its Class A common stock at $100.00 per share, aiming to raise approximately $500.0 million in gross proceeds. The offering is expected to close on September 18, 2024, with underwriters having a 30-day option to purchase an additional 750,000 shares. J.P. Morgan, TD Cowen, Jefferies, and Stifel are acting as joint book-running managers for the offering.",
      "url": "https://www.prnewswire.com/news-releases/nuvalent-announces-pricing-of-upsized-public-offering-of-common-stock-302249714.html",
      "source": "PR Newswire",
      "published": "20240916T222300",
      "overall_sentiment_score": 0.373031,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.303947,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.608549
    },
    {
      "title": "Money losing natgas producer BKV revives US IPO",
      "summary": "Loss-making natural gas producer BKV Corp is reviving its U.S. IPO, aiming to raise up to $315 million at a valuation of up to $1.77 billion. The company, which posted a net loss of $98.3 million in the first half of the year, plans to use the proceeds primarily to repay debt. This move comes as rate cut expectations and rising natural gas prices create a more favorable market for listings.",
      "url": "https://www.reuters.com/markets/deals/natgas-producer-bkv-aims-raise-up-315-mln-us-ipo-2024-09-16/",
      "source": "Reuters",
      "published": "20240916T160200",
      "overall_sentiment_score": 0.035256,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.133327,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.561438
    },
    {
      "title": "Globe Life holds price target by Evercore amid contractor dispute",
      "summary": "Evercore ISI maintained its 'In Line' rating and $95.00 price target for Globe Life Inc. (NYSE: GL) despite ongoing legal challenges with the EEOC regarding agent classification. The company faces potential financial repercussions and delays in stock re-rating due to widening federal agency involvement, though other firms like JPMorgan and Piper Sandler maintain positive ratings. InvestingPro data highlights Globe Life's low P/E ratio relative to growth, robust financial health, and a 54-year history of dividend payments.",
      "url": "https://uk.investing.com/news/company-news/globe-life-holds-price-target-by-evercore-amid-contractor-dispute-93CH-3711526",
      "source": "Investing.com UK",
      "published": "20240927T173200",
      "overall_sentiment_score": 0.10228,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.111096,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.645811
    },
    {
      "title": "Pase del CEO de Macro a Supervielle reaviva rumores de M&A en el mercado argentino",
      "summary": "The appointment of Gustavo Manriquez, former CEO of Banco Macro, as the new CEO of Banco Supervielle has reignited rumors of a potential acquisition of Supervielle by Macro in the Argentine market. While Supervielle denies being for sale, analysts suggest the move could be a strategic play for a future takeover. This development occurs amidst a broader trend of consolidation in the Argentine banking sector, driven by deregulation and recent significant M&A transactions.",
      "url": "https://www.bloomberglinea.com/latinoamerica/argentina/pase-del-ceo-de-macro-a-supervielle-reaviva-rumores-de-ma-en-el-mercado-argentino/",
      "source": "Bloomberg Línea",
      "published": "20240925T043000",
      "overall_sentiment_score": 0.06297,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.06854,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.559576
    },
    {
      "title": "Goldman Sachs Group, Inc. (NYSE:GS): Here is What Jim Cramer’s Looking At",
      "summary": "Jim Cramer highlighted Goldman Sachs' projection of a 10% decline in its capital markets business due to a challenging macro environment, as discussed by CEO David M. Solomon. Cramer also commented on the Federal Reserve's potential rate cuts, believing they would foster a positive market backdrop and benefit most businesses, with technology companies being less reliant on these cuts due to automation. The article notes that Goldman Sachs (NYSE:GS) ranks 10th on Insider Monkey's list of Jim Cramer's top stocks for September, while suggesting AI stocks hold greater promise for higher returns.",
      "url": "https://www.insidermonkey.com/blog/goldman-sachs-group-inc-nysegs-here-is-what-jim-cramers-looking-at-1355781/",
      "source": "Insider Monkey",
      "published": "20240924T092900",
      "overall_sentiment_score": 0.188091,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.140794,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.62072
    },
    {
      "title": "Ankur Crawford: ‘When Software Begins to Write Software, Innovation Is Exponential’",
      "summary": "Ankur Crawford, a growth equities investor at Fred Alger Management, discusses the long-term case for AI, emphasizing its role in democratizing compute and driving exponential innovation. She draws parallels to the steam engine and industrial revolution, highlighting AI's potential impact on labor and the economy. Crawford also shares her firm's approach to market volatility and the implications of AI on traditional portfolio construction and equity valuations.",
      "url": "https://www.morningstar.com/personal-finance/ankur-crawford-when-software-begins-write-software-innovation-is-exponential",
      "source": "Morningstar",
      "published": "20240924T000000",
      "overall_sentiment_score": 0.172052,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": -0.143746,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.636651
    },
    {
      "title": "Under 25% of Vanguard’s 2024 proxy pilot participants chose ESG-centered policies",
      "summary": "Vanguard's 2024 proxy season pilot program revealed that just under a quarter (24.4%) of its 40,000 participants opted for a third-party ESG policy. A plurality (43%) aligned with Vanguard’s advised policy, while 30% chose company-board policies. Investors in Vanguard's ESG U.S. Stock ETF were significantly more likely to select the ESG policy, in contrast to those in its Dividend Appreciation Index Fund.",
      "url": "https://www.esgdive.com/news/vanguard-proxy-choice-pilot-data-report-esg-etf-dividend/727381/",
      "source": "ESG Dive",
      "published": "20240918T000000",
      "overall_sentiment_score": 0.05527,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.012778,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.622984
    },
    {
      "title": "Citigroup sells trust services unit to JTC for $80 million",
      "summary": "JTC has agreed to acquire Citigroup's global fiduciary and trust administration services business, known as 'Citi Trust,' for $80 million. This unit serves over 2,000 ultra-high net worth clients, managing more than $70 billion in assets across seven jurisdictions. The sale aligns with Citi CEO Jane Fraser's restructuring efforts to improve performance, reduce costs, and simplify operations.",
      "url": "https://www.reuters.com/markets/deals/citigroup-sells-trust-services-unit-jtc-80-million-2024-09-16/",
      "source": "Reuters",
      "published": "20240916T135400",
      "overall_sentiment_score": 0.214735,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.132181,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.558028
    },
    {
      "title": "Los ADR del Grupo Aval y Ecopetrol fueron los que más cayeron en la última década",
      "summary": "Over the last decade, Colombian ADRs with Level III listings on the New York Stock Exchange, including Grupo Aval, Ecopetrol, and Bancolombia, have experienced significant declines. Grupo Aval's shares fell by 85.06%, Ecopetrol's by 72.88%, and Bancolombia's by 46.13%. Analysts attribute these drops to factors such as low liquidity, lack of investor appetite in the financial sector, monetary cycles, and macroeconomic influences like oil prices and currency devaluation.",
      "url": "https://www.larepublica.co/finanzas/las-acciones-colombianas-con-adr-nivel-iii-se-desplomaron-en-la-bolsa-de-nueva-york-3952769",
      "source": "LaRepublica.co",
      "published": "20240916T000000",
      "overall_sentiment_score": -0.209258,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.100806,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.638328
    },
    {
      "title": "ON THE MOVE: Northern Trust Makes Leadership Changes; Schroders Names New CEO",
      "summary": "Northern Trust and Schroders announced significant leadership changes, with Northern Trust appointing Peter B. Cherecwich as COO and Richard Oldfield becoming Group Chief Executive of Schroders. The article also details new appointments at FINRA, the SEC Investor Advisory Committee, Franklin Templeton, Scotiabank, ACA Group, Neuberger Berman, and BNP Paribas Asset Management.",
      "url": "https://www.tradersmagazine.com/xtra/on-the-move-northern-trust-makes-leadership-changes-schroders-names-new-ceo/",
      "source": "Traders Magazine",
      "published": "20240916T000000",
      "overall_sentiment_score": 0.149146,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.142688,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.608175
    },
    {
      "title": "$1.8B Morgan Stanley team goes indie with Wells Fargo",
      "summary": "A Chicago-based team from Morgan Stanley, Verismo Financial, managing nearly $1.8 billion in assets, has moved to Wells Fargo's independent advisor channel. The team, led by Frank Devincentis, Craig Eyler, and Molly Girard, cited a desire for greater autonomy and Wells Fargo's strong understanding of banking and cybersecurity as key factors in their decision. This transition follows Wells Fargo's adjustments to its FiNet platform's fee structure and increased support staffing for independent advisors.",
      "url": "https://www.investmentnews.com/wirehouses/18b-morgan-stanley-team-goes-indie-with-wells-fargo/257177",
      "source": "InvestmentNews",
      "published": "20240916T000000",
      "overall_sentiment_score": 0.163281,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.099522,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.564472
    },
    {
      "title": "IBM & Microsoft Expand AI Accessibility for Tech Skills Gap",
      "summary": "IBM and Microsoft have strengthened their partnership by launching three new Experience Zones in Romania, USA, and UK to improve AI accessibility and bridge the global technology skills gap. These centers offer hands-on access to advanced technologies like generative AI and hybrid cloud solutions, leveraging IBM's consulting expertise and Microsoft's cutting-edge technologies. The initiative aims to help businesses navigate the digital landscape and accelerate digital transformation.",
      "url": "https://technologymagazine.com/ai-and-machine-learning/ibm-microsoft-expand-ai-accessibility-for-tech-skills-gap",
      "source": "Technology Magazine",
      "published": "20240922T000000",
      "overall_sentiment_score": 0.333106,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.216822,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.627037
    },
    {
      "title": "Focus: MercadoLibre, Latam's Amazon.com rival, rides high with AI, loans, drones",
      "summary": "MercadoLibre, Latin America's e-commerce giant, is expanding rapidly by leveraging AI, offering loans, and exploring drone delivery to enhance its ecosystem for shoppers and sellers. The company is using its extensive user data to provide instant credit, fueling its growth and solidifying its position as the region's most valuable firm despite competition from other fintechs. Investors are bullish on MercadoLibre's outlook, with strong growth in areas like credit and plans to triple active users.",
      "url": "https://www.reuters.com/business/retail-consumer/mercadolibre-latams-amazoncom-rival-rides-high-with-ai-loans-drones-2024-09-30/",
      "source": "Reuters",
      "published": "20240930T202100",
      "overall_sentiment_score": 0.236816,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.429632,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.859378
    },
    {
      "title": "What I Learned When Trump Told a Weird Lie About My Ex-Boss Bob Tisch",
      "summary": "The author debunks Donald Trump's repeated claim that her former boss, Bob Tisch (who died in 2005), considered San Francisco \"the greatest city in the country.\" She highlights Tisch's deep ties to New York City through his business, philanthropy, and sports team ownership. The author consulted Tisch's daughter, Laurie Tisch, who confirmed her father never expressed such sentiments about San Francisco, leading the author to speculate on Trump's motivations for fabricating this story.",
      "url": "https://www.thedailybeast.com/what-i-learned-when-trump-told-a-weird-lie-about-my-ex-boss-bob-tisch/",
      "source": "The Daily Beast",
      "published": "20240927T124500",
      "overall_sentiment_score": -0.044931,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.147736,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.585825
    },
    {
      "title": "The Most Powerful Women in Finance 2024",
      "summary": "This article highlights the 2024 list of the Most Powerful Women in Finance, featuring prominent leaders such as Mary Callahan Erdoes, Abigail Johnson, and Jenny Johnson, among 22 others. It introduces new honorees like Christina Minnis, Kourtney Gibson, and Kate El-Hillow, and details the achievements and leadership philosophies of many of these influential women in the financial industry. The piece showcases their contributions to diversity, innovation, and strategic growth within their respective institutions.",
      "url": "https://www.americanbanker.com/list/the-most-powerful-women-in-finance-2024",
      "source": "American Banker",
      "published": "20240924T063000",
      "overall_sentiment_score": 0.307719,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.340008,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.829862
    },
    {
      "title": "What does AI-driven stock selection mean for passive investors?",
      "summary": "The article explores the impact of AI-driven stock selection on both active and passive investors, highlighting how large language models can identify winning trades and outperform human analysts in short-term earnings predictions. While AI offers a new tool for active investors to gain an edge, its implications for passive investors suggest increased market efficiency and a greater focus on lower fees for differentiation. The article also touches on the limitations of AI, such as its tendency to \"hallucinate\" and its struggle with qualitative, long-term assessments.",
      "url": "https://www.etfstream.com/articles/what-does-ai-driven-stock-selection-mean-for-passive-investors",
      "source": "ETF Stream",
      "published": "20240924T000000",
      "overall_sentiment_score": 0.24756,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.203641,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.581076
    },
    {
      "title": "South Korean investors bet big on ETFs tracking Indian equities",
      "summary": "South Korean investors have significantly increased their investments in ETFs tracking Indian equities, with total AUM more than tripling this year to 1.3 trillion won ($975.6 million). This surge is driven by India's strong economic prospects and stock market performance, as investors seek alternatives to the struggling Chinese market. While some analysts advise a long-term approach due to current high valuations, India is considered a top pick among emerging markets for its growth potential.",
      "url": "https://www.kedglobal.com/korean-stock-market/newsView/ked202409190004",
      "source": "The Korea Economic Daily Global Edition",
      "published": "20240919T130511",
      "overall_sentiment_score": 0.289455,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.411416,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.607581
    },
    {
      "title": "With Uncertainty Ahead, Intermediate Bonds Offer Opportunities",
      "summary": "Given the current market's high uncertainty due to potential recession, a forthcoming presidential election, and interest rates, fixed income investors might consider a middle-ground approach with intermediate bonds. This strategy offers a balance between short-term and long-term debt, especially as the yield curve normalizes. The article suggests specific Vanguard ETFs for broad exposure, corporate bonds, and Treasury options within the intermediate maturity range.",
      "url": "https://www.etftrends.com/fixed-income-channel/uncertainty-ahead-intermediate-bonds-offer-opportunities/",
      "source": "ETF Trends",
      "published": "20240925T000000",
      "overall_sentiment_score": 0.107448,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.102684,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.585235
    }
  ]
}