{
  "ticker": "JPM",
  "date": "2024-01-22",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T12:15:13.025914",
  "source": "alpha_vantage",
  "article_count": 16,
  "articles": [
    {
      "title": "JPMorgan posts record net interest income",
      "summary": "JPMorgan Chase & Co. achieved its most profitable year in US banking history, driven by a seventh consecutive quarter of record net interest income (NII) totaling $24.2 billion in Q4. Despite a surprise forecast that the windfall may continue, the bank incurred a $2.9 billion charge for an FDIC special assessment related to 2023 bank failures and saw expenses climb significantly due to higher compensation. CEO Jamie Dimon warned that inflation could be stickier and interest rates higher than market expectations, influenced by increased government spending.",
      "url": "https://www.investmentnews.com/independent-broker-dealers/jpmorgan-posts-record-net-interest-income/247986",
      "source": "InvestmentNews",
      "published": "20240112T000000",
      "overall_sentiment_score": 0.249066,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.499731,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "J.P. Morgan Asset Management to Transfer JPMorgan Active Bond ETF (JBND) to NYSE from NYSE Arca",
      "summary": "J.P. Morgan Asset Management announced it will transfer the listing of its JPMorgan Active Bond ETF (JBND) from NYSE Arca to the New York Stock Exchange (NYSE), effective January 30, 2024. The move aims to leverage the NYSE's floor-based trading model for enhanced market quality, with expectations of tighter spreads and increased liquidity. Shareholders are not required to take any action, and the fund's ticker will remain JBND.",
      "url": "https://www.marketscreener.com/quote/stock/JPMORGAN-CHASE-CO-37468997/news/J-P-Morgan-Asset-Management-to-Transfer-JPMorgan-Active-Bond-ETF-JBND-to-NYSE-from-NYSE-Arca-45695291/",
      "source": "marketscreener.com",
      "published": "20240108T171500",
      "overall_sentiment_score": 0.318371,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.261169,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.815256
    },
    {
      "title": "Bad Office Loans Mount at Bank of America, Wells Fargo",
      "summary": "Bank of America (BAC) and Wells Fargo (WFC) reported increased charge-offs for commercial-property loans in the fourth quarter of 2023, primarily due to struggles in the US office market. Remote work trends and rising interest rates have negatively impacted office valuations, leading to these write-offs. JPMorgan Chase & Co. also set aside more reserves due to a deteriorating outlook on commercial-property valuations.",
      "url": "https://www.bloomberg.com/news/articles/2024-01-12/bad-office-loans-mount-at-bofa-wells-fargo-as-maturities-loom",
      "source": "Bloomberg.com",
      "published": "20240112T205300",
      "overall_sentiment_score": -0.407667,
      "overall_sentiment_label": "Bearish",
      "ticker_sentiment_score": -0.320406,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.726158
    },
    {
      "title": "CrossCountry adopts FICO Score 10 T for non-conforming loans, MBS issuances",
      "summary": "CrossCountry Mortgage has adopted the FICO Score 10 T model for non-conforming loans and MBS issuances, claiming to be the first to commit to issuing MBS exclusively based on this updated score. This move aims to help investors familiarize themselves with the new score and realize promised performance improvements, empowering smarter decisions and allowing for more personalized financial solutions for customers. The adoption aligns with regulators' plans to update credit systems and follows concerns about the previous timeline for transition and increased costs for credit reports.",
      "url": "https://www.housingwire.com/articles/crosscountry-adopts-fico-score-10-t-for-non-conforming-loans-mbs-issuances/",
      "source": "HousingWire",
      "published": "20240109T102700",
      "overall_sentiment_score": 0.169974,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.122182,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.646899
    },
    {
      "title": "Potential for rate cuts adding to fixed income's allure",
      "summary": "The potential for interest rate cuts is increasing the attractiveness of fixed income investments. This article from Pensions & Investments Portfolio Management highlights this trend. It also briefly mentions other financial news such as delays in SEC work on private credit due to government shutdown and CalPERS voting against Elon Musk's pay package.",
      "url": "https://www.pionline.com/investing/potential-rate-cuts-adding-fixed-incomes-allure/",
      "source": "Pensions & Investments",
      "published": "20240111T130000",
      "overall_sentiment_score": 0.140712,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.145135,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.638547
    },
    {
      "title": "BTCO: Convenient, Cost-Effective Avenue to Spot Bitcoin Exposure",
      "summary": "The article discusses the Invesco Galaxy Bitcoin ETF (BTCO) as a new option for spot Bitcoin exposure following SEC approval. It highlights BTCO's competitive 0.39% annual fee, waived for the first six months up to $5 billion AUM, and its potential for significant long-term growth similar to the SPDR Gold Shares ETF (GLD). The approval of spot Bitcoin ETFs like BTCO is seen as legitimizing digital currencies and potentially attracting substantial inflows from advisors.",
      "url": "https://www.etftrends.com/crypto-channel/btco-convenient-cost-effective-avenue-spot-bitcoin-exposure/",
      "source": "ETF Trends",
      "published": "20240119T000000",
      "overall_sentiment_score": 0.328632,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.313074,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.624848
    },
    {
      "title": "ADF to SEC: Don’t let Wells Fargo, Charles Schwab dodge shareholders",
      "summary": "Alliance Defending Freedom (ADF) has urged the SEC to reject attempts by Wells Fargo and Charles Schwab to exclude shareholder resolutions from their 2024 proxy ballots. Wells Fargo is trying to block a proposal for transparency on \"de-banking\" risks, while Charles Schwab is seeking to avoid a report on its DEI policies. ADF argues that both companies are attempting to hide from legitimate shareholder concerns and calls for the SEC to allow shareholders to vote on these proposals, citing previous SEC rulings in favor of ADF-backed shareholders.",
      "url": "https://adfmedia.org/press-release/adf-sec-dont-let-wells-fargo-charles-schwab-dodge-shareholders/",
      "source": "adfmedia.org",
      "published": "20240118T172223",
      "overall_sentiment_score": 0.164965,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.135053,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.62474
    },
    {
      "title": "BNY Mellon profit beats on robust interest revenue",
      "summary": "B.N.Y. Mellon reported fourth-quarter profit estimates, driven by a significant increase in net interest revenue due to elevated interest rates. Despite incurring substantial one-time charges, including a $752 million FDIC special assessment and additional divestiture-related costs, the bank exceeded profit expectations. Its assets under custody or administration and assets under management both saw an 8% rise.",
      "url": "https://www.reuters.com/business/finance/bny-mellon-profit-falls-fdic-charge-2024-01-12/",
      "source": "Reuters",
      "published": "20240112T172500",
      "overall_sentiment_score": 0.267213,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.130137,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.624563
    },
    {
      "title": "Corporate Credit Outlook 2024: High Tide for Yield?",
      "summary": "Despite weakening economic fundamentals, corporate bond investors should find opportunities in 2024, particularly in higher-quality credits, due to elevated yields and relatively strong corporate balance sheets. The article suggests focusing on intermediate-term corporate bonds and selectively avoiding the most vulnerable CCC-rated debt, despite a projected moderate default rate.",
      "url": "https://www.alliancebernstein.com/corporate/en/insights/investment-insights/corporate-credit-outlook-2024-high-tide-for-yield.html",
      "source": "AllianceBernstein",
      "published": "20240112T000000",
      "overall_sentiment_score": 0.323066,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.308515,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.617193
    },
    {
      "title": "Home health company BrightSpring gears up for IPO at proposed $2.8B valuation",
      "summary": "BrightSpring Health Services is moving forward with an initial public offering aiming to raise $960 million, valuing the company at approximately $2.8 billion. Most of the proceeds are intended for debt repayment. This IPO signals a potential thawing of the healthcare IPO market after a dry spell.",
      "url": "https://www.fiercehealthcare.com/health-tech/home-health-company-brightspring-files-ipo-plans-sec",
      "source": "Fierce Healthcare",
      "published": "20240118T140000",
      "overall_sentiment_score": 0.194141,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.141744,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.608253
    },
    {
      "title": "Watkins Advises on Axonics’ US$3.7 Billion Acquisition by Boston Scientific",
      "summary": "Latham & Watkins LLP represented J.P. Morgan Securities LLC as financial advisor to Axonics, Inc. in its acquisition by Boston Scientific Corporation. The acquisition values Axonics at approximately US$3.7 billion, with Boston Scientific paying US$71 in cash per share. The Latham & Watkins corporate deal team was led by partners Charles Ruck and Luke Bergstrom.",
      "url": "https://www.lw.com/en/news/2024/01/latham-watkins-advises-on-axonics-us3-7-billion-acquisition-by-boston-scientific",
      "source": "Latham & Watkins LLP",
      "published": "20240108T000000",
      "overall_sentiment_score": 0.289791,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.148047,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.608086
    },
    {
      "title": "Charles Schwab reports declines as CEO calls 2023 most challenging in his career",
      "summary": "Charles Schwab Corp. reported significant declines in profit, new assets, and deposits for the fourth quarter of 2023, a year CEO Walt Bettinger described as the most challenging in his career. The company was heavily impacted by interest rate hikes eroding investment values and consumers seeking higher-yielding alternatives to deposits, leading to a 48% drop in net new assets and a 21% decline in bank deposits. Schwab is now focusing on moving away from more expensive funding sources and expects its earnings potential to grow as higher-cost borrowings are paid down and its securities portfolio is reinvested at higher market rates.",
      "url": "https://www.dallasnews.com/business/banking/2024/01/17/charles-schwab-reports-declines-as-ceo-calls-2023-most-challenging-in-his-career/",
      "source": "Dallas News",
      "published": "20240117T224600",
      "overall_sentiment_score": 0.081096,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.236299,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.60454
    },
    {
      "title": "Sixth Street Specialty Lending, Inc. Prices Public Offering of $350.0 million 6.125% Unsecured Notes due 2029",
      "summary": "Sixth Street Specialty Lending, Inc. announced the pricing of an underwritten public offering of $350.0 million in aggregate principal amount of 6.125% notes due 2029. The company plans to use the net proceeds to pay down outstanding debt under its revolving credit facility and make new investments. An interest rate swap will be utilized to align the interest rates of its liabilities with its investment portfolio.",
      "url": "https://www.stocktitan.net/news/TSLX/sixth-street-specialty-lending-inc-prices-public-offering-of-350-0-t48s4dyp1qkk.html",
      "source": "Stock Titan",
      "published": "20240108T172300",
      "overall_sentiment_score": 0.155893,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.125646,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.604278
    },
    {
      "title": "Fidelity Investments® Launches Spot Bitcoin Exchange-Traded Product, Fidelity® Wise Origin® Bitcoin Fund (FBTC)",
      "summary": "Fidelity Investments has launched the Fidelity® Wise Origin® Bitcoin Fund (FBTC), a spot bitcoin exchange-traded product, with an expense ratio of 0.25%, waived for the first six months. This launch provides advisors and individual investors with a new avenue to gain exposure to bitcoin, following the SEC's authorization of such products. Fidelity emphasizes its long-standing engagement in the digital assets space and its commitment to offering investors more choices.",
      "url": "https://newsroom.fidelity.com/pressreleases/fidelity-investments--launches-spot-bitcoin-exchange-traded-product--fidelity--wise-origin--bitcoin-/s/02f9b68a-de40-41c5-baab-584ef8510471",
      "source": "Fidelity Newsroom",
      "published": "20240111T000000",
      "overall_sentiment_score": 0.291467,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.103549,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.57474
    },
    {
      "title": "No Gimmicks, No Marketing Stunts, Just Bitcoin: Introducing the Valkyrie Bitcoin Fund",
      "summary": "Valkyrie Investments Inc. has launched the Valkyrie Bitcoin Fund (NASDAQ: BRRR), one of the first spot bitcoin ETFs in the U.S., offering investors simplified access to digital currency. The fund aims to provide a serious investment product for institutions, advisors, and investors, leveraging Valkyrie's expertise without relying on extensive marketing stunts. Valkyrie emphasizes treating Bitcoin as a sophisticated asset class and waiving sponsor fees for the first three months of trading.",
      "url": "https://www.businesswire.com/news/home/20240111392503/en/No-Gimmicks-No-Marketing-Stunts-Just-Bitcoin-Introducing-the-Valkyrie-Bitcoin-Fund",
      "source": "Business Wire",
      "published": "20240111T053102",
      "overall_sentiment_score": 0.323779,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.21961,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.554719
    },
    {
      "title": "Wells Fargo Advisors to sell new bitcoin ETFs",
      "summary": "Wells Fargo Advisors announced it will sell new spot bitcoin ETFs, but only for unsolicited purchases. This move comes as the broader retail brokerage industry, including competitors like Vanguard and Merrill Edge, evaluates or restricts offerings of these new investment products. Meanwhile, Wells Fargo's Wealth and Investment Management group reported a decline in net income for the quarter ending December 31, 2023, amidst ongoing overhauls of its wealth management business.",
      "url": "https://www.investmentnews.com/alternatives/wells-fargo-advisors-to-sell-new-bitcoin-etfs/247991",
      "source": "InvestmentNews",
      "published": "20240112T000000",
      "overall_sentiment_score": 0.099546,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.037291,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.517312
    }
  ]
}