{
  "ticker": "JPM",
  "date": "2024-06-17",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T12:16:53.821206",
  "source": "alpha_vantage",
  "article_count": 21,
  "articles": [
    {
      "title": "Active ETFs take centre stage",
      "summary": "The article highlights the surging global demand for active ETFs, noting their significant growth rate compared to traditional ETFs and their increasing share of net flows. It discusses various reasons for investor interest in active ETFs beyond outperformance, such as diversification, lower costs, and ESG considerations, and emphasizes J.P. Morgan Asset Management's prominent role in this evolving market. The piece also suggests that active approaches can add value in fixed income, despite current investor misconceptions.",
      "url": "https://www.etfstream.com/articles/active-etfs-take-centre-stage",
      "source": "ETF Stream",
      "published": "20240613T000000",
      "overall_sentiment_score": 0.280486,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.403056,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.994175
    },
    {
      "title": "Londoner Macao down up to 3k rooms in 2Q: firm",
      "summary": "Las Vegas Sands Corp. expects 2,500 to 3,000 rooms at The Londoner Macao to be out of commission in the second quarter due to ongoing renovations, a significant increase from the first quarter. The company plans to complete the renovation projects for the Cotai Arena and the Pacifica casino by the fourth quarter of this year, aiming to improve its market positioning despite near-term lagging results compared to peers. Las Vegas Sands is managing margins by redistributing table demand to other Macau properties and anticipates a return to higher reinvestment rates once renovations are complete.",
      "url": "https://www.ggrasia.com/londoner-macao-down-up-to-3k-rooms-in-q2-firm",
      "source": "GGRAsia",
      "published": "20240605T000000",
      "overall_sentiment_score": 0.056795,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.124227,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.637206
    },
    {
      "title": "LandBridge Announces Launch of IPO",
      "summary": "LandBridge Company LLC announced the launch of its initial public offering of 14,500,000 Class A shares, priced between $19.00 and $22.00 per share. The company will list its Class A shares on the New York Stock Exchange under the ticker symbol “LB”. Goldman Sachs & Co. LLC and Barclays are acting as lead book-running managers for the offering.",
      "url": "https://www.citybiz.co/article/567789/landbridge-announces-launch-of-ipo/",
      "source": "citybiz",
      "published": "20240617T000000",
      "overall_sentiment_score": 0.333745,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.202986,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.636836
    },
    {
      "title": "The value of securities lending in three charts",
      "summary": "This article quantifies the benefits of securities lending for Vanguard funds, showing how it enhances returns, demonstrates a value-based approach to lending, and offsets a significant portion of expense ratios. Vanguard's strategy of prioritizing value over volume in securities lending results in higher income per dollar loaned compared to the industry average. Securities lending has added between 1 and 5 basis points to annual returns and offset between 23% and 90% of expense ratios for Vanguard funds and ETFs.",
      "url": "https://corporate.vanguard.com/content/corporatesite/us/en/corp/articles/value-securities-lending-three-charts.html",
      "source": "Vanguard research",
      "published": "20240611T000000",
      "overall_sentiment_score": 0.132686,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.126214,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.636362
    },
    {
      "title": "Clean Energy ETFs Rebound on China, U.S. Windfall",
      "summary": "Clean energy ETFs experienced a significant rebound in May, driven by positive developments in China's solar industry and a substantial U.S. loan guarantee for hydrogen developer Plug Power. This surge follows a challenging period for the sector in 2023, exacerbated by oversupply and interest rate sensitivity. Improved sentiment, softening interest rates, accelerated financing for clean energy projects in the U.S., and the growing electricity demands of AI are further fueling optimism in the sector.",
      "url": "https://www.etf.com/sections/news/clean-energy-etfs-rebound-china-us-windfall",
      "source": "ETF.com",
      "published": "20240605T000000",
      "overall_sentiment_score": 0.296368,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.31202,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.633595
    },
    {
      "title": "How Synchrony is making WFH work when other FIs haven’t",
      "summary": "While many financial institutions are mandating employees return to the office, Synchrony is maintaining its flexible workplace model. CEO Brian D. Doubles believes approaches beyond physical attendance can increase positive outcomes, influencing both employee satisfaction and productivity. This stance is notably different from major banks like JPMorgan, Bank of America, and Goldman Sachs, which have largely returned to in-office mandates.",
      "url": "https://tearsheet.co/culture-and-talent/how-synchrony-is-making-wfh-work-when-other-fis-havent/",
      "source": "Tearsheet",
      "published": "20240606T000000",
      "overall_sentiment_score": -0.117651,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.316191,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.63044
    },
    {
      "title": "With 84% ownership of the shares, Cadence Bank (NYSE:CADE) is heavily dominated by institutional owners",
      "summary": "Cadence Bank (NYSE:CADE) is primarily owned by institutional investors, holding 84% of its shares, which gives them significant influence over the company's stock price and decisions. The Vanguard Group, BlackRock, Inc., and FMR LLC are the largest shareholders, with insiders also owning a meaningful stake. Individual investors hold 14% of the company's shares.",
      "url": "https://finance.yahoo.com/news/84-ownership-shares-cadence-bank-133410145.html",
      "source": "Yahoo Finance",
      "published": "20240613T000000",
      "overall_sentiment_score": 0.089509,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.117247,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.630315
    },
    {
      "title": "Three more minority banks get a deposit boost from State Street",
      "summary": "State Street Corp. has selected three additional minority banks—Carver State Bank, Citizens Trust Bank, and Ponce Bank—to receive a portion of its $100 million in pledged deposits, aiming to provide stable, low-cost funding to minority depository institutions and community development financial institutions. This initiative is part of a larger trend among big banks and the Economic Opportunity Coalition to channel billions of dollars into MDIs and CDFIs to support underserved communities. While the deposits are intended to boost lending, some skepticism exists regarding their full impact, with economists suggesting clearer reporting on how funds are utilized.",
      "url": "https://www.americanbanker.com/news/three-more-minority-banks-get-a-deposit-boost-from-state-street",
      "source": "American Banker",
      "published": "20240611T171900",
      "overall_sentiment_score": 0.321997,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.22234,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.627918
    },
    {
      "title": "Tempus Announces Pricing of Initial Public Offering",
      "summary": "Tempus AI, Inc. announced the pricing of its initial public offering of 11,100,000 shares of Class A common stock at $37.00 per share, expecting to raise $410.7 million. The shares are set to begin trading on the Nasdaq Global Select Market under the ticker symbol “TEM” on June 14, 2024, with the offering expected to close on June 17, 2024. Morgan Stanley, J.P. Morgan, and Allen & Company LLC are leading the offering as book-running managers.",
      "url": "https://www.businesswire.com/news/home/20240613404159/en/Tempus-Announces-Pricing-of-Initial-Public-Offering",
      "source": "Business Wire",
      "published": "20240613T000000",
      "overall_sentiment_score": 0.350147,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.3207,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.625576
    },
    {
      "title": "Naver's Webtoon Entertainment aims up to $2.67 bln valuation in US IPO",
      "summary": "Webtoon Entertainment, majority-owned by South Korean tech giant Naver, is targeting a valuation of up to $2.67 billion in its upcoming U.S. initial public offering. The online comics platform plans to raise as much as $315 million by offering 15 million shares at a price range of $18 to $21 each, joining other companies looking to capitalize on improving investor sentiment. Webtoon, which connects 24 million creators with nearly 170 million monthly active users, will list on the Nasdaq under the symbol \"WBTN\".",
      "url": "https://www.reuters.com/markets/us/navers-webtoon-entertainment-targets-up-267-bln-valuation-us-ipo-2024-06-17/",
      "source": "Reuters",
      "published": "20240617T122100",
      "overall_sentiment_score": 0.260241,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.219996,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.625385
    },
    {
      "title": "Fair Isaac Corporation (NYSE:FICO): The Original AI Stock with the Patents to Prove It",
      "summary": "Fair Isaac Corporation (NYSE:FICO) CEO Will Lansing discusses the company's long history as an analytics and AI pioneer, dating back to the 1950s. He highlights FICO's two main business sides: the widely recognized FICO Score for credit evaluation and its growing software platform for financial institutions. Lansing also emphasizes FICO's focus on \"explainable AI\" and empowering consumers with their financial data.",
      "url": "https://www.twst.com/news/fair-isaac-corporation-nysefico-the-original-ai-stock-with-the-patents-to-prove-it/",
      "source": "The Wall Street Transcript",
      "published": "20240607T000000",
      "overall_sentiment_score": 0.484965,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.398558,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.624748
    },
    {
      "title": "Best Bank ETFs",
      "summary": "This article discusses the best bank ETFs to consider for exposure to the financial sector, especially after the US Bank Crisis. It highlights that while individual banks may fail, the broader banking and finance sector is expected to thrive. The author recommends bank ETFs as a safer alternative to individual bank stocks due to the inherent risks.",
      "url": "https://drwealth.com/best-bank-etfs/",
      "source": "Dr Wealth",
      "published": "20240615T035326",
      "overall_sentiment_score": 0.254875,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.243051,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.623704
    },
    {
      "title": "Keurig Dr Pepper Opens Brazilian Trading and Logistics Branch, KDP Brasil Global",
      "summary": "Keurig Dr Pepper (KDP) and its Swiss coffee trading arm, Keurig Trading, have established a new office in Brazil named KDP Brasil Global. This branch will focus on green coffee sourcing, logistics, and quality, aimed at building a more resilient and transparent coffee supply chain. This move positions KDP at the heart of the world's largest coffee-producing region to engage directly with local vendors and improve service and quality.",
      "url": "https://dailycoffeenews.com/2024/06/03/keurig-dr-pepper-opens-brazilian-trading-and-logistics-branch-kdp-brasil-global/",
      "source": "Daily Coffee News by Roast Magazine",
      "published": "20240603T000000",
      "overall_sentiment_score": 0.146408,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.108453,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.616822
    },
    {
      "title": "News | Blackstone To Expand at Longtime New York City Home",
      "summary": "Blackstone, the private equity giant, is expanding its footprint at its longtime New York City headquarters at 345 Park Avenue, increasing its lease to 1.06 million square feet across 28 floors. This move makes Blackstone New York's seventh-largest commercial office tenant and represents the largest commercial office lease executed in the city since 2022, signaling confidence in Midtown Manhattan's office market. The expansion comes as Blackstone's assets under management surpassed $1 trillion and amidst ongoing developments in the Park Avenue area, reinforcing its status as a premier financial services hub.",
      "url": "https://www.costar.com/article/1613279548/blackstone-to-expand-at-longtime-new-york-city-home",
      "source": "CoStar",
      "published": "20240612T211400",
      "overall_sentiment_score": 0.210849,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.112853,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.615892
    },
    {
      "title": "Ferguson plc: Share Repurchase Program",
      "summary": "Ferguson plc has entered into a non-discretionary arrangement with J.P. Morgan Securities LLC to continue its $4.0 billion share repurchase program. This tranche allocates a maximum of $235 million and will run from June 10, 2024, to September 26, 2024. The program aims to reduce the company's capital, with repurchased shares potentially used to satisfy share awards, and will transition to Ferguson Enterprises Inc. after a merger effective August 1, 2024.",
      "url": "https://www.businesswire.com/news/home/20240610634018/en/Ferguson-plc-Share-Repurchase-Program",
      "source": "Business Wire",
      "published": "20240610T000000",
      "overall_sentiment_score": 0.244397,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.107369,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.606505
    },
    {
      "title": "This ETF strategy may help investors skirt market concentration risk",
      "summary": "Investors seeking to avoid market concentration risk might consider value-oriented investments, according to Phil McInnis of Avantis Investors. He suggests a diversified approach beyond typical index funds, favoring companies with low valuations and strong balance sheets through an ETF strategy that includes a profitability overlay. Avantis' U.S. Large Cap Value ETF (AVLV) aims for less concentration by making smaller bets on profitable, attractively priced companies across various sectors, demonstrating stronger performance than its benchmark.",
      "url": "https://www.cnbc.com/2024/06/15/avoid-concentration-risk-with-this-value-play-etf-expert-suggests.html",
      "source": "CNBC",
      "published": "20240615T005811",
      "overall_sentiment_score": 0.372046,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.327694,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.604427
    },
    {
      "title": "Which Japan ETF should fund selectors choose?",
      "summary": "This article examines three UCITS Japan ETFs—BlackRock’s SJPA, Vanguard’s VJPB, and DWS’s XDJP—comparing their exposure, returns, bid-ask spread, tracking difference, and fees. It analyzes their methodologies and performance to help fund selectors choose the best option for capturing Japanese equity exposure, concluding that Vanguard's VJPB currently holds a narrow edge despite higher fees. The article also highlights the importance of macro developments and currency hedging considerations for investors in Japan ETFs.",
      "url": "https://www.etfstream.com/articles/which-japan-etf-should-fund-selectors-choose",
      "source": "ETF Stream",
      "published": "20240604T000000",
      "overall_sentiment_score": 0.173356,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.138695,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.603095
    },
    {
      "title": "Waystar Shares Dip After 2024’s Biggest IPO by a US Company",
      "summary": "Waystar Holding Corp. shares declined after its initial public offering raised $968 million, making it the largest IPO by a US-based company this year. The healthcare payments software maker priced its shares at $21.50 apiece and aims to use the proceeds to repay debt and invest in innovation. Despite the dip, Waystar is leveraging AI to address complex healthcare revenue cycle issues and expects to grow its addressable market significantly.",
      "url": "https://www.livemint.com/market/ipo/waystar-shares-dip-after-2024-s-biggest-ipo-by-a-us-company-11717783453909.html",
      "source": "mint",
      "published": "20240607T233400",
      "overall_sentiment_score": 0.028127,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.123208,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.602761
    },
    {
      "title": "Omnis Investments to include ETFs in new MPS",
      "summary": "Omnis Investments has launched a new managed portfolio service (MPS) named Omnis Agility, consisting of four portfolios, each allocating 30% to ETFs. This MPS will blend in-house active funds with ETFs, primarily focusing on equities and fixed income, selected based on size, cost, tracking accuracy, and manager reputation. The firm believes ETFs offer greater flexibility and access to opportunities, enhancing long-term performance efficiently.",
      "url": "https://www.etfstream.com/articles/omnis-investments-to-include-etfs-in-new-mps",
      "source": "ETF Stream",
      "published": "20240603T000000",
      "overall_sentiment_score": 0.242022,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.241732,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.602017
    },
    {
      "title": "Addus HomeCare expands personal care services to 2 new states with $350M deal",
      "summary": "Addus HomeCare is set to acquire Gentiva's personal care business for $350 million, expanding its personal care services into two new states: Texas and Missouri. This acquisition is expected to boost Addus' annualized revenues by approximately $280 million and is part of its strategic growth plan through accretive acquisitions. Meanwhile, Gentiva will sharpen its focus on its core hospice and palliative care businesses.",
      "url": "https://www.fiercehealthcare.com/providers/addus-homecare-expands-personal-care-services-3-new-states-350m-deal",
      "source": "Fierce Healthcare",
      "published": "20240610T163000",
      "overall_sentiment_score": 0.266777,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.105791,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.577671
    },
    {
      "title": "Overheard at the Forum: How Colony Bank Hired a Fintech Creator to Jump Start Innovation",
      "summary": "Christian Ruppe, SVP and chief innovation officer at Colony Bank, focuses on implementing fintech-derived skills to drive innovation within the community bank rather than pursuing cutting-edge, untested technologies. He acts as an integrator of internal and external resources, guided by the bank's strategic plan, to bring the $3 billion institution up to date and ready for future advancements. Ruppe emphasizes that innovation is a continuous process that must happen regardless of economic conditions, especially in community banking, and that future efforts will likely focus on streamlining business banking services.",
      "url": "https://thefinancialbrand.com/news/banking-innovation/how-colony-bank-accelerates-innovation-with-fintech-dna-178522",
      "source": "The Financial Brand",
      "published": "20240603T000000",
      "overall_sentiment_score": 0.103902,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.085179,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.550464
    }
  ]
}