{
  "ticker": "JPM",
  "date": "2024-11-11",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T12:57:42.446810",
  "source": "alpha_vantage",
  "article_count": 26,
  "articles": [
    {
      "title": "DBS Reaffirms Their Hold Rating on Automatic Data Processing (ADP)",
      "summary": "DBS analyst Andy Yu CFA reaffirmed a Hold rating on Automatic Data Processing (ADP), setting a price target of $306.00. This comes as ADP reported strong quarterly revenue of $5.18 billion and a net profit of $1.01 billion for the quarter ending September 30. Other analysts also weighed in, with Morgan Stanley maintaining a Hold and Mizuho Securities reiterating a Buy.",
      "url": "https://www.theglobeandmail.com/investing/markets/stocks/ADP-Q/pressreleases/36043197/dbs-reaffirms-their-hold-rating-on-automatic-data-processing-adp/",
      "source": "The Globe and Mail",
      "published": "20241111T054900",
      "overall_sentiment_score": 0.057229,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.145125,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.614372
    },
    {
      "title": "Wells Fargo Bank Decreases Prime Rate to 7.75 Percent",
      "summary": "Wells Fargo Bank announced it is decreasing its prime rate to 7.75 percent from 8.00 percent, effective November 8, 2024. The company, a leading financial services provider with approximately $1.9 trillion in assets, offers a diversified set of banking, investment, and mortgage products. Wells Fargo focuses its social impact on building a sustainable, inclusive future by supporting housing affordability, small business growth, financial health, and a low-carbon economy.",
      "url": "https://www.businesswire.com/news/home/20241107825601/en/Wells-Fargo-Bank-Decreases-Prime-Rate-to-7.75-Percent",
      "source": "Business Wire",
      "published": "20241107T000000",
      "overall_sentiment_score": 0.160554,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.136412,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.622035
    },
    {
      "title": "DevvStream Holdings Inc. Announces Completion of Business Combination with Focus Impact Acquisition Corp.; Secures Up to US$43M of Additional Capital to Execute Growth Plans",
      "summary": "DevvStream Holdings Inc. has completed its business combination with Focus Impact Acquisition Corp., making it the first publicly traded carbon credit generation company on a major U.S. stock exchange. The combined entity will be renamed DevvStream Corp. and its shares are expected to trade on the Nasdaq under the ticker \"DEVS\" starting November 7, 2024. DevvStream also secured up to $43 million in additional financing to accelerate growth and democratize access to carbon markets.",
      "url": "https://www.newsfilecorp.com/release/229105/DevvStream-Holdings-Inc.-Announces-Completion-of-Business-Combination-with-Focus-Impact-Acquisition-Corp.-Secures-Up-to-US43M-of-Additional-Capital-to-Execute-Growth-Plans",
      "source": "Newsfile",
      "published": "20241106T160100",
      "overall_sentiment_score": 0.492002,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.278276,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.610654
    },
    {
      "title": "JP Morgan AM brings $37bn US equity premium income ETF to Europe",
      "summary": "JP Morgan Asset Management (JPMAM) has launched two new active premium income ETFs in Europe: the JPMorgan US Equity Premium Income Active UCITS ETF (JEPI) and the JPMorgan Nasdaq Equity Premium Income Active UCITS ETF (JEPQ). These UCITS versions mirror successful US-listed strategies, with the US JEPI having amassed $36.6bn and JEPQ $17.6bn. Both new ETFs are designed to provide high yields and reduced volatility through an options strategy.",
      "url": "https://www.etfstream.com/articles/jp-morgan-am-brings-usd37bn-us-equity-premium-income-etf-to-europe",
      "source": "ETF Stream",
      "published": "20241106T000000",
      "overall_sentiment_score": 0.43035,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.403909,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.823433
    },
    {
      "title": "Equitable hones in on annuity delivery across channels after strong Q3",
      "summary": "Equitable Holdings is focusing on its strong annuity products, particularly its market-leading registered indexed-linked annuities (RILAs), after a strong Q3. Despite increasing competition in the RILA market, Equitable believes its integrated business model and partnerships, such as those with J.P. Morgan Asset Management and BlackRock for lifetime income solutions, will continue to drive growth. The company reported record assets under management and administration of $1 trillion, despite a net income decrease compared to the previous year.",
      "url": "https://insurancenewsnet.com/innarticle/equitable-hones-in-on-annuity-delivery-across-channels-after-strong-q3",
      "source": "InsuranceNewsNet",
      "published": "20241105T000000",
      "overall_sentiment_score": 0.260496,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.134654,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.600486
    },
    {
      "title": "CoreCard Corporation (NYSE:CCRD) Q3 2024 Earnings Call Transcript",
      "summary": "CoreCard Corporation (NYSE:CCRD) reported better-than-expected Q3 2024 results, with total revenue up 17% year-over-year to $15.7 million, driven by higher license, professional services, and processing/maintenance revenues. The company provided 2025 guidance forecasting total revenue between $60 million and $64 million, and earnings per share between $0.88 and $0.94, with revenue growth excluding Goldman Sachs anticipated at 30% to 40%. CEO Leland Strange also discussed the secured Goldman Sachs agreement through 2026, the ongoing development of their CoreFi platform, and the company's share repurchase program, reiterating that the stock is undervalued.",
      "url": "https://www.insidermonkey.com/blog/corecard-corporation-nyseccrd-q3-2024-earnings-call-transcript-1384541/",
      "source": "Insider Monkey",
      "published": "20241102T082300",
      "overall_sentiment_score": 0.251358,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.104092,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.641148
    },
    {
      "title": "Barclays Sticks to Its Buy Rating for Anheuser Busch InBev SA/NV (0RJI)",
      "summary": "Barclays has reiterated its Buy rating for Anheuser Busch InBev SA/NV (0RJI), setting a price target of €88.00. J.P. Morgan also maintained a Buy rating with a €75.00 price target. The company currently has a \"Strong Buy\" analyst consensus with a price target consensus of €68.86, indicating a 30.99% upside.",
      "url": "https://www.theglobeandmail.com/investing/markets/stocks/BUD/pressreleases/35841703/barclays-sticks-to-its-buy-rating-for-anheuser-busch-inbev-sanv-0rji/",
      "source": "The Globe and Mail",
      "published": "20241101T024600",
      "overall_sentiment_score": 0.406919,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.312373,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.632822
    },
    {
      "title": "EPAM Completes Acquisition of NEORIS",
      "summary": "EPAM Systems, Inc. announced the successful completion of its acquisition of NEORIS, a global advanced technology consultancy. This acquisition enhances EPAM’s delivery capabilities in Latin America and Europe, significantly boosting client value across key industries. It also strategically expands EPAM's offerings to Spanish- and Portuguese-speaking countries and broadens global nearshore delivery capabilities.",
      "url": "https://www.epam.com/about/newsroom/press-releases/2024/epam-completes-acquisition-of-neoris",
      "source": "EPAM",
      "published": "20241101T000000",
      "overall_sentiment_score": 0.263457,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.14647,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.613139
    },
    {
      "title": "BlackRock launches ETF that expands beyond the ‘Magnificent Seven'",
      "summary": "BlackRock's iShares has launched a new ETF, the iShares Top 20 U.S. Stocks ETF (TOPT), aimed at investors looking to diversify beyond the \"Magnificent Seven\" tech giants. This ETF comprises the 20 largest U.S. stocks by market capitalization, offering a broader and more diversified approach to capturing growth in the U.S. equity market. The launch addresses concerns about the high concentration and valuations of the Magnificent Seven, which recently experienced a significant market cap slide.",
      "url": "https://www.nbcdfw.com/news/business/money-report/blackrock-launches-etf-that-expands-beyond-the-magnificent-seven/3685874/",
      "source": "NBC 5 Dallas-Fort Worth",
      "published": "20241031T225721",
      "overall_sentiment_score": 0.031223,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.145883,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.600448
    },
    {
      "title": "Camping World’s $300M Stock Offering Priced at $20.50",
      "summary": "Camping World Holdings Inc. (NYSE:CWH) announced the pricing of a $300.0 million public offering of its Class A common stock at $20.50 per share. The company will use the proceeds to purchase common units from CWGS Enterprises LLC, which will allocate the funds for general corporate purposes, including balance sheet strengthening and debt reduction. Goldman Sachs & Co. LLC and J.P. Morgan are serving as joint lead book-running managers for the offering.",
      "url": "https://rvbusiness.com/camping-worlds-300m-stock-offering-priced-at-20-50/",
      "source": "RVBusiness",
      "published": "20241031T000000",
      "overall_sentiment_score": 0.169604,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.142217,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.737087
    },
    {
      "title": "ZJK Industrial Co., Ltd. Announces Partial Exercise of Over-Allotment Option",
      "summary": "ZJK Industrial Co., Ltd. announced that the underwriters of its initial public offering partially exercised their over-allotment option, purchasing an additional 131,249 ordinary shares at $5.00 per share. This increased the total offering to 1,381,249 ordinary shares, generating gross proceeds of approximately $6.91 million. The proceeds will be allocated towards expanding manufacturing facilities, growing the North American sales network, potential acquisitions in the fasteners industry, and general corporate purposes.",
      "url": "https://www.stocktitan.net/news/ZJK/zjk-industrial-co-ltd-announces-partial-exercise-of-over-allotment-1cwwwmt3bfso.html",
      "source": "Stock Titan",
      "published": "20241030T132500",
      "overall_sentiment_score": 0.128692,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.066057,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.580476
    },
    {
      "title": "EyePoint Pharmaceuticals Announces Pricing of Upsized Public Offering",
      "summary": "EyePoint Pharmaceuticals has priced an upsized public offering of 12,727,273 shares of its common stock at $11.00 per share, expecting gross proceeds of approximately $140.0 million. The company plans to use these proceeds to advance the clinical development of DURAVYU™ for wet age-related macular degeneration (wet AMD) and diabetic macular edema (DME), as well as support earlier-stage pipeline initiatives and general corporate purposes. The offering is expected to close around October 31, 2024, with underwriters having an option to purchase additional shares.",
      "url": "https://investors.eyepointpharma.com/news-releases/news-release-details/eyepoint-pharmaceuticals-announces-pricing-upsized-public-0",
      "source": "EyePoint Pharmaceuticals",
      "published": "20241029T000000",
      "overall_sentiment_score": 0.168303,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.105497,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.616666
    },
    {
      "title": "The Global Economy Remains Resilient",
      "summary": "A new report from Citi Chief Economist Nathan Sheets indicates that the global economy continues to grow at a solid, albeit slightly below-trend, pace despite various global developments. The report highlights stronger-than-expected third-quarter performance, leading to an upward revision of global growth forecasts for the year, and notes ongoing disinflation is allowing central banks to gradually ease monetary policies. It also discusses regional economic situations, inflation prospects, and central bank implications.",
      "url": "https://www.citigroup.com/global/insights/global-economic-outlook-strategy-the-global-economy-remains-resilient",
      "source": "Citigroup",
      "published": "20241029T000000",
      "overall_sentiment_score": 0.368059,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.329351,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.423907
    },
    {
      "title": "Hedge funds pile into banks, dump green energy post US election, Goldman Sachs says",
      "summary": "Hedge funds significantly increased their holdings in bank stocks and divested from renewable electricity producers following Donald Trump's U.S. presidential election win, according to a Goldman Sachs report. Financial stocks, particularly U.S. banks, are expected to benefit from a lighter regulatory environment and potential tax reform under the new administration. Conversely, utilities companies, especially independent power and renewable electricity producers, saw increased shorting by hedge funds.",
      "url": "https://www.reuters.com/markets/hedge-flow-hedge-funds-pile-into-banks-dump-green-energy-post-us-election-2024-11-11/",
      "source": "Reuters",
      "published": "20241111T160900",
      "overall_sentiment_score": 0.294449,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.339832,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.61046
    },
    {
      "title": "Prudential Names Chappuis President and CEO of PGIM",
      "summary": "Prudential Financial, Inc. has appointed Jacques Chappuis as president and CEO of PGIM, its $1.4 trillion global investment management business, effective May 1, 2025. Chappuis succeeds David Hunt, under whose leadership PGIM's assets under management grew significantly from $619 billion to $1.4 trillion. Chappuis brings nearly 30 years of investment management experience, including a key role in the integration of Eaton Vance at Morgan Stanley Investment Management.",
      "url": "https://njbmagazine.com/njb-news-now/prudential-names-chappuis-president-and-ceo-of-pgim/",
      "source": "New Jersey Business Magazine",
      "published": "20241111T000000",
      "overall_sentiment_score": 0.3522,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.310103,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.631992
    },
    {
      "title": "Why Shares of QuantumScape, First Solar, and ChargePoint Plunged in October",
      "summary": "Shares of QuantumScape, First Solar, and ChargePoint experienced significant drops in October due to various factors including analyst downgrades, production delays, and political concerns. QuantumScape faced investor disappointment over a delayed production ramp-up, First Solar was impacted by a port strike and weak earnings, and ChargePoint suffered from analyst skepticism and fears surrounding President-elect Trump's stance on EVs. Despite these challenges, the article suggests maintaining a long-term investment perspective, especially for industry leaders like First Solar, while cautioning about the higher risk associated with QuantumScape and ChargePoint.",
      "url": "https://www.fool.com/investing/2024/11/08/why-shares-of-quantumscape-first-solar-and-chargep/",
      "source": "The Motley Fool",
      "published": "20241108T123900",
      "overall_sentiment_score": -0.113428,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.137686,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.637431
    },
    {
      "title": "Enstar shareholders approve acquisition by Sixth Street",
      "summary": "Enstar Group Limited shareholders have approved its acquisition by Sixth Street in a $5.1 billion transaction. Upon closing, expected in mid-2025, Enstar will become a privately-held company and its shareholders will receive $338.00 in cash per ordinary share. The company will continue to operate under its current name and business strategy.",
      "url": "https://www.reinsurancene.ws/enstar-shareholders-approve-acquisition-by-sixth-street/",
      "source": "Reinsurance News",
      "published": "20241108T000000",
      "overall_sentiment_score": 0.285311,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.202877,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.632636
    },
    {
      "title": "Truist adds JPMorgan exec to lead mid-corporate unit",
      "summary": "Truist Financial has hired Kerry Jessani, a former JPMorgan executive, to lead its mid-corporate banking unit starting in February. Jessani brings over 20 years of experience from JPMorgan, where she most recently served as deputy head of specialized industries for commercial banking. This strategic hire aims to enhance Truist's commercial banking business and complement its investment corporate banking coverage.",
      "url": "https://businessnc.com/truist-adds-jpmorgan-exec-to-lead-mid-corporate-unit/",
      "source": "Business North Carolina",
      "published": "20241104T000000",
      "overall_sentiment_score": 0.282924,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.281995,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.843741
    },
    {
      "title": "ETF trading: Silver ETFs Outperform GLD Amid Strong Metals Rally",
      "summary": "Silver ETFs, specifically Abrdn Physical Silver Shares ETF (SIVR) and iShares Silver Trust (SLV), have surged nearly 41% year-to-date, outperforming the SPDR Gold Trust ETF (GLD) which rose 33%. This performance for silver is its best since 2020, driven by factors similar to gold, increased industrial demand, and anticipated interest rate cuts. Despite its volatility, silver is seen by some analysts as having significant upside potential, possibly testing its 2011 peak.",
      "url": "https://www.markets.com/news/etf-trading-silver-et-fs-outperform-gld-amid-strong-metals-rally",
      "source": "Markets.com",
      "published": "20241103T000000",
      "overall_sentiment_score": 0.152482,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.010667,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.642683
    },
    {
      "title": "MDU Resources Completes Spinoff of Everus Construction Group",
      "summary": "MDU Resources Group, Inc. has successfully completed the spinoff of its construction services subsidiary, Everus Construction Group, making Everus an independent public company. MDU Resources shareholders received one share of Everus common stock for every four shares of MDU Resources common stock held, with Everus now trading on the NYSE under the ticker symbol \"ECG.\" This strategic move aims to create value for shareholders and position MDU Resources as a pure-play regulated energy delivery business.",
      "url": "https://www.prnewswire.com/news-releases/mdu-resources-completes-spinoff-of-everus-construction-group-302294093.html",
      "source": "PR Newswire",
      "published": "20241101T083000",
      "overall_sentiment_score": 0.240806,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.113276,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.581209
    },
    {
      "title": "The mortgage industry braces for (more) FICO price hikes",
      "summary": "The mortgage industry is anticipating further price hikes for FICO scores, causing concern among lenders who fear increased costs and potential abuse of power by credit reporting bureaus. Despite widespread speculation and analyst estimates suggesting significant revenue boosts for FICO, the company has not yet officially confirmed any pricing details for 2025. Lenders expect to receive more information after the upcoming election, with credit reporting agencies also expected to increase their prices.",
      "url": "https://www.housingwire.com/articles/the-mortgage-industry-braces-for-more-fico-price-hikes/",
      "source": "HousingWire",
      "published": "20241031T143300",
      "overall_sentiment_score": 0.164399,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.214602,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.646018
    },
    {
      "title": "Visa class action alleges company monopolizes debit card networks",
      "summary": "A new class action lawsuit has been filed against Visa Inc., alleging the company monopolizes debit card networks and charges artificially inflated prices for its debit products. The plaintiff, Yabla Inc., claims Visa engages in exclusionary conduct to stifle competition and protect its highly profitable debit business. The lawsuit seeks to represent merchants in the U.S. who have accepted Visa-branded debit cards since October 22, 2020, and alleges Sherman Act violations.",
      "url": "https://topclassactions.com/lawsuit-settlements/money/credit-cards/visa-class-action-alleges-company-monopolizes-debit-card-networks/",
      "source": "Class Action Lawsuits",
      "published": "20241031T000000",
      "overall_sentiment_score": -0.181553,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.139177,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.564252
    },
    {
      "title": "Macerich Lands $525M for Queens Mall",
      "summary": "Macerich has refinanced its Queens Center shopping mall with a new $525 million loan at a fixed interest rate of 5.37 percent, marking their lowest refinancing rate since 2019. This deal is more favorable than anticipated and replaces a $600 million CMBS loan due to mature next January. Queens Center is highlighted as a top-performing asset in Macerich's portfolio, with new retailers soon to open, filling all available retail space.",
      "url": "https://www.commercialsearch.com/news/macerich-lands-525m-for-queens-mall/",
      "source": "Commercial Search",
      "published": "20241030T000000",
      "overall_sentiment_score": 0.171154,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.14445,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.613201
    },
    {
      "title": "What to Know About Investing in Private Credit",
      "summary": "This article discusses key aspects of investing in private credit, highlighting its significant market growth and inherent liquidity challenges. It also raises questions about its performance during future economic downturns.",
      "url": "https://www.thinkadvisor.com/2024/10/31/what-to-know-about-investing-in-private-credit/",
      "source": "ThinkAdvisor",
      "published": "20241031T163600",
      "overall_sentiment_score": 0.10645,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.115757,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.625536
    },
    {
      "title": "Here’s how ETF investors can lock in higher yields as Treasury rates jumped in October",
      "summary": "MarketWatch reporter Isabel Wang discusses how ETF investors can secure higher yields in a volatile bond market. The article highlights defined-maturity bond ladder ETFs as a strategy to lock in high yields and match investment goals with specific maturity dates. This approach is particularly relevant given the jump in Treasury rates observed in October.",
      "url": "https://www.marketwatch.com/story/heres-how-etf-investors-can-lock-in-higher-yields-as-treasury-rates-jumped-in-october-5b49face?gaa_at=eafs&gaa_n=AWEtsqfrKpXHNFtzkwtUoHyTamKPimzCabWStabTG9RGpmIDhGONwWFaD5dl&gaa_ts=69076146&gaa_sig=M1hC6xuf3263tVzVYt2tVqt80lC3JiaXxyr1IxS4S2t5HXEpnkN3L9coboPUmm0qsu1l8ucGjv5G6bbp6lIgrQ%3D%3D",
      "source": "MarketWatch",
      "published": "20241031T183800",
      "overall_sentiment_score": 0.144883,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.100425,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.623112
    },
    {
      "title": "3 Top Dividend ETFs That Could Build Generation-Spanning Wealth",
      "summary": "This article highlights three top dividend-focused ETFs—iShares Core Dividend Growth ETF (DGRO), Vanguard High Dividend Yield ETF (VYM), and Schwab U.S. Dividend Equity ETF (SCHD)—as efficient ways to build long-term wealth through compound growth. These ETFs offer low expense ratios and hold high-quality companies with consistent dividend histories, providing a reliable investment strategy amidst market volatility. Each fund is detailed with its investment strategy, top holdings, expense ratio, yield, and historical performance over the past decade.",
      "url": "https://www.fool.com/investing/2024/10/29/3-top-dividend-etfs-that-could-build-generation-sp/",
      "source": "The Motley Fool",
      "published": "20241029T070000",
      "overall_sentiment_score": 0.363973,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.298445,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.625193
    }
  ]
}