{
  "ticker": "JPM",
  "date": "2024-08-19",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T12:17:37.538488",
  "source": "alpha_vantage",
  "article_count": 35,
  "articles": [
    {
      "title": "JPMorgan (JPM) Trading Desk Says ‘Getting Close’ to Buy-the-Dip Opportunity",
      "summary": "JPMorgan's trading desk suggests that the recent selloff in global stocks, particularly the tech sector, might be nearing a tactical \"buy the dip\" opportunity. The Nasdaq 100 Index experienced a significant drop, correlating with a weak US jobs report and increased market volatility. JPMorgan eyes manufacturing and inflation data as key factors for a potential market bounce.",
      "url": "https://www.bloomberg.com/news/articles/2024-08-05/jpm-trading-desk-says-getting-close-to-buy-the-dip-opportunity-lzh07hst",
      "source": "Bloomberg.com",
      "published": "20240805T130500",
      "overall_sentiment_score": 0.425414,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.40595,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "JP Morgan launches active ETFs driven by data science",
      "summary": "JP Morgan Asset Management has introduced a new suite of actively managed US equity ETFs that leverage data science techniques to construct fundamentally selected portfolios. The suite includes three ETFs targeting different market capitalization segments—large, mid, and small core—with expense ratios ranging from 0.30% to 0.40%. These ETFs use proprietary data analysis and research to forecast financial prospects, aiming to identify favorably priced securities while managing associated risks.",
      "url": "https://www.etfstrategy.com/jp-morgan-launches-active-etfs-driven-by-data-science-10339/",
      "source": "ETF Strategy",
      "published": "20240813T195809",
      "overall_sentiment_score": 0.224012,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.260397,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.882306
    },
    {
      "title": "Franklin Templeton, Sun Life subsidiaries join Climate Action 100+ exodus",
      "summary": "Subsidiaries of Franklin Templeton and Sun Life Financial have announced their departure from the Climate Action 100+ coalition, following Goldman Sachs' asset management arm. These withdrawals, including ClearBridge Investments, SLC Fixed Income, and Crescent Capital, occurred after increased scrutiny on ESG and climate initiatives and a House Judiciary Committee inquiry into CA100+ members. The exits highlight ongoing political pressures faced by the climate action investor group.",
      "url": "https://www.esgdive.com/news/franklin-templeton-sun-life-subsidiaries-join-climate-action-100-exodus/724617/",
      "source": "ESG Dive",
      "published": "20240819T000000",
      "overall_sentiment_score": -0.201937,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.232666,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.73926
    },
    {
      "title": "He’s Back by Popular Demand! Sir Rod Stewart Returning to The Colosseum at Caesars Palace in 2025",
      "summary": "Sir Rod Stewart is returning to The Colosseum at Caesars Palace in 2025 for \"The Encore Shows\" after his successful 13-year residency. The shows, presented in partnership with Caesars Entertainment and Live Nation Las Vegas, will feature his greatest hits and new production elements. Presale tickets begin August 8th, with general public sales starting August 12th for concert dates in March, May, and June of 2025.",
      "url": "https://investor.caesars.com/news-releases/news-release-details/hes-back-popular-demand-sir-rod-stewart-returning-colosseum",
      "source": "Caesars Entertainment",
      "published": "20240807T000000",
      "overall_sentiment_score": 0.274041,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.146816,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.64669
    },
    {
      "title": "Net Lease Office Properties Sells Asset for $72M",
      "summary": "Net Lease Office Properties (NLOP) has sold a 354,000-square-foot office building in metro Phoenix for $71.5 million as part of its ongoing sell-off strategy. The proceeds will be used to repay $55 million on the senior secured mortgage and $8 million on its mezzanine loan. This sale is part of NLOP's plan to exit the ailing office market, following its spin-off from W.P. Carey last year.",
      "url": "https://www.commercialsearch.com/news/net-lease-office-properties-sells-asset-for-72m/",
      "source": "CommercialSearch",
      "published": "20240809T000000",
      "overall_sentiment_score": -0.086388,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.104735,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.642634
    },
    {
      "title": "Rockefeller crashes the high-yield muni bond party with new ETFs",
      "summary": "Rockefeller Asset Management is entering the high-yield municipal bond ETF market with new actively managed funds. Managed by a team from Invesco, these ETFs will focus on lower-rated municipal bonds, including specific offerings for California and New York tax-exempt bonds. This move capitalizes on the growing $131 billion muni ETF space, where high-yield muni bonds have shown strong performance.",
      "url": "https://www.investmentnews.com/etfs/rockefeller-crashes-the-high-yield-muni-bond-party-with-new-etfs/256353",
      "source": "InvestmentNews",
      "published": "20240814T140926",
      "overall_sentiment_score": 0.139376,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.134191,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.638227
    },
    {
      "title": "JBND: New Active Bond ETF From JPMorgan (NYSE:JBND)",
      "summary": "JBND is a new actively managed fixed-income ETF from JPMorgan focusing on U.S. investment-grade bonds with a higher duration and securitized products compared to JPIE. The fund primarily holds highly-rated assets (AAA, AA, A-rated accounting for over 80% of holdings) and features a 6-year duration. In its short history, JBND has outperformed IEF, a treasuries-only ETF, demonstrating the effectiveness of active management in the current market.",
      "url": "https://seekingalpha.com/article/4715556-jbnd-new-active-bond-etf-from-jpmorgan",
      "source": "Seeking Alpha",
      "published": "20240819T045500",
      "overall_sentiment_score": 0.396187,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.312593,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.637443
    },
    {
      "title": "Marathon Investor Sues to Block ConocoPhillips Acquisition",
      "summary": "A Marathon Oil Corp. shareholder has filed a lawsuit to block the proposed $17 billion acquisition by ConocoPhillips, claiming the deal significantly undervalues Marathon by over $6 billion. The lawsuit alleges misrepresentation by Marathon, its directors, and financial adviser Morgan Stanley, and seeks to halt an investor vote until corrective disclosures are made or a trial is held. The plaintiff also raises questions about potential conflicts of interest for Marathon's management and advisers.",
      "url": "https://www.ttnews.com/articles/marathon-sues-conocophillips",
      "source": "Transport Topics",
      "published": "20240812T163900",
      "overall_sentiment_score": 0.023301,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.068841,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.63685
    },
    {
      "title": "Investment funds pour into Australian banks; caution on miners",
      "summary": "Australian financial stocks are gaining favor with equity funds, surpassing miners on the local main index due to concerns about poor Chinese demand for commodities. The financial sub-index has risen over 15% this year, while the metals and mining index has declined more than 18%. Despite recent struggles in the mining sector, some traders are starting to buy miners again due to perceived cheap stock prices and stimulus measures from China.",
      "url": "https://www.kitco.com/news/off-the-wire/2024-08-12/investment-funds-pour-australian-banks-caution-miners",
      "source": "KITCO",
      "published": "20240812T154900",
      "overall_sentiment_score": 0.315161,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.340537,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.633485
    },
    {
      "title": "Canada’s Scotiabank Stakes Out $2.8 Billion in US Lender KeyCorp",
      "summary": "Canada's Scotiabank has acquired a 14.9% stake in US regional lender KeyCorp for $2.8 billion, representing a strategic pivot towards the US market after mixed results in Latin America. This move expands Scotiabank's presence in the US and offers KeyCorp opportunities to explore investment banking, wealth, and payments through Scotiabank's international network, while KeyCorp is currently navigating challenges from high interest rates and increased deposit costs.",
      "url": "https://www.thedailyupside.com/finance/banking/canadas-scotiabank-stakes-out-2-8-billion-in-us-lender-keycorp/",
      "source": "The Daily Upside",
      "published": "20240812T000000",
      "overall_sentiment_score": 0.111268,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.145516,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.630324
    },
    {
      "title": "US 30-year mortgage rate drops on weak jobs data, Fed rate-cut signal",
      "summary": "The 30-year fixed-rate mortgage dropped to its lowest level in 15 months, reaching 6.55% after the Federal Reserve signaled potential rate cuts and weak jobs data bolstered market expectations for significant reductions. This decline offers relief to potential homebuyers and those looking to refinance, though low housing inventory continues to constrain purchase activity. The shift in the Fed's communication, now focusing on both inflation and the labor market, has already translated to lower mortgage rates as investors anticipate future central bank actions.",
      "url": "https://www.reuters.com/markets/us/us-30-year-mortgage-rate-drops-weak-jobs-data-fed-rate-cut-signal-2024-08-07/",
      "source": "Reuters",
      "published": "20240807T110200",
      "overall_sentiment_score": 0.279813,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.261677,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.629707
    },
    {
      "title": "Veritex Community Bank’s new Houston leader eyes Cypress, Katy for growth",
      "summary": "Veritex Community Bank has appointed Peyton Jones as its new Houston market president. Jones aims to expand the Dallas-based bank's presence in Houston, focusing on growth opportunities in the Cypress and Katy areas.",
      "url": "https://www.bizjournals.com/houston/news/2024/08/12/veritex-community-bank-growth-houston-peyton-jones.html",
      "source": "The Business Journals",
      "published": "20240812T000000",
      "overall_sentiment_score": 0.147494,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.106186,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.628239
    },
    {
      "title": "Owner of 60 Wall Street makes bold bet with $250M revamp: ‘Sink or swim for downtown’",
      "summary": "Paramount Group is investing $250 million to revamp 60 Wall Street, a vacant 1.6 million square-foot tower in the struggling Financial District. This significant renovation aims to attract new tenants and revitalize downtown Manhattan's office market, which faces high vacancy rates. The project is seen as a crucial test for the district's future, with many eyes on whether Paramount can secure major leases.",
      "url": "https://nypost.com/2024/08/18/business/owner-of-60-wall-st-makes-risky-bet-with-massive-250m-revamp/",
      "source": "New York Post",
      "published": "20240818T132300",
      "overall_sentiment_score": 0.101886,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.078351,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.62652
    },
    {
      "title": "Fund Files: Virtus PM to exit firm, American Beacon acquires three Ninety One funds",
      "summary": "Two portfolio managers from Stone Harbor Investment Partners, an affiliate of Virtus Investment Partners, have been removed from four funds totaling $433m in assets, with one PM also confirmed to be leaving the firm. Separately, American Beacon has acquired three Ninety One Emerging Markets funds, adding $1.8bn in AUM to its lineup.",
      "url": "https://citywire.com/pro-buyer/news/fund-files-virtus-pm-to-exit-firm-american-beacon-acquires-three-ninety-one-funds/a2448132",
      "source": "Citywire",
      "published": "20240813T000000",
      "overall_sentiment_score": 0.043682,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.116407,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.62478
    },
    {
      "title": "State Street promotes long-time exec to lead investment services",
      "summary": "State Street Corporation has promoted Joerg Ambrosius to lead its investment services division. Ambrosius will continue in his role as chief commercial officer, a position he has held since October 2022. This move consolidates his leadership within the company's key services.",
      "url": "https://www.bizjournals.com/boston/news/2024/08/12/state-street-investment-services-head.html",
      "source": "The Business Journals",
      "published": "20240812T000000",
      "overall_sentiment_score": 0.223037,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.111575,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.624694
    },
    {
      "title": "Traders lose billions on big volatility short after stocks rout",
      "summary": "Retail traders, hedge funds, and pension funds lost billions after a significant short-volatility bet went wrong following a global stock market selloff. The CBOE VIX index saw its largest-ever intraday jump, costing investors in short-volatility ETFs $4.1 billion and highlighting the risks of such popular strategies. Banks' hedging practices and the rise of zero-day expiry options contributed to the strategy's popularity before the VIX surge.",
      "url": "https://www.reuters.com/markets/us/traders-lose-billions-big-volatility-short-after-stocks-rout-2024-08-07/",
      "source": "Reuters",
      "published": "20240808T045900",
      "overall_sentiment_score": -0.120877,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.23756,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.622867
    },
    {
      "title": "Morgan Stanley team joins NewEdge Wealth in Allentown",
      "summary": "A team of four advisors, led by Paul Emrick, has joined NewEdge Wealth in Allentown, Pennsylvania, from Morgan Stanley. This move marks NewEdge Wealth's second expansion in a week, contributing to the firm's record high AUM of over $55 billion. The team cited a desire to return to independent roots and leverage NewEdge's resources, including Goldman Sachs Custody Solutions, to better serve high-net-worth clients.",
      "url": "https://www.investmentnews.com/ria-news/morgan-stanley-team-joins-newedge-wealth-in-allentown/256491",
      "source": "InvestmentNews",
      "published": "20240819T000000",
      "overall_sentiment_score": 0.126747,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.134454,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.620576
    },
    {
      "title": "2024 Best of Business: Financial Services",
      "summary": "This article announces the winners of the 2024 Best of Business awards in the Financial Services category, recognizing top companies across various financial sectors. It highlights Gold, Silver, and Bronze awardees in categories like Accounting Firm, Business Bank, Community Bank, Consumer Bank, Credit Union, Mortgage Lender, and Wealth Management Firm, detailing their services, achievements, and unique strengths.",
      "url": "https://tcbmag.com/honors/2024-best-of-business-financial-services/",
      "source": "Twin Cities Business",
      "published": "20240808T000000",
      "overall_sentiment_score": 0.60692,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.514154,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.618119
    },
    {
      "title": "Scotiabank to buy almost 15% of KeyCorp for about $2.8 billion",
      "summary": "Scotiabank has agreed to acquire a nearly 15% stake in KeyCorp for approximately $2.8 billion, a move that represents an 11% premium on KeyCorp's recent trading price. This investment signals Scotiabank's strategic shift to focus on North America, while also providing KeyCorp with capital flexibility to improve its balance sheet and accelerate growth. The deal, which will occur in two tranches, positions KeyCorp for potential future strategic opportunities with the Canadian lender.",
      "url": "https://www.crainscleveland.com/banking-finance/scotiabank-buy-nearly-15-stake-keycorp-28b",
      "source": "Crain's Cleveland Business",
      "published": "20240812T082600",
      "overall_sentiment_score": 0.305421,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.132074,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.616417
    },
    {
      "title": "BlackRock iShares Bitcoin Trust Breaks ETF Chart With $20 Billion Inflow",
      "summary": "BlackRock's iShares Bitcoin Trust (IBIT) has achieved a significant milestone by attracting approximately $20 billion in inflows this year, making it the top-performing new ETF launched in 2024. IBIT's success, alongside other spot Bitcoin ETFs, highlights strong investor interest in cryptocurrency as institutions like Goldman Sachs increasingly embrace Bitcoin ETFs. This inflow coincides with a notable recovery in the Bitcoin market, with BTC recently trading around $61,245.",
      "url": "https://br.tradingview.com/news/u_today%3A3d9d7f568094b%3A0-blackrock-ishares-bitcoin-trust-breaks-etf-chart-with-20-billion-inflow/",
      "source": "TradingView – Acompanhe todos os mercados",
      "published": "20240814T105805",
      "overall_sentiment_score": 0.254889,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.308713,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.615802
    },
    {
      "title": "White & Case advises Deutsche Bank and Royal Bank of Canada of financing for US$8.9 billion leveraged buyout R1 RCM Inc.",
      "summary": "White & Case LLP has advised Deutsche Bank and Royal Bank of Canada on a debt financing transaction for the US$8.9 billion leveraged buyout of R1 RCM Inc. by investment funds affiliated with TowerBrook Capital Partners and Clayton, Dubilier & Rice. The legal team included partners Eric Leicht, Eliza McDougall, David Ridley, and Andrew Weisberg, along with associates Shana Vantusko, Elizabeth Mapelli, and Emily Brewster. This transaction involves a leading technology-driven solutions provider for health systems, hospitals, and physician groups.",
      "url": "https://www.whitecase.com/news/press-release/white-case-advises-deutsche-bank-and-royal-bank-canada-financing-us89-billion",
      "source": "White & Case LLP",
      "published": "20240807T000000",
      "overall_sentiment_score": 0.239534,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.183323,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.615576
    },
    {
      "title": "Goldman Sachs leaves climate alliance amid political pressure",
      "summary": "Goldman Sachs' asset management division has exited the investor engagement group Climate Action 100+ due to increasing political pressure and broader backlash against climate-focused coalitions. This move follows similar withdrawals by other firms, prompted by concerns from Republican lawmakers regarding potential antitrust violations. Despite the withdrawal, Goldman Sachs stated its continued commitment to sustainable investing.",
      "url": "https://www.proactiveinvestors.com/companies/news/1054012/goldman-sachs-leaves-climate-alliance-amid-political-pressure-1054012.html",
      "source": "Proactive financial news",
      "published": "20240813T120100",
      "overall_sentiment_score": -0.11465,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.108713,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.615532
    },
    {
      "title": "1,000% stock increase: The story behind Eli Lilly’s pharmaceutical dominance",
      "summary": "Eli Lilly's stock has surged by nearly 1,000% in a decade, reaching a record value of $840 billion, driven by the success of its weight loss and diabetes drugs, Zepbound and Mounjaro. The company, now one of the ten largest globally by market cap, has invested heavily in innovation and new manufacturing facilities to meet overwhelming demand, even surpassing competitors like Novo Nordisk in some drug sales. Eli Lilly aims to become the first healthcare company worth a trillion dollars, planning to launch over 20 new drugs in the next decade.",
      "url": "https://www.calcalistech.com/ctechnews/article/aqtbdq00f",
      "source": "CTech",
      "published": "20240814T142700",
      "overall_sentiment_score": 0.33495,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.145414,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.612628
    },
    {
      "title": "Monroe Capital Leads ~$300mm Asset-Based Financing to Triad Financial Services, Inc.",
      "summary": "Monroe Capital LLC has partnered with Triad Financial Services, Inc. to provide an asset-based financing facility, expected to initially be ~$300 million, for the origination and purchase of commercial Community Rental loans. This financing will enable Triad to expand its services in the manufactured housing community space, offering affordable housing solutions and generating compelling yields for Monroe Capital's investors. The transaction highlights Monroe Capital's expertise in specialty finance and asset-based lending within its Alternative Credit Solutions Group.",
      "url": "https://www.businesswire.com/news/home/20240808029366/en/Monroe-Capital-Leads-%24300mm-Asset-Based-Financing-to-Triad-Financial-Services-Inc.",
      "source": "Business Wire",
      "published": "20240808T000000",
      "overall_sentiment_score": 0.398327,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.30884,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.610993
    },
    {
      "title": "Morgan Stanley says SEC seeking details on advisory account cash balances",
      "summary": "Morgan Stanley announced that the SEC is seeking details regarding advisory account cash balances swept to affiliate bank deposit programs. The company has been in discussions with the SEC since April concerning compliance with the Investment Advisers Act of 1940. Morgan Stanley also disclosed a conditional settlement agreement for a 2017 lawsuit related to the IPO of OW Bunker.",
      "url": "https://www.reuters.com/business/finance/morgan-stanley-discloses-us-sec-requests-information-advisory-account-cash-2024-08-05/",
      "source": "Reuters",
      "published": "20240805T221100",
      "overall_sentiment_score": -0.15835,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.10752,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.610691
    },
    {
      "title": "IDEX Corporation Announces Pricing of Public Offering of Senior Notes",
      "summary": "IDEX Corporation announced the pricing of its public offering of $500 million principal amount of 4.950% Senior Notes due 2029. The net proceeds of approximately $495.0 million will be used to fund the acquisition of Mott Corporation and its subsidiaries, as well as associated fees and expenses. Wells Fargo Securities, BofA Securities, Inc., and J.P. Morgan Securities LLC are acting as joint book-running managers for the offering.",
      "url": "https://www.stocktitan.net/news/IEX/idex-corporation-announces-pricing-of-public-offering-of-senior-jic012vabrta.html",
      "source": "Stock Titan",
      "published": "20240807T173500",
      "overall_sentiment_score": 0.132177,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.128204,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.608291
    },
    {
      "title": "The Standard to Acquire Allstate’s Employer Voluntary Benefits Business for $2B",
      "summary": "The Standard (StanCorp Financial Group Inc.) announced its acquisition of Allstate Corp.'s employer voluntary benefit business for approximately $2 billion. This transaction, expected to close in the first half of 2025, will expand The Standard's workplace benefits offerings and includes a product distribution partnership with Allstate. This strategic move aims to significantly accelerate The Standard's growth and enhance its competitive position in the U.S. employee benefits market.",
      "url": "https://www.plansponsor.com/the-standard-to-acquire-allstates-employer-voluntary-benefits-business-for-2b/",
      "source": "plansponsor",
      "published": "20240814T000000",
      "overall_sentiment_score": 0.19399,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.11407,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.60814
    },
    {
      "title": "New EVP at Bank of Blue Valley also leads private banking for parent company",
      "summary": "Kevin Zimmermann has been appointed as the new Executive Vice President at Bank of Blue Valley. He will also assume the role of head of private banking for its parent company, HTLF Bank. This appointment signifies a key leadership change for the bank.",
      "url": "https://www.bizjournals.com/kansascity/news/2024/08/19/bank-of-blue-valley-evp-director-private-banking.html",
      "source": "The Business Journals",
      "published": "20240819T000000",
      "overall_sentiment_score": 0.109786,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.101544,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.604453
    },
    {
      "title": "Why the Capital One-Discover Merger Makes Sense",
      "summary": "The proposed $35 billion Capital One-Discover merger is analyzed for its competitive implications in consumer banking, credit card issuance, and payment networks. The article argues the merger makes sense as it will not create a \"too big to fail\" institution in banking, nor significantly increase credit card market concentration, but rather disrupt the payment network duopoly of Visa and Mastercard by boosting Discover's network volume.",
      "url": "https://www.jdsupra.com/legalnews/why-the-capital-one-discover-merger-1855455/",
      "source": "JD Supra",
      "published": "20240805T000000",
      "overall_sentiment_score": 0.291983,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.14109,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.60348
    },
    {
      "title": "‘Crypto’-friendly Customers Bank hit with Fed Reserve enforcement action",
      "summary": "The U.S. Federal Reserve has issued an enforcement action against Customers Bank, a prominent \"crypto\"-friendly institution, demanding improved digital asset compliance and risk management practices. This action follows identified deficiencies in the bank's anti-money laundering and Bank Secrecy Act rules, occurring after the collapse of other crypto-friendly banks. The enforcement requires Customers Bank to enhance customer due diligence, transaction monitoring, and its overall digital asset strategy to ensure safe and sound operations and prevent illicit activities.",
      "url": "https://coingeek.com/crypto-friendly-customers-bank-hit-with-fed-reserve-enforcement-action/",
      "source": "CoinGeek",
      "published": "20240809T000000",
      "overall_sentiment_score": -0.151375,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.117376,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.593647
    },
    {
      "title": "Scotiabank to take nearly 15% stake in KeyBank for $2.8B",
      "summary": "Scotiabank has agreed to acquire a 14.9% stake in KeyCorp for approximately $2.8 billion, purchasing 163 million shares of common stock at $17.17 per share. This major investment will be completed in two tranches, with the final purchase in Q1 2025 after regulatory approval, aiming to bolster KeyCorp's capital and accelerate growth while signaling Scotiabank's renewed focus on North America. The deal, which offers KeyCorp an 11% premium on recent trading, has led to a 14% jump in KeyCorp's shares and suggests a potential future full acquisition by the Canadian lender.",
      "url": "https://www.bankingdive.com/news/scotiabank-to-buy-nearly-15-stake-in-keybank-2-8-billion/723965/",
      "source": "Banking Dive",
      "published": "20240812T000000",
      "overall_sentiment_score": 0.228827,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.124613,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.584616
    },
    {
      "title": "Payoneer targets growth with more acquisitions",
      "summary": "Payoneer, under CEO John Caplan, is aggressively pursuing acquisitions to expand its business-to-business (B2B) cross-border payments services and enter the accounts payable (AP) arena. The company recently acquired Singapore-based Skuad for $61 million, adding payroll and workforce management capabilities. This strategic shift aims to capitalize on the larger $6 trillion B2B payments market, moving beyond its traditional marketplace niche and focusing on larger clients.",
      "url": "https://www.paymentsdive.com/news/payoneer-cross-border-acquisitions-b2b-accounts-payable-skaud/723722/",
      "source": "Payments Dive",
      "published": "20240808T000000",
      "overall_sentiment_score": 0.185299,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.124206,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.57691
    },
    {
      "title": "TED ELIOPOULOS JOINS PROLOGIS AS SENIOR PRIVATE INVESTMENT EXECUTIVE",
      "summary": "Prologis, Inc. announced that Ted Eliopoulos has joined the company as managing director, Strategic Capital, to help grow its private investment business. Eliopoulos brings extensive experience from previous roles at Calvert Research and Management, Morgan Stanley Investment Management, and CalPERS. His appointment is expected to significantly contribute to Prologis's growth trajectory and its Strategic Capital business, which manages $87.8 billion in assets.",
      "url": "https://ir.prologis.com/press-releases/detail/993/ted-eliopoulos-joins-prologis-as-senior-private-investment",
      "source": "Prologis",
      "published": "20240819T090000",
      "overall_sentiment_score": 0.218181,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.059762,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.566754
    },
    {
      "title": "Intercontinental Exchange Stock Gained 22% YTD, What’s Next?",
      "summary": "Intercontinental Exchange (NYSE: ICE) stock has gained 22% YTD, outperforming the S&P 500, but is still trading 6% below its estimated fair value of $166. The company recently surpassed Q2 FY2024 street estimates with significant revenue growth in its exchanges and mortgage technology segments, despite increased operating expenses impacting net income. Analysts project ICE's total revenues to reach $11.49 billion in FY2024, leading to a GAAP EPS of $6.04 and a valuation of $166.",
      "url": "https://www.forbes.com/sites/greatspeculations/2024/08/16/intercontinental-exchange-stock-gained-22-ytd-whats-next/",
      "source": "Forbes",
      "published": "20240816T060000",
      "overall_sentiment_score": -0.039455,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.053158,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.560395
    },
    {
      "title": "Authorities prevent ‘heist of the century’ copycat bank robbery in San Isidro",
      "summary": "Authorities in San Isidro, Argentina, uncovered an elaborate 220-meter-long tunnel intended for a bank robbery at a Banco Macro branch, preventing a \"heist of the century\" copycat attempt. The discovery was prompted by a delivery driver hearing strange noises, leading police to investigate and find the sophisticated underground passage, which included ventilation and electric lights. Investigators believe the construction took six to nine months and was close to completion, aiming for the bank's vault, and noting its professionalism exceeded that of the famous 2006 Banco Río robbery.",
      "url": "https://www.batimes.com.ar/news/argentina/what-the-tunnel-to-rob-banco-macro-in-san-isidro-is-like.phtml",
      "source": "Buenos Aires Times",
      "published": "20240808T155800",
      "overall_sentiment_score": 0.034732,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.007914,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.341359
    }
  ]
}