{
  "ticker": "JPM",
  "date": "2024-10-21",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T12:57:28.284425",
  "source": "alpha_vantage",
  "article_count": 32,
  "articles": [
    {
      "title": "KKM Financial's Essential 40 stock fund is now an ETF",
      "summary": "KKM Financial has converted its Essential 40 mutual fund into an ETF, a move driven by the tax efficiency advantages of ETFs compared to mutual funds. This conversion aligns with a broader trend among asset managers, facilitated by a 2019 SEC rule change. The newly converted fund, trading under the ticker ESN, aims to allow investors to \"buy what you use\" in an equal-weighted fund, with holdings including JPMorgan Chase, Amazon, Waste Management, and Eli Lilly.",
      "url": "https://www.cnbc.com/2024/10/21/kkm-financials-essential-40-stock-fund-is-now-an-etf.html",
      "source": "CNBC",
      "published": "20241021T122000",
      "overall_sentiment_score": 0.356329,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.303534,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.640177
    },
    {
      "title": "Goldman Sachs: Raises the Bar for Banks After Crushing Q3 2024",
      "summary": "Goldman Sachs reported a stellar Q3 2024 performance, with significant growth across various segments, including a 70% YoY increase in net interest income and a 20% rise in investment banking revenue. The firm's assets under supervision reached a record $3.1 trillion, and its earnings beat analyst estimates by nearly $1 billion. This strong performance, driven by a focus on investment banking and wealth management, positions Goldman Sachs as a leader benefiting from the anticipated interest rate cut cycle.",
      "url": "https://www.marketbeat.com/originals/goldman-sachs-raises-the-bar-for-banks-after-crushing-q3-2024/",
      "source": "MarketBeat",
      "published": "20241021T000000",
      "overall_sentiment_score": 0.289141,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.339056,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.727611
    },
    {
      "title": "World’s largest investment managers see assets hit $128 trillion in return to growth",
      "summary": "Total assets under management (AUM) at the world's 500 largest asset managers rebounded significantly to $128 trillion by the end of 2023, marking a 12.5% annual growth despite not reaching 2021 levels. This recovery saw both active and passive strategies grow, with passive investments now accounting for over a third of AUM, and North America leading growth. BlackRock maintains its position as the largest asset manager, while other firms like Charles Schwab Investment and Geode Capital Management showed notable rises in rankings.",
      "url": "https://www.wtwco.com/en-sg/news/2024/10/worlds-largest-investment-managers-see-assets-hit-dollar-128-trillion-in-return-to-growth",
      "source": "wtwco.com",
      "published": "20241021T000000",
      "overall_sentiment_score": 0.363519,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.317601,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.607614
    },
    {
      "title": "FICO predicted to hike costs for mortgage credit scores by up to 50%",
      "summary": "Investment firms Jeffries and Wells Fargo predict Fair Isaac Corp. (FICO) will raise the cost of mortgage credit scores by up to 50% in 2025, from $3.25 to potentially $5. This anticipated increase has raised concerns among mortgage trade groups, industry professionals, and members of Congress, who point to potential negative impacts on consumers and affordability, as well as a lack of competition in the credit scoring market. Lawmakers have called for investigations into FICO's alleged anti-competitive behavior.",
      "url": "https://www.nationalmortgagenews.com/news/fico-predicted-to-hike-costs-for-mortgage-credit-scores-by-up-to-50",
      "source": "National Mortgage News",
      "published": "20241018T152100",
      "overall_sentiment_score": -0.232098,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.128654,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.560581
    },
    {
      "title": "Boeing hones $15 billion financing plan to weather crises, sources say",
      "summary": "Boeing is finalizing a plan to raise approximately $15 billion through common shares and mandatory convertible bonds to strengthen its finances amidst ongoing crises, including regulatory scrutiny and production curbs. The company is also considering a structured finance transaction for an additional $5 billion and is acting to protect its investment-grade credit rating. The timing of the equity raise is uncertain, partly due to an ongoing strike, but investors anticipate strong demand for the proposed hybrid bonds.",
      "url": "https://www.reuters.com/business/aerospace-defense/boeing-closes-15-billion-financing-via-stock-hybrid-bonds-2024-10-16/",
      "source": "Reuters",
      "published": "20241017T063500",
      "overall_sentiment_score": 0.075401,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.144933,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.730382
    },
    {
      "title": "JPMorgan Chase leads banking sector in AI adoption: report",
      "summary": "JPMorgan Chase has maintained its lead in AI adoption within the banking sector, according to an Evident AI Index report, driven by its large AI workforce, research, and reported ROI on AI use cases. Capital One is rapidly gaining ground, ranking second by significantly increasing its AI skills and development capabilities and holding a substantial share of AI patents among the top banks. The report highlights that leading banks, including Royal Bank of Canada and Wells Fargo, are prioritizing AI research teams and data modernization, reflecting a strategic top-down approach to AI integration in a highly regulated industry.",
      "url": "https://www.ciodive.com/news/jpmorgan-chase-capital-one-ai-adoption-leaders-evident/730208/",
      "source": "CIO Dive",
      "published": "20241017T000000",
      "overall_sentiment_score": 0.23488,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.43848,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Stacked bitcoin and gold ETF launches with the goal of shielding investors from inflation and currency debasement",
      "summary": "A new ETF, the STKD Bitcoin & Gold ETF (BTGD), has launched with the aim of protecting investors from inflation and currency debasement by providing exposure to both bitcoin and gold. This ETF offers a \"stacked approach,\" providing more than $1 of exposure for every $1 invested, and invests in bitcoin futures, ETPs, gold futures, and gold ETPs rather than directly in the underlying assets. The launch comes amid increasing interest in alternative asset classes like gold and bitcoin as hedges against economic instability and geopolitical tensions, a trend identified by JPMorgan analysts as the \"debasement trade.\"",
      "url": "https://www.theblock.co/post/321622/stacked-bitcoin-and-gold-etf-launches-with-the-goal-of-sheilding-investors-from-inflation-and-currency-debasement",
      "source": "The Block",
      "published": "20241016T163900",
      "overall_sentiment_score": 0.314352,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.332322,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.610998
    },
    {
      "title": "Morgan Stanley profit exceeds forecasts on dealmaking surge; shares jump to record",
      "summary": "Morgan Stanley's Q3 profit surpassed forecasts, driven by a significant surge in investment banking, leading to a record-high stock price. CEO Ted Pick expressed optimism for continued recovery in M&A and IPO activity, while wealth management assets also saw substantial growth, nearing its $10 trillion target. This strong performance across segments has boosted investor confidence.",
      "url": "https://www.reuters.com/business/finance/morgan-stanleys-profit-jumps-recovery-dealmaking-2024-10-16/",
      "source": "Reuters",
      "published": "20241016T142300",
      "overall_sentiment_score": 0.372844,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.303723,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.616016
    },
    {
      "title": "Morgan Stanley shares pop 7% after beating estimates for third-quarter profit and revenue",
      "summary": "Morgan Stanley (MS) reported strong third-quarter results, exceeding analyst estimates for both profit and revenue, driven by robust performance across its wealth management, investment banking, and trading divisions. The bank's profit rose 32% to $3.2 billion ($1.88 per share) and revenue increased 16% to $15.38 billion, benefiting from buoyant markets and a rebound in investment banking activity. Shares of Morgan Stanley surged over 7% following the earnings announcement.",
      "url": "https://www.cnbc.com/2024/10/16/morgan-stanley-ms-earnings-q3-2024.html",
      "source": "CNBC",
      "published": "20241016T070000",
      "overall_sentiment_score": 0.477608,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.322919,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.631588
    },
    {
      "title": "Morgan Stanley Wealth Closes in on 30% Margin Target as Asset Flows Rebound",
      "summary": "Morgan Stanley's wealth management division posted record revenue and profit in Q3, nearing its 30% pretax margin goal with a 28.3% margin. Net new assets surged by 79% to $63.9 billion, driven by a 59% increase in fee-based flows. The company's strategy to shift E-Trade and workplace customers to its advisor-led unit, where fee-based accounts offer higher margins, is bearing fruit, with assets under management in this channel reaching $4.65 trillion.",
      "url": "https://www.advisorhub.com/morgan-stanley-wealth-closes-in-on-30-margin-target-as-asset-flows-rebound/",
      "source": "AdvisorHub",
      "published": "20241016T000000",
      "overall_sentiment_score": 0.242464,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.209606,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.581622
    },
    {
      "title": "Wells Fargo profit beats forecasts as provisions shrink; shares rise",
      "summary": "Wells Fargo's Q3 profit surpassed analyst expectations as it reduced provisions for potential loan losses and predicted stabilized interest income, leading to a 6% rise in shares. The bank noted a strong U.S. economy, slowing inflation, and a resilient labor market, though it forecast a near-term dip in net interest income. Executives believe future rate cuts will positively impact NII by lowering deposit costs, despite a decrease in overall revenue and loans.",
      "url": "https://www.reuters.com/business/finance/wells-fargos-profit-falls-lower-interest-income-2024-10-11/",
      "source": "Reuters",
      "published": "20241011T225600",
      "overall_sentiment_score": 0.28691,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.105595,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.612826
    },
    {
      "title": "JPMorgan Chase shares pop 5% after topping estimates on better-than-expected interest income",
      "summary": "JPMorgan Chase exceeded Q3 2024 profit and revenue estimates, driven by higher-than-expected net interest income and strong performance in its Wall Street division. CEO Jamie Dimon also commented on regulatory capital requirements and geopolitical risks. Despite concerns about future net interest income due to an anticipated rate-cutting environment, the bank's shares rose 5%.",
      "url": "https://www.cnbc.com/2024/10/11/jpmorgan-chase-jpm-earnings-q3-2024.html",
      "source": "CNBC",
      "published": "20241011T120100",
      "overall_sentiment_score": 0.230032,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.447113,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Car-Mart sells $300 million in asset-backed notes",
      "summary": "America's Car-Mart Inc. has completed a $300 million term securitization transaction, marking its second such deal in 2024. The proceeds will be used to pay debt and fund noteholder-benefiting accounts, with the notes backed by $507.2 million in accounts receivables. The company also recently raised $73 million through an equity sale, aiming to improve liquidity and strengthen its balance sheet.",
      "url": "https://talkbusiness.net/2024/10/car-mart-sells-300-million-in-asset-backed-notes/",
      "source": "Talk Business & Politics",
      "published": "20241011T093300",
      "overall_sentiment_score": 0.317171,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.223855,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.552668
    },
    {
      "title": "CAMP4 Announces Pricing of Initial Public Offering",
      "summary": "CAMP4 Therapeutics Corporation announced the pricing of its initial public offering of 6,820,000 shares of common stock at $11.00 per share, expecting to raise approximately $75.0 million. The company's stock is set to begin trading on the Nasdaq Global Market under the ticker \"CAMP\" on October 11, 2024, with the offering expected to close on October 15, 2024. J.P. Morgan, Leerink Partners, Piper Sandler, and William Blair are acting as joint book-running managers for the offering.",
      "url": "https://www.globenewswire.com/news-release/2024/10/10/2961761/0/en/CAMP4-Announces-Pricing-of-Initial-Public-Offering.html",
      "source": "GlobeNewswire",
      "published": "20241010T190700",
      "overall_sentiment_score": 0.243282,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.150889,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.642015
    },
    {
      "title": "Citigroup establishes banking executive team, memo shows",
      "summary": "Citigroup has formed a new executive team for its corporate and investment bank to capture a larger share of the deals market, following the hiring of Viswas Raghavan from JPMorgan Chase. The bank appointed John Chirico and Jason Rekate as co-heads of corporate banking and also established an investment banking operating team to focus on strategic priorities and \"must-win\" transactions. This move is part of CEO Jane Fraser's broader overhaul to improve performance, cut costs, and simplify businesses at the Wall Street giant.",
      "url": "https://www.reuters.com/business/finance/citigroup-establishes-banking-executive-team-memo-shows-2024-10-10/",
      "source": "Reuters",
      "published": "20241010T174300",
      "overall_sentiment_score": 0.251988,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.101127,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.628826
    },
    {
      "title": "KinderCare IPO: stock price today, learning company lists on NYSE",
      "summary": "KinderCare Learning Companies, a for-profit early-childhood education provider, has made its long-awaited debut on the NYSE under the ticker KLC, pricing its stock at $24 a share. The IPO tests investor appetite for the ECE market, especially as childcare costs are a significant political topic. KinderCare, backed by Partners Group, earned $102.6 million on $2.5 billion in revenue in 2023 and saw its stock perform well on its first day of trading, with shares up over 9% midday Wednesday.",
      "url": "https://www.fastcompany.com/91205566/kindercare-ipo-stock-price-will-be-closely-watched-today-as-for-profit-learning-company-makes-long-delayed-nyse-debut",
      "source": "Fast Company",
      "published": "20241009T000000",
      "overall_sentiment_score": 0.212359,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.1448,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.580361
    },
    {
      "title": "KinderCare Announces Pricing of Initial Public Offering",
      "summary": "KinderCare Learning Companies, Inc. announced the pricing of its initial public offering of 24,000,000 shares of common stock at $24.00 per share. The shares are expected to begin trading on the NYSE under the symbol \"KLC\" on October 9, 2024, with the offering closing on October 10, 2024. KinderCare plans to use the net proceeds to repay existing indebtedness and cover expenses.",
      "url": "https://www.businesswire.com/news/home/20241008260552/en/KinderCare-Announces-Pricing-of-Initial-Public-Offering",
      "source": "Business Wire",
      "published": "20241008T000000",
      "overall_sentiment_score": 0.210548,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.128315,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.618105
    },
    {
      "title": "E-mini Russell 2000 index has risen for four consecutive days! With the support of two major bullish factors, can small cap stocks continue to rise?",
      "summary": "The E-mini Russell 2000 index has seen four consecutive days of gains, fueled by outstanding bank performance and a resurgence of the \"Trump trade\" narrative. Wall Street attributes this optimism to the strong financial sector, which makes up about 20% of the index, and mounting expectations of a Trump victory in the upcoming U.S. presidential election, which is believed to benefit small-cap stocks. Investors can leverage this trend by investing in Russell 2000 tracking ETFs.",
      "url": "https://news.futunn.com/en/post/48827804/e-mini-russell-2000-index-has-risen-for-four-consecutive",
      "source": "富途牛牛",
      "published": "20241017T170300",
      "overall_sentiment_score": 0.283106,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.504111,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.605074
    },
    {
      "title": "Bank earnings: Morgan Stanley scores huge profit beat, lifting its stock",
      "summary": "Morgan Stanley reported a significant profit beat, causing its stock to rally. Analysts are bullish on the stock, with CFRA reiterating a buy rating and raising its price target. The bank's institutional securities business benefited from global factors, including China's stimulus and varying central bank policies.",
      "url": "https://www.marketwatch.com/livecoverage/bank-earnings-bank-of-america-bac-goldman-sachs-citi-citigroup-results?gaa_at=eafs&gaa_n=AWEtsqeZZ0J24Jt51S8YYMcCibupHU5EcCfvNV9hzVbc6f87LI2DAqblubu4&gaa_ts=6907559a&gaa_sig=InZLVhgDcTd684XZLqQ2i1mWX91rIYSwE3FlbEsDviWdoc9HjomjGlTTQq13iMewCvk5uBfxlOCf_lruQlZdhA%3D%3D",
      "source": "MarketWatch",
      "published": "20241016T134900",
      "overall_sentiment_score": 0.336547,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.341635,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.733069
    },
    {
      "title": "Why Bank Stock ETFs Are Suddenly Outperforming",
      "summary": "Bank stock ETFs have recently outperformed the broader market due to stronger-than-expected third-quarter earnings from major U.S. banks like JPMorgan Chase and BNY Mellon. While this outperformance is a significant shift from earlier in the year, some analysts suggest investors may be overly enthusiastic, as current valuations have largely priced in a soft landing scenario. Morningstar analysts provide detailed opinions on several big banks, noting that while some are trading at premiums, others are closer to their fair value estimates.",
      "url": "https://www.morningstar.com/markets/why-bank-stock-etfs-are-suddenly-outperforming",
      "source": "Morningstar",
      "published": "20241016T000000",
      "overall_sentiment_score": 0.212267,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.137396,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.735291
    },
    {
      "title": "Morgan Stanley Posts Record New Wealth Revenue in Q3",
      "summary": "Morgan Stanley's wealth segment recorded a record $7.27 billion in revenue in Q3, marking a 14% year-over-year increase, with assets under management reaching $7.67 trillion. Despite a slight decrease in net interest income due to lower average sweep deposits, the firm saw significant growth in net new assets, particularly from advisor-led and workplace channels. Analysts are encouraged by the stabilization of deposits and potential for improved intermediate-term net interest income.",
      "url": "https://www.wealthmanagement.com/wirehouse-news/morgan-stanley-posts-record-new-wealth-revenue-in-q3",
      "source": "WealthManagement.com",
      "published": "20241016T000000",
      "overall_sentiment_score": 0.331254,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.210884,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.592147
    },
    {
      "title": "TD Bank to Pay Historic $3 Billion Over AML Compliance Violations (AML)",
      "summary": "TD Bank has been fined over $3 billion by multiple U.S. federal and state agencies for systemic, willful anti-money laundering (AML) failures, marking the largest penalty ever assessed under the Bank Secrecy Act (BSA). The bank pled guilty to conspiracy and failure to file accurate currency transaction reports, facilitating money laundering due to prolonged understaffing, inadequate training, and intentional lack of monitoring for high-risk clients. In addition to financial penalties, TD Bank faces an independent monitor for four years, growth restrictions, and potential asset reductions in the U.S. if compliance is not met.",
      "url": "https://www.lowenstein.com/news-insights/publications/client-alerts/td-bank-to-pay-historic-3-billion-over-aml-compliance-violations-aml",
      "source": "Lowenstein Sandler LLP",
      "published": "20241014T000000",
      "overall_sentiment_score": -0.268634,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.132029,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.616134
    },
    {
      "title": "Downgrade for Iris Energy stock as peers offer better value, says JPMorgan",
      "summary": "JPMorgan downgraded Iris Energy Ltd. (NASDAQ: IREN) from Overweight to Neutral, despite raising its price target to $15.00 from $9.50. The downgrade follows a significant stock surge and reflects JPMorgan's view that other sector operators now offer better value, particularly as investor sentiment shifts toward companies that directly hold bitcoin. Iris Energy, a bitcoin mining and cloud services company, continues to expand its operations and financial performance, with other analysts maintaining bullish ratings.",
      "url": "https://www.investing.com/news/analyst-ratings/downgrade-for-iris-energy-stock-as-peers-offer-better-value-says-jpmorgan-93CH-3763067",
      "source": "Investing.com",
      "published": "20241012T043000",
      "overall_sentiment_score": 0.069327,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.036972,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.713943
    },
    {
      "title": "HSBC: In 2024, the issuance of bonds in EMEA emerging markets is expected to reach a record high.",
      "summary": "JPMorgan predicts that bond issuance in emerging markets of Europe, the Middle East, and Africa (EMEA) will hit a record high this year, surpassing the 2020 record of $265 billion, despite geopolitical turbulence. This surge is partly driven by issuers rushing to complete transactions before the US presidential election, alongside strong demand from investors eyeing high returns, especially from countries like Turkey and those emerging from debt restructurings. The anticipated decline in US interest rates is also making emerging market yields more attractive, drawing funds back into the region.",
      "url": "https://news.futunn.com/en/post/48539564/hsbc-in-2024-the-issuance-of-bonds-in-emea-emerging",
      "source": "富途牛牛",
      "published": "20241009T213000",
      "overall_sentiment_score": 0.196989,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.322142,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.638339
    },
    {
      "title": "The soaring gold continues its flight! After outperforming the stock market for over two decades, gold is advancing towards the '5K era'.",
      "summary": "Gold prices have surged past $4,000 per ounce for the first time, driven by concerns over the U.S. economy, government shutdown, and geopolitical tensions. Investment institutions like Goldman Sachs and JPMorgan predict gold could reach $5,000, signaling a new \"5K era\" and highlighting its role as a safe-haven asset amidst global uncertainties and central bank purchases. Gold's performance has outpaced the stock market and even chip stocks, showing a significant shift in investor preference.",
      "url": "https://news.futunn.com/en/post/63025894/the-soaring-gold-continues-its-flight-after-outperforming-the-stock",
      "source": "富途牛牛",
      "published": "20241009T081100",
      "overall_sentiment_score": 0.116008,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.501603,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.638852
    },
    {
      "title": "Has wirehouse plugged the leak?",
      "summary": "Wells Fargo Advisors appears to have stabilized its financial advisor workforce after years of attrition following a 2016 scandal. Management asserts that advisor departures have significantly slowed, attributing this to internal transfers and improved retention efforts. Despite this, the firm still faces competition and advisor scrutiny over its past cultural issues.",
      "url": "https://www.investmentnews.com/wirehouses/has-wirehouse-plugged-the-leak/257554",
      "source": "InvestmentNews",
      "published": "20241008T000000",
      "overall_sentiment_score": 0.157389,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.105951,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.606556
    },
    {
      "title": "Ceribell Seeks Public Debut with $101M IPO Amid Medtech IPO Struggles",
      "summary": "Ceribell, a company that developed a portable EEG platform using AI to monitor patient seizures, is seeking to raise $101 million in its initial public offering of 6.7 million shares, priced between $14 and $16. This public debut comes during a challenging period for medtech IPOs, with limited access to capital markets and previous medtech IPOs trading below their initial price. Ceribell aims to establish its system as the standard of care for EEG in acute settings, having already generated $54 million in sales for the 12 months ended June 30, 2024.",
      "url": "https://www.mddionline.com/business/ceribell-looks-to-make-its-public-debut-amid-medtech-ipo-drought",
      "source": "Medical Device and Diagnostic industry",
      "published": "20241008T000000",
      "overall_sentiment_score": 0.175897,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.142669,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.646137
    },
    {
      "title": "KeyCorp could be back in the market for a bank deal next year",
      "summary": "KeyCorp is considering future bank acquisitions as it expects to complete its deal with Scotiabank next year, which will significantly boost its capital levels to a pro forma Common Equity Tier 1 (CET1) ratio of 12%. CEO Chris Gorman indicated that the company would be well-positioned to take advantage of industry consolidation once the capital infusion is complete. This comes after KeyCorp recorded a $700 million loss related to reconfiguring its securities portfolio.",
      "url": "https://www.crainscleveland.com/banking-finance/keycorp-could-revisit-bank-ma-it-completes-deal-scotiabank-next-year",
      "source": "Crain's Cleveland Business",
      "published": "20241017T142600",
      "overall_sentiment_score": 0.157801,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.094973,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.553454
    },
    {
      "title": "Millennials pick crypto over other assets as $84tn wealth transfer looms",
      "summary": "A substantial $84 trillion wealth transfer from older to younger generations is anticipated over the next decade, with millennials showing a strong preference for cryptocurrency investments. A Charles Schwab survey reveals that 62% of millennials plan to invest in crypto next year, surpassing American stocks and fixed-income assets. Major asset managers like BlackRock and Fidelity are acknowledging this trend, with an estimated $20 trillion expected to flow into cryptocurrencies, half of which will go to Bitcoin.",
      "url": "https://www.dlnews.com/articles/markets/millennials-prefer-crypto-bitcoin-over-us-stocks-says-schwab/",
      "source": "DL News",
      "published": "20241011T121100",
      "overall_sentiment_score": 0.280527,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.211155,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.570216
    },
    {
      "title": "U-Haul Expands Midwest Self Storage Footprint",
      "summary": "U-Haul has acquired a four-property self storage portfolio in Minnesota and Kansas from NexPoint Storage Partners, expanding its Midwest footprint. The portfolio includes 3,345 units totaling 327,791 rentable square feet, which were 88 percent leased at the time of the transaction. JLL Capital Markets represented the seller in the deal for these Class A facilities.",
      "url": "https://www.multihousingnews.com/u-haul-expands-midwest-self-storage-footprint/",
      "source": "Multifamily Housing News",
      "published": "20241008T000000",
      "overall_sentiment_score": 0.101183,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.147697,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.623717
    },
    {
      "title": "Will China’s Stock Market Keep Skyrocketing?",
      "summary": "Chinese equities have become the best-performing market globally this year, largely due to a recent $113 billion stimulus package. While some Wall Street firms remain skeptical, Goldman Sachs sees further upside, anticipating more stimulus measures from Beijing despite past rallies fizzling out. The market's rapid gains have led some analysts to believe the \"easy money\" phase for China stocks is ending.",
      "url": "https://www.inc.com/phil-rosen/china-stock-market-outlook-investors-equities-fed-beijing-wall-street/90985778",
      "source": "Inc.com",
      "published": "20241008T000000",
      "overall_sentiment_score": 0.081612,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.079732,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.646969
    },
    {
      "title": "A closer look at State Street and Apollo's private credit ETF",
      "summary": "State Street and Apollo have filed for a novel ETF that will invest in both public and private debt, aiming to give investors access to the burgeoning private credit market. This move follows the trend of asset managers combining private credit with active ETFs, with similar filings from Virtus and BondBloxx. The article delves into how such a fund might operate and the potential challenges it could encounter.",
      "url": "https://citywire.com/pro-buyer/news/a-closer-look-at-state-street-and-apollos-private-credit-etf/a2451804",
      "source": "Citywire",
      "published": "20241010T000000",
      "overall_sentiment_score": 0.17106,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.141429,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.632839
    }
  ]
}