{
  "ticker": "JPM",
  "date": "2024-05-06",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T12:16:25.035679",
  "source": "alpha_vantage",
  "article_count": 23,
  "articles": [
    {
      "title": "U.S. Bancorp, parent company of U.S. Bank, names Gunjan Kedia new president",
      "summary": "U.S. Bancorp has named Gunjan Kedia as its new president, reporting to chairman and CEO Andy Cecere. Kedia, previously vice chair of wealth, corporate, commercial and institutional banking, will now oversee the company's three lines of business. Her appointment comes as the banking industry navigates challenges in loan and deposit growth, with U.S. Bancorp recently revising its fiscal 2024 net interest income downward.",
      "url": "https://www.startribune.com/us-bancorp-names-gunjan-kedia-new-president/600363578",
      "source": "Star Tribune",
      "published": "20240503T191500",
      "overall_sentiment_score": 0.146099,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.101824,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.645408
    },
    {
      "title": "Mister Car Wash upgraded to overweight by JPMorgan while Driven Brands gets cut",
      "summary": "JPMorgan Chase upgraded Mister Car Wash to overweight from neutral, citing a shift in competitive tides in the company's favor as peer growth slows. Concurrently, JPMorgan cut its rating on rival Driven Brands Holdings. The stock's price target for Mister Car Wash was kept at $8.50 a share.",
      "url": "https://www.marketwatch.com/story/mister-car-wash-upgraded-to-overweight-by-jpmorgan-while-driven-brands-gets-cut-af147752?gaa_at=eafs&gaa_n=AWEtsqcvLSZ8NVCkPVI5UU5iz0ebo4X3yOxyTbYosnNFjsaEoBR8Wij3WZSK&gaa_ts=69075a3b&gaa_sig=Pec9nG5dNC4JcxmLwUVcgNuxgXN16Y2GS9ifVwXfIBGmRJzJNFzuJmJfpfJEhnGnDrPP8yyfdBI4t0jckXGcJw%3D%3D",
      "source": "MarketWatch",
      "published": "20240503T085000",
      "overall_sentiment_score": 0.320795,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.149317,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.743062
    },
    {
      "title": "Comerica Inc. Names New EVP/Chief Business Risk & Controls Officer",
      "summary": "Comerica Inc. has appointed Floyd Kessler as its new EVP, Chief Business Risk and Controls Officer. Kessler will be responsible for leading the business risk and controls office across various revenue divisions, including commercial banking, marketing, customer experience, Retail Bank, and wealth management, aiming to transform risk and control functions. He brings 18 years of risk management experience to the Dallas-based banking company.",
      "url": "https://dallasinnovates.com/comerica-inc-names-new-evp-chief-business-risk-controls-officer/",
      "source": "Dallas Innovates",
      "published": "20240503T000000",
      "overall_sentiment_score": 0.190552,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.136486,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.64507
    },
    {
      "title": "3 Financial Stocks Driving Gains in XLF ETF",
      "summary": "The Financial Select Sector SPDR Fund (XLF) ETF provides investors exposure to leading North American financial services companies, with a significant 25% return in the past year. Key contributors to XLF's performance include Berkshire Hathaway, JPMorgan, and Progressive Corp, benefiting from the high-interest rate environment. The ETF is trading 5% below its 52-week high, and Wall Street analysts largely maintain a \"buy\" rating, anticipating continued gains as long as interest rates remain elevated.",
      "url": "https://247wallst.com/investing/2024/05/02/3-financial-stocks-driving-gains-in-xlf-etf/",
      "source": "24/7 Wall St.",
      "published": "20240502T124400",
      "overall_sentiment_score": 0.53256,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.406745,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.865281
    },
    {
      "title": "White & Case advises Morgan Stanley Infrastructure Partners on investment in Salcef Group",
      "summary": "White & Case advised Morgan Stanley Infrastructure Partners on a binding sale and purchase agreement with the shareholders of Finhold S.r.l., the majority shareholder of Salcef Group S.p.A. This investment aims to accelerate Salcef Group's growth strategy in Italy and internationally, leveraging Morgan Stanley Infrastructure Partners' global expertise. Following closing, a mandatory public tender offer will be launched to delist Salcef Group shares from the Euronext STAR Milan market.",
      "url": "https://www.whitecase.com/news/press-release/white-case-advises-morgan-stanley-infrastructure-partners-investment-salcef",
      "source": "White & Case LLP",
      "published": "20240426T000000",
      "overall_sentiment_score": 0.270458,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.212515,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.606162
    },
    {
      "title": "DOJ examines Capital One-Discover deal’s competitive angle",
      "summary": "The Justice Department is examining the competitive aspects of Capital One's proposed acquisition of Discover, advising bank regulators who extended their public comment periods on the deal until May 31. Despite concerns raised by critics, Capital One CEO Richard Fairbank maintains the $35.3 billion all-stock transaction will increase payment network competition and benefit consumers, anticipating a close by late 2024 or early 2025. This scrutiny is part of a broader trend of increased antitrust enforcement from the Biden administration and bank regulators.",
      "url": "https://www.bankingdive.com/news/doj-capital-one-discover-deal-competition-antitrust-federal-reserve-occ-fairbank/714453/",
      "source": "Banking Dive",
      "published": "20240426T000000",
      "overall_sentiment_score": 0.004544,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.00248,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.602598
    },
    {
      "title": "First Citizens profit beats estimates as Silicon Valley Bank stabilizes",
      "summary": "First Citizens BancShares reported a first-quarter profit that exceeded expectations, driven by higher interest income and the stabilizing performance of its acquired Silicon Valley Bank (SVB) assets. SVB's loans and deposits demonstrated stabilization for the first time since the acquisition, despite a challenging venture capital environment. The bank remains cautious but sees promising signs for future IPO activity and deposit growth in the second half of the year.",
      "url": "https://www.reuters.com/markets/us/svb-owner-first-citizens-profit-beats-estimates-interest-income-strength-2024-04-25/",
      "source": "Reuters",
      "published": "20240425T204500",
      "overall_sentiment_score": 0.135166,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.288409,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.638926
    },
    {
      "title": "Raymond James' CEO shrugs off DOL rule",
      "summary": "Raymond James CEO Paul Reilly stated that the Department of Labor's new fiduciary rule appears \"much more manageable\" than the initial draft. This sentiment was echoed by other senior brokerage executives, who believe the rule will be more problematic for insurance companies selling fixed annuities than for large retail broker-dealers. The new rule, set to take effect for some provisions in September 2024 and April 2025, redefines who is a fiduciary under ERISA and requires financial professionals to provide \"prudent, loyal, honest advice free from overcharges.\"",
      "url": "https://www.investmentnews.com/independent-broker-dealers/raymond-james-ceo-shrugs-off-dol-rule/252709",
      "source": "InvestmentNews",
      "published": "20240425T000000",
      "overall_sentiment_score": 0.143244,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.062333,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.646382
    },
    {
      "title": "Fiserv, Inc. (NYSE:FI) Q1 2024 Earnings Call Transcript",
      "summary": "Fiserv, Inc. reported strong Q1 2024 results with adjusted earnings per share up 19% and revenue growth of 7%, leading them to raise their full-year EPS outlook. The company's Merchant Solutions segment saw 36% organic revenue growth, driven by Clover's performance and international expansion, while the Financial Solutions segment grew 5% organically, highlighted by Finxact wins and strong digital payment demand. Fiserv emphasized its strategic integration between segments, ongoing capital allocation, and commitment to corporate social responsibility, marking its 40th year in business with sustained growth and innovation.",
      "url": "https://finance.yahoo.com/news/fiserv-inc-nyse-fi-q1-124112932.html",
      "source": "Yahoo Finance",
      "published": "20240424T000000",
      "overall_sentiment_score": 0.264344,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.20613,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.601436
    },
    {
      "title": "First Internet Bank CEO talks M&A, BaaS work",
      "summary": "First Internet Bank CEO David Becker discusses the current M&A landscape, noting that activity is likely to remain quiet until Federal Reserve rate cuts begin, despite an increase in banks and fintechs looking for exits or critical mass. Following a failed acquisition in 2022, First Internet Bank built its own banking-as-a-service (BaaS) team, now serving clients like Ramp, and Becker highlights the challenges and regulatory scrutiny in the BaaS space for smaller banks.",
      "url": "https://www.bankingdive.com/news/first-internet-bank-ceo-becker-mergers-acquisitions-baas-ramp-jaris/714152/",
      "source": "Banking Dive",
      "published": "20240424T000000",
      "overall_sentiment_score": 0.146698,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.053761,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.590716
    },
    {
      "title": "삼성자산운용, SOFR ETF로 美 뉴욕거래소 상장기념식 참석",
      "summary": "삼성자산운용이 미국 상장지수펀드(ETF) 전문 운용사 앰플리파이(Amplify)와 함께 Amplify 삼성 SOFR ETF를 뉴욕증권거래소에 상장한 것을 기념해 '오프닝 벨' 행사에 참석했습니다. 이 SOFR ETF는 국내 토종 ETF가 미국 증시에 수출된 첫 사례로, 미국의 무위험지표금리(SOFR) 수익률을 추종하며 월 분배형 상품으로 개인 및 해외주식 투자자들에게 달러 대기자금 투자용으로 활용 가능합니다. 서봉균 삼성자산운용 대표는 국내 대표 운용사로서 혁신적인 상품을 세계 ETF 시장에 계속 수출하여 대한민국 금융의 위상을 높이겠다고 밝혔습니다.",
      "url": "https://www.seoulfn.com/news/articleView.html?idxno=517636",
      "source": "서울파이낸스",
      "published": "20240423T160954",
      "overall_sentiment_score": 0.308968,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.343198,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.604066
    },
    {
      "title": "美증시 '오프닝 벨' 울린 삼성운용…서봉균 \"한국 금융 글로벌 위상 높일 것\"",
      "summary": "삼성자산운용이 국내 토종 ETF를 미국 뉴욕거래소에 최초로 상장한 것을 기념해 '오프닝 벨' 행사에 참석했다. 삼성자산운용은 미국 ETF 전문 운용사 앰플리파이와 함께 지난해 11월 앰플리파이 삼성 SOFR ETF를 뉴욕거래소에 상장했으며, 이는 국내 토종 ETF가 미국 증시에 수출된 첫 사례이다. 서봉균 삼성자산운용 대표는 이를 통해 한국 금융의 글로벌 위상을 높이는 데 기여하겠다고 밝혔다.",
      "url": "https://www.4th.kr/news/articleView.html?idxno=2061220",
      "source": "포쓰저널",
      "published": "20240423T134100",
      "overall_sentiment_score": 0.35236,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.414116,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.637521
    },
    {
      "title": "BlackRock set for first mutual fund-to-ETF switch",
      "summary": "BlackRock is converting its $700 million BlackRock International Dividend Fund into an exchange-traded fund by November, marking its first mutual fund-to-ETF switch. This move aligns with a broader industry trend driven by investor demand for lower costs and tax benefits offered by ETFs. Other major asset managers have also completed similar conversions, reflecting a significant shift of assets from mutual funds to ETFs.",
      "url": "https://www.investmentnews.com/etfs/blackrock-set-for-first-mutual-fund-to-etf-switch/252547",
      "source": "InvestmentNews",
      "published": "20240422T000000",
      "overall_sentiment_score": 0.206587,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.243652,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.67143
    },
    {
      "title": "Comstock’s Haynesville-to-Gulf Coast Strategy On Track, but Coping with Low Natural Gas Prices Job No. 1",
      "summary": "Comstock Resources Inc. is positioning itself to be a major LNG supplier with its Haynesville-to-Gulf Coast strategy, but the immediate challenge is managing assets during a period of low natural gas prices. The company has secured significant financial support from shareholders, bondholders, and its bank group to maintain liquidity and continue operations. Comstock is also increasing its hedged positions to protect against price volatility while anticipating future demand growth from power generation, data centers, and LNG exports.",
      "url": "https://naturalgasintel.com/news/comstocks-haynesville-to-gulf-coast-strategy-on-track-but-coping-with-low-natural-gas-prices-job-no-1/",
      "source": "Natural Gas Intelligence",
      "published": "20240506T140300",
      "overall_sentiment_score": -0.118212,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.148705,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.641249
    },
    {
      "title": "Five funds outpacing the Hong Kong stock market rally",
      "summary": "This article identifies five funds, including ETFs and active mutual funds, that have outperformed the Hang Seng Index during a recent two-week rally in the Hong Kong stock market. It highlights specific funds like the Mirae Asset Hang Seng TECH ETF and iShares MSCI Hong Kong ETF, along with actively managed funds such as Matthews China, Eastspring Investments China Equity, and JPM China, detailing their performance and key holdings. The funds benefited from significant rallies in large-cap technology and financial stocks.",
      "url": "https://fundselectorasia.com/five-funds-outpacing-the-hong-kong-stock-market-rally/",
      "source": "Fund Selector Asia",
      "published": "20240506T000000",
      "overall_sentiment_score": 0.333928,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.26363,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.639124
    },
    {
      "title": "Columbia struggled after Umpqua merger. Is the math starting to work?",
      "summary": "Columbia Banking System, which acquired Umpqua Bank, faced investor skepticism and financial struggles last year due to the merger coinciding with the SVB collapse and rising deposit costs. CEO Clint Stein is focused on cost-cutting and strategic expansion into new markets, with some analysts noting early signs of a turnaround, though investors await consistent proof of improved financial performance. The bank is reducing staff, closing duplicative branches, and maintaining a cautious lending approach, particularly within its commercial real estate portfolio.",
      "url": "https://www.americanbanker.com/news/columbia-struggled-after-umpqua-merger-is-the-math-starting-to-work",
      "source": "American Banker",
      "published": "20240503T193500",
      "overall_sentiment_score": -0.040575,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.111324,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.562627
    },
    {
      "title": "BBLU: A Promising Start In A Competitive Field",
      "summary": "The Ea Bridgeway Blue Chip ETF (BBLU) is an actively managed fund using a quantitative approach to invest in large-cap stocks, aiming to outperform passive averages. While blue-chip stocks offer stability and long-term growth potential, investors should consider their investment horizon, risk tolerance, diversification, and fees. The article notes the challenge of generating alpha in well-covered large-cap markets.",
      "url": "https://seekingalpha.com/article/4688404-bblu-promising-start-in-a-competitive-field",
      "source": "Seeking Alpha",
      "published": "20240502T015806",
      "overall_sentiment_score": 0.208166,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.126613,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.644632
    },
    {
      "title": "ICICI Bank exposed credit card data of 17000 customers",
      "summary": "ICICI Bank, a major private bank in India, mistakenly exposed sensitive credit card data of 17,000 customers due to a technical glitch in its iMobile banking app. The glitch allowed users to see card details, including credit card numbers, expiry dates, and CVVs, of other customers. The bank has blocked the affected cards, is issuing new ones, and assures compensation for any financial loss, stating that no misuse has been reported yet.",
      "url": "https://securityaffairs.com/162479/security/icici-bank-technical-glitch.html",
      "source": "Security Affairs",
      "published": "20240428T000000",
      "overall_sentiment_score": -0.288232,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.134537,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.557429
    },
    {
      "title": "Goldman and BofA face renewed calls to split CEO, chairman's roles",
      "summary": "Goldman Sachs and Bank of America are facing renewed pressure from proxy advisers and some investors to split their CEO and chairman roles to improve corporate governance. While some investors and a major sovereign wealth fund support the separation, both banks and other large institutional investors argue that a strong lead independent director can provide sufficient oversight. Efforts to split the roles have had limited success in the past, but the debate continues with varying opinions on its effectiveness.",
      "url": "https://www.reuters.com/business/finance/goldman-bofa-face-renewed-calls-split-ceo-chairmans-roles-2024-04-23/",
      "source": "Reuters",
      "published": "20240423T151700",
      "overall_sentiment_score": -0.046109,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.018298,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.603358
    },
    {
      "title": "Advisor recruiting getting \"irrational,\" says Ameriprise CEO",
      "summary": "Ameriprise Financial CEO James Cracchiolo stated that advisor recruiting has become \"irrational\" and \"very competitive,\" with firms offering increasingly aggressive financial incentives. This has led to a slower pace of advisor movement and higher costs for recruiting experienced professionals, despite a booming stock market which encourages advisors to stay put. Ameriprise saw a decline in net advisor gains in 2023, though it reported an overall increase in advisors at the end of March, primarily in its employee channel.",
      "url": "https://www.investmentnews.com/ria-news/advisor-recruiting-getting-irrational-says-ameriprise-ceo/252586",
      "source": "InvestmentNews",
      "published": "20240423T000000",
      "overall_sentiment_score": 0.03655,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.118872,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.602958
    },
    {
      "title": "Expert Investors: ETFs key for tactical allocations in government bonds",
      "summary": "Chris Forgan of Fidelity International highlights ETFs as \"nimble\" and \"cost-effective\" tools for tactical allocations in government bonds, especially for accessing hard-to-reach markets like Chinese government bonds. He sees opportunities in UK gilts and German Bunds and notes that while Fidelity is a major issuer of active UCITS ETFs, his team currently uses passive ETFs for tactical plays. Forgan also emphasizes the need for better ETF accessibility for retail investors and improved education on total cost of ownership.",
      "url": "https://www.etfstream.com/articles/expert-investors-etfs-key-for-tactical-allocations-in-government-bonds",
      "source": "ETF Stream",
      "published": "20240501T000000",
      "overall_sentiment_score": 0.125866,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.145349,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.605587
    },
    {
      "title": "3 Tips When Looking to Short-Term Bonds",
      "summary": "This article provides three key tips for investors considering short-term bonds, emphasizing their benefits in various interest rate environments and cautioning against equating short duration with low risk. It also highlights the importance of understanding how a short-term bond strategy generates its yields and its actual duration exposure. The piece suggests the Natixis Loomis Sayles Short Duration Income ETF (LSST) as a potential option for income opportunities in short-term bonds.",
      "url": "https://www.etftrends.com/portfolio-construction-channel/3-tips-short-term-bonds/",
      "source": "ETF Trends",
      "published": "20240430T000000",
      "overall_sentiment_score": 0.089153,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.098627,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.575264
    },
    {
      "title": "The Potential Rate Cut Benefits for Short Duration Bonds",
      "summary": "Experts suggest that investors currently in money market funds due to high rates may find short-duration bond funds more beneficial once the Federal Reserve begins cutting rates. Portfolio managers anticipate potential rate cuts later this year, which could shift the yield curve and create opportunities for short-term bonds to outperform money market funds. Fidelity Investments offers ETFs like FLDB and FLTB as options for investors looking to leverage the strength of short-term bonds during an easing policy cycle.",
      "url": "https://www.etftrends.com/etf-investing-channel/rate-cut-benefits-short-duration-bonds/",
      "source": "ETF Trends",
      "published": "20240430T000000",
      "overall_sentiment_score": 0.089206,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.143543,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.589069
    }
  ]
}