{
  "ticker": "JPM",
  "date": "2024-09-09",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T12:17:52.211434",
  "source": "alpha_vantage",
  "article_count": 36,
  "articles": [
    {
      "title": "MBX Biosciences sets IPO terms with plans to raise up to $136 million",
      "summary": "MBX Biosciences has set the terms for its initial public offering, planning to raise up to $136 million. The clinical-stage biotech aims to offer 8.5 million shares at a price range of $14 to $16 each. The company will be listed on Nasdaq under the ticker \"MBX\" with JPMorgan, Jefferies, Stifel, and Guggenheim Securities underwriting the deal.",
      "url": "https://www.marketwatch.com/story/mbx-biosciences-sets-ipo-terms-with-plans-to-raise-up-to-136-million-156e80c8?gaa_at=eafs&gaa_n=AWEtsqe2FD7WMlqbmYHQkTwxW94jqq-gReiPV-5YKicDYVCtD9VbCgp7KlQh&gaa_ts=69075a37&gaa_sig=D-epI51SSyNXGjodeH7I7EKHkvHkhOJd0n4vG6490V98zNauHLKXcxL2oAyeiMtGU6RjKO8j6pwYnJ62K3Wsrw%3D%3D",
      "source": "MarketWatch",
      "published": "20240909T070200",
      "overall_sentiment_score": 0.265564,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.125317,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.627498
    },
    {
      "title": "VanEck to Close Ethereum Strategy ETF, Reassessing Crypto Investment Approach",
      "summary": "VanEck has announced the closure of its futures-based Ethereum Strategy ETF (EFUT) due to a lack of investor interest, with trading ceasing on September 16 and liquidation anticipated around September 23. This decision highlights a broader trend where investors prefer spot-based crypto ETFs over older futures-based funds, as evidenced by the higher assets under management in VanEck's spot Ethereum ETF (ETHV). Industry experts like Nate Geraci anticipated this shift, noting that spot ETFs would render futures-based options obsolete.",
      "url": "https://cryptonews.com.au/news/vaneck-to-close-ethereum-strategy-etf-reassessing-crypto-investment-approach-123247/",
      "source": "Crypto News Australia",
      "published": "20240909T000000",
      "overall_sentiment_score": 0.125722,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.334718,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.553399
    },
    {
      "title": "Cliffs says it’s still interested in US Steel mills",
      "summary": "Cleveland-Cliffs remains interested in acquiring union-represented assets of U.S. Steel, especially if a proposed acquisition by Japan's Nippon Steel Corp. is blocked by the U.S. government. Cliffs CEO Lourenco Goncalves stated the company is ready to invest in any union-represented assets U.S. Steel might shut down, expressing strong support for the United Steelworkers (USW) union and condemning U.S. Steel's alleged threats. This comes as the U.S. political landscape increasingly scrutinizes foreign ownership of domestic steel production.",
      "url": "https://www.recyclingtoday.com/news/us-steel-cleveland-cliffs-nippon-steel-biden-merger-opposition-usw-union/",
      "source": "Recycling Today",
      "published": "20240909T000000",
      "overall_sentiment_score": 0.216622,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.103807,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.645228
    },
    {
      "title": "Morgan Stanley fined $2M over ex-First Republic CEO stock sales",
      "summary": "Morgan Stanley was fined $2 million by a Massachusetts regulator for failing to properly monitor stock sales by the former CEO of First Republic Bank, James Herbert II. Herbert sold over $6.8 million in First Republic stock before the bank's collapse, raising concerns about potential insider trading. The fine highlights compliance lapses within Morgan Stanley's wealth unit, including inadequate vetting of the former CEO's trading activity and failures to address red flags and specific policies for insiders at FDIC-regulated companies.",
      "url": "https://www.legaldive.com/news/morgan-stanley-fined-2m-over-ex-first-republic-ceo-stock-sales/726484/",
      "source": "Legal Dive",
      "published": "20240909T000000",
      "overall_sentiment_score": -0.05397,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.113179,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.62457
    },
    {
      "title": "BNY snaps up managed accounts provider Archer",
      "summary": "Bank of New York Mellon Corp. is acquiring Archer, a technology firm specializing in managed accounts, to expand its presence in the retail wealth market. This acquisition will help BNY distribute its investment strategies and custody bank business more broadly to financial advisors and their clients, leveraging the fast-growing retail managed accounts sector. The deal is expected to close in the fourth quarter, pending regulatory approval.",
      "url": "https://www.investmentnews.com/fintech/bny-snaps-up-managed-accounts-provider-archer/257010",
      "source": "InvestmentNews",
      "published": "20240905T000000",
      "overall_sentiment_score": 0.190857,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.143391,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.584412
    },
    {
      "title": "UL Solutions Announces Pricing of Secondary Public Offering of Class A Common Stock",
      "summary": "UL Solutions Inc. announced the pricing of its secondary public offering of 20,000,000 shares of Class A common stock at $49.00 per share. The offering consists entirely of shares sold by UL Standards & Engagement, with UL Solutions not receiving any proceeds. The offering is expected to close on September 9, 2024, with several investment banks acting as bookrunners and co-managers.",
      "url": "https://www.businesswire.com/news/home/20240905530972/en/UL-Solutions-Announces-Pricing-of-Secondary-Public-Offering-of-Class-A-Common-Stock",
      "source": "Business Wire",
      "published": "20240905T000000",
      "overall_sentiment_score": 0.119857,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.125281,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.73641
    },
    {
      "title": "Mike Philbrick's Top Picks:iShares Gold Bullion ETF, TD Q U.S. Small-Mid-Cap Equity ETF, and iMGP DBi Managed Futures Strategy ETF.",
      "summary": "Mike Philbrick, CEO of ReSolve Asset Management, shares his top investment picks. These include the iShares Gold Bullion ETF, the TD Q U.S. Small-Mid-Cap Equity ETF, and the iMGP DBi Managed Futures Strategy ETF.",
      "url": "https://www.bnnbloomberg.ca/video/shows/market-call/2024/08/30/mike-philbricks-top-picksishares-gold-bullion-etf-td-q-us-small-mid-cap-equity-etf-and-imgp-dbi-managed-futures-strategy-etf/",
      "source": "BNN Bloomberg",
      "published": "20240830T125000",
      "overall_sentiment_score": 0.262616,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.226551,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.696969
    },
    {
      "title": "Harbor Capital Advisors Expands Growing ETF Lineup with the Harbor Active Small Cap ETF",
      "summary": "Harbor Capital Advisors has launched the Harbor Active Small Cap ETF (SMLL), an actively managed fund investing in growth and value small-cap companies. The ETF provides exclusive access to portfolio manager Glenn Gawronski's disciplined investing approach, aiming to capitalize on inefficiencies in the small-cap market. With a total expense ratio of 80 basis points, SMLL seeks to offer a cost-effective, transparent, and tax-efficient strategy for advisors.",
      "url": "https://markets.financialcontent.com/siliconvalley/article/bizwire-2024-8-29-harbor-capital-advisors-expands-growing-etf-lineup-with-the-harbor-active-small-cap-etf",
      "source": "FinancialContent",
      "published": "20240829T090000",
      "overall_sentiment_score": 0.251775,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.104175,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.6146
    },
    {
      "title": "GigCapital7 Corp. Announces Pricing of $200,000,000 Initial Public Offering",
      "summary": "GigCapital7 Corp. announced the pricing of its initial public offering of 20,000,000 units at $10.00 per unit, totaling $200,000,000. The units, consisting of one Class A ordinary share and one redeemable warrant, are expected to be listed on the Nasdaq Global Market under the ticker symbol \"GIGGU\" beginning August 29, 2024. Craft Capital Management LLC and EF Hutton LLC are acting as joint book-running managers for the offering, which is expected to close on August 30, 2024.",
      "url": "https://www.businesswire.com/news/home/20240829453048/en/GigCapital7-Corp.-Announces-Pricing-of-%24200000000-Initial-Public-Offering",
      "source": "Business Wire",
      "published": "20240829T000000",
      "overall_sentiment_score": 0.262229,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.129677,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.582371
    },
    {
      "title": "U.S. Bank works to simplify SMB banking, payments",
      "summary": "U.S. Bank is focusing on simplifying banking and payment services for small and medium-sized businesses (SMBs) to gain a competitive edge. The bank aims to provide a unified platform for banking and payment products, addressing SMB owners' desire for seamless integration and simple solutions. U.S. Bank is also expanding its SBA loan program, having approved 2,746 SBA 7(a) loans totaling $557.5 million thus far this fiscal year, placing it among the top five lenders.",
      "url": "https://www.bankingdive.com/news/us-bank-simplify-smb-banking-payments-small-business/725668/",
      "source": "Banking Dive",
      "published": "20240829T000000",
      "overall_sentiment_score": 0.259844,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.105602,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.647675
    },
    {
      "title": "Who owns Kings Island, Cedar Point? A look at the amusement park group created in merger",
      "summary": "The merger of Six Flags and Cedar Fair has created the new Six Flags Entertainment Corp., an $8 billion company with 42 properties across North America, including Kings Island and Cedar Point. The largest shareholder of the publicly traded Six Flags Entertainment (NYSE:FUN) is Goldman Sachs, followed by JPMorgan Chase & Co., UBS Group AG, and Barclays PLC. The article details the locations of parks owned by the new entity, distinguishing between former Six Flags and Cedar Fair locations.",
      "url": "https://www.beaconjournal.com/story/entertainment/2024/08/28/who-owns-kings-island-cedar-point-cedar-fair-six-flags-merger-creates-new-theme-park-group/74969843007/",
      "source": "Akron Beacon Journal",
      "published": "20240828T000000",
      "overall_sentiment_score": 0.236774,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.239997,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.635098
    },
    {
      "title": "Goldman Sachs snaps up Citigroup veteran for natural resources team",
      "summary": "Goldman Sachs has hired Tyler Miller, a veteran power banker from Citigroup, as a partner and global co-head of power, utilities, and infrastructure in its natural resources group. Miller brings almost 25 years of experience to Goldman Sachs, where his hiring is strategically timed amidst a surge in energy demand driven by the artificial intelligence boom and increased deal activity in the utility sector. This move follows Goldman Sachs' efforts to strengthen its talent pool, including winning back former employees and poaching others from rivals.",
      "url": "https://www.investmentnews.com/ria-news/goldman-sachs-snaps-up-citigroup-veteran-for-natural-resources-team/256808",
      "source": "InvestmentNews",
      "published": "20240828T000000",
      "overall_sentiment_score": 0.172577,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.142981,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.610094
    },
    {
      "title": "BofA clients pull out of US stocks as S&P 500 hovers near all-time high",
      "summary": "Bank of America clients recorded their first net outflow from US stocks in three weeks, totaling $4.6 billion, as the S&P 500 neared an all-time high. The withdrawals were seen across most client groups and seven of 11 sectors, including technology and energy, signaling a shift to risk-off sentiment despite recent market gains. Meanwhile, client purchases of ETFs continued, particularly in tech ETFs, while corporate buybacks slowed.",
      "url": "https://www.investmentnews.com/equities/bofa-clients-pull-out-of-us-stocks-as-sp-500-hovers-near-all-time-high/256800",
      "source": "InvestmentNews",
      "published": "20240827T000000",
      "overall_sentiment_score": 0.03766,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.023872,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.634547
    },
    {
      "title": "BNY takes $5M hit over swaps reporting shortfalls",
      "summary": "Bank of New York Mellon Corp. will pay a $5 million penalty after the US Commodity Futures Trading Commission (CFTC) found it repeatedly failed to properly report millions of swap transactions and supervise a related unit. The CFTC stated that BNY violated a prior order, though the penalty was reduced due to BNY's self-reporting. This follows similar settlements with other major banks last year regarding swaps reporting issues.",
      "url": "https://www.investmentnews.com/regulation-and-legislation/bny-takes-5m-hit-over-swaps-reporting-shortfalls/256758",
      "source": "InvestmentNews",
      "published": "20240826T000000",
      "overall_sentiment_score": -0.327135,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.294071,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.728358
    },
    {
      "title": "Bank of America Hires JPMorgan Software Banker Carpenter",
      "summary": "Bank of America Corp. has hired Tim Carpenter from JPMorgan Chase & Co. to co-lead its software investment banking practice. Carpenter, who will join as a managing director in December, will be based in Boston and work alongside Edward Liu, the bank's other software co-head. This move strengthens Bank of America's presence in the software investment banking sector.",
      "url": "https://www.bloomberg.com/news/articles/2024-09-09/bank-of-america-hires-jpmorgan-software-banker-carpenter",
      "source": "Bloomberg.com",
      "published": "20240909T153000",
      "overall_sentiment_score": 0.029102,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.118795,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.827228
    },
    {
      "title": "High-Yield Opportunity Persists, Despite Tight Spreads",
      "summary": "Despite narrow credit spreads, AllianceBernstein argues there's a compelling case for investing in the high-yield market due to strong economic fundamentals, sticky spread trends, and attractive yields. Historical data suggests that tight spreads have often been followed by strong returns, and current yields are significantly higher than in previous years. High yield bonds are also presented as a potentially prudent substitute for a portion of an equity allocation, offering equity-like returns with less volatility.",
      "url": "https://www.alliancebernstein.com/corporate/en/insights/investment-insights/high-yield-opportunity-persists-despite-tight-spreads.html",
      "source": "AllianceBernstein",
      "published": "20240906T000000",
      "overall_sentiment_score": -0.044109,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.097844,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.557116
    },
    {
      "title": "Small-cap stocks unloved in ETF flows — but Rob Arnott likes these ‘underdogs’",
      "summary": "This article discusses the current state of small-cap stocks, noting they are \"unloved\" in ETF flows despite unusually strong overall ETF inflows in August. It highlights Rob Arnott, founder of Research Affiliates, for his interest in these \"underdog\" small-cap stocks and his firm's new ETF. The piece suggests that while large-cap stocks may be dominating flows, there's a contrarian view on the potential of small caps.",
      "url": "https://www.marketwatch.com/story/small-cap-stocks-unloved-in-etf-flows-but-rob-arnott-likes-these-underdogs-9d719c0c?gaa_at=eafs&gaa_n=AWEtsqfN0fvN29tP9lHS-xrTpty8eywhXLdkFUIOQsPwHFbwHEr4Nd5_UhO6&gaa_ts=690757e0&gaa_sig=HawLi7PMftvNo8bvgHLdQd-iePlYXE_2n8YdzihEr-rotfDkjnB5_-DWyciK5hrSHQTa6er4CR83SEfozzjWRw%3D%3D",
      "source": "MarketWatch",
      "published": "20240905T182000",
      "overall_sentiment_score": 0.150755,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.136814,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.602973
    },
    {
      "title": "PFFD: Shrinking Value And Distribution",
      "summary": "The Global X U.S. Preferred ETF (PFFD) tracks an index of U.S. preferred stocks and is concentrated in top issuers, particularly large banks. Despite its bond-like returns, PFFD has underperformed high-yield bond benchmarks and other preferred stock ETFs. The article highlights a significant decay in both the value and distribution of PFFD.",
      "url": "https://seekingalpha.com/article/4719164-pffd-shrinking-value-distribution",
      "source": "Seeking Alpha",
      "published": "20240905T055200",
      "overall_sentiment_score": -0.187989,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.227341,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.744827
    },
    {
      "title": "Dollar's Dominance Faces Challenges, But Demise Is Decades Away: Analyst",
      "summary": "JPMorgan's Joyce Chang asserts that the U.S. dollar's global dominance is deeply entrenched and its meaningful erosion is likely decades away, despite growing diversification efforts and alternative financial systems. While de-dollarization risks are exaggerated, particularly in China, the rise of digital payment systems and a drive for payments autonomy present an underappreciated long-term risk to the dollar's hegemony. Investors should monitor these evolving trends and consider diversified currency exposure.",
      "url": "https://www.tradingview.com/news/benzinga:2bd359ea4094b:0-dollar-s-dominance-faces-challenges-but-demise-is-decades-away-analyst/",
      "source": "TradingView — Track All Markets",
      "published": "20240904T181032",
      "overall_sentiment_score": 0.089098,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.103057,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.641809
    },
    {
      "title": "BofA joins peers in downgrading China growth",
      "summary": "Bank of America (BofA) has joined other major Wall Street banks in downgrading its forecast for China's economic growth this year to below 5%, now expecting 4.8%. This revised outlook reflects a growing consensus that China will struggle to meet its official growth target, with BofA economists highlighting insufficient policy support and the US presidential election as key uncertainties. The bank also predicts further slowdowns in the next two years, projecting 4.5% growth.",
      "url": "https://www.investmentnews.com/ria-news/bofa-joins-peers-in-downgrading-china-growth/256973",
      "source": "InvestmentNews",
      "published": "20240904T000000",
      "overall_sentiment_score": -0.353572,
      "overall_sentiment_label": "Bearish",
      "ticker_sentiment_score": -0.322137,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.720085
    },
    {
      "title": "US regulator fines Bank of America, Merrill Lynch $3M over insufficient surveillance systems",
      "summary": "Bank of America Securities and Merrill Lynch have been fined $3 million by a US regulator for insufficient surveillance systems. This settlement follows previous fines for Bank of America related to reporting failures. The article notes Bank of America's Charlotte headquarters and references other recent regulatory actions against financial institutions.",
      "url": "https://www.bizjournals.com/charlotte/news/2024/09/03/bank-of-america-merrill-lynch-fine-finra-banking.html",
      "source": "The Business Journals",
      "published": "20240903T000000",
      "overall_sentiment_score": -0.363896,
      "overall_sentiment_label": "Bearish",
      "ticker_sentiment_score": -0.321711,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.640339
    },
    {
      "title": "Fastenal Company (NASDAQ:FAST) is largely controlled by institutional shareholders who own 83% of the company",
      "summary": "Fastenal Company (NASDAQ:FAST) is primarily owned by institutional shareholders, who control 83% of the company's stock, giving them significant influence over its stock price and corporate decisions. The top 23 shareholders collectively own 50% of the company, and insiders hold less than 1% but have recently made purchases. Retail investors represent 17% of the ownership.",
      "url": "https://finance.yahoo.com/news/fastenal-company-nasdaq-fast-largely-130015523.html",
      "source": "Yahoo Finance",
      "published": "20240901T130015",
      "overall_sentiment_score": 0.117237,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.113865,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.640245
    },
    {
      "title": "Solid-State EV Batteries Could Drive Silver Demand: How to Invest",
      "summary": "Breakthroughs in silver-based solid-state battery technology for electric vehicles could significantly increase global silver demand, with each 100 kWh battery pack potentially using up to 1 kg of silver. This surge in demand presents a substantial investment opportunity for silver, and investors can gain exposure through exchange-traded funds like the iShares Silver Trust (SLV) and the abrdn Physical Silver Shares ETF (SIVR). These ETFs offer a convenient and cost-effective way to capitalize on the expected rise in silver prices due to its industrial applications in the EV sector.",
      "url": "https://www.theglobeandmail.com/investing/markets/stocks/JPM/pressreleases/28294298/solid-state-ev-batteries-could-drive-silver-demand-how-to-invest/",
      "source": "The Globe and Mail",
      "published": "20240830T160908",
      "overall_sentiment_score": 0.287548,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.146711,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.631961
    },
    {
      "title": "Looming Rate Cuts Could Push These ETFs Higher",
      "summary": "The article discusses how impending interest rate cuts could significantly benefit financial sector ETFs, especially leveraged options like Direxion Daily Financial Bull 3X ETF (FAS) and Direxion Daily Regional Banks Bull 3X Shares (DPST). It highlights the potential for increased profitability for banks and renewed life in the real estate sector, suggesting Direxion Daily Real Estate Bull 3X Shares (DRN) as another play. The piece emphasizes that while financial stocks were out of favor, positioning in the options market and recent stock action indicate a shift.",
      "url": "https://www.etftrends.com/leveraged-inverse-channel/looming-rate-cuts-could-push-etfs-higher/",
      "source": "ETF Trends",
      "published": "20240830T000000",
      "overall_sentiment_score": 0.407224,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.311392,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.560163
    },
    {
      "title": "KeyCorp's (KEY) Restructuring Initiatives Aid Amid Rising Costs",
      "summary": "KeyCorp (KEY) is positioned for top-line growth due to strategic acquisitions, restructuring, and strong loan/deposit balances, despite rising funding costs and elevated expenses. The company's initiatives to expand digital banking services and pursue opportunistic buyouts are expected to boost fee income and revenues in the coming years. Weakening asset quality, however, remains a concern.",
      "url": "https://finance.yahoo.com/news/keycorps-key-restructuring-initiatives-aid-162100382.html",
      "source": "Yahoo Finance",
      "published": "20240826T162100",
      "overall_sentiment_score": 0.203216,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.218501,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.600567
    },
    {
      "title": "HSBC Targets To Double Wealth Business Assets To $131B In UK: Report",
      "summary": "HSBC aims to double its UK wealth management assets to £100 billion (approximately $131 billion) within the next five years, targeting the 'mass affluent' market. The bank plans to leverage its global presence and hire more advisors to achieve this goal, focusing on international connectivity and digital channel enhancements. This strategy is part of a broader banking trend to expand into less interest-rate-sensitive sectors and compete with independent financial advisors.",
      "url": "https://es.tradingview.com/news/benzinga%3A12ebddc92094b%3A0-hsbc-targets-to-double-wealth-business-assets-to-131b-in-uk-report/",
      "source": "TradingView: siga todos los mercados",
      "published": "20240826T132721",
      "overall_sentiment_score": 0.180911,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.129281,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.62654
    },
    {
      "title": "U.S. Bancorp (USB) Rises 12% in 3 Months: More Upside Left?",
      "summary": "U.S. Bancorp (USB) has seen its shares rise 12% in the past three months, fueled by strategic acquisitions and a strong balance sheet. The article explores factors like inorganic expansion, the Fed's potential rate cuts, and capital position as drivers for future growth, while also noting concerns such as mounting expenses and a lack of loan portfolio diversification. Despite these concerns, the company is positioned to benefit from upcoming economic shifts and strategic moves.",
      "url": "https://www.nasdaq.com/articles/us-bancorp-usb-rises-12-3-months-more-upside-left",
      "source": "Nasdaq",
      "published": "20240826T121300",
      "overall_sentiment_score": 0.391523,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.337965,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.603189
    },
    {
      "title": "Key Industry Accolades Highlight Plumas Bank’s Stability & Performance Through Economic Fluctuations",
      "summary": "Plumas Bank has received multiple prestigious awards in 2024, acknowledging its exceptional performance in serving clients, investors, and communities. These accolades, including rankings from American Banker, KBW Bank Honor Roll, and ICBA, highlight the bank's stability and strong results through economic fluctuations. Plumas Bank attributes this success to its proactive management of earnings, expenses, and margins.",
      "url": "https://nevadabusiness.com/2024/08/key-industry-accolades-highlight-plumas-banks-stability-performance-through-economic-fluctuations/",
      "source": "Nevada Business Magazine",
      "published": "20240826T000000",
      "overall_sentiment_score": 0.502768,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.129061,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.569624
    },
    {
      "title": "Institutional investors find edge with currency-hedged US Treasury ETFs",
      "summary": "Mexican institutional investors are increasingly using currency-hedged short-duration US Treasury ETFs to capitalize on positive carry, leading to significantly higher returns compared to unhedged counterparts. These inflows have reached nearly $5.4bn in 2024 across five Mexican peso-hedged share classes. The strategy allows investors to access broader fixed income exposures and leverage the Mexican peso's positive carry, with some also using these instruments to synthetically replicate local fixed income exposure.",
      "url": "https://www.etfstream.com/articles/institutional-investors-find-edge-with-currency-hedged-us-treasury-etfs",
      "source": "ETF Stream",
      "published": "20240902T000000",
      "overall_sentiment_score": 0.380706,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.316624,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.629486
    },
    {
      "title": "Abrupt departure of co-CIO Ken Leech raises due diligence bar for Western Asset Management institutional clients",
      "summary": "The abrupt departure of co-CIO Ken Leech from Western Asset Management is expected to increase the due diligence requirements for the firm's institutional clients. This development occurred on August 28, 2024. The article title implies a significant impact on how clients will vet the asset management firm moving forward.",
      "url": "https://www.pionline.com/money-management/abrupt-departure-co-cio-ken-leech-raises-due-diligence-bar-western-asset/",
      "source": "Pensions & Investments",
      "published": "20240828T110100",
      "overall_sentiment_score": 0.176345,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.267639,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.618777
    },
    {
      "title": "European Stock Market Closing Review] U.S. Employment Slowdown Impacts Global Markets! European Stock Markets Turn Down, with Energy and Banking Stocks Leading the Decline.",
      "summary": "European stock markets closed lower, primarily impacted by a significant slowdown in U.S. non-farm payroll data, which intensified concerns about the U.S. economy and strengthened the case for a Federal Reserve rate cut. The energy and banking sectors led the decline, while interest rate-sensitive sectors like real estate saw gains. Political uncertainties in France and mixed economic data from Germany and the Eurozone also contributed to market sentiment.",
      "url": "https://news.futunn.com/en/post/61753559/european-stock-market-closing-review-us-employment-slowdown-impacts-global",
      "source": "富途牛牛",
      "published": "20240906T033100",
      "overall_sentiment_score": -0.115534,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.186231,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.691781
    },
    {
      "title": "Father-daughter advisor duo splits from Morgan Stanley",
      "summary": "Veteran advisor Joel Freedman and his daughter Alex Freedman have departed from Morgan Stanley to launch their own independent firm, Eclipse Private Wealth Management, in Radnor, Pennsylvania. The new firm will affiliate with Sanctuary Wealth and BNY Pershing, focusing on personalized financial planning and wealth management services. Joel Freedman, with nearly 40 years of experience, and Alex Freedman aim to embrace independence to better serve their clients.",
      "url": "https://www.investmentnews.com/ria-news/father-daughter-advisor-duo-splits-from-morgan-stanley/257034",
      "source": "InvestmentNews",
      "published": "20240906T000000",
      "overall_sentiment_score": 0.098655,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.059141,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.622167
    },
    {
      "title": "3 Cruise Line Stocks Promising Near-Term Growth: RCL, CCL, NCLH",
      "summary": "The cruise industry is experiencing strong demand and increased booking volumes for both North American and European sailings, benefiting from solid pricing and onboard spending. This article highlights three cruise line stocks—Royal Caribbean Cruises Ltd. (RCL), Carnival Corp. & plc (CCL), and Norwegian Cruise Line Holdings Ltd. (NCLH)—as promising investments due to their strong growth potential and favorable Zacks Ranks, supported by rising passenger projections and positive earnings estimate revisions.",
      "url": "https://finance.yahoo.com/news/3-cruise-line-stocks-promising-184500788.html",
      "source": "Yahoo Finance",
      "published": "20240827T184500",
      "overall_sentiment_score": 0.419426,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.133188,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.63312
    },
    {
      "title": "Lending opportunities attract new mortgage REITs from Goldman Sachs, Principal Real Estate",
      "summary": "Goldman Sachs and Principal Real Estate are launching new nonlisted mortgage REITs, the Goldman Sachs Real Estate Finance Trust and Principal Credit Real Estate Income Trust, to capitalize on alternative lending opportunities. These firms aim to raise capital from individual investors to originate and buy property loans, targeting debt investments rather than properties. The move comes as commercial real estate debt investing gains favor amid high interest rates and traditional lenders reduce their real estate exposure.",
      "url": "https://www.costar.com/article/8271426/lending-opportunities-attract-new-mortgage-reits-from-goldman-sachs-principal-real-estate",
      "source": "CoStar",
      "published": "20240909T204100",
      "overall_sentiment_score": 0.249493,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.304135,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.615084
    },
    {
      "title": "Goldman Sachs AM Hires New International ETF Strategy Head",
      "summary": "Goldman Sachs Asset Management has appointed Simon Hutcheson as its new head of international ETF strategy and development, following his seven-year tenure at State Street Global Advisors. This hiring comes as Goldman Sachs expands its ETF market presence and undergoes management team changes. The firm has recently seen several departures from its ETF leadership but continues to launch new funds and grow its assets under management.",
      "url": "https://finance.yahoo.com/news/goldman-sachs-am-hires-international-181805452.html",
      "source": "Yahoo Finance",
      "published": "20240903T181805",
      "overall_sentiment_score": 0.237114,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.13036,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.645888
    },
    {
      "title": "Goldman Sachs AM Hires New International ETF Strategy Head",
      "summary": "Goldman Sachs Asset Management (GSAM) has appointed Simon Hutcheson as head of international ETF strategy and development, following his seven years at State Street Global Advisors. This hiring is part of Goldman Sachs' broader effort to expand its ETF market participation, which has also involved recent hires and departures within its ETF management team. Goldman Sachs is actively introducing new ETFs and has expressed a commitment to delivering innovative solutions to clients.",
      "url": "https://www.etf.com/sections/news/goldman-sachs-am-hires-new-international-etf-strategy-head",
      "source": "ETF.com",
      "published": "20240903T000000",
      "overall_sentiment_score": 0.203933,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.20979,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.609617
    }
  ]
}