{
  "ticker": "JPM",
  "date": "2025-08-11",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T13:00:47.084545",
  "source": "alpha_vantage",
  "article_count": 50,
  "articles": [
    {
      "title": "Citigroup hires JPMorgan's Baygual as co-head of M&A, memo shows",
      "summary": "Citigroup has hired Guillermo Baygual from JPMorgan Chase as co-head of mergers and acquisitions, signaling its intent to expand its dealmaking business. This appointment follows other strategic moves by Citi to grow its investment banking arm, with the bank reporting a strong M&A pipeline and ranking high in M&A revenue in the first half of 2025.",
      "url": "https://www.reuters.com/business/finance/citigroup-hires-jpmorgans-baygual-co-head-ma-memo-shows-2025-08-07/",
      "source": "Reuters",
      "published": "20250807T224500",
      "overall_sentiment_score": 0.189446,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.256479,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.833676
    },
    {
      "title": "J.P. Morgan AM launches India Equity Active ETF",
      "summary": "J.P. Morgan Asset Management has launched an India Research Enhanced Index Equity Active UCITS ETF (JRIN) on major European exchanges. This fund is the firm's fifth emerging markets product in its Research Enhanced Index range, bringing the total to 14 ETFs with $28bn in AUM. Managed by Lina Nassar and Sonal Tanna, the ETF aims to outperform the MSCI India 10/40 Index by actively investing in Indian companies using a bottom-up stock selection process and leveraging insights from over 50 emerging markets research analysts.",
      "url": "https://funds-europe.com/j-p-morgan-am-launches-india-equity-active-ucits-etf/",
      "source": "Funds Europe",
      "published": "20250805T000000",
      "overall_sentiment_score": 0.214007,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.449782,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.813478
    },
    {
      "title": "Compra ASUR concesiones comerciales en aeropuertos de EU por 295 mdd",
      "summary": "Grupo Aeroportuario del Sureste (ASUR) has agreed to acquire commercial concessions in several US airports for $295 million. This strategic expansion includes purchasing URW Airports, which manages commercial programs in major US airports like Los Angeles, Chicago O'Hare, and New York JFK. The transaction, expected to close in the second half of 2025, is being financed by available cash and debt funding from JPMorgan Chase Bank.",
      "url": "https://www.elfinanciero.com.mx/empresas/2025/07/31/compra-asur-concesiones-comerciales-en-aeropuertos-de-eu-por-295-mdd/",
      "source": "El Financiero",
      "published": "20250731T143900",
      "overall_sentiment_score": 0.349402,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.206632,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.74994
    },
    {
      "title": "Firefly Aerospace Announces Pricing of Upsized Initial Public Offering",
      "summary": "Firefly Aerospace announced the pricing of its upsized initial public offering of 19,296,000 shares of common stock at $45.00 per share, with an option for underwriters to purchase additional shares. The shares are expected to trade on Nasdaq Global Market under \"FLY\" starting August 7, 2025. Firefly intends to use the net proceeds to repay outstanding borrowings, settle accrued dividends on preferred stock, and for general corporate purposes.",
      "url": "https://fireflyspace.com/news/firefly-aerospace-announces-pricing-of-upsized-initial-public-offering/",
      "source": "Firefly Aerospace",
      "published": "20250806T000000",
      "overall_sentiment_score": 0.308413,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.244979,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.723286
    },
    {
      "title": "Citi announces research expansion into private industry, mostly tech firms",
      "summary": "Citigroup is expanding its research coverage to include private companies, particularly rapidly growing tech firms in sectors like artificial intelligence, mirroring a strategy by JPMorgan Chase. The reports will focus on event-driven analysis but will not include price targets or buy/sell recommendations. This move addresses the blurring lines between public and private market influence as some private companies achieve valuations comparable to major S&P 500 firms.",
      "url": "https://www.reuters.com/business/finance/citi-announces-research-expansion-into-private-industry-mostly-tech-firms-2025-07-29/",
      "source": "Reuters",
      "published": "20250729T034900",
      "overall_sentiment_score": 0.22259,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.203524,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.713414
    },
    {
      "title": "Healthpeak Prices Offering of $500 Million of 4.750% Senior Unsecured Notes Due 2033",
      "summary": "Healthpeak Properties, Inc. announced that its operating company, Healthpeak OP, LLC, has priced a public offering of $500 million in 4.750% senior unsecured notes due 2033. The estimated net proceeds of approximately $492.8 million will be used to repay borrowings under its commercial paper program and for general corporate purposes, including other indebtedness, acquisitions, and development activities. The offering is expected to close on August 14, 2025.",
      "url": "https://markets.financialcontent.com/whittierdailynews/article/bizwire-2025-8-5-healthpeak-prices-offering-of-500-million-of-4750-senior-unsecured-notes-due-2033",
      "source": "FinancialContent",
      "published": "20250805T172700",
      "overall_sentiment_score": 0.144567,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.127063,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.684694
    },
    {
      "title": "Hess Midstream LP Announces Signing of Accretive $100 Million Repurchase From Sponsor and the Public",
      "summary": "Hess Midstream LP declared an accretive $100 million repurchase, encompassing both Class B units from a Chevron affiliate and Class A shares from the public. This strategic move is part of an ongoing financial strategy focusing on shareholder returns, with the company aiming for continued financial flexibility of over $1.25 billion through 2027 for incremental shareholder returns and potential further repurchases. The repurchased securities will be cancelled, expected to boost distributable cash flow per Class A share and support distribution growth above the targeted 5% annually through 2027.",
      "url": "https://www.businesswire.com/news/home/20250805862879/en/Hess-Midstream-LP-Announces-Signing-of-Accretive-%24100-Million-Repurchase-From-Sponsor-and-the-Public",
      "source": "Business Wire",
      "published": "20250805T030907",
      "overall_sentiment_score": 0.341602,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.129227,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.649379
    },
    {
      "title": "1 No-Brainer Dividend Index Fund to Buy Right Now for Less Than $500",
      "summary": "The article recommends the Fidelity High Dividend ETF (FDVV) as a strong dividend index fund investment for less than $500. It highlights the ETF's solid performance, comparable to the S&P 500 but with a significantly higher dividend yield, and its low expense ratio. The fund's portfolio combines tech growth stocks like Nvidia and Microsoft with blue-chip dividend payers such as JPMorgan Chase, enabling it to deliver both growth and income.",
      "url": "https://www.theglobeandmail.com/investing/markets/markets-news/Motley%20Fool/34003231/1-no-brainer-dividend-index-fund-to-buy-right-now-for-less-than-500/",
      "source": "The Globe and Mail",
      "published": "20250808T035842",
      "overall_sentiment_score": 0.326623,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.306253,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.648776
    },
    {
      "title": "_{Celcuity Inc. Announces Concurrent Public Offerings of Convertible Senior Notes Due 2031 and Common Stock",
      "summary": "Celcuity Inc. announced concurrent public offerings of $150 million in convertible senior notes due 2031 and $75 million in common stock. The company intends to use the net proceeds for capped call transactions, working capital, and general corporate purposes, including clinical trial expenditures and business development. The offerings are subject to market conditions, and the closing of one is not conditioned on the other.",
      "url": "https://www.globenewswire.com/news-release/2025/07/28/3122817/0/en/Celcuity-Inc-Announces-Concurrent-Public-Offerings-of-Convertible-Senior-Notes-Due-2031-and-Common-Stock.html",
      "source": "GlobeNewswire",
      "published": "20250728T160200",
      "overall_sentiment_score": 0.140693,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.112607,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.648697
    },
    {
      "title": "Firefly Aerospace Announces Launch of Initial Public Offering",
      "summary": "Firefly Aerospace has announced the launch of its initial public offering (IPO), proposing to offer 16,200,000 shares of common stock at an expected price between $35.00 and $39.00 per share. The company intends to use the net proceeds to repay outstanding borrowings, pay dividends on preferred stock, and for general corporate purposes. Firefly Aerospace has applied to list its common stock on the Nasdaq Global Market under the ticker symbol “FLY,” with Goldman Sachs & Co. LLC, J.P. Morgan, Jefferies, and Wells Fargo Securities acting as lead bookrunning managers.",
      "url": "https://fireflyspace.com/news/firefly-aerospace-announces-launch-of-initial-public-offering/",
      "source": "Firefly Aerospace",
      "published": "20250728T000000",
      "overall_sentiment_score": 0.389134,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.346791,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.646523
    },
    {
      "title": "Vanguard vs. Fidelity: Which Is the Better High-Yield ETF to Buy Now?",
      "summary": "This article compares two high-yield ETFs, Vanguard High Dividend Yield ETF (VYM) and Fidelity High Dividend ETF (FDVV), to determine which is a better buy for 2025. While both offer compelling features for income-focused investors, the article concludes that VYM is the superior choice due to its ultra-low expense ratio, broader diversification, and focus on stable, high-yield companies, despite FDVV offering a higher yield and growth potential.",
      "url": "https://247wallst.com/investing/2025/08/09/vanguard-vs-fidelity-which-is-the-better-high-yield-etf-to-buy-now/",
      "source": "24/7 Wall St.",
      "published": "20250809T100600",
      "overall_sentiment_score": 0.313503,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.333572,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.644946
    },
    {
      "title": "Ford Motor Co. takes out a $3B line of credit amid economic uncertainty",
      "summary": "Ford Motor Co. has secured a $3 billion term loan credit agreement, available until July 28, 2026, with loans maturing by December 31, 2028. This action, administered by JPMorgan Chase Bank, aims to enhance Ford's liquidity and financial flexibility, especially in light of economic uncertainties such as tariffs and potential recession. As part of the agreement, Ford is required to maintain a minimum cash reserve of $4 billion.",
      "url": "https://www.freep.com/story/money/cars/ford/2025/07/28/ford-motor-takes-line-of-credit-amid-economic-uncertainty/85413747007/",
      "source": "Detroit Free Press",
      "published": "20250728T000000",
      "overall_sentiment_score": -0.153429,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": 0.126834,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.644691
    },
    {
      "title": "Buffett's Berkshire sells one-third of VeriSign stake for $1.23 billion",
      "summary": "Berkshire Hathaway sold approximately one-third of its stake in VeriSign for $1.23 billion, reducing its ownership to 9.6% from 14.2%. The sale was intended to bring Berkshire's stake below a 10% regulatory threshold, with the shares sold at a 6.9% discount to VeriSign's closing price. This move comes as Berkshire, led by Warren Buffett, has been a net seller of stocks for several quarters.",
      "url": "https://www.reuters.com/legal/government/buffetts-berkshire-sells-one-third-verisign-stake-123-billion-2025-07-28/",
      "source": "Reuters",
      "published": "20250729T021300",
      "overall_sentiment_score": -0.083332,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.147578,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.644188
    },
    {
      "title": "Replimune Group: Unexpected Surge Analysis",
      "summary": "Replimune Group Inc. (REPL) experienced a significant 65.06% stock surge due to promising clinical trial results for its RP1 treatment in melanoma, leading JPMorgan to initially raise its price target to $19. However, the stock faced a downturn and class-action lawsuit after the FDA rejected RP1, causing JPMorgan to revise its target down to $9. The article provides an overview of Replimune's financial situation, stock price movements, and market implications, advising caution despite speculative optimism.",
      "url": "https://stockstotrade.com/news/replimune-group-inc-repl-news-2025_07_30/",
      "source": "StocksToTrade",
      "published": "20250730T140400",
      "overall_sentiment_score": 0.052585,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.145664,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.643781
    },
    {
      "title": "Service Corporation International declares quarterly dividend of 32 cents",
      "summary": "Service Corporation International (NYSE:SCI) announced a quarterly cash dividend of 32 cents per share, maintaining its 21-year streak of dividend payments and marking its 11th consecutive year of dividend increases. The dividend is payable on September 30, 2025, to shareholders of record by September 15, 2025. This decision follows stronger-than-expected Q2 2025 financial results, leading Raymond James to raise its price target for SCI to $90 with an Outperform rating.",
      "url": "https://www.investing.com/news/company-news/service-corporation-international-declares-quarterly-dividend-of-32-cents-93CH-4174106",
      "source": "Investing.com",
      "published": "20250806T121700",
      "overall_sentiment_score": 0.376904,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.348924,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.642373
    },
    {
      "title": "VeriSign: ação desaba após Berkshire, de Buffett, vender participação de US$ 1,23 bi",
      "summary": "Berkshire Hathaway, led by Warren Buffett, sold approximately one-third of its stake in VeriSign, an internet infrastructure and domain name registration company. This divestment, which totaled around $1.23 billion, caused VeriSign's stock to drop by 9.32%. The sale aimed to reduce Berkshire's holding below a 10% regulatory threshold, with VeriSign not receiving any proceeds from the transaction.",
      "url": "https://www.infomoney.com.br/mercados/verisign-acao-desaba-apos-berkshire-de-buffett-vender-participacao-de-us-123-bi/",
      "source": "InfoMoney",
      "published": "20250729T173100",
      "overall_sentiment_score": -0.198646,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": 0.11923,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.639924
    },
    {
      "title": "Barclays exits Net-Zero Banking Alliance, follows HSBC",
      "summary": "Barclays announced its withdrawal from the United Nations-backed Net-Zero Banking Alliance (NZBA), citing the departure of most global banks from the coalition. The bank stated its continued commitment to its sustainability goals, including reaching net-zero emissions by 2050 and allocating $1 trillion in sustainable and transition financing by 2030, despite a recent report highlighting its increased financing of fossil fuels. This exit follows similar moves by HSBC and other major financial institutions, particularly after the NZBA loosened its membership requirements.",
      "url": "https://www.esgdive.com/news/barclays-exits-net-zero-banking-alliance-follows-hsbc/756608/",
      "source": "ESG Dive",
      "published": "20250801T000000",
      "overall_sentiment_score": -0.145,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.139543,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.638806
    },
    {
      "title": "Figma Announces Pricing of Initial Public Offering",
      "summary": "Figma has announced the pricing of its initial public offering of 36,937,080 shares of Class A common stock at $33.00 per share. The company plans to begin trading on the New York Stock Exchange under the ticker symbol “FIG” on July 31, 2025, with the offering expected to close on August 1, 2025. This IPO includes shares offered by Figma and existing stockholders, with underwriters having an option to purchase additional shares.",
      "url": "https://www.businesswire.com/news/home/20250730260733/en/Figma-Announces-Pricing-of-Initial-Public-Offering",
      "source": "Business Wire",
      "published": "20250731T081018",
      "overall_sentiment_score": 0.359772,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.308934,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.634025
    },
    {
      "title": "F&G Annuities & Life Announces Strategic Partnership With New Reinsurer Backed by Blackstone Managed Funds",
      "summary": "F&G Annuities & Life (NYSE: FG) has announced a strategic partnership with a new reinsurance vehicle backed by Blackstone managed funds, involving approximately $1 billion in anticipated capital commitments. This partnership, effective August 1, 2025, will provide long-term growth capital to F&G through a forward flow reinsurance agreement on a quota share basis for fixed indexed annuity products. The collaboration aims to enhance F&G's capital-light model, support growth opportunities, and shift the business towards a more fee-based, higher-margin structure.",
      "url": "https://www.prnewswire.com/news-releases/fg-annuities--life-announces-strategic-partnership-with-new-reinsurer-backed-by-blackstone-managed-funds-302523508.html",
      "source": "PR Newswire",
      "published": "20250806T162500",
      "overall_sentiment_score": 0.283462,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.110917,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.63259
    },
    {
      "title": "Heartflow, Inc. Announces Closing of Upsized Initial Public Offering and Full Exercise of the Underwriters' Option to Purchase Additional Shares",
      "summary": "Heartflow, Inc. (Nasdaq: HTFL) announced the closing of its upsized initial public offering of 19,166,667 shares at $19 per share, including the full exercise of the underwriters' option to purchase additional shares. The offering generated approximately $364.2 million in gross proceeds. The company's common stock began trading on Nasdaq on August 8, 2025.",
      "url": "https://www.globenewswire.com/news-release/2025/08/11/3131308/0/en/Heartflow-Inc-Announces-Closing-of-Upsized-Initial-Public-Offering-and-Full-Exercise-of-the-Underwriters-Option-to-Purchase-Additional-Shares.html",
      "source": "GlobeNewswire",
      "published": "20250811T163000",
      "overall_sentiment_score": 0.424733,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.233389,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.629911
    },
    {
      "title": "AIMD Stock Soars: What’s Fueling the Surge?",
      "summary": "Ainos Inc. (AIMD) stock surged by 79.39% due to promising clinical trial results for its investigational drug VELDONA and advancements in its AI Nose technology, including a collaboration for AI-enhanced robots in Japan. Despite ongoing financial challenges with high operating expenses and an elusive path to profitability, the company has regained compliance with Nasdaq listing rules, which is bolstering investor confidence. The article emphasizes the company's strategic partnerships and innovative technology as key drivers for potential future success in the nascent sensory AI market.",
      "url": "https://stockstotrade.com/news/ainos-inc-aimd-news-2025_08_06/",
      "source": "StocksToTrade",
      "published": "20250806T100600",
      "overall_sentiment_score": 0.325398,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.195778,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.627168
    },
    {
      "title": "Earnings call transcript: ONE Group Hospitality Q2 2025 results miss expectations",
      "summary": "ONE Group Hospitality (STKS) reported Q2 2025 results that missed analyst expectations, with EPS of $0.05 against a forecast of $0.09 and revenue of $207.4 million, slightly below the $207.95 million forecast. The company saw a 20.6% YoY increase in company-owned restaurant net revenues but a widened net loss of $10.1 million. Despite the miss, management remains confident in achieving long-term sales goals and is focused on strategic initiatives, including Benihana integration and new venue development.",
      "url": "https://www.investing.com/news/transcripts/earnings-call-transcript-one-group-hospitality-q2-2025-results-miss-expectations-93CH-4171629",
      "source": "Investing.com",
      "published": "20250805T000919",
      "overall_sentiment_score": -0.072103,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.033469,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.624134
    },
    {
      "title": "White & Case advises initial purchasers on Sabesp’s US$500 million 5.625% Blue Senior Notes offering",
      "summary": "Global law firm White & Case LLP advised the initial purchasers, including Goldman Sachs & Co. LLC, Itau BBA USA Securities, Inc., and J.P. Morgan Securities LLC, on Sabesp's US$500 million 5.625% Blue Senior Notes offering due 2030. The notes, issued by Sabesp Lux S.à r.l. and guaranteed by Brazil's largest sanitation company, Sabesp, will fund eligible blue projects. This marks Sabesp's first international capital markets issuance since December 2010.",
      "url": "https://www.whitecase.com/news/press-release/white-case-advises-initial-purchasers-sabesps-us500-million-5625-blue-senior",
      "source": "White & Case LLP",
      "published": "20250804T045055",
      "overall_sentiment_score": 0.293893,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.287505,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.624104
    },
    {
      "title": "Teradyne Stock Soars: Time to Buy?",
      "summary": "Teradyne Inc. stock (NASDAQ: TER) surged by 16.2% due to strong Q2 earnings driven by its Semiconductor Test group and AI-focused System-on-a-Chip solutions. UBS raised its price target to $120, and Cathie Wood's ARK Investment acquired 179.2K shares, reflecting investor optimism despite a JPMorgan downgrade. The company's robust financials, including a 59.4% gross margin and low debt-to-equity ratio, combined with strategic partnerships like Universal Robots' work with Amazon, position it for continued growth and resilience in the tech sector.",
      "url": "https://stockstotrade.com/news/teradyne-inc-ter-news-2025_07_30/",
      "source": "StocksToTrade",
      "published": "20250730T100300",
      "overall_sentiment_score": 0.318077,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.043668,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.623505
    },
    {
      "title": "Procter & Gamble beats estimates but warns tariffs will start to weigh on earnings",
      "summary": "Procter & Gamble reported quarterly results that beat Wall Street's expectations but issued fiscal 2026 guidance anticipating a $1 billion hit due to higher costs from tariffs. The company expects mid-single-digit price increases on about a quarter of its items due to these tariffs. P&G is also undergoing a restructuring plan that includes cutting 7,000 nonmanufacturing roles over the next two years.",
      "url": "https://www.cnbc.com/2025/07/29/procter-gamble-pg-q4-2025-earnings.html",
      "source": "CNBC",
      "published": "20250729T074100",
      "overall_sentiment_score": -0.148513,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.136516,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.622814
    },
    {
      "title": "ADMA Biologics Announces Second Quarter 2025 Financial Results and Provides Business Update",
      "summary": "ADMA Biologics reported strong second-quarter 2025 financial results, with total revenue of $122.0 million, a 14% year-over-year increase, and significant growth in GAAP Net Income and Adjusted EBITDA. The company initiated commercial-scale manufacturing with a new FDA-approved yield enhancement process, secured a $300 million debt refinancing, and expanded its production operations infrastructure in Boca Raton, Florida. ADMA reaffirmed its financial guidance for FY 2025-2026, anticipating accelerated growth and projecting annual revenue to reach over $1.1 billion prior to 2030.",
      "url": "https://www.globenewswire.com/news-release/2025/08/06/3128654/0/en/ADMA-Biologics-Announces-Second-Quarter-2025-Financial-Results-and-Provides-Business-Update.html",
      "source": "GlobeNewswire",
      "published": "20250806T160500",
      "overall_sentiment_score": 0.576096,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.3149,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.622383
    },
    {
      "title": "Southwest Gas Holdings Announces Closing of Secondary Public Offering of Centuri Holdings, Inc. Common Stock",
      "summary": "Southwest Gas Holdings, Inc. announced the closing of its secondary public offering, selling 17,250,000 shares of Centuri Holdings, Inc. common stock at $19.50 per share, raising approximately $325 million. Additionally, Icahn Partners acquired 1,573,500 shares in a concurrent private placement, contributing about $31 million. Following these transactions, Southwest Gas Holdings now owns approximately 30.9% of Centuri and will deconsolidate Centuri from its financial statements, accounting for its remaining interest using the equity method.",
      "url": "https://www.quantisnow.com/insight/southwest-gas-holdings-announces-closing-of-secondary-public-offering-of-6158244",
      "source": "Quantisnow",
      "published": "20250811T160500",
      "overall_sentiment_score": 0.208286,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.12027,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.621103
    },
    {
      "title": "Live Oak Bancshares, Inc. Closes Depositary Share Offering",
      "summary": "Live Oak Bancshares, Inc. announced the closing of its underwritten offering of 4,000,000 depositary shares, each representing a 1/40th interest in its 8.375% Fixed Rate Series A Non-Cumulative Perpetual Preferred Stock. The company received approximately $96,150,000 net proceeds from the offering. Morgan Stanley & Co. LLC, RBC Capital Markets, LLC, UBS Investment Bank, and Keefe, Bruyette & Woods served as joint bookrunning managers.",
      "url": "https://www.globenewswire.com/news-release/2025/08/04/3126890/36594/en/Live-Oak-Bancshares-Inc-Closes-Depositary-Share-Offering.html",
      "source": "GlobeNewswire",
      "published": "20250804T161500",
      "overall_sentiment_score": 0.341783,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.306221,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.621045
    },
    {
      "title": "Fund Update: PINNACLE ASSOCIATES LTD added 50,386 shares of KKR & CO. ($KKR) to their portfolio",
      "summary": "PINNACLE ASSOCIATES LTD increased its holdings of KKR & CO. by 50,386 shares, as per a recent SEC 13F filing. The article also details significant hedge fund activity, insider trading, government contracts, Congressional stock trading, and analyst ratings for KKR. Overall, the sentiment from analysts is positive with multiple buy and outperform ratings.",
      "url": "https://www.quiverquant.com/news/Fund+Update%3A+PINNACLE+ASSOCIATES+LTD+added+50%2C386+shares+of+KKR+%26+CO.+%28%24KKR%29+to+their+portfolio",
      "source": "Quiver Quantitative",
      "published": "20250804T181300",
      "overall_sentiment_score": 0.105789,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.128795,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.619614
    },
    {
      "title": "Super Micro Computer stock falls as much as 16% after quarterly results, profit forecast miss estimates",
      "summary": "Super Micro Computer (SMCI) stock dropped over 16% after its fiscal fourth-quarter results and profit forecast missed Wall Street expectations. The company reported adjusted EPS of $0.41 and revenue of $5.76 billion, both below analyst estimates, attributing the shortfall to capital constraints and supply chain issues with Nvidia. Despite the recent dip, shares were still up over 50% year-to-date as investors continue to flock to AI-themed stocks.",
      "url": "https://finance.yahoo.com/news/super-micro-computer-stock-falls-as-much-as-16-after-quarterly-results-profit-forecast-miss-estimates-133551819.html",
      "source": "Yahoo Finance",
      "published": "20250806T000000",
      "overall_sentiment_score": -0.300481,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.118144,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.614768
    },
    {
      "title": "The RMR Group Announces $1.0 Billion Refinancing of Vertex Pharmaceuticals’ Headquarters in Boston Seaport District",
      "summary": "The RMR Group announced a $1.0 billion refinancing for Vertex Pharmaceuticals' headquarters in Boston's Seaport District. This five-year, interest-only fixed-rate mortgage financing has a weighted-average interest rate of 5.5957% and will primarily repay an existing $620 million mortgage, fund leasing reserves, and repatriate cash. The lease with Vertex has been extended for approximately 15 years, now expiring in June 2044.",
      "url": "https://www.businesswire.com/news/home/20250807469984/en/The-RMR-Group-Announces-%241.0-Billion-Refinancing-of-Vertex-Pharmaceuticals-Headquarters-in-Boston-Seaport-District",
      "source": "Business Wire",
      "published": "20250807T000000",
      "overall_sentiment_score": 0.257544,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.205673,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.614448
    },
    {
      "title": "Fund Update: CINCINNATI INSURANCE CO added 57,500 shares of MICROCHIP TECHNOLOGY ($MCHP) to their portfolio | MCHP Stock News",
      "summary": "CINCINNATI INSURANCE CO has increased its holdings in MICROCHIP TECHNOLOGY ($MCHP) by adding 57,500 shares, as disclosed in a recent SEC 13F filing for the 06-30-2025 reporting period. The article also details significant hedge fund activity, insider trading, government contracts, congressional stock trading, and analyst ratings for MCHP. Various analysts have issued \"Buy\" or \"Positive\" ratings, with a median price target of $82.5.",
      "url": "https://www.quiverquant.com/news/Fund+Update%3A+CINCINNATI+INSURANCE+CO+added+57%2C500+shares+of+MICROCHIP+TECHNOLOGY+%28%24MCHP%29+to+their+portfolio",
      "source": "Quiver Quantitative",
      "published": "20250807T141300",
      "overall_sentiment_score": 0.125197,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.260053,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.612067
    },
    {
      "title": "Crypto exchange Bullish raises IPO size, seeks nearly $5 billion valuation",
      "summary": "Peter Thiel-backed cryptocurrency exchange Bullish has increased the size of its initial public offering, now aiming to raise $990 million at a valuation of $4.8 billion. The company, which also owns CoinDesk, plans to offer 30 million shares priced between $32 and $33. This move highlights a trend of crypto firms entering public markets, with BlackRock and Cathie Wood's ARK Investment Management already indicating interest in purchasing shares.",
      "url": "https://www.cnbc.com/2025/08/11/crypto-exchange-bullish-raises-ipo-size-seeks-nearly-5-billion-valuation.html",
      "source": "CNBC",
      "published": "20250811T130100",
      "overall_sentiment_score": 0.33254,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.244614,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.609086
    },
    {
      "title": "DGRO ETF Surges as Dividend Growth Leaders Outperform Amid Market Volatility",
      "summary": "The iShares Core Dividend Growth ETF (DGRO) has seen record inflows, bringing its assets under management to $32.5 billion and pushing its value to a new record of $46.82. Its year-to-date return of 10.8% has surpassed the S&P 500 and the MSCI World High Dividend Yield Index, driven by strategic allocations to financials and technology. DGRO's focus on companies with consistent dividend increases and a low expense ratio makes it an appealing option for investors seeking resilient income and capital appreciation.",
      "url": "https://www.tradingnews.com/news/dividend-growth-etf-grdo-drwas-record-inflows",
      "source": "TradingNews",
      "published": "20250806T214130",
      "overall_sentiment_score": 0.354813,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.323294,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.609
    },
    {
      "title": "Alexander's, Inc. Declares Quarterly Dividend of $4.50 Per Share | ALX Stock News",
      "summary": "Alexander's, Inc. declared a quarterly dividend of $4.50 per share, payable on August 29, 2025, to shareholders of record by August 11, 2025. The company, a REIT with five properties in New York City, also included cautionary notes regarding forward-looking statements and risks such as interest rate fluctuations and inflation. The announcement was accompanied by data on recent hedge fund activity in ALX stock.",
      "url": "https://www.quiverquant.com/news/Alexander%27s%2C+Inc.+Declares+Quarterly+Dividend+of+%244.50+Per+Share",
      "source": "Quiver Quantitative",
      "published": "20250730T174000",
      "overall_sentiment_score": -0.112115,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.441605,
      "ticker_sentiment_label": "Bearish",
      "relevance_score": 0.608892
    },
    {
      "title": "AMBIPAR Partners with Ajman Bank to boost Sustainable Finance Journey",
      "summary": "Ambipar, a global leader in environmental and carbon solutions, has formed a long-term strategic partnership with Ajman Bank, a prominent UAE financial institution. This collaboration aims to bolster Ajman Bank's net-zero and sustainable finance strategy by integrating environmental services, carbon solutions, and innovative financial products. The partnership will focus on co-creating a robust net-zero strategy, developing green banking solutions, improving environmental operations across bank branches, and empowering corporate clients with sustainability expertise.",
      "url": "https://intlbm.com/2025/08/08/ambipar-partners-with-ajman-bank-to-boost-sustainable-finance-journey/",
      "source": "intlbm",
      "published": "20250808T051016",
      "overall_sentiment_score": 0.670708,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.622961,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.605962
    },
    {
      "title": "Oxy combines big revenues with decisive debt reduction",
      "summary": "Occidental Petroleum Corp. announced strong second-quarter results with $2.6 billion in operating cash flow and a significant $7.5 billion debt reduction within 13 months of acquiring CrownRock Corp. The company also highlighted exceeding production guidance, achieving higher cash flow despite lower oil prices, and making progress on its Stratos direct air capture plant, with trains one and two transitioning to operations.",
      "url": "https://www.oaoa.com/local-news/oxy-combines-big-revenues-with-decisive-debt-reduction/",
      "source": "Odessa American",
      "published": "20250808T000000",
      "overall_sentiment_score": 0.264453,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.249999,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.604739
    },
    {
      "title": "KKR & Co. Inc. (NYSE:KKR) Q2 2025 Earnings Call Transcript",
      "summary": "KKR & Co. Inc. reported strong Q2 2025 earnings, exceeding expectations with an EPS of $1.18. The company highlighted significant growth in fee-related earnings, robust deployment and monetization activities across its global platform, and strong capital raising momentum, particularly in asset-based finance and private wealth. KKR also discussed strategic initiatives, including the acquisition of HealthCare Royalty Partners and an expanded partnership with Energy Capital Partners, reinforcing confidence in achieving its 2026 financial targets.",
      "url": "https://www.insidermonkey.com/blog/kkr-co-inc-nysekkr-q2-2025-earnings-call-transcript-1581944/",
      "source": "Insider Monkey",
      "published": "20250801T082900",
      "overall_sentiment_score": 0.321184,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.175192,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.603064
    },
    {
      "title": "Teradyne Stock Soars: Time to Buy?",
      "summary": "Teradyne Inc. (NASDAQ: TER) experienced an 18.35% stock surge following robust Q2 2025 earnings which surpassed guidance, driven primarily by its Semiconductor Test segment for AI applications. Analyst UBS raised its price target to $120, and ARK Investment acquired a significant stake, further boosting investor confidence. A new deal with Amazon for Universal Robots is also set to generate approximately $400 million, positioning Teradyne strongly in the automation sector.",
      "url": "https://stockstotrade.com/news/teradyne-inc-ter-news-2025_07_30-3/",
      "source": "StocksToTrade",
      "published": "20250801T140400",
      "overall_sentiment_score": 0.462087,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.33716,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.594584
    },
    {
      "title": "Is Cronos Group’s Stock Set to Surge?",
      "summary": "Cronos Group's stock is up 13.1% amid positive market sentiment and strong Q2 performance, with revenues exceeding expectations. The company maintains a robust cash reserve and has strategically invested in High Tide, though it faces operational challenges such as negative EBIT margins. Potential reclassification of marijuana in the U.S. could further boost its market position.",
      "url": "https://stockstotrade.com/news/cronos-group-inc-cron-news-2025_08_11/",
      "source": "StocksToTrade",
      "published": "20250811T140900",
      "overall_sentiment_score": 0.361593,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.24592,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.593997
    },
    {
      "title": "NANO Nuclear Energy Inc. Selected for Solactive Global Uranium & Nuclear Components Total Return Index, Enabling Inclusion in Global X Uranium ETF",
      "summary": "NANO Nuclear Energy Inc. has been chosen for the Solactive Global Uranium & Nuclear Components Total Return Index, effective August 1, 2025. This inclusion allows the company's stock to be eligible for the Global X Uranium ETF, which boasts over $4 billion in net assets. The move is expected to boost NANO Nuclear's visibility and attract more investors interested in the growing nuclear energy sector.",
      "url": "https://www.quiverquant.com/news/NANO+Nuclear+Energy+Inc.+Selected+for+Solactive+Global+Uranium+%26+Nuclear+Components+Total+Return+Index%2C+Enabling+Inclusion+in+Global+X+Uranium+ETF",
      "source": "Quiver Quantitative",
      "published": "20250801T111000",
      "overall_sentiment_score": 0.356137,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.258976,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.591022
    },
    {
      "title": "$ROOT stock is down 19% today. Here's what we see in our data.",
      "summary": "Root Inc. (ROOT) stock has fallen 19% today, with approximately $125.8 million in trading volume. Insider trading data shows 26 sales and zero purchases by insiders over the past six months, including significant sales by Meyer Malka and CEO Alexander E. Timm. Conversely, hedge funds show mixed activity with 108 institutional investors adding shares and 69 decreasing positions, led by major additions from CAPITAL RESEARCH GLOBAL INVESTORS and T. ROWE PRICE INVESTMENT MANAGEMENT.",
      "url": "https://www.quiverquant.com/news/%24ROOT+stock+is+down+19%25+today.+Here%27s+what+we+see+in+our+data.",
      "source": "Quiver Quantitative",
      "published": "20250807T144700",
      "overall_sentiment_score": -0.066708,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.20793,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.582101
    },
    {
      "title": "Earnings call transcript: Masco Q2 2025 beats earnings forecast, stock surges",
      "summary": "Masco Corporation (MAS) significantly surpassed analyst expectations in Q2 2025, reporting an EPS of $1.30 against a forecast of $1.08, and revenue of $2.05 billion, exceeding the $2 billion projection. This strong performance, driven by improved operating profit and margins despite a slight decline in net sales, led to an 8.09% surge in Masco’s stock in pre-market trading. The company reinstated its full-year EPS guidance between $3.90 and $4.10, anticipating flat sales growth excluding divestitures and currency impacts, and remains focused on offsetting tariff impacts through cost reductions and sourcing adjustments.",
      "url": "https://www.investing.com/news/transcripts/earnings-call-transcript-masco-q2-2025-beats-earnings-forecast-stock-surges-93CH-4163634",
      "source": "Investing.com",
      "published": "20250731T020849",
      "overall_sentiment_score": 0.265778,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.060137,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.581844
    },
    {
      "title": "Florida’s BayFirst sheds 51 jobs, shutters SBA loan platform",
      "summary": "St. Petersburg, Florida-based BayFirst National Bank has eliminated 51 jobs and discontinued its Small Business Administration 7(a) loan program, Bolt, to save $6 million annually. The bank anticipates a restructuring charge in the third quarter related to this decision and has suspended dividend payments while directors forgo board fees to offset the charge. BayFirst also aims to sell its Bolt balances and loan origination program, following two consecutive quarters of losses totaling $1.5 million.",
      "url": "https://www.bankingdive.com/news/bayfirst-ends-bolt-sba-loan-program-cuts-51-jobs-restructuring-charge/756958/",
      "source": "Banking Dive",
      "published": "20250806T011106",
      "overall_sentiment_score": -0.167116,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.130633,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.576051
    },
    {
      "title": "Unexpected Surge in Arista Networks: Analyzing Latest Gains",
      "summary": "Arista Networks Inc. (ANET) experienced a significant 17.79% stock surge following positive investor sentiment and strong market performance. The company surpassed Q2 expectations with revenue of $2.205B and an EPS of 73 cents, driven by AI networking and cloud infrastructure growth. Morgan Stanley raised its price target for Arista to $120, maintaining an \"Overweight\" rating, underscoring confidence in the company's strategic position and innovation.",
      "url": "https://stockstotrade.com/news/arista-networks-inc-anet-news-2025_08_06-2/",
      "source": "StocksToTrade",
      "published": "20250806T160300",
      "overall_sentiment_score": 0.459287,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.119851,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.570927
    },
    {
      "title": "Cornerstone Strategic Investment Fund and Cornerstone Total Return Fund Announce Monthly Distributions and Maintain 2026 Distribution Percentage at 21%",
      "summary": "Cornerstone Strategic Investment Fund (CLM) and Cornerstone Total Return Fund (CRF) have announced their monthly distributions for October, November, and December 2025, maintaining their established distribution policy. Each fund will pay approximately $0.12 per share monthly for CLM and $0.11 per share for CRF. For 2026, the distribution percentage will remain at 21% of the net asset value as of the end of October 2025, though the exact monthly amounts will be finalized then.",
      "url": "https://www.quiverquant.com/news/Cornerstone+Strategic+Investment+Fund+and+Cornerstone+Total+Return+Fund+Announce+Monthly+Distributions+and+Maintain+2026+Distribution+Percentage+at+21%25",
      "source": "Quiver Quantitative",
      "published": "20250804T132100",
      "overall_sentiment_score": -0.02597,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.092906,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.567471
    },
    {
      "title": "Fundamental Global Inc. Announces Rebrand to FG Nexus Inc., Launches Ethereum Treasury Strategy Led by Maja Vujinovic and Joe Moglia as Executive Advisor",
      "summary": "Fundamental Global Inc. is rebranding to FG Nexus Inc. and launching a new Ethereum treasury strategy, aiming to raise $200 million through a private placement of prefunded common stock warrants. This initiative, supported by strategic investors like Galaxy Digital and Kraken, will focus on leveraging Ethereum for digital finance. Maja Vujinovic, a blockchain pioneer, will lead the digital asset business, with former TD Ameritrade CEO Joe Moglia serving as Executive Advisor.",
      "url": "https://www.quiverquant.com/news/Fundamental+Global+Inc.+Announces+Rebrand+to+FG+Nexus+Inc.,+Launches+Ethereum+Treasury+Strategy+Led+by+Maja+Vujinovic+and+Joe+Moglia+as+Executive+Advisor",
      "source": "Quiver Quantitative",
      "published": "20250730T081000",
      "overall_sentiment_score": 0.115804,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.137464,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.560389
    },
    {
      "title": "Eaton Vance Launches Mortgage-Backed Securities ETF",
      "summary": "Eaton Vance has expanded its active fixed-income offerings by launching the Mortgage Opportunities ETF (EVMO) on NYSE Arca. This actively managed fund, converted from the existing Morgan Stanley Mortgage Securities Trust (MTGDX) mutual fund, provides diversified exposure to global securitized markets, including agency and non-agency MBS, commercial MBS, and other asset-backed securities. EVMO aims to serve as an attractive investment-grade alternative to corporate credit or as a standalone component in a broader portfolio, with risk diversification benefits.",
      "url": "https://etfdb.com/news/2025/08/04/eaton-vance-launches-mortgage-backed-evmo/",
      "source": "ETF Database",
      "published": "20250804T001244",
      "overall_sentiment_score": 0.260912,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.0541,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.556698
    },
    {
      "title": "Kennedy-Wilson (KW) Q2 2025 Earnings Transcript",
      "summary": "Kennedy-Wilson (KW) reported solid Q2 2025 results, exceeding business plans with $1.7 billion in new capital deployed, bringing the year-to-date total to $2.6 billion. The company made significant progress on debt reduction, repurchasing shares, and expanding its rental housing portfolio, aiming for 80% AUM in this sector within two years. Asset sales generated $250 million in cash, exceeding targets, with proceeds earmarked for further debt reduction and reinvestment.",
      "url": "https://www.fool.com/earnings/call-transcripts/2025/08/07/kennedy-wilson-kw-q2-2025-earnings-transcript/",
      "source": "The Motley Fool",
      "published": "20250807T125000",
      "overall_sentiment_score": 0.206735,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.166689,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.553946
    },
    {
      "title": "HASI’s Upside And Risks In Green Infrastructure Investing",
      "summary": "Hannon Armstrong Sustainable Infrastructure Capital (HASI) specializes in financing green infrastructure projects, aiming to benefit from the growing sustainable finance market despite short-term challenges. While its stock performance has lagged due to high interest rates and political headwinds, its strategic partnership with KKR and attractive forward P/E ratio offer potential upside. Investors should, however, be mindful of risks like interest rate sensitivity, current negative operating margins, and high valuation metrics.",
      "url": "https://finimize.com/content/hasi-asset-snapshot",
      "source": "Finimize",
      "published": "20250804T042614",
      "overall_sentiment_score": 0.135647,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.182651,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.551327
    }
  ]
}