{
  "ticker": "JPM",
  "date": "2025-09-22",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T13:01:15.551263",
  "source": "alpha_vantage",
  "article_count": 50,
  "articles": [
    {
      "title": "Mavrek, ACRES Commercial Realty close financing for Chicago’s 65 E. Wacker Place",
      "summary": "Mavrek and ACRES Commercial Realty Corp. have successfully closed financing for the Wacker Place project at 65 E. Wacker Place in Chicago. This financing, which includes a $62.4 million senior loan and an $11 million loan from Hoyne Savings Bank, along with over $17 million in historic tax credits, will fund the redevelopment of the historic building into a 252-unit luxury apartment complex with modern amenities. The project is now poised to begin interior construction and aims to become a premier luxury residential building in downtown Chicago.",
      "url": "https://rejournals.com/mavrek-acres-commercial-realty-close-financing-for-chicagos-65-e-wacker-place/",
      "source": "REJournals",
      "published": "20250922T190929",
      "overall_sentiment_score": 0.37695,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.323852,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.630811
    },
    {
      "title": "First Financial Trust Names R. Mark Davidovich EVP To Lead Fort Worth Market",
      "summary": "First Financial Trust has appointed R. Mark Davidovich as Executive Vice President and leader of its Fort Worth Market. Davidovich brings extensive experience in wealth management, real estate, and public affairs, having previously served at VetMor, True North Advisors, J.P. Morgan Private Bank, and Goldman Sachs. First Financial Trust aims to leverage his deep roots and strategic insight to grow its presence in the Fort Worth market.",
      "url": "https://fortworthinc.com/news/first-financial-trust-names-r-mark-davidovich-evp-to-lead-fo/",
      "source": "Fort Worth Inc.",
      "published": "20250922T123900",
      "overall_sentiment_score": 0.214384,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.145877,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.617337
    },
    {
      "title": "Affirm Holdings grants equity awards to executive officers",
      "summary": "Affirm Holdings announced that its Compensation Committee approved annual equity awards for certain executive officers, including Rob O’Hare, Katherine Adkins, Michael Linford, and Libor Michalek. These awards, granted on September 18, comprise both restricted stock units (RSUs) and performance stock units (PSUs) that vest into shares of Affirm’s Class A common stock. The PSUs are tied to time-based, service-based, and company financial performance conditions over a three-year period beginning July 1, 2025.",
      "url": "https://www.investing.com/news/sec-filings/affirm-holdings-grants-equity-awards-to-executive-officers-93CH-4250072",
      "source": "Investing.com",
      "published": "20250922T045000",
      "overall_sentiment_score": 0.248927,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.101901,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.564198
    },
    {
      "title": "AgriFORCE Growing Systems to Launch as First Publicly-Traded Avalanche-Focused Company on NASDAQ with a $550 Million Capital Raise Strategy",
      "summary": "AgriFORCE Growing Systems Ltd. (Nasdaq: AGRI) announced it will be renamed AVAX One and plans to raise approximately $550 million to become the first NASDAQ-listed company focused on maximizing ownership of AVAX, the native token of the Avalanche network. The company aims to provide public market investors with direct exposure to the Avalanche ecosystem, which is designed as a foundational digital settlement layer for finance and a platform for tokenizing real-world assets. The capital raise strategy includes a $300 million PIPE and future capital raising activities, with a goal to own over $700 million worth of AVAX tokens, positioning AVAX One as a significant player in the onchain financial economy.",
      "url": "https://investingnews.com/agriforce-growing-systems-to-launch-as-first-publicly-traded-avalanche-focused-company-on-nasdaq-with-a-550-million-capital-raise-strategy/",
      "source": "Investing News Network",
      "published": "20250922T000000",
      "overall_sentiment_score": 0.336699,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.31855,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.635459
    },
    {
      "title": "Can Analyst Endorsements of Concentra Group Holdings Parent (CON) Reveal a Deeper Edge in Outpatient Care?",
      "summary": "JPMorgan and Truist Securities have issued positive endorsements for Concentra Group Holdings Parent Inc (CON), citing its growth outlook, strong market position, and flexible cost structure. While these endorsements boost confidence, the company's key short-term growth driver remains the expansion of clinic locations, with sluggish organic volume growth identified as a primary risk. Concentra is projected to reach $2.6 billion in revenue and $249.0 million in earnings by 2028, with a fair value estimate significantly higher than its current price.",
      "url": "https://simplywall.st/stocks/us/healthcare/nyse-con/concentra-group-holdings-parent/news/can-analyst-endorsements-of-concentra-group-holdings-parent",
      "source": "Simply Wall Street",
      "published": "20250921T000000",
      "overall_sentiment_score": 0.449533,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.329734,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.614417
    },
    {
      "title": "Exclusive | Jefferies Deepens Ties With Japan’s Sumitomo Mitsui",
      "summary": "Jefferies Financial Group and Japan’s Sumitomo Mitsui Financial Group are strengthening their alliance to attract more global companies and private-equity firms. SMBC, Sumitomo Mitsui's commercial banking subsidiary, intends to increase its equity stake in Jefferies from approximately 15% to up to 20% through open market purchases. This expanded partnership aims to enhance their services in mergers and acquisitions, borrowing, and investment.",
      "url": "https://www.wsj.com/business/deals/jefferies-deepens-ties-with-japans-sumitomo-mitsui-5fe342f2?gaa_at=eafs&gaa_n=AWEtsqdot7M-PsEvLzZf0poQoUCjKYJl4kfYtmXKOFZYvS-7DK1phAM9k-32&gaa_ts=693b3623&gaa_sig=ldtxv3z7qecWS6kCbUqwmpFNO4GRZE58EWUyrZBAvsagNB6lJDiK4Rw6SJd3snNHKtuLjyQgHIieVW9q2hBs4g%3D%3D",
      "source": "The Wall Street Journal",
      "published": "20250919T210957",
      "overall_sentiment_score": 0.10701,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.120844,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.638804
    },
    {
      "title": "Rex-Osprey hybrid spot XRP ETF makes 2025 record-breaking debut",
      "summary": "The Rex-Osprey XRP exchange-traded fund (ETF) has made a record-breaking debut in 2025, becoming the strongest US ETF launch of the year. This hybrid spot XRP ETF, along with a Dogecoin ETF (DOJE), saw significant trading volumes on its opening day, reflecting growing investor interest in regulated digital asset investment vehicles. Despite strong ETF performance, the prices of XRP and Dogecoin themselves saw declines following the debut.",
      "url": "https://cryptoslate.com/rex-osprey-hybrid-spot-xrp-etf-makes-2025-record-breaking-debut/",
      "source": "CryptoSlate",
      "published": "20250919T124500",
      "overall_sentiment_score": 0.145401,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.147274,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.305124
    },
    {
      "title": "$300M Tech IPO: AI-Powered Ecommerce Platform Pattern Launches Major Nasdaq Public Offering at $14/Share",
      "summary": "Pattern Group Inc., an AI-powered e-commerce acceleration platform, has priced its initial public offering at $14.00 per share, aiming to raise $300 million. The company will offer 10,714,286 shares, with an additional 10,714,286 shares sold by existing stockholders, and expects to begin trading on the Nasdaq Global Select Market under the ticker \"PTRN\" on September 19, 2025. Goldman Sachs & Co. LLC and J.P. Morgan are leading the offering.",
      "url": "https://www.stocktitan.net/news/PTRN/pattern-announces-pricing-of-initial-public-ptx2z0nbbhtk.html",
      "source": "Stock Titan",
      "published": "20250918T201000",
      "overall_sentiment_score": 0.296926,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.300731,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.611022
    },
    {
      "title": "Synopsys Stock Tumbles: Cut Losses or Hang Tight?",
      "summary": "Synopsys Inc. stock is trending up by 12.9% despite mixed Q3 2025 earnings which saw revenue growth but a decline in GAAP EPS and negative free cash flow. The article discusses market reactions including Cathie Wood's ARK Investment buying shares, analyst rating adjustments, and strategic partnerships aiming for long-term benefits in custom silicon and AI technology. Investors are urged to consider the company's strategic ventures and market dynamics before making decisions amidst its current volatility.",
      "url": "https://stockstotrade.com/news/synopsys-inc-snps-news-2025_09_18-3/",
      "source": "StocksToTrade",
      "published": "20250918T160400",
      "overall_sentiment_score": 0.035226,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.130281,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.617995
    },
    {
      "title": "SEC paves way for speedier crypto ETF listings as XRP and dogecoin ETFs launch",
      "summary": "The SEC has approved generic listing standards for crypto ETFs, streamlining the process for new listings. This decision has led to the launch of the first spot XRP and dogecoin ETFs by Rex-Osprey, along with an approval for Grayscale's multi-asset Digital Large Cap Fund. These developments are seen as a significant step towards making crypto more accessible to investors and integrating it into mainstream finance.",
      "url": "https://sherwood.news/crypto/sec-paves-way-for-speedier-crypto-etf-listings-as-xrp-and-dogecoin-etfs/",
      "source": "Sherwood News",
      "published": "20250918T100700",
      "overall_sentiment_score": 0.189885,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.24643,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.637343
    },
    {
      "title": "First U.S. Spot ETFs for XRP & DOGE Launch Tomorrow, Tap Into $167B Altcoin Surge",
      "summary": "REX-Osprey™ is set to launch the first U.S.-listed spot ETFs for XRP ($XRPR) and DOGE ($DOJE) on September 18, 2025, providing mainstream investors with regulated access to these major altcoins. This development follows a significant surge in XRP's market value, which reached $167 billion by August 2025, and marks a crucial step towards broader cryptocurrency acceptance in traditional finance despite continued market volatility and regulatory risks. The ETFs will track the price movements of XRP and DOGE through a hybrid investment model, sourcing assets from large crypto exchanges and potentially utilizing offshore subsidiaries for tax compliance.",
      "url": "https://www.cryptoninjas.net/news/first-u-s-spot-etfs-for-xrp-doge-launch-tomorrow-tap-into-167b-altcoin-surge/",
      "source": "CryptoNinjas",
      "published": "20250918T000000",
      "overall_sentiment_score": 0.181213,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.105458,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.306159
    },
    {
      "title": "Zillow Group stock hits 52-week high at 92.08 USD By Investing.com",
      "summary": "Zillow Group Inc Class C stock reached a new 52-week high of $92.08 USD, backed by a strong market capitalization of $21.26 billion and robust liquidity. The company's stock delivered an impressive 41% return over the past year, with 15.3% revenue growth, reflecting investor confidence. JPMorgan recently raised its price target for Zillow to $94.00, maintaining an Overweight rating, despite a slight EPS miss in Q2 2025, due to strong revenue and a solid Q3 outlook.",
      "url": "https://ng.investing.com/news/company-news/zillow-group-stock-hits-52week-high-at-9208-usd-93CH-2107761",
      "source": "Investing.com Nigeria",
      "published": "20250917T210927",
      "overall_sentiment_score": 0.378624,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.217469,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.620557
    },
    {
      "title": "First Fed hires new executive",
      "summary": "First Fed has appointed Curt Queyrouze as its new president and chief executive officer, effective September 17. He replaces interim CEO Geri Bullard, and his compensation package includes a $550,000 annual base salary, a $100,000 signing bonus, and 50,000 shares of restricted stock. This appointment follows a U.S. Bankruptcy Court ruling against Water Station Management, a company First Fed did business with, for operating a Ponzi scheme, though First Fed is protected in this specific case.",
      "url": "https://www.peninsuladailynews.com/news/first-fed-hires-new-executive/",
      "source": "Peninsula Daily News",
      "published": "20250916T092900",
      "overall_sentiment_score": 0.04575,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.107497,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.627295
    },
    {
      "title": "HOLD - Will nine tenths there ... - INTERVIEW: The rags-to-riches rise of Freedom Holding Corp's Timur Turlov",
      "summary": "This article chronicles the rags-to-riches story of Timur Turlov, the founder of Freedom Holding Corp (FRHC) and now the richest man in Kazakhstan. It details his journey from a challenging childhood in post-Soviet Moscow to building FRHC into a Nasdaq-listed financial services behemoth, emphasizing his ethical approach to wealth creation in contrast to earlier oligarchs. The piece also covers FRHC's strategic shift to Kazakhstan, its expansion into a superapp-based ecosystem across Central Asia, and its impressive financial performance, despite facing scrutiny related to its FSU origins.",
      "url": "https://www.intellinews.com/interview-the-rags-to-riches-rise-of-freedom-holding-corp-s-timur-turlov-398038/",
      "source": "IntelliNews",
      "published": "20250915T165944",
      "overall_sentiment_score": 0.375074,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.312277,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.563297
    },
    {
      "title": "Avidity Biosciences, Inc. Announces Closing of Upsized Public Offering of Common Stock, Including Full Exercise of Underwriters' Option to Purchase Additional Shares",
      "summary": "Avidity Biosciences, Inc. has announced the closing of its upsized public offering of 17,250,000 shares of common stock at $40.00 per share, generating gross proceeds of $690.0 million. This includes the full exercise of the underwriters' option to purchase additional shares. The company plans to use these net proceeds to advance its late-stage clinical programs, build commercial inventory, expand infrastructure, progress R&D for its AOC platform, and for general corporate purposes.",
      "url": "https://www.prnewswire.com/news-releases/avidity-biosciences-inc-announces-closing-of-upsized-public-offering-of-common-stock-including-full-exercise-of-underwriters-option-to-purchase-additional-shares-302556671.html",
      "source": "PR Newswire",
      "published": "20250915T160100",
      "overall_sentiment_score": 0.220725,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.11573,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.637852
    },
    {
      "title": "JPMorgan initiates Ermenegildo Zegna stock with Overweight rating, $11 target",
      "summary": "JPMorgan has initiated coverage on Ermenegildo Zegna Group (NYSE:ZGN) with an Overweight rating and an $11 price target, citing several competitive advantages. These include a focus on high-net-worth individuals, strong gross profit margins, and tight supply chain control. The company is expected to see accelerated profitable growth starting in the second half of 2025, with an anticipated 18% compound annual growth rate for group operating profit between 2025 and 2028.",
      "url": "https://www.investing.com/news/analyst-ratings/jpmorgan-initiates-ermenegildo-zegna-stock-with-overweight-rating-11-target-93CH-4237954",
      "source": "Investing.com",
      "published": "20250915T025600",
      "overall_sentiment_score": 0.387682,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.259644,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.615835
    },
    {
      "title": "REX-Osprey XRP ETF Launch: Paving the Way for Crypto Investment Paradigm Shift",
      "summary": "The REX-Osprey XRP ETF, set to launch on September 18, 2025, is the first spot ETF for XRP in the U.S., opening new avenues for institutional and retail investors but also carrying risks of increased volatility. This ETF could redefine U.S. cryptocurrency regulations and foster new fintech solutions by bridging traditional finance with blockchain technology. While offering significant opportunities for crypto adoption and market integration, it faces challenges from regulatory scrutiny and the inherent volatility of crypto assets, demanding careful navigation from investors.",
      "url": "https://www.onesafe.io/blog/rex-osprey-xrp-etf-launch-impact",
      "source": "OneSafe",
      "published": "20250914T000000",
      "overall_sentiment_score": 0.274498,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.297901,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.341241
    },
    {
      "title": "LiveOne Expands Digital Asset Strategy with Increased Bitcoin Holdings and Additional PodcastOne Shares",
      "summary": "LiveOne has significantly increased its Bitcoin holdings to over $5 million as part of a $500 million treasury yield strategy aimed at diversification and long-term growth. The company also acquired an additional 347,000 shares of PodcastOne, bringing its total to approximately 2.1 million shares. LiveOne is further expanding its Web3 strategy by tokenizing and monetizing over 10,000 hours of video content on the blockchain.",
      "url": "https://www.quiverquant.com/news/LiveOne+Expands+Digital+Asset+Strategy+with+Increased+Bitcoin+Holdings+and+Additional+PodcastOne+Shares",
      "source": "Quiver Quantitative",
      "published": "20250912T151000",
      "overall_sentiment_score": 0.057518,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.207414,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.645687
    },
    {
      "title": "Dianthus Therapeutics Raises $288M in Upsized Public Offering | DNTH Stock News",
      "summary": "Dianthus Therapeutics successfully closed an upsized public offering, raising approximately $288 million in gross proceeds through the sale of common stock and pre-funded warrants. The underwriters fully exercised their option for additional shares, indicating strong market demand. The capital infusion will fund Dianthus's preclinical and clinical development activities, working capital, and general corporate purposes, particularly advancing antibody complement therapeutics for severe autoimmune diseases.",
      "url": "https://www.stocktitan.net/news/DNTH/dianthus-therapeutics-inc-announces-closing-of-its-upsized-288-ia1ekw7s4orp.html",
      "source": "Stock Titan",
      "published": "20250911T160700",
      "overall_sentiment_score": 0.166188,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.122236,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.64645
    },
    {
      "title": "TPG to acquire GE Vernova’s Proficy® Software business",
      "summary": "GE Vernova (NYSE: GEV) has announced a binding agreement with TPG for the sale of its Proficy® manufacturing software business for $600 million, with potential for additional proceeds. This transaction will establish Proficy as an independent industrial technology solutions provider, allowing GE Vernova to reinvest in core businesses focused on electrifying and decarbonizing the energy ecosystem. TPG, leveraging its experience in software carveouts, aims to accelerate Proficy's growth and support its customers' digital transformations.",
      "url": "https://www.gevernova.com/news/press-releases/tpg-to-acquire-ge-vernovas-proficy-manufacturing-software-business",
      "source": "GE Vernova",
      "published": "20250911T040909",
      "overall_sentiment_score": 0.289906,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.228691,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.600769
    },
    {
      "title": "Angel Studios to Begin Trading Today as ANGX",
      "summary": "Angel Studios, a media and technology company, has completed its D-SPAC merger with Southport and will begin trading today on the NYSE under the ticker ANGX. The company successfully maxed out JOBS Act crowdfunding at $75 million and secured a $100 million credit line, leveraging its 1.5 million \"Guild\" members for content approval and demand forecasting. This unique model of democratic content curation and community-backed financing aims to reshape how media is financed and produced.",
      "url": "https://www.techbuzznews.com/angel-studios-to-begin-trading-as-angx/",
      "source": "TechBuzz News",
      "published": "20250911T000000",
      "overall_sentiment_score": 0.300897,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.142029,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.622301
    },
    {
      "title": "Waystar Announces Launch of Secondary Offering of Common Stock",
      "summary": "Waystar Holding Corp. announced that its selling stockholders, including investment funds of EQT AB and Bain Capital, LP, and Canada Pension Plan Investment Board, intend to offer 18,000,000 shares of common stock in a secondary offering. Waystar itself is not selling shares and will not receive any proceeds from this offering. J.P. Morgan is acting as the underwriter for the offering.",
      "url": "https://www.prnewswire.com/news-releases/waystar-announces-launch-of-secondary-offering-of-common-stock-302553156.html",
      "source": "PR Newswire",
      "published": "20250910T164300",
      "overall_sentiment_score": -0.066602,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.104605,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.612149
    },
    {
      "title": "Should You Invest in the Fidelity MSCI Financials Index ETF (FNCL)?",
      "summary": "The Fidelity MSCI Financials Index ETF (FNCL) is a passively managed ETF launched in 2013, seeking to track the MSCI USA IMI Financials Index. With over $2.35 billion in assets and an expense ratio of 0.08%, it offers low-cost, diversified exposure to the Financials sector, particularly through its top holdings like JP Morgan Chase, Berkshire Hathaway Inc. Cl B, and Bank of America. While it is considered a medium-risk choice with a Zacks ETF Rank of 3 (Hold), it has shown strong performance, up approximately 22.65% over the past year.",
      "url": "https://www.sharewise.com/de/news_articles/Should_You_Invest_in_the_Fidelity_MSCI_Financials_Index_ETF_FNCL_Zacks_20250910_1220",
      "source": "sharewise.com",
      "published": "20250910T060853",
      "overall_sentiment_score": 0.359857,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.321738,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.634606
    },
    {
      "title": "Figure Technology Solutions, Inc. Announces Pricing of Initial Public Offering",
      "summary": "Figure Technology Solutions, Inc. announced the pricing of its initial public offering of 31,500,000 shares of Class A common stock at $25.00 per share, with trading expected to begin on Nasdaq under \"FIGR\" on September 11, 2025. The offering includes shares from both Figure and existing stockholders, with underwriters having a 30-day option to purchase additional shares. Goldman Sachs & Co. LLC, Jefferies, and BofA Securities are joint lead bookrunning managers for the offering.",
      "url": "https://www.businesswire.com/news/home/20250910400753/en/Figure-Technology-Solutions-Inc.-Announces-Pricing-of-Initial-Public-Offering",
      "source": "Business Wire",
      "published": "20250910T000000",
      "overall_sentiment_score": 0.37715,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.333769,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.62703
    },
    {
      "title": "285 Million Dogecoin: CleanCore Solutions Makes Historic Treasury Move with Robinhood Partnership",
      "summary": "CleanCore Solutions (NYSE Amer:ZONE) has made a strategic move by acquiring 285 million Dogecoin, valued at $68 million, making it the world's largest institutional Dogecoin holder. The company has partnered with Robinhood's digital division as custodian and plans to acquire 5% of the total Doge supply. This initiative, combined with record revenues from its industrial cleaning business, aims to create dual value drivers and reduce future shareholder dilution risks.",
      "url": "https://www.stocktitan.net/news/ZONE/clean-core-solutions-puts-dual-value-drivers-and-robinhood-division-n2zzq6myocbq.html",
      "source": "Stock Titan",
      "published": "20250909T220848",
      "overall_sentiment_score": 0.04688,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.124813,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.585286
    },
    {
      "title": "Fossil Group, Inc. Announces Commencement of Exchange",
      "summary": "Fossil Group, Inc. (NASDAQ: FOSL) has announced the commencement of an exchange offer for its outstanding 7.00% Senior Notes due 2026. This initiative includes a consent solicitation and a rights offering, aiming to exchange old notes for new secured senior notes and warrants, or for new stock. The company is actively restructuring its debt, with a potential UK Proceeding if conditions for the exchange offer are not met.",
      "url": "https://www.globenewswire.com/news-release/2025/09/09/3147410/7982/en/Fossil-Group-Inc-Announces-Commencement-of-Exchange-Offer-Consent-Solicitation-and-Rights-Offering-Relating-to-Its-Senior-Notes.html",
      "source": "GlobeNewswire",
      "published": "20250909T180000",
      "overall_sentiment_score": 0.079975,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.045459,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.568545
    },
    {
      "title": "Klarna Announces Pricing of its Initial Public Offering",
      "summary": "Klarna Group plc announced the pricing of its initial public offering of 34,311,274 ordinary shares at $40.00 per share, exceeding the midpoint of its estimated range. The shares are expected to begin trading on the New York Stock Exchange under the symbol “KLAR” on September 10, 2025. Goldman Sachs & Co. LLC, J.P. Morgan, and Morgan Stanley are acting as joint book-running managers for the offering.",
      "url": "https://www.businesswire.com/news/home/20250909984518/en/Klarna-Announces-Pricing-of-its-Initial-Public-Offering",
      "source": "Business Wire",
      "published": "20250909T000000",
      "overall_sentiment_score": 0.259497,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.211282,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.649252
    },
    {
      "title": "Douglas Emmett Secures $941M in Loans on Apartment Properties",
      "summary": "Douglas Emmett, an office and apartment REIT, has secured $941 million in new loans for eight residential properties in Southern California. These non-recourse, interest-only loans mature in September 2030 and carry a fixed interest rate of 4.80%, replacing previous loans scheduled to mature in 2027 and 2029. Walker & Dunlop facilitated a total financing package of $1,068,677,000 for Douglas Emmett, including one property in Hawaii, through the Fannie Mae DUS program.",
      "url": "https://www.connectcre.com/stories/douglas-emmett-secures-941m-in-loans-on-apartment-properties/",
      "source": "Connect CRE",
      "published": "20250908T001013",
      "overall_sentiment_score": 0.283389,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.103833,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.579449
    },
    {
      "title": "Barings BDC, Inc. Prices Public Offering of $300 Million of 5.200% Notes due 2028",
      "summary": "Barings BDC, Inc. announced the pricing of an underwritten public offering of $300 million aggregate principal amount of 5.200% notes due 2028. The company intends to use the net proceeds to repay indebtedness under its senior secured credit facility and for general corporate purposes, including investments in portfolio companies. J.P. Morgan Securities LLC, ING Financial Markets LLC, MUFG Securities Americas Inc., and SMBC Nikko Securities America, Inc. are among the joint bookrunners for the offering.",
      "url": "https://www.businesswire.com/news/home/20250908257060/en/Barings-BDC-Inc.-Prices-Public-Offering-of-%24300-Million-of-5.200-Notes-due-2028",
      "source": "Business Wire",
      "published": "20250908T000000",
      "overall_sentiment_score": 0.301755,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.309863,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.620009
    },
    {
      "title": "Emerging markets rush to debt markets to grab risk-on moment",
      "summary": "Emerging market countries and companies are rapidly issuing bonds, taking advantage of high investor appetite for EM assets despite potential global debt market swings. This bond issuance, including significant deals from Saudi Arabia and Petrobras, is on pace for a record year, driven by a \"risk-on\" moment as investors seek higher yields compared to developed markets. Analysts forecast continued strong issuance and anticipate further debt sales from various sovereign and corporate entities in the developing world.",
      "url": "https://www.investmentnews.com/emerging-markets/emerging-markets-rush-to-debt-markets-to-grab-risk-on-moment/261992",
      "source": "InvestmentNews",
      "published": "20250908T000000",
      "overall_sentiment_score": 0.158212,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.335257,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.910288
    },
    {
      "title": "$700M AVAX Token Strategy: AgriFORCE Becomes First Public Avalanche Company with Major Blockchain Play",
      "summary": "AgriFORCE Growing Systems (NASDAQ: AGRI) is transforming into AVAX One, becoming the first NASDAQ-listed company focused on Avalanche blockchain technology. The company plans a $550 million capital raise, targeting over $700 million in AVAX tokens, backed by industry leaders like Anthony Scaramucci and Brett Tejpaul, and over 50 institutional investors. This strategic shift aims to create the \"Berkshire Hathaway of the onchain financial economy,\" focusing on asset accumulation and integrating fintech businesses onto the Avalanche network.",
      "url": "https://www.stocktitan.net/news/AGRI/agri-force-growing-systems-agri-to-launch-as-first-publicly-traded-d8nr7l9sv6r2.html",
      "source": "Stock Titan",
      "published": "20250922T210935",
      "overall_sentiment_score": 0.419975,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.272311,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.588707
    },
    {
      "title": "Invesco Mortgage Capital: A REIT Stuck In A Holding Pattern, Despite Fed Decision",
      "summary": "Invesco Mortgage Capital (IVR) is rated a hold due to its stagnant operating cash flow and dividends, and a decline in portfolio value. Potential upside could come from lower Fed rates and increased mortgage demand, though the company's balance sheet risk is deemed in line with peers. A key risk remains a wave of mortgage defaults, despite many MBS being agency-backed.",
      "url": "https://seekingalpha.com/article/4824688-invesco-mortgage-capital-reit-stuck-in-holding-pattern-despite-fed-decision-downgrade-hold",
      "source": "Seeking Alpha",
      "published": "20250922T081036",
      "overall_sentiment_score": 0.008269,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.139174,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.601423
    },
    {
      "title": "NiSource subsidiary NIPSCO signs agreement to supply power to data centers",
      "summary": "NiSource subsidiary NIPSCO has signed an agreement to provide electric service to a large investment-grade company's data centers, with power supply beginning in 2027 and increasing annually through 2032. To meet this demand, another NiSource subsidiary, NIPSCO Generation LLC, plans to construct new dispatchable generation facilities. This development comes amidst mixed analyst sentiment regarding NiSource's future, with some price target upgrades and downgrades due to regulatory uncertainties and strong growth projections.",
      "url": "https://www.investing.com/news/sec-filings/nisource-subsidiary-nipsco-signs-agreement-to-supply-power-to-data-centers-93CH-4248538",
      "source": "Investing.com",
      "published": "20250922T064700",
      "overall_sentiment_score": 0.069428,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.110199,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.593871
    },
    {
      "title": "Lowenstein Represents Hivemind Capital as Lead Investor in a $550M Capital Raise for AgriFORCE Growing Systems to Create the First Publicly Traded Avalanche-Focused Company on NASDAQ",
      "summary": "Lowenstein Sandler represented Hivemind Capital as lead investor in a $550M capital raise for AgriFORCE Growing Systems Ltd. (Nasdaq: AGRI). This funding aims to transform AgriFORCE into the first NASDAQ-listed company focused on maximizing ownership of AVAX, the native token of the Avalanche network, and will be renamed AVAX One. The capital raise strategy involves a $300 million PIPE and plans for an additional $250 million, with a goal to own over $700 million worth of AVAX tokens.",
      "url": "https://www.lowenstein.com/news-insights/firm-news/lowenstein-represents-hivemind-capital-as-lead-investor-in-a-550m-capital-raise-for-agriforce-growing-systems-to-create-the-first-publicly-traded-avalanche-focused-company-on-nasdaq",
      "source": "Lowenstein Sandler LLP",
      "published": "20250922T000000",
      "overall_sentiment_score": 0.255109,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.321008,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.615204
    },
    {
      "title": "Kennedy Wilson to Acquire Toll Brothers Apartment Living",
      "summary": "Kennedy Wilson has announced its acquisition of Toll Brothers' Apartment Living platform for $347 million, encompassing a portfolio of stabilized and in-development multifamily and student housing properties. This transaction will significantly scale Kennedy Wilson's investment management platform and rental housing capabilities, with Toll Brothers planning to exit the multifamily development business after selling its remaining assets. The acquisition includes general partner interests in 18 assets valued at $2.2 billion, a 29-property development pipeline, and the expertise of the Toll Brothers Apartment Living management team.",
      "url": "https://www.multihousingnews.com/kennedy-wilson-to-acquire-toll-brothers-apartment-living/",
      "source": "Multifamily Housing News",
      "published": "20250919T070927",
      "overall_sentiment_score": 0.235347,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.120292,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.638376
    },
    {
      "title": "Kimco Realty to Report Third Quarter 2025 Earnings on October 30, 2025",
      "summary": "Kimco Realty will release its third quarter 2025 earnings on October 30, 2025, before the market opens, followed by a conference call at 8:30 AM ET. The company, a publicly traded REIT specializing in grocery-anchored shopping centers, also provided an overview of its portfolio, investor communication channels, and contact information for investor relations. The article also includes details on hedge fund activity, analyst ratings, and price targets for KIM stock.",
      "url": "https://www.quiverquant.com/news/Kimco+Realty+to+Report+Third+Quarter+2025+Earnings+on+October+30%2C+2025",
      "source": "Quiver Quantitative",
      "published": "20250918T110000",
      "overall_sentiment_score": 0.1298,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.215377,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.617577
    },
    {
      "title": "Stocks To Watch Today on Sep 18: Biocon, DevX, Federal Bank, Cochin Shipyard and more",
      "summary": "This article lists several companies whose stocks are expected to be in the spotlight on September 18 due to significant corporate developments. Key companies discussed include Biocon, Dixon Technologies, Federal Bank, Indosolar, Bandhan Bank, SVP Global Textiles Ltd, Lodha Developers Ltd, Cochin Shipyard, and Dev Accelerator (DevX). These developments range from FDA approvals and acquisitions to stock sales and project agreements.",
      "url": "https://www.etnownews.com/markets/stocks-to-watch-today-on-sep-18-biocon-devx-federal-bank-cochin-shipyard-and-more-article-152845792",
      "source": "ET Now",
      "published": "20250918T032814",
      "overall_sentiment_score": 0.150138,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.196002,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.633746
    },
    {
      "title": "Hancock Whitney Corp stock hits 52-week high at 64.31 USD",
      "summary": "Hancock Whitney Corp (HWC) stock reached a 52-week high of $64.31, driven by strong market conditions and positive company performance, including 27.75% growth over the past year. The regional bank reported strong Q2 2025 results with 6% annualized loan growth and improved asset quality, leading analysts from Raymond James, Piper Sandler, and DA Davidson to raise their price targets. The company has also maintained dividend payments for 38 consecutive years.",
      "url": "https://www.investing.com/news/company-news/hancock-whitney-corp-stock-hits-52week-high-at-6431-usd-93CH-4243015",
      "source": "Investing.com",
      "published": "20250917T140700",
      "overall_sentiment_score": 0.515209,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.444574,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.574906
    },
    {
      "title": "Perkins Coie Represents Black Rock Coffee Bar in Refinancing of Senior Credit Facility",
      "summary": "Perkins Coie represented Black Rock Coffee Bar in refinancing its existing credit facility with a new senior credit facility from JPMorgan Chase Bank, N.A. This refinancing happened concurrently with Black Rock Coffee Bar's initial public offering of its Class A common stock. The advisory team was led by financial transactions partner Jonathan Forgang and included Laura Gritz, Dan Sito, and Joe Bailey, providing expertise on financial, tax, and corporate matters respectively.",
      "url": "https://perkinscoie.com/news/press-release/perkins-coie-represents-black-rock-coffee-bar-refinancing-senior-credit-facility",
      "source": "Perkins Coie",
      "published": "20250917T051114",
      "overall_sentiment_score": 0.346163,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.231055,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.642883
    },
    {
      "title": "Progressive eyes possible excess profit refund in Florida auto market",
      "summary": "Progressive Corp. anticipates a potential excess profit refund for its policyholders in Florida, where it is the largest personal auto insurer, due to state regulations requiring insurers to return profits exceeding statutory thresholds. Despite cutting auto rates twice and benefiting from tort reform, the company's CEO Tricia Griffith noted that profits could still exceed limits for 2023-2025, especially with a quiet hurricane season. This situation highlights the delicate balance insurers face in Florida's regulated market between profitability and compliance with consumer protection laws.",
      "url": "https://www.insurancebusinessmag.com/us/news/auto-motor/progressive-eyes-possible-excess-profit-refund-in-florida-auto-market-549937.aspx",
      "source": "Insurance Business America",
      "published": "20250917T000000",
      "overall_sentiment_score": -0.106124,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.083579,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.558
    },
    {
      "title": "New ETF Shop Snags Former Janus Henderson Exec",
      "summary": "Reckoner Capital Management, an ETF shop backed by RedBird Capital Partners, has hired Richard Hoge, former COO of Janus Henderson’s ETF business, to lead the expansion of its ETF suite. The firm launched its first ETF, the Leveraged AAA CLO ETF (RAAA), in July and plans to leverage ETFs to build a global credit platform, bringing alternative assets to a wider range of clients. Hoge's extensive experience in the ETF market, including co-founding VelocityShares, is expected to be crucial in developing new and differentiated products.",
      "url": "https://www.thedailyupside.com/etf/industry-news-etf/new-etf-shop-snags-former-janus-henderson-exec/",
      "source": "The Daily Upside",
      "published": "20250917T000000",
      "overall_sentiment_score": 0.109919,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.142843,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.609192
    },
    {
      "title": "Analog Devices at JPMorgan U.S. All Stars: Strategic Growth Outlook",
      "summary": "Analog Devices presented at the JPMorgan U.S. All Stars Conference, detailing its strategic growth outlook amidst a cyclical upturn, emphasizing strong performance in industrial, automotive, and consumer sectors. The company is actively managing inventory, targeting high gross margins, and committing to returning 100% of free cash flow to shareholders, while also addressing challenges like trade uncertainties and a China anti-dumping probe. Analog Devices expects continued long-term growth driven by secular mega-trends and strategic investments, aiming for $15 EPS by fiscal 2027 despite the recent downturn's severity.",
      "url": "https://www.investing.com/news/transcripts/analog-devices-at-jpmorgan-us-all-stars-strategic-growth-outlook-93CH-4240241",
      "source": "Investing.com",
      "published": "20250916T070200",
      "overall_sentiment_score": 0.281734,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.12217,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.600552
    },
    {
      "title": "Why JPMorgan Says Fiverr's Painful Layoffs Could Lead To Long-Term Gain",
      "summary": "JPMorgan believes Fiverr International's recent layoffs and restructuring, driven by an \"AI-native infrastructure and mindset,\" will position the company for significant long-term growth. Analyst Doug Anmuth maintained an Overweight rating and a $30 price target, noting that the restructuring is expected to generate $30 million in annualized gross savings, which will be partly reinvested in AI talent. The company reiterated its guidance for Q3 and 2025, indicating no immediate material impact on revenue.",
      "url": "https://www.benzinga.com/analyst-stock-ratings/reiteration/25/09/47694710/why-jpmorgan-says-fiverrs-painful-layoffs-could-lead-to-long-term-gain",
      "source": "Benzinga",
      "published": "20250916T040939",
      "overall_sentiment_score": 0.291212,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.233301,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.615338
    },
    {
      "title": "FactSet Adds J.P. Morgan, Barclays to Aftermarket Research Offering",
      "summary": "FactSet announced the addition of J.P. Morgan and Barclays analyst reports to its aftermarket research (AMR) offering, significantly expanding its coverage. This integration broadens the insights available to FactSet clients, providing diverse perspectives from over 1,800 global brokers to aid in financial analysis and decision-making. The enhanced AMR product is available on the FactSet Workstation, via mobile, and through API data feeds, catering to sell-side, corporate, and private capital professionals.",
      "url": "https://finance.yahoo.com/news/factset-adds-j-p-morgan-120000143.html",
      "source": "Yahoo Finance",
      "published": "20250915T120000",
      "overall_sentiment_score": 0.287926,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.304222,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.852058
    },
    {
      "title": "The Procter & Gamble Company (PG) Focused on Innovation and Efficiency to Accelerate Growth",
      "summary": "The Procter & Gamble Company (NYSE: PG) is focusing on innovation and efficiency to drive future growth, as reiterated at the Barclays 18th Annual Global Consumer Staples Conference 2025. The company plans organizational restructuring, optimizing value chains, and improving productivity through technology. It also anticipates mid-to-single-digit price increases on 25% of its U.S. portfolio due to tariff headwinds, positioning itself as a strong defensive stock according to Steve Cohen.",
      "url": "https://www.insidermonkey.com/blog/the-procter-gamble-company-pg-focused-on-innovation-and-efficiency-to-accelerate-growth-1609034/",
      "source": "Insider Monkey",
      "published": "20250915T090300",
      "overall_sentiment_score": 0.172079,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.10986,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.590308
    },
    {
      "title": "Stifel reiterates Buy rating on Halliburton stock citing strong operator performance",
      "summary": "Stifel reiterated its Buy rating on Halliburton (NYSE:HAL) stock, citing the oilfield services company's strong performance with operators, despite a recent decline in revenue and a lowered price target from another firm. The firm highlighted Halliburton's premium pricing position, equipment reliability, and leadership in digital automation technologies. Other recent developments include UBS lowering its price target due to margin challenges, S&P Global Ratings revising the outlook to stable from positive, and Melius Research initiating coverage with a Buy rating.",
      "url": "https://www.investing.com/news/analyst-ratings/stifel-reiterates-buy-rating-on-halliburton-stock-citing-strong-operator-performance-93CH-4238544",
      "source": "Investing.com",
      "published": "20250915T074100",
      "overall_sentiment_score": -0.069016,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.228557,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.623336
    },
    {
      "title": "Citigroup Is On A Path To 15% ROE (NYSE:C)",
      "summary": "Citigroup is undergoing a successful transformation under Jane Fraser, aiming for a 15% RoTE in the medium term through lower capital ratios, revenue growth, and cost reductions. Key catalysts like the Banamex IPO and reduced G-SIB surcharge are expected to support higher valuations. The author maintains a Strong Buy rating, projecting a share price of $200–$230 by 2028 as transformation costs decline and operating leverage boosts profitability.",
      "url": "https://seekingalpha.com/article/4822849-citigroup-path-to-15-percent-roe",
      "source": "Seeking Alpha",
      "published": "20250914T231700",
      "overall_sentiment_score": 0.591254,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.337475,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.629924
    },
    {
      "title": "J.P. Morgan Maintains a Hold on TD SYNNEX Corporation (SNX)",
      "summary": "J.P. Morgan has maintained a Hold rating on TD SYNNEX Corporation (SNX) with a price target of $160.00. This comes after TD SYNNEX announced a strategic collaboration agreement with Amazon Web Services (AWS) to boost cloud migration, AI adoption, and marketplace growth in several regions. Despite SNX's potential, the report suggests other AI stocks may offer greater upside and less downside risk.",
      "url": "https://finance.yahoo.com/news/j-p-morgan-maintains-hold-051720901.html",
      "source": "Yahoo Finance",
      "published": "20250913T210925",
      "overall_sentiment_score": 0.069116,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.045616,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.603251
    },
    {
      "title": "Zoetis Inc. (ZTS) Secures a New Five-Year $1.25 Billion Senior Unsecured Revolving Credit Facility",
      "summary": "Zoetis Inc. (ZTS) has secured a new five-year, $1.25 billion senior unsecured revolving credit facility, enhancing its financial flexibility. This agreement, replacing a 2022 facility, is administered by JPMorgan Chase and involves several other major banks as syndication agents. The credit facility offers borrowing options tied to base or SOFR rates plus a margin linked to the company’s debt ratings, providing liquidity for operations and strategic initiatives without mandatory prepayments.",
      "url": "https://finance.yahoo.com/news/zoetis-inc-zts-secures-five-151259473.html",
      "source": "Yahoo Finance",
      "published": "20250912T135939",
      "overall_sentiment_score": 0.178413,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.122625,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.632416
    },
    {
      "title": "Recursion Pharmaceuticals Stock (RXRX) Opinions on AI-Driven Pipeline Updates",
      "summary": "Recent discussions on Recursion Pharmaceuticals (RXRX) highlight both excitement for its AI-driven drug discovery platform and concerns about the lack of late-stage clinical candidates. The stock's volatility is fueled by insider trading activity and anticipation of upcoming milestones, creating a dynamic conversation among investors. This mix of optimism and skepticism reflects the high stakes surrounding the company's future moves in biotech.",
      "url": "https://www.quiverquant.com/news/Recursion+Pharmaceuticals+Stock+%28RXRX%29+Opinions+on+AI-Driven+Pipeline+Updates",
      "source": "Quiver Quantitative",
      "published": "20250911T173200",
      "overall_sentiment_score": 0.096966,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.1359,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.56489
    }
  ]
}