{
  "ticker": "JPM",
  "date": "2025-05-19",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T12:59:49.723247",
  "source": "alpha_vantage",
  "article_count": 23,
  "articles": [
    {
      "title": "Moody's rebaixa rating dos maiores bancos americanos após cortar nota de crédito dos EUA",
      "summary": "A Moody's Ratings rebaixou as notas de crédito de alguns dos maiores bancos americanos, incluindo J.P. Morgan e Bank of America, um dia após reduzir a classificação de crédito dos EUA. A agência citou a capacidade enfraquecida do governo de oferecer suporte às instituições, impactando não apenas os bancos, mas também empresas, investidores e consumidores que interagem com eles. Essa ação reflete as repercussões da retirada da classificação soberana máxima dos EUA devido a déficits orçamentários crescentes.",
      "url": "https://valor.globo.com/financas/noticia/2025/05/19/moodys-rebaixa-rating-dos-maiores-bancos-americanos-apos-cortar-nota-de-credito-dos-eua.ghtml",
      "source": "Valor Econômico",
      "published": "20250519T152800",
      "overall_sentiment_score": -0.247765,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.422019,
      "ticker_sentiment_label": "Bearish",
      "relevance_score": 0.948554
    },
    {
      "title": "As Stocks Swooned, Individuals Bought & Pros Bailed",
      "summary": "During extreme market volatility in April 2025, individual investors bought stocks on the dip, while hedge funds and professional investors sold off shares. This behavior contrasts with past market downturns, largely because individual investors use passively managed index funds in 401(k)s. While hedge funds are forced to sell due to leverage and performance pressures, retail investors who held steady have seen their portfolios recover.",
      "url": "https://www.newsmax.com/finance/streettalk/retail-investor-market/2025/05/05/id/1209642/",
      "source": "Newsmax",
      "published": "20250505T151200",
      "overall_sentiment_score": -0.049477,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.125808,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.739456
    },
    {
      "title": "Should You Invest in the Fidelity MSCI Financials Index ETF (FNCL)?",
      "summary": "The Fidelity MSCI Financials Index ETF (FNCL), launched in 2013, is a passively managed ETF designed for broad exposure to the Financials - Broad segment of the equity market, ranked 3rd within the Zacks sectors. With $2.16 billion in assets and a low expense ratio of 0.08%, it seeks to match the performance of the MSCI USA IMI Financials Index. The ETF has performed well year-to-date and over the last 12 months, holding a Zacks ETF Rank of 2 (Buy).",
      "url": "https://www.sharewise.com/us/news_articles/Should_You_Invest_in_the_Fidelity_MSCI_Financials_Index_ETF_FNCL_Zacks_20250505_1220",
      "source": "sharewise.com",
      "published": "20250505T000952",
      "overall_sentiment_score": 0.314819,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.211059,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.656026
    },
    {
      "title": "PSEG Power in $1.25 Billion Offering",
      "summary": "Cleary Gottlieb is representing PSEG Power LLC in its Rule 144A/Reg S offering of $750 million 5.2% senior notes due 2030 and $500 million 5.75% senior notes due 2035, totaling $1.25 billion. The offering priced on May 14, 2025, and is expected to close on May 21, 2025, with several major banks acting as bookrunners. PSEG Power, a subsidiary of Public Service Enterprise Group Incorporated, is an energy supply company owning and operating merchant nuclear generating assets and providing fuel and energy management services primarily in the eastern United States.",
      "url": "https://www.clearygottlieb.com/news-and-insights/news-listing/pseg-power-in-1-25-billion-offering",
      "source": "Cleary Gottlieb",
      "published": "20250519T000000",
      "overall_sentiment_score": 0.354758,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.306508,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.647842
    },
    {
      "title": "Animal Spirits: There Will Never Be Another Warren Buffett",
      "summary": "This article compiles diverse financial and economic discussions from the \"Animal Spirits\" podcast, featuring topics like the recovery of US stocks driven by risky companies, retail investor behavior, the definition of a bear market, and consumer spending patterns. It references tweets and charts from various financial commentators to support its points. The overarching theme, though not explicitly detailed in the provided content, is suggested by the title \"There Will Never Be Another Warren Buffett,\" hinting at a unique and unrepeatable era of investing.",
      "url": "https://www.theirrelevantinvestor.com/p/animal-spirits-there-will-never-be-another-warren-buffett",
      "source": "The Irrelevant Investor",
      "published": "20250507T040920",
      "overall_sentiment_score": -0.124961,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.202622,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.644124
    },
    {
      "title": "Dorchester Minerals Elects Sarah Wariner as an Independent Manager",
      "summary": "Dorchester Minerals, L.P. announced the election of Sarah N. Wariner as an Independent Manager, succeeding Ron Trout who retired after 17 years of service. Ms. Wariner brings extensive experience in law, business, and corporate governance from her roles at Jacobs Engineering Group, JP Morgan Chase & Co., and Clark Hill PLC. Dorchester Minerals, L.P. is a Dallas-based owner of oil and natural gas interests.",
      "url": "https://www.citybiz.co/article/696467/dorchester-minerals-elects-sarah-wariner-as-an-independent-manager/",
      "source": "citybiz",
      "published": "20250519T000000",
      "overall_sentiment_score": 0.21113,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.145223,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.6415
    },
    {
      "title": "Revealed: Santander helped raise $1.3bn for firm responsible for massive South American deforestation",
      "summary": "A new Global Witness investigation reveals that Santander, despite its net-zero pledge, helped finance Cresud, an \"agricultural real estate\" company responsible for deforesting over 170,000 hectares in South America. The financing, totaling $1.3 billion since 2011, increased after Santander introduced a policy to limit funding for deforesting companies. This highlights the urgent need for international action to stop banks from investing in companies that destroy climate-critical forests.",
      "url": "https://globalwitness.org/en/press-releases/revealed-santander-helped-raise-13bn-for-firm-responsible-for-massive-south-american-deforestation/",
      "source": "Global Witness",
      "published": "20250515T200904",
      "overall_sentiment_score": -0.469648,
      "overall_sentiment_label": "Bearish",
      "ticker_sentiment_score": -0.333418,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.637725
    },
    {
      "title": "PIMCO launches a Diversified Private Credit Fund",
      "summary": "PIMCO has introduced the Diversified Private Credit Fund (DPC Fund), an evergreen multi-sector private lending strategy designed for European wealth investors. This Luxembourg-domiciled fund aims to provide access to a broad range of private credit investments, including loans backed by tangible assets, residential mortgages, consumer credit, corporate credit, and commercial real estate. The DPC Fund, managed by an experienced PIMCO investment committee, seeks to generate income and long-term capital appreciation through a diversified, relative-value approach.",
      "url": "https://rankiapro.com/en/news/pimco-launches-diversified-private-credit-fund/",
      "source": "RankiaPro",
      "published": "20250512T042433",
      "overall_sentiment_score": 0.124066,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.124629,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.628845
    },
    {
      "title": "Downgrade de Rating dos EUA - Moodys's",
      "summary": "Moody's downgraded the U.S. rating to AA+ with a stable outlook from AAA with a negative outlook, following similar actions by S&P and Fitch. This move highlights concerns about the long-term sustainability of the U.S. debt and persistent fiscal deficits, though its immediate market impact was limited due to previous downgrades. The stable outlook emphasizes the U.S.'s strong credit position due to its economic resilience and the dollar's role as a global reserve currency, despite the warning regarding long-term debt management.",
      "url": "https://avenue.us/mercados/moodys-rebaixa-rating-dos-eua/",
      "source": "avenue.us",
      "published": "20250519T180814",
      "overall_sentiment_score": 0.182513,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.132184,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.625672
    },
    {
      "title": "How Investment Grade Credit Can Deliver in Times of Uncertainty",
      "summary": "This article argues that investment grade (IG) corporate credit offers attractive income and total return potential during uncertain times due to strong fundamentals and higher yields. It highlights improved valuations, the resilience of IG companies, and the benefits of active alpha generation over passive beta exposures. Goldman Sachs Asset Management emphasizes prudent financial management among BBB-rated companies and expectations for continued resilience in IG credit total returns.",
      "url": "https://am.gs.com/en-sg/advisors/insights/article/2025/earning-credit-how-investment-grade-can-deliver-in-times-of-uncertainty",
      "source": "Goldman Sachs Asset Management",
      "published": "20250507T000000",
      "overall_sentiment_score": 0.215166,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.252345,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.614596
    },
    {
      "title": "As Investors Brace for Volatility, Look to Dividend ETF FDVV",
      "summary": "Given current market uncertainties like sticky inflation, high interest rates, and geopolitical tensions, many investors anticipate continued volatility. Dividend ETFs, such as the Fidelity High Dividend ETF (FDVV), offer a potential solution for stability and income generation. FDVV invests in large- and mid-cap dividend-paying companies and can provide diversification benefits, offering a consistent revenue stream that can help offset market volatility.",
      "url": "https://www.etftrends.com/etf-investing-channel/investors-brace-volatility-look-dividend-etf-fdvv/",
      "source": "ETF Trends",
      "published": "20250506T000000",
      "overall_sentiment_score": 0.383229,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.30445,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.611754
    },
    {
      "title": "BioSig Enters into an LOI to Merge with Streamex Exchange Corp. Creating a Publicly Listed Real-World Asset Tokenization Company Led by Seasoned Industry Executives",
      "summary": "BioSig Technologies, Inc. (NASDAQ: BSGM) announced it has signed a Letter of Intent to merge with Streamex Exchange Corporation, aiming to bring a real-world asset tokenization company public on the Nasdaq. The all-stock transaction will result in Streamex's current stockholders owning approximately 75% of the combined company's common stock after conversion of preferred shares. This merger seeks to leverage Streamex's commodity-focused tokenization infrastructure to bridge traditional finance with the digital economy.",
      "url": "https://www.biospace.com/press-releases/biosig-enters-into-an-loi-to-merge-with-streamex-exchange-corp-creating-a-publicly-listed-real-world-asset-tokenization-company-led-by-seasoned-industry-executives",
      "source": "BioSpace",
      "published": "20250506T044057",
      "overall_sentiment_score": 0.096191,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.116655,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.61112
    },
    {
      "title": "Agree Realty Announces Pricing of $400 Million of 5.600% Senior Unsecured Notes Due 2035",
      "summary": "Agree Realty Corporation announced that its operating partnership priced a public offering of $400 million of 5.600% senior unsecured notes due 2035, with an effective yield to maturity of 5.692%. The net proceeds will be used for general corporate purposes, including reducing indebtedness and funding property acquisitions and development. This offering is expected to increase the company's liquidity to approximately $2.6 billion and extend its weighted-average debt maturity.",
      "url": "https://www.prnewswire.com/news-releases/agree-realty-announces-pricing-of-400-million-of-5-600-senior-unsecured-notes-due-2035--302455815.html",
      "source": "PR Newswire",
      "published": "20250514T162400",
      "overall_sentiment_score": 0.161358,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.115007,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.608208
    },
    {
      "title": "Janus Henderson Investors launches MBS ETF in Europe",
      "summary": "Janus Henderson Investors has introduced a new active mortgage-backed securities (MBS) ETF in Europe, the Janus Henderson Tabula Mortgage-Backed Securities (JMBS) UCITS ETF. This fund will primarily invest in agency MBS, with a small allocation to non-agency MBS for diversification, and aims to provide income and portfolio insulation during volatile periods through active management. The ETF is managed by John Kerschner, Nick Childs, and Thomas Polus, expanding a successful US strategy to non-US investors.",
      "url": "https://alternativecreditinvestor.com/2025/05/12/janus-handerson-investors-launches-mbs-etf-in-europe/",
      "source": "Alternative Credit Investor",
      "published": "20250512T041040",
      "overall_sentiment_score": 0.393934,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.344579,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.606785
    },
    {
      "title": "Brookfield Asset Management Ltd. Class A (BAM) Receives a Hold from Morgan Stanley",
      "summary": "Morgan Stanley analyst Michael Cyprys maintained a Hold rating on Brookfield Asset Management Ltd. Class A (BAM) with a price target of $54.00, following yesterday's closing price of C$83.14. J.P. Morgan also reiterated a Hold rating with a $55.00 price target. The company currently holds a Moderate Buy consensus from analysts, with a price target implying a slight downside.",
      "url": "https://www.theglobeandmail.com/investing/markets/stocks/BAM/pressreleases/32453639/brookfield-asset-management-ltd-class-a-bam-receives-a-hold-from-morgan-stanley/",
      "source": "The Globe and Mail",
      "published": "20250517T072748",
      "overall_sentiment_score": 0.073849,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.123714,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.602595
    },
    {
      "title": "VanEck Launches NODE ETF To Tap Blockchain's Next Chapter",
      "summary": "VanEck has launched the Onchain Economy ETF (BATS: NODE), an actively managed fund designed to provide exposure to the developing blockchain ecosystem without the full volatility of cryptocurrency. The ETF invests in various blockchain-related companies, including crypto-native firms, data centers, fintech, and incumbent digital asset players. NODE features a Bitcoin sensitivity framework to adjust holdings based on valuation ties to price swings, allowing it to manage risk dynamically.",
      "url": "https://www.benzinga.com/etfs/new-etfs/25/05/45500575/vaneck-launches-node-etf-to-tap-blockchains-next-chapter",
      "source": "Benzinga",
      "published": "20250519T021331",
      "overall_sentiment_score": 0.302034,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.234549,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.582672
    },
    {
      "title": "Divest From China With AVXC’s Emerging Market Strategy",
      "summary": "Given the shaky performance of the U.S. market, many investors are exploring international equities, particularly emerging markets, despite their inherent risks. The Avantis Emerging Markets ex-China Equity ETF (AVXC) offers a strategy to navigate these risks by actively managing and excluding Chinese companies, focusing instead on countries like Taiwan, India, and South Korea, addressing investor concerns about ongoing tariff negotiations. The fund has seen significant capital inflows, indicating its growing appeal for a more balanced portfolio.",
      "url": "https://www.etftrends.com/core-strategies-channel/divest-china-avxcs-emerging-market-strategy/",
      "source": "ETF Trends",
      "published": "20250507T000000",
      "overall_sentiment_score": 0.176166,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.112479,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.573848
    },
    {
      "title": "American Homes 4 Rent Announces Pricing of Public Offering of $650 Million of 4.950% Senior Notes due 2030",
      "summary": "American Homes 4 Rent announced the pricing of a public offering of $650 million aggregate principal amount of 4.950% Senior Notes due 2030. The notes will be issued at 99.444% of par value with interest payable semi-annually. Proceeds are intended for repayment of outstanding indebtedness and general corporate purposes, including property acquisitions and improvements.",
      "url": "https://www.prnewswire.com/news-releases/american-homes-4-rent-announces-pricing-of-public-offering-of-650-million-of-4-950-senior-notes-due-2030--302447756.html",
      "source": "PR Newswire",
      "published": "20250506T160900",
      "overall_sentiment_score": 0.099686,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.123993,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.571561
    },
    {
      "title": "UnitedHealth: Uma das maiores empresas americanas está prestes a implodir",
      "summary": "UnitedHealth Group, uma das maiores empresas americanas e membro do Dow Jones, está em crise após a renúncia abrupta do CEO Andrew Witty e a revelação de uma investigação criminal federal por possível fraude no Medicare. As ações da empresa perderam US$ 288 bilhões em um mês, e ela agora enfrenta intenso escrutínio governamental e a volta do ex-CEO Stephen Hemsley para tentar estabilizar a situação. A crise é agravada por uma queda drástica na confiança dos investidores e a retirada das projeções financeiras de 2025.",
      "url": "https://www.cnnbrasil.com.br/economia/negocios/unitedhealth-uma-das-maiores-empresas-americanas-esta-prestes-a-implodir/",
      "source": "CNN Brasil",
      "published": "20250517T111500",
      "overall_sentiment_score": -0.422178,
      "overall_sentiment_label": "Bearish",
      "ticker_sentiment_score": -0.212078,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.569402
    },
    {
      "title": "International Diversification Benefits Shining in 2025",
      "summary": "International equities and related funds are demonstrating significant diversification benefits in 2025, outperforming the S&P 500 after a decade of lagging performance. Factors like the end of deflation in Europe and Japan, along with U.S. policy changes, are driving this momentum. ETFs like the WisdomTree International Equity Fund (DWM) are experiencing strong gains, highlighting the value of unhedged international allocations in portfolios.",
      "url": "https://www.etftrends.com/model-portfolio-content-hub/international-diversification-benefits-shining-2025/",
      "source": "ETF Trends",
      "published": "20250508T053010",
      "overall_sentiment_score": 0.238744,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.104382,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.563511
    },
    {
      "title": "Investments Roundup: Simplify, CAIS, BlackRock, Advisors, Edward Jones And More",
      "summary": "This Investments Roundup features various financial firms launching new products and making strategic moves. Simplify and Pacer ETFs introduced complex barrier and rotator ETFs, respectively, highlighting the increasing complexity of investment instruments. BlackRock anticipates the bond ETF market to reach $6 trillion by 2030, while Edward Jones and Venturi Private Wealth are expanding alternative investment access for high-net-worth clients.",
      "url": "https://www.wealthsolutionsreport.com/investments-roundup-simplify-cais-blackrock-advisors-edward-jones-and-more/",
      "source": "Wealth Solutions Report",
      "published": "20250513T205838",
      "overall_sentiment_score": 0.164386,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": -0.133783,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.561978
    },
    {
      "title": "Sumitomo Mitsui Doubles Down On India With Plan To Buy Stake In Yes Bank For $1.6 Billion",
      "summary": "Sumitomo Mitsui Financial Group's unit, Sumitomo Mitsui, is set to acquire a significant stake in India's Yes Bank for $1.6 billion, becoming its largest shareholder. The deal, subject to regulatory approvals, involves purchasing shares from State Bank of India and other banks at 21.50 rupees apiece. This investment follows Sumitomo Mitsui's increased focus on India, aiming to expand its business in the region.",
      "url": "https://www.forbes.com/sites/jonathanburgos/2025/05/10/sumitomo-mitsui-doubles-down-on-india-with-plan-to-buy-stake-in-yes-bank-for-16-billion/",
      "source": "Forbes",
      "published": "20250510T093300",
      "overall_sentiment_score": 0.333135,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.335513,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.504505
    },
    {
      "title": "Investment Grade Credit Rating: What Does It Mean?",
      "summary": "An investment grade credit rating signifies a low risk of default for municipal or corporate bonds, making them attractive to conservative investors. Rating agencies like S&P, Moody's, and Fitch use letter grades to indicate credit quality, with higher grades (e.g., AAA, Aaa) representing lower risk. A downgrade from investment grade to \"junk status\" can have significant negative repercussions for a company, increasing its cost of capital.",
      "url": "https://www.investopedia.com/terms/i/investmentgrade.asp",
      "source": "Investopedia",
      "published": "20250510T000000",
      "overall_sentiment_score": 0.180465,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.140073,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.326813
    }
  ]
}