{
  "ticker": "JPM",
  "date": "2025-04-07",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T12:59:21.450614",
  "source": "alpha_vantage",
  "article_count": 20,
  "articles": [
    {
      "title": "Presidio Property Trust, Inc. SEC 10-K Report",
      "summary": "Presidio Property Trust, Inc. has released its annual 10-K report, detailing a 7.3% increase in total revenue to $18.9 million, driven by new leases and model home transactions. The report highlights strategic initiatives, including diversifying its portfolio with office, industrial, and model home properties, and recent acquisitions and dispositions. The company also outlines financial and operational challenges, such as indebtedness, market risks, and the impact of inflation and rising interest rates, while focusing on capital management through stock repurchases and potential property sales.",
      "url": "https://www.tradingview.com/news/tradingview:52c8067b46e2b:0-presidio-property-trust-inc-sec-10-k-report/",
      "source": "TradingView — Track All Markets",
      "published": "20250331T092815",
      "overall_sentiment_score": -0.065782,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.05265,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.569958
    },
    {
      "title": "Greenidge Generation Holdings Inc. SEC 10-K Report",
      "summary": "Greenidge Generation Holdings Inc. (GREE) has released its annual 10-K report, detailing a 15% decrease in total revenue to $59.5 million but an improved operating loss of $11.4 million. The company is strategically shifting towards datacenter hosting and cryptocurrency mining, expanding operations in Mississippi, and launching new products like the Pod X. Significant financial risks include insufficient cash flows for long-term debt and high dependence on volatile bitcoin prices and energy costs.",
      "url": "https://www.tradingview.com/news/tradingview:1cd8d36536112:0-greenidge-generation-holdings-inc-sec-10-k-report/",
      "source": "TradingView",
      "published": "20250331T034423",
      "overall_sentiment_score": -0.075542,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.022771,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.557169
    },
    {
      "title": "JPIE: Short Duration, 6% Yield, Low Risk--Meet Your New Favorite Bond ETF (NYSEARCA:JPIE)",
      "summary": "The JPMorgan Active Income ETF (JPIE) offers a compelling 6%+ dividend yield by investing in a diversified basket of short-duration credit and securitized assets. With a low expense ratio and monthly dividends, JPIE aims to reduce downside risk by rotating between credit environments and sectors. The ETF currently holds nearly 2,000 bonds, with 60% investment-grade holdings and a 2.3-year average duration, making it a suitable option for investors seeking income in uncertain macroeconomic conditions.",
      "url": "https://seekingalpha.com/article/4770589-jpie-short-duration-6-percent-yield-low-risk-meet-your-new-favorite-bond-etf",
      "source": "Seeking Alpha",
      "published": "20250326T120600",
      "overall_sentiment_score": 0.359049,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.119149,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.614472
    },
    {
      "title": "Latham & Watkins Advises Kaspi.kz on Debut US$650 Million Bond Issuance",
      "summary": "Latham & Watkins advised Kaspi.kz on its debut US$650 million 6.250% notes issuance due 2030, listed on the International Securities Market of the London Stock Exchange and Astana International Exchange. This represents the largest-ever investment grade bond issuance by a non-sovereign from Kazakhstan. Citi and J.P. Morgan served as joint lead managers and bookrunners, with BCC Invest acting as Kazakhstan manager.",
      "url": "https://www.lw.com/en/news/2025/03/latham-advises-kaspikz-on-debut-us650-million-bond-issuance",
      "source": "Latham & Watkins LLP",
      "published": "20250326T081004",
      "overall_sentiment_score": 0.362751,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.340353,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.628438
    },
    {
      "title": "5 Explosive Effects the Fidelity Ethereum Fund Launch Will Have on Blockchain Treasury Funds!",
      "summary": "Fidelity Investments is launching an Ethereum-based fund, Fidelity Treasury Digital Fund, to enhance financial transparency and speed. This move, following BlackRock and Franklin Templeton, signifies a growing integration of traditional finance with blockchain technology. Experts predict a bullish impact on Ethereum's price, anticipating growth within a $1,985 to $2,025 range due to institutional adoption, while closely monitoring market indicators.",
      "url": "https://coinfomania.com/5-explosive-effects-the-fidelity-ethereum-fund-launch-will-have-on-blockchain-treasury-funds/",
      "source": "Coinfomania",
      "published": "20250324T120900",
      "overall_sentiment_score": 0.261291,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.257965,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.552976
    },
    {
      "title": "Deutsche Bank, Mudrick Sue Ambac Over $65 Million Transfer",
      "summary": "Deutsche Bank, Mudrick Capital Management, and other noteholders have sued Ambac Assurance Corp. for an alleged unauthorized transfer of $65 million to its parent company, Ambac Financial Group. The creditors claim this transfer violates Ambac's rehabilitation terms and benefits shareholders over noteholders, especially given their unpaid principal and interest since 2018. This dispute also involves the structure of an Oaktree Capital Management sale of Ambac's legacy financial guarantee business, which creditors allege was designed to harm Ambac Assurance.",
      "url": "https://www.claimsjournal.com/news/national/2025/03/24/329629.htm",
      "source": "Claims Journal",
      "published": "20250324T000000",
      "overall_sentiment_score": -0.187027,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.128839,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.638582
    },
    {
      "title": "Why Europe is yet to see a non-AAA CLO ETF",
      "summary": "Europe has not yet seen a non-AAA CLO ETF due to restrictive regulatory challenges, despite success in the US with products like VanEck's $1bn non-AAA CLO ETF (CLOI). European regulations, particularly from the Central Bank of Ireland, require publicly listed CLO ETFs to maintain at least 80% exposure to AAA-rated tranches, making it difficult to replicate US strategies that include lower-rated securities. This regulatory environment, combined with a perceived saturation in the AAA CLO ETF space, hinders the launch of more diverse CLO ETF offerings in Europe.",
      "url": "https://www.etfstream.com/articles/why-europe-is-yet-to-see-a-non-aaa-clo-etf",
      "source": "ETF Stream",
      "published": "20250403T000000",
      "overall_sentiment_score": 0.04717,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.02141,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.621563
    },
    {
      "title": "Should You Invest in the Invesco KBW Bank ETF (KBWB)?",
      "summary": "This article evaluates the Invesco KBW Bank ETF (KBWB) for investors seeking exposure to the Financials - Banking sector. It highlights KBWB as a passively managed ETF with low costs, diversified holdings focused on major banks, and a Zacks ETF Rank of 2 (Buy). The article also covers its performance, risk metrics, and suggests alternatives like FTXO and KBE.",
      "url": "https://finance.yahoo.com/news/invest-invesco-kbw-bank-etf-102005149.html",
      "source": "Yahoo Finance",
      "published": "20250401T120838",
      "overall_sentiment_score": 0.338714,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.312945,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.618038
    },
    {
      "title": "KeyCorp CEO's total compensation jumps 82% following Scotiabank bonus",
      "summary": "KeyCorp CEO Chris Gorman's total compensation for 2024 increased by nearly 82% to over $18.63 million, primarily due to a one-time stock bonus related to a significant minority equity investment from The Bank of Nova Scotia (Scotiabank). This bonus, part of a larger $16.7 million allocated to five top executives, is designed to increase long-term stock ownership and retain talent. The Scotiabank deal, totaling $2.8 billion, gives Scotiabank a 14.87% stake in KeyCorp, making it the bank's largest minority shareholder.",
      "url": "https://www.crainscleveland.com/banking-finance/scotiabank-bonus-lifts-keycorp-ceos-2024-compensation-82",
      "source": "Crain's Cleveland Business",
      "published": "20250328T144400",
      "overall_sentiment_score": 0.156964,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.060322,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.593931
    },
    {
      "title": "CarGurus executive chair Steinert Langley sells $1.4 million in shares",
      "summary": "CarGurus Inc.'s (NASDAQ: CARG) Executive Chair, Steinert Langley, sold $1.4 million worth of Class A common stock on March 26 and 27 under a Rule 10b5-1 trading plan. The sales occurred amidst analyst targets suggesting the stock is undervalued, though the company recently reported mixed Q4 2024 earnings and anticipates Q1 2025 revenue below consensus estimates. Langley retains significant direct and indirect ownership in CarGurus.",
      "url": "https://www.investing.com/news/insider-trading-news/cargurus-executive-chair-steinert-langley-sells-14-million-in-shares-93CH-3955316",
      "source": "Investing.com",
      "published": "20250328T040300",
      "overall_sentiment_score": -0.092248,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.142414,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.633076
    },
    {
      "title": "YieldMax launches its first European ETF: YMAG",
      "summary": "YieldMax ETFs has debuted its first UCITS ETF in Europe, the YieldMax Big Tech Option Income UCITS ETF (YMAG), developed in partnership with HANetf. This actively managed ETF utilizes covered call strategies on US-listed technology stocks to generate monthly income and capture capital growth. YMAG is initially listed on the London Stock Exchange, Xetra, and Borsa Italiana, expanding YieldMax's successful US option-based income ETF model to the European market.",
      "url": "https://etfexpress.com/2025/03/27/yieldmax-launches-its-first-european-etf-ymag/",
      "source": "ETF Express",
      "published": "20250327T040901",
      "overall_sentiment_score": 0.432237,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.318461,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.621205
    },
    {
      "title": "United Airlines And JPMorgan Roll Out Exclusive Benefits For New MileagePlus Cardholders, Including Welcome Bonuses",
      "summary": "United Airlines and JPMorgan Chase & Co. have introduced new benefits and welcome bonuses for their MileagePlus cardholders. These enhancements aim to make flying more rewarding and personalized, offering significant value and opportunities to earn Premier qualifying points. The new offerings cater to various traveler preferences, with benefits ranging from $800 to $2,000 annually and welcome bonuses of 80,000 to 125,000 miles.",
      "url": "https://www.sahmcapital.com/news/content/united-airlines-and-jpmorgan-roll-out-exclusive-benefits-for-new-mileageplus-cardholders-including-welcome-bonuses-2025-03-24",
      "source": "Sahm",
      "published": "20250324T221101",
      "overall_sentiment_score": 0.282915,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.282508,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.933296
    },
    {
      "title": "JP Morgan to turn Lagos office into full branch as Africa merchant banking expansion gathers pace",
      "summary": "JP Morgan is converting its Lagos representative office into a full-service branch and has applied for a merchant banking license, signaling a major expansion of its African operations. This move will allow JP Morgan to offer dollar loans and a broader range of financial services beyond advisory roles, competing with other global banks in key African markets like Nigeria, Kenya, and Côte d’Ivoire. The expansion reflects a strategic bet on Nigeria's long-term potential, despite short-term challenges, and aims to capitalize on the growing financial opportunities across the continent.",
      "url": "https://financeinafrica.com/news/jp-morgan-lagos-office-expansion/",
      "source": "Finance in Africa",
      "published": "20250402T080903",
      "overall_sentiment_score": 0.249567,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.413996,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Active Fixed Income ETFs Continue to See Strong Interest",
      "summary": "Active ETFs, particularly in the fixed income sector, have seen significant adoption by advisors, with 40% having allocations by the end of 2024. While active management can be challenging in equities, over 63% of active bond strategies outperformed their passive peers in 2024, highlighting their potential in the fixed income space. Funds like the Fidelity Limited Term Bond ETF (FLTB) and the Fidelity Corporate Bond ETF (FCOR) offer examples for advisors considering active fixed income allocations.",
      "url": "https://etfdb.com/active-etf-content-hub/active-fixed-income-etfs-still-garner-strong-interest/",
      "source": "ETF Database",
      "published": "20250403T230902",
      "overall_sentiment_score": 0.321614,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.274578,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.646732
    },
    {
      "title": "Stick With Investment-Grade Corporate Bonds Amid Uncertainty",
      "summary": "Amidst market uncertainty, fixed income investors are advised to consider investment-grade corporate bonds for a balance between yield and credit risk. While macroeconomic factors and geopolitical risks are causing spreads between corporate bonds and Treasuries to widen, corporate profits are trending higher. The article suggests specific Vanguard ETFs for short-term, long-term, and intermediate corporate bond exposure depending on an investor's risk tolerance.",
      "url": "https://www.etftrends.com/fixed-income-channel/stick-investment-grade-corporate-bonds-amid-uncertainty/",
      "source": "ETF Trends",
      "published": "20250401T000000",
      "overall_sentiment_score": 0.05366,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.141155,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.639002
    },
    {
      "title": "BNP Paribas AM to close two ESG factor ETFs",
      "summary": "BNP Paribas Asset Management (BNPPAM) is set to close two ESG-screened factor ETFs, the BNP Paribas Easy ESG Low Vol US UCITS ETF (EVOU) and the BNP Paribas Easy ESG Momentum Europe UCITS ETF (EMOM), due to low demand and assets reaching a level that no longer permits efficient management. The liquidation is scheduled for May 14, 2025, reflecting a broader trend of investors moving away from ESG ETFs amid regulatory confusion and greenwashing concerns.",
      "url": "https://www.etfstream.com/articles/bnp-paribas-am-to-close-two-esg-factor-etfs",
      "source": "ETF Stream",
      "published": "20250331T000000",
      "overall_sentiment_score": -0.216064,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.102359,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.605845
    },
    {
      "title": "Why JPMorgan, BlackRock want to 'privatize' more of your stock and bond money in volatile market",
      "summary": "Major financial institutions like JPMorgan Chase and BlackRock are expanding ETF products to Main Street investors, offering strategies traditionally reserved for high-net-worth clients, such as private credit and equity income strategies. This trend allows investors to access alternative investments and generate income in volatile markets, providing downside protection and a way to stay invested. The article highlights the increasing demand for these accessible yet sometimes less liquid investment options.",
      "url": "https://www.cnbc.com/2025/03/30/wall-street-wants-privatize-stock-bond-money-market-correction.html",
      "source": "CNBC",
      "published": "20250330T095000",
      "overall_sentiment_score": 0.240615,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.325272,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.878375
    },
    {
      "title": "J.P. Morgan Real Estate Income Trust, Inc. Expands Portfolio with Acquisitions of Two Attainable Housing Assets",
      "summary": "J.P. Morgan Real Estate Income Trust, Inc. (JPMREIT) announced the acquisition of two attainable housing assets: The Preserve at Pine Valley in Wilmington, NC ($32.1 million) and Bass Lofts in Atlanta, GA ($34.8 million). These acquisitions align with JPMREIT's strategy to invest in high-quality residential properties in high-growth markets, leveraging strong demand for rental housing in the Sunbelt region. This expands JPMREIT's total portfolio to 12 investments in the residential sector.",
      "url": "https://www.prnewswire.com/news-releases/jp-morgan-real-estate-income-trust-inc-expands-portfolio-with-acquisitions-of-two-attainable-housing-assets-302412097.html",
      "source": "PR Newswire",
      "published": "20250326T120000",
      "overall_sentiment_score": 0.219943,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.448164,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Polen Capital Expands Active ETF Lineup with Two Credit ETFs",
      "summary": "Polen Capital has launched two new active credit ETFs, the Polen Floating Rate Income ETF (PCFI) and the Polen High Income ETF (PCHI), to enhance its offerings for investors seeking income, diversification, and growth. These ETFs are managed by experienced professionals and aim to navigate dynamic markets, complementing Polen Capital's existing lineup of active ETFs. The new funds emphasize high current income and long-term capital appreciation, utilizing Polen Capital's established investment processes.",
      "url": "https://finance.yahoo.com/news/polen-capital-expands-active-etf-130000033.html",
      "source": "Yahoo Finance",
      "published": "20250324T100905",
      "overall_sentiment_score": 0.316057,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.244071,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.608104
    },
    {
      "title": "Fidelity, Vanguard Launch Bond ETFs",
      "summary": "Fidelity and Vanguard have launched new bond ETFs. This announcement comes as part of ongoing developments in financial products offered by major investment firms. The article was published on April 7, 2025, by Dinah Wisenberg Brin.",
      "url": "https://www.thinkadvisor.com/2025/04/07/fidelity-vanguard-launch-bond-etfs/",
      "source": "ThinkAdvisor",
      "published": "20250407T105300",
      "overall_sentiment_score": 0.225034,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.112128,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.642059
    }
  ]
}