{
  "ticker": "JPM",
  "date": "2025-04-28",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T12:59:35.594570",
  "source": "alpha_vantage",
  "article_count": 25,
  "articles": [
    {
      "title": "Jpmorgan Cha (JPM) Stock Price, News & Analysis",
      "summary": "JPMorgan Chase & Co. (JPM) is a leading global financial services firm operating in commercial banking, investment banking, asset management, and consumer services under the J.P. Morgan and Chase brands. The article details its business segments, digital asset initiatives, credit card partnerships, research on retirement, and capital market activities. It also provides an overview of its stock performance, recent news, SEC filings, financial highlights, and upcoming investor events.",
      "url": "https://www.stocktitan.net/overview/JPM/",
      "source": "Stock Titan",
      "published": "20250424T062930",
      "overall_sentiment_score": 0.215694,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.431002,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "JPMorgan’s Maier Sees Paradigm Shift to Active Management in ETFs",
      "summary": "JPMorgan Chief ETF Strategist Jon Maier discusses the rising popularity of actively managed ETFs, highlighting the success of funds like JEPI and JEPQ due to their income generation and lower volatility. He also emphasizes the importance of diversification, especially through fixed income and international investments, and points to a significant shift towards active management within the ETF space, as evidenced by recent flows.",
      "url": "https://www.etftrends.com/exchange-an-etf-experience-jpmorgans-maier-sees-paradigm-shift-active-management-etfs/",
      "source": "ETF Trends",
      "published": "20250417T000000",
      "overall_sentiment_score": 0.310309,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.258389,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.710595
    },
    {
      "title": "JPMorgan Chase & Co. Increases Its Stake in iShares Russell 2500 ETF (BATS:SMMD)",
      "summary": "JPMorgan Chase & Co. has increased its stake in the iShares Russell 2500 ETF (BATS:SMMD), signaling a large-scale institutional repositioning. Multiple firms expanded their exposure to mid-cap companies through this ETF, which provides access to companies ranked between 501 and 3,000 by market capitalization. The article highlights an increased institutional interest in mid-cap companies.",
      "url": "https://kalkinemedia.com/us/news/market-updates/jpmorgan-chase-co-increases-its-stake-in-ishares-russell-2500-etf-batssmmd",
      "source": "Kalkine Media",
      "published": "20250424T005800",
      "overall_sentiment_score": 0.324035,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.339357,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.708904
    },
    {
      "title": "Eastern to acquire HarborOne in $490 million deal in latest U.S. regional bank consolidation",
      "summary": "Eastern Bankshares is set to acquire HarborOne Bancorp in a $490 million stock and cash deal, reflecting a trend of consolidation among U.S. regional banks. This merger aims to strengthen Eastern's presence in the Greater Boston area and expand into Rhode Island, providing increased scale and diversification in an uncertain market. Another significant bank consolidation involves Columbia Banking System acquiring Pacific Premier Bancorp for approximately $2 billion.",
      "url": "https://www.reuters.com/business/finance/eastern-acquire-harborone-490-million-deal-latest-us-regional-bank-consolidation-2025-04-24/",
      "source": "Reuters",
      "published": "20250425T131800",
      "overall_sentiment_score": 0.257935,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.145777,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.648813
    },
    {
      "title": "Regulators approve $35bn merger of Capital One and Discover Financial",
      "summary": "The $35bn merger between Capital One and Discover Financial services has received approval from the Federal Reserve and the Office of the Comptroller of the Currency (OCC), moving the deal closer to completion. The Federal Reserve also fined Discover $100m for overcharging certain interchange fees and mandated remediation, which Capital One has committed to as a condition of approval. The acquisition is now expected to be completed on May 18, 2025, pending all necessary regulatory approvals.",
      "url": "https://www.theguardian.com/business/2025/apr/18/capital-one-discover-financial-merger",
      "source": "The Guardian",
      "published": "20250418T131400",
      "overall_sentiment_score": 0.177497,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.137395,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.648187
    },
    {
      "title": "Invesco First-Quarter ETF Unit Assets Inch Up 1.3%",
      "summary": "Invesco Ltd. reported a 1.3% increase in first-quarter assets for its ETF and index business, reaching $491 billion, despite a slight decline in overall company AUM due to market losses. The firm's flagship Invesco QQQ Trust (QQQ) saw its assets fall by 6.8% to $297.2 billion, primarily due to market depreciation. Invesco's results, along with those from other major ETF issuers, reflect mixed performance across the industry amid volatile market conditions.",
      "url": "https://www.etf.com/sections/news/invesco-first-quarter-etf-unit-assets-inch-13",
      "source": "ETF.com",
      "published": "20250422T000000",
      "overall_sentiment_score": 0.028651,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.14805,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.64318
    },
    {
      "title": "Eastern Bankshares and HarborOne Bancorp To Merge",
      "summary": "Eastern Bankshares, Inc. (Nasdaq: EBC) and HarborOne Bancorp (Nasdaq: HONE) have announced a definitive merger agreement wherein HarborOne will merge with Eastern in a stock and cash transaction valued at approximately $490 million. HarborOne shareholders will receive either 0.765 shares of Eastern common stock or $12.00 in cash per share. The merger is expected to close in Q4 2025, pending regulatory and HarborOne shareholder approvals, and aims to expand Eastern's presence in Greater Boston and Rhode Island.",
      "url": "https://www.citybiz.co/article/686681/eastern-bankshares-and-harborone-bancorp-to-merge/",
      "source": "citybiz",
      "published": "20250424T060908",
      "overall_sentiment_score": 0.358213,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.300341,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.640493
    },
    {
      "title": "Steep Rise: Why United Rentals’ Stock Climbed?",
      "summary": "United Rentals Inc. (URI) stock climbed over 10% driven by strong Q1 earnings, including an EPS of $8.86 and revenue of $3.72B, surpassing analyst expectations. The company also announced a $1.79 dividend per share and maintained an optimistic full-year revenue outlook. Analyst upgrades from Morgan Stanley and reaffirmed \"Overweight\" ratings from JPMorgan further contributed to investor confidence.",
      "url": "https://stockstotrade.com/news/united-rentals-inc-uri-news-2025_04_24/",
      "source": "StocksToTrade",
      "published": "20250424T151500",
      "overall_sentiment_score": 0.248251,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": -0.102723,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.638019
    },
    {
      "title": "Lobbying Update: $1,220,000 of MCKESSON CORPORATION & AFFILIATES U.S. ONCOLOGY AND RX SAVINGS SOLUTIONS lobbying was just disclosed | MCK Stock News",
      "summary": "MCKESSON CORPORATION & AFFILIATES disclosed $1,220,000 in lobbying expenditures for Q1 2025, focusing on various healthcare regulations, including pharmacist services, cancer treatment access, and drug pricing. The article also details recent congressional and insider trading activity in MCK stock, as well as institutional investor movements and analyst ratings for the company.",
      "url": "https://www.quiverquant.com/news/Lobbying+Update%3A+%241%2C220%2C000+of+MCKESSON+CORPORATION+%26+AFFILIATES+U.S.+ONCOLOGY+AND+RX+SAVINGS+SOLUTIONS+lobbying+was+just+disclosed",
      "source": "Quiver Quantitative",
      "published": "20250424T203800",
      "overall_sentiment_score": 0.003731,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.025491,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.637993
    },
    {
      "title": "New BlackRock S&P 500 ETF Caps Companies at 3% Weight",
      "summary": "BlackRock has launched a new ETF, iShares S&P 500 3% Capped ETF (TOPC), designed to offer capped exposure to S&P 500 equities by limiting any single company's weight to a maximum of 3%. This fund aims to address concentration risk and provide investors with a more diversified large-cap weighting, particularly in the tech and financial sectors. With a net expense ratio of 9 basis points after a fee waiver, TOPC redistributes excess weight from large companies to smaller ones within the index.",
      "url": "https://etfdb.com/news/2025/04/16/new-blackrock-etf-topc-caps-companies-3-weight/",
      "source": "ETF Database",
      "published": "20250416T203925",
      "overall_sentiment_score": 0.181071,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.12228,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.637443
    },
    {
      "title": "Eastern Bankshares to acquire HarborOne Bancorp in $490m stock and cash deal",
      "summary": "Eastern Bankshares is set to acquire HarborOne Bancorp in a $490 million stock and cash deal, expanding Eastern Bankshares' footprint across New England. The merger agreement allows HarborOne Bancorp shareholders to elect either 0.765 shares of Eastern Bankshares common stock or $12 in cash per share, with an allocation mechanism ensuring a 75% to 85% stock consideration. The deal is expected to close in Q4 2025, pending regulatory and shareholder approvals.",
      "url": "https://www.banking-gateway.com/news/eastern-bankshares-to-acquire-harborone-bancorp-in-490m-stock-and-cash-deal/",
      "source": "NS Banking",
      "published": "20250425T000000",
      "overall_sentiment_score": 0.344497,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.136078,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.630117
    },
    {
      "title": "GLDM Stock Price, News & Analysis | SPDR® Gold MiniShares",
      "summary": "This article provides an in-depth analysis of SPDR® Gold MiniShares (GLDM), a trust that offers investors exposure to gold. It details GLDM's structure as a series of World Gold Trust, its sponsorship by WGC USA Asset Management Company, LLC, and its listing on NYSE Arca. The document also highlights GLDM's custody arrangements, noting JPMorgan Chase Bank, N.A. as the sole custodian for its gold, following the termination of previous agreements with ICBC Standard Bank plc.",
      "url": "https://www.stocktitan.net/overview/GLDM/",
      "source": "Stock Titan",
      "published": "20250425T130134",
      "overall_sentiment_score": 0.197455,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.134065,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.625445
    },
    {
      "title": "Fusão pode criar maior empresa de cartão de crédito dos EUA; entenda",
      "summary": "A Capital One recebeu aprovação do Federal Reserve e do Gabinete do Controlador da Moeda para adquirir e se fundir com a Discover Financial Services, podendo criar a maior empresa de cartão de crédito dos EUA. O acordo, que envolverá apenas ações, oferece à Capital One a capacidade de processar transações internamente e uma nova fonte de receita. Embora a fusão possa beneficiar clientes Discover com maior aceitação, há o risco de taxas de juros mais altas para alguns, especialmente para clientes com pontuações de crédito mais baixas atendidos pelo Capital One.",
      "url": "https://www.cnnbrasil.com.br/economia/negocios/fusao-pode-criar-maior-empresa-de-cartao-de-credito-dos-eua-entenda/",
      "source": "CNN Brasil",
      "published": "20250418T183500",
      "overall_sentiment_score": 0.208936,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.109231,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.624329
    },
    {
      "title": "Charles Schwab CEO eyes spot Bitcoin trading by April 2026",
      "summary": "Charles Schwab CEO Rick Wurster is reportedly planning to launch spot Bitcoin trading services by April 2026, driven by a 400% increase in traffic to Schwab's crypto website and an anticipated favorable regulatory environment following Donald Trump's re-election. Schwab has also partnered with Trump Media and Technology Group to provide customized ETFs and crypto services for the upcoming \"Truth.Fi\" platform, aiming to integrate digital assets with traditional finance.",
      "url": "https://br.tradingview.com/news/cointelegraph%3A076296adc094b%3A0-charles-schwab-ceo-eyes-spot-bitcoin-trading-by-april-2026/",
      "source": "TradingView – Acompanhe todos os mercados",
      "published": "20250419T115730",
      "overall_sentiment_score": 0.183421,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.209961,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.619406
    },
    {
      "title": "On-Demand Webinar: The Evolution of Exchange Traded Funds",
      "summary": "This on-demand webinar from etf.com discusses the rapid growth and opportunities in active ETFs, highlighting their significantly higher organic growth rate compared to passive ETFs in 2024. Hosted by Sumit Roy, Senior ETF Analyst at etf.com, and featuring Sandra Testani of American Century Investments, the webinar explores how active ETFs can be used to construct diversified, tax-efficient, and cost-effective portfolios. The discussion emphasizes the strong momentum behind active ETFs as investors increasingly seek their structural benefits and innovative potential.",
      "url": "https://www.etf.com/sections/webinars/the-evolution-of-exchange-traded-funds",
      "source": "ETF.com",
      "published": "20250421T050358",
      "overall_sentiment_score": 0.22176,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.242685,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.614582
    },
    {
      "title": "TPG Stock Price, News & Analysis",
      "summary": "TPG Inc. (NASDAQ: TPG) is a global alternative asset management firm founded in 1992, specializing in private equity, impact, credit, real estate, and market solutions. The company trades on the Nasdaq Global Select Market and has a market capitalization of $9.6 billion. Recent activities include a strategic partnership with Jackson Financial Inc. and regular updates through SEC filings, detailing financial results, corporate actions, and dividend declarations from associated entities like TPG RE Finance Trust and TPG Mortgage Investment Trust, Inc.",
      "url": "https://www.stocktitan.net/overview/TPG/",
      "source": "Stock Titan",
      "published": "20250425T232718",
      "overall_sentiment_score": 0.158247,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.123179,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.613684
    },
    {
      "title": "First American Financial names new CEO and CFO",
      "summary": "First American Financial Corporation has announced significant leadership changes, appointing Mark E. Seaton as its new CEO, succeeding Ken DeGiorgio. Concurrently, Matt F. Wajner has been promoted to CFO, taking over Seaton's previous role. These appointments come as the company continues its 136-year history of real estate transaction solutions, reporting $6.1 billion in revenue for 2024.",
      "url": "https://www.mpamag.com/us/mortgage-industry/industry-moves/first-american-financial-names-new-ceo-and-cfo/532418",
      "source": "Mortgage Professional America",
      "published": "20250416T000000",
      "overall_sentiment_score": 0.076018,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.129088,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.605495
    },
    {
      "title": "NXP Semiconductors N.V. to Announce First Quarter 2025 Financial Results and Host Earnings Conference Call",
      "summary": "NXP Semiconductors N.V. will release its Q1 2025 financial results on April 28, 2025, after market close, followed by a conference call on April 29, 2025, at 8:00 a.m. EDT. The company, which reported $12.61 billion in revenue in 2024, will provide details on how to register for the webcast and access the replay. The article also includes details on congressional stock trading, hedge fund activity, and analyst ratings for NXPI.",
      "url": "https://www.nasdaq.com/articles/nxp-semiconductors-nv-announce-first-quarter-2025-financial-results-and-host-earnings",
      "source": "Nasdaq",
      "published": "20250417T081300",
      "overall_sentiment_score": 0.15543,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.149248,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.604244
    },
    {
      "title": "Why Fidelity’s Dividend ETF (FDVV) Is a Safe Haven in Today’s Market",
      "summary": "The Fidelity High Dividend ETF (FDVV) offers investors a blend of safety and income through exposure to diversified large-cap dividend-paying businesses. Its significant yield of 3.28% and relative resilience make it attractive for those seeking compounding opportunities and portfolio growth, especially in uncertain economic times. With a low expense ratio of 0.16%, FDVV provides a cost-effective way to invest in established companies that can withstand market volatility.",
      "url": "https://247wallst.com/investing/2025/04/22/why-fidelitys-dividend-etf-fdvv-is-a-safe-haven-in-todays-market/",
      "source": "24/7 Wall St.",
      "published": "20250422T113300",
      "overall_sentiment_score": 0.349641,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.2664,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.603305
    },
    {
      "title": "Why Is eBay Stock Trading Higher On Wednesday?",
      "summary": "eBay Inc. stock rose after announcing a global payment partnership with Checkout.com to enhance the user experience and strengthen its digital payments infrastructure. This collaboration aims to prioritize security, speed, and ease of use in payment processing for eBay's massive global marketplace. The company's Vice President of Global Payments highlighted that this alliance aligns with eBay's vision for growth through financial services innovation.",
      "url": "https://www.benzinga.com/25/04/44846653/whats-going-on-with-ebay-stock-today",
      "source": "Benzinga",
      "published": "20250416T150852",
      "overall_sentiment_score": 0.143584,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.230273,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.601442
    },
    {
      "title": "BIGZ Stock Price, News & Analysis",
      "summary": "BlackRock Innovation and Growth Term Trust (BIGZ) is undergoing significant strategic changes. These include a new investment policy to focus at least 80% of assets on technology companies and privately held companies, a change in its name to BlackRock Technology and Private Equity Term Trust, and a new ticker symbol, BTX, effective around February 20, 2025. The fund also has a managed distribution plan and has engaged in tender offers for its shares.",
      "url": "https://www.stocktitan.net/overview/BIGZ/",
      "source": "Stock Titan",
      "published": "20250425T122720",
      "overall_sentiment_score": 0.165809,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.112141,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.597363
    },
    {
      "title": "SEC Delays Staking Decision on Grayscale's ETHE, ETH",
      "summary": "The SEC has delayed its decision on whether to permit \"staking\" in Grayscale's Ethereum ETFs (ETHE and ETH) and on in-kind redemptions for VanEck's Bitcoin and Ethereum ETFs until June 1. This delay comes shortly after Paul Atkins was named SEC Commissioner, signaling a potentially more crypto-friendly stance compared to previous regulatory approaches. The decision is crucial for the crypto industry, especially after Ethereum ETFs have faced significant outflows and price declines.",
      "url": "https://www.etf.com/sections/news/sec-delays-staking-decision-grayscales-ethe-eth",
      "source": "ETF.com",
      "published": "20250415T000000",
      "overall_sentiment_score": 0.16619,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.022177,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.573896
    },
    {
      "title": "VanEck to Launch New ETF Tracking Crypto Stocks",
      "summary": "VanEck has received SEC approval to launch a new actively managed ETF, the Onchain Economy ETF (NODE), which will invest in crypto-related stocks. The ETF will allocate at least 80% of its net assets to \"Digital Transformation Companies and/or Digital Asset Instruments\" and will have a management fee of 0.69%. This move further solidifies VanEck's presence in the digital assets space, following other crypto-related product launches and investments.",
      "url": "https://www.etf.com/sections/news/vaneck-launch-new-etf-tracking-crypto-stocks",
      "source": "ETF.com",
      "published": "20250417T000000",
      "overall_sentiment_score": 0.358042,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.251955,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.571958
    },
    {
      "title": "Start Investing",
      "summary": "This article from Grayscale provides guidance on how to invest with them, outlining options for ETF products, publicly traded funds, and private funds tailored for eligible accredited investors. It details Grayscale's product lifecycle, from private placement to eventual ETF conversion, and lists examples of products at the private placement stage.",
      "url": "https://www.grayscale.com/invest",
      "source": "Grayscale",
      "published": "20250423T040905",
      "overall_sentiment_score": 0.231788,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.291562,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.561101
    },
    {
      "title": "Flotek Acquires Innovative Mobile Power Generation Assets and Secures Multi-Year Lease Providing $160 Million Revenue Backlog and Immediate Earnings Accretion",
      "summary": "Flotek Industries, Inc. has acquired power generation assets and related intellectual property from ProFrac GDM, LLC for $105 million, concurrently securing a six-year dry lease agreement for these assets with ProFrac GDM. This strategic move provides Flotek with an entry point into the mobile power generation sector, expanding its Data Analytics segment and projected to generate approximately $14 million in high-margin rental revenue in 2025, increasing to $27.4 million annually by 2026. The acquisition also establishes a scalable platform for future growth and offers a turnkey solution for remote power generation applications.",
      "url": "https://www.prnewswire.com/news-releases/flotek-acquires-innovative-mobile-power-generation-assets-and-secures-multi-year-lease-providing-160-million-revenue-backlog-and-immediate-earnings-accretion-302439980.html",
      "source": "PR Newswire",
      "published": "20250428T160500",
      "overall_sentiment_score": 0.218939,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.136722,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.551827
    }
  ]
}