{
  "ticker": "JPM",
  "date": "2025-02-03",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T12:58:39.201389",
  "source": "alpha_vantage",
  "article_count": 15,
  "articles": [
    {
      "title": "These ETFs aim to multiply the stock market's dividends. Here’s how they work",
      "summary": "Franklin Templeton has launched two new ETFs, XUDV and XIDV, designed for income-hungry investors seeking multiplied dividends without leverage. These funds utilize custom indexes with unique weighting and inclusion rules, aiming for higher dividend yields than standard market indexes. The new ETFs enter a market where traditional dividend funds have seen outflows, offering a competitive and innovative approach to dividend investing.",
      "url": "https://www.cnbc.com/2025/02/02/these-etfs-aim-to-multiply-the-stock-markets-dividends-how-they-work.html",
      "source": "CNBC",
      "published": "20250202T070800",
      "overall_sentiment_score": 0.173802,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": -0.111229,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.566083
    },
    {
      "title": "Maze Therapeutics Announces Pricing of Upsized Initial Public Offering",
      "summary": "Maze Therapeutics, Inc. announced the pricing of its upsized initial public offering of 8,750,000 shares of common stock at $16.00 per share, expecting to raise $140.0 million. The shares are anticipated to begin trading on the Nasdaq Global Market on January 31, 2025, under the symbol “MAZE.” The offering is managed by J.P. Morgan, TD Cowen, Leerink Partners, and Guggenheim Securities as joint bookrunning managers.",
      "url": "https://www.globenewswire.com/news-release/2025/01/31/3018524/0/en/Maze-Therapeutics-Announces-Pricing-of-Upsized-Initial-Public-Offering.html",
      "source": "GlobeNewswire",
      "published": "20250130T193000",
      "overall_sentiment_score": 0.429741,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.303199,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.605078
    },
    {
      "title": "Wells Fargo investment bank co-CEO to retire",
      "summary": "Jon Weiss, co-CEO of Wells Fargo's corporate and investment bank, is set to retire in June, with Fernando Rivas becoming the sole CEO. Weiss is credited with significantly increasing the division's net income and revenue during his tenure. This development comes as Wells Fargo continues to expand its investment banking business and has added numerous senior leadership roles since 2020.",
      "url": "https://www.bankingdive.com/news/wells-fargo-investment-bank-co-ceo-jon-weiss-retire-rivas-scharf/738785/",
      "source": "Banking Dive",
      "published": "20250130T000000",
      "overall_sentiment_score": 0.130463,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.109698,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.643632
    },
    {
      "title": "New ETF Blends Equity Portfolio With Derivatives Strategy",
      "summary": "The new PEO AlphaQuest Thematic PE ETF (LQPE)",
      "url": "https://www.etftrends.com/new-etf-blends-equity-portfolio-derivatives-strategy/",
      "source": "ETF Trends",
      "published": "20250128T130918",
      "overall_sentiment_score": 0.197044,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.104108,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.579497
    },
    {
      "title": "Latest news: Host might sell 10; largest Courtyard for KSA; Rosewood adds Dominican",
      "summary": "Host Hotels & Resorts is reportedly considering selling over 10 properties with a combined value exceeding $1 billion. Marriott International is set to open the world's largest Courtyard by Marriott in Makkah, Saudi Arabia, and Rosewood Hotels & Resorts is expanding into the Dominican Republic. Other notable developments include a new CEO for edyn, First Hospitality launching new verticals, Valor adding three hotels in Dubai, and Minor Hotels aiming for over 850 properties by 2027.",
      "url": "https://www.hotelinvestmenttoday.com/Deals/Mergers-and-Acquistions/Latest-news-Host-might-sell-10-largest-Courtyard-for-KSA-Rosewood-adds-Dominican",
      "source": "Hotel Investment Today",
      "published": "20250122T000000",
      "overall_sentiment_score": 0.196256,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.119258,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.571458
    },
    {
      "title": "Disc Medicine Announces Proposed Public Offering of Common Stock and Pre-Funded Warrants",
      "summary": "Disc Medicine announced a proposed underwritten offering of $200.0 million in common stock and pre-funded warrants, with an option for underwriters to purchase an additional $30.0 million. The company plans to use the net proceeds to fund research and clinical development of product candidates, support commercialization efforts for bitopertin, and for general corporate purposes. Jefferies, Leerink Partners, Stifel, and Cantor are serving as joint book-running managers for the offering.",
      "url": "https://www.globenewswire.com/news-release/2025/01/21/3013049/0/en/Disc-Medicine-Announces-Proposed-Public-Offering-of-Common-Stock-and-Pre-Funded-Warrants.html",
      "source": "GlobeNewswire",
      "published": "20250121T160100",
      "overall_sentiment_score": 0.05037,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.132884,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.603632
    },
    {
      "title": "Dimensional Fund Advisors plots European ETF entry",
      "summary": "Dimensional Fund Advisors (DFA) is preparing to enter the European ETF market by recruiting UCITS ETF specialists, including a London-based ETF capital markets specialist manager. The move follows its significant success in the US active ETF market, where it manages 38 US-listed ETFs with $155.9bn AUM. DFA's entry would challenge established players like JP Morgan Asset Management in Europe's growing active ETF space.",
      "url": "https://www.etfstream.com/articles/dimensional-fund-advisors-plots-european-etf-entry",
      "source": "ETF Stream",
      "published": "20250203T000000",
      "overall_sentiment_score": 0.227811,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.139376,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.744952
    },
    {
      "title": "Northern Trust AM exits Climate Action 100+, Net-Zero Asset Managers initiative",
      "summary": "Northern Trust Asset Management has announced its departure from both the Climate Action 100+ and the Net-Zero Asset Managers initiative. This decision aligns with a broader trend of Wall Street firms withdrawing from climate-focused alliances, particularly amid increased Republican scrutiny and a change in federal leadership. The company stated its confidence in independently managing material risks and engaging with portfolio companies to safeguard and grow client capital.",
      "url": "https://www.esgdive.com/news/northern-trust-am-exits-climate-action-100-net-zero-assert-managers-initiative/738272/",
      "source": "ESG Dive",
      "published": "20250124T000000",
      "overall_sentiment_score": -0.233207,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.209547,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.601451
    },
    {
      "title": "KeyCorp plans more hiring for wealth management, investment banking businesses",
      "summary": "KeyCorp plans to hire dozens of additional professionals in its wealth management and investment banking businesses this year, building on 170 wealth professionals hired recently. This expansion is part of a strategy to boost fee income, which has seen wealth management client assets under management reach a record $61.4 billion and investment banking fees jump 63%. Despite a net loss in 2024 due to securities portfolio repositioning, the company is optimistic about future growth in these segments.",
      "url": "https://www.crainscleveland.com/banking-finance/keycorp-hiring-wealth-management-investment-banking",
      "source": "Crain's Cleveland Business",
      "published": "20250123T145000",
      "overall_sentiment_score": 0.220875,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.126248,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.649397
    },
    {
      "title": "Martin Marietta Materials to Host Q4 and Full-Year 2024 Earnings Conference Call on February 12, 2025",
      "summary": "Martin Marietta Materials, Inc. announced its Q4 and full-year 2024 earnings conference call for February 12, 2025, during which financial results for the year ending December 31, 2024, will be discussed. The company, a leading supplier of building materials, will release results before the market opens, with a live webcast and replay available for investors. The article also details recent hedge fund activity in MLM stock.",
      "url": "https://www.quiverquant.com/news/Martin+Marietta+Materials+to+Host+Q4+and+Full-Year+2024+Earnings+Conference+Call+on+February+12%2C+2025",
      "source": "Quiver Quantitative",
      "published": "20250122T235000",
      "overall_sentiment_score": 0.164652,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.216134,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.627892
    },
    {
      "title": "The LME Wave",
      "summary": "This article discusses the rise of Liability Management Exercises (LMEs) in the credit market, driven by weak credit documentation, high debt costs, and upcoming maturities. It details various LME methods, their impact on lenders, and potential defense mechanisms, while also analyzing key credit market trends in Q4 2024 across high yield bonds, senior loans, investment grade credit, emerging markets debt, global convertibles, structured credit, and private credit. The authors conclude that LMEs are likely to continue and emphasize the importance of scale and experience for investors to navigate this dynamic.",
      "url": "https://www.oaktreecapital.com/insights/insight-commentary/market-commentary/oaktree-credit-quarterly-4q2024-the-lme-wave",
      "source": "Oaktree Capital Management",
      "published": "20250130T000000",
      "overall_sentiment_score": 0.109764,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.136377,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.696835
    },
    {
      "title": "Lazard to build out global ETF footprint",
      "summary": "Lazard Asset Management plans to expand its global ETF presence by filing for five active equity ETFs in the US. The initial suite will cover emerging markets, Japan, international equity, equity megatrends, and next-generation technologies. The firm also plans to establish an ETF team in the coming year.",
      "url": "https://www.etfstream.com/articles/lazard-to-build-out-global-etf-footprint",
      "source": "ETF Stream",
      "published": "20250120T000000",
      "overall_sentiment_score": 0.21458,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.217933,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.55599
    },
    {
      "title": "ETF Wrap: AI-powered ETFs the new focus in active",
      "summary": "This article discusses key developments in the ETF market, highlighting the emergence of AI-powered active ETFs from DWS and Ultramarin. It also covers PIMCO's asset outflows from its European UCITS ETF range and the removal of ESG labeling from S&P 500 ETFs by State Street and DWS due to new regulations. The market is seeing increased competition in active fixed income ETFs with new players and expanded offerings.",
      "url": "https://www.etfstream.com/articles/etf-wrap-ai-powered-etfs-the-new-focus-in-active",
      "source": "ETF Stream",
      "published": "20250131T000000",
      "overall_sentiment_score": 0.060245,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.114867,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.625741
    },
    {
      "title": "BlackRock launches new active CLO ETF",
      "summary": "BlackRock has introduced a new active collateralized loan obligation (CLO) ETF, the iShares BBB-B CLO Active ETF (BCLO). Managed by Saffet Ozbalci, Jason Choi, and Nidhi Patel, this ETF targets the BBB-B rated segment of the CLO market with a 0.45% expense ratio. This launch expands BlackRock's CLO offerings, which already include the $680m iShares AAA CLO Active ETF.",
      "url": "https://citywire.com/ria/news/blackrock-launches-new-active-clo-etf/a2458803",
      "source": "Citywire",
      "published": "20250130T190925",
      "overall_sentiment_score": 0.172816,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.131958,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.601066
    },
    {
      "title": "Bitwise Files for Dogecoin ETF Amid Shifting US Regulations",
      "summary": "Bitwise has filed an application for a Dogecoin exchange-traded fund with U.S. federal regulators, marking a significant step amidst a changing regulatory landscape for cryptocurrencies. This application follows the firm's registration of a statutory trust for the fund last week. If approved, the Dogecoin ETF would join Bitwise's existing Bitcoin and Ethereum ETFs, offering investors exposure to the meme coin's price movements.",
      "url": "https://decrypt.co/303214/bitwise-files-for-dogecoin-etf-amid-shifting-us-regulations",
      "source": "Decrypt",
      "published": "20250128T000000",
      "overall_sentiment_score": 0.140257,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.147175,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.622046
    }
  ]
}