{
  "ticker": "JPM",
  "date": "2025-11-24",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T13:01:58.469365",
  "source": "alpha_vantage",
  "article_count": 50,
  "articles": [
    {
      "title": "6 FOR 2026",
      "summary": "BNY's 2026 outlook addresses six essential questions for investors navigating evolving markets. The report covers the global economy, central bank policies, fixed income, the U.S. dollar, equity valuations, and the long-term winners of AI. It suggests markets are positioned for growth in a multi-dimensional environment, with opportunities arising from diverging central bank policies and the ongoing impact of AI.",
      "url": "https://www.bny.com/corporate/global/en/outlook-2026.html",
      "source": "BNY",
      "published": "20251124T220611",
      "overall_sentiment_score": 0.441444,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.322516,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.634993
    },
    {
      "title": "JPMorgan Chase Financial Company LLC Declares Quarterly Coupon on Alerian MLP Index ETN",
      "summary": "JPMorgan Chase Financial Company LLC announced the quarterly coupon amount for its Alerian MLP Index ETN (NYSE Arca: AMJB) due January 28, 2044. The coupon amount per note is $0.5006, resulting in a current yield of 6.6%. The company also provided details about JPMorgan Chase & Co. and urged investors to review the prospectus with the SEC.",
      "url": "https://www.businesswire.com/news/home/20251124927667/en/JPMorgan-Chase-Financial-Company-LLC-Declares-Quarterly-Coupon-on-Alerian-MLP-Index-ETN",
      "source": "Business Wire",
      "published": "20251124T212137",
      "overall_sentiment_score": 0.278475,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.255062,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Nuvalent Announces Closing of Public Offering of Common Stock and Full Exercise by Underwriters of Option to Purchase Additional Shares from Selling Stockholders",
      "summary": "Nuvalent, Inc. announced the closing of its underwritten public offering of 4,950,496 shares of Class A common stock at $101.00 per share, generating gross proceeds of approximately $500.0 million for the company. Additionally, the underwriters fully exercised their option to purchase an additional 742,574 shares from selling stockholders, with Nuvalent receiving no proceeds from this portion of the sale. J.P. Morgan, Jefferies, TD Cowen, and Cantor acted as joint book-running managers for the offering.",
      "url": "https://www.morningstar.com/news/pr-newswire/20251124ne32107/nuvalent-announces-closing-of-public-offering-of-common-stock-and-full-exercise-by-underwriters-of-option-to-purchase-additional-shares-from-selling-stockholders",
      "source": "Morningstar",
      "published": "20251124T210100",
      "overall_sentiment_score": 0.198782,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.137115,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.607677
    },
    {
      "title": "JPMorgan Chase Financial Company LLC Declares Quarterly Coupon on Alerian MLP Index ETN",
      "summary": "JPMorgan Chase Financial Company LLC announced a quarterly coupon payment for its Alerian MLP Index ETN (AMJB). The coupon amount is $0.5006 per Note, with a current yield of 6.6%, payable on December 9, 2025. The Notes are senior, unsecured obligations guaranteed by JPMorgan Chase & Co.",
      "url": "https://finance.yahoo.com/news/jpmorgan-chase-financial-company-llc-211500716.html",
      "source": "Yahoo Finance",
      "published": "20251124T161500",
      "overall_sentiment_score": 0.138769,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.121634,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 1.0
    },
    {
      "title": "[8-K] SKYWORKS SOLUTIONS, INC. Reports Material Event | SWKS SEC Filing - Form 8-K",
      "summary": "Skyworks Solutions, Inc. reported a material event in an 8-K SEC filing, detailing a Second Amendment to its Revolving Credit Agreement. This amendment, made with JPMorgan Chase Bank, N.A., extends the maturity date of the company's revolving credit facility to November 18, 2030, securing longer-term financing. The agreement covers the company and its borrowing subsidiaries, with full terms available in the filed exhibit.",
      "url": "https://www.stocktitan.net/sec-filings/SWKS/8-k-skyworks-solutions-inc-reports-material-event-c1f5af941fe3.html",
      "source": "Stock Titan",
      "published": "20251124T160700",
      "overall_sentiment_score": 0.14662,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.136521,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.633614
    },
    {
      "title": "JPMorgan Chase & Co. Cuts Energy Transfer (NYSE:ET) Price Target to $21.00",
      "summary": "JPMorgan Chase & Co. lowered its price target for Energy Transfer (NYSE:ET) to $21.00 from $22.00, while maintaining an \"overweight\" rating, suggesting a significant upside. This adjustment follows Energy Transfer missing quarterly EPS and revenue estimates. Despite the price target revision, insider buying by Director Kelcy L. Warren and generally positive analyst ratings indicate continued confidence in the stock.",
      "url": "https://www.marketbeat.com/instant-alerts/jpmorgan-chase-co-cuts-energy-transfer-nyseet-price-target-to-2100-2025-11-24/",
      "source": "MarketBeat",
      "published": "20251124T155227",
      "overall_sentiment_score": 0.100332,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.020662,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.857384
    },
    {
      "title": "Strategic Buyouts & Diverse Revenues Aid Raymond James Amid Cost Woes",
      "summary": "Raymond James Financial Inc. (RJF) is well-positioned for growth through strategic acquisitions and strong segment performance, supported by consistent capital distributions. However, its reliance on volatile capital markets and increasing expenses pose significant challenges. The company's future growth hinges on navigating these headwinds while continuing its acquisition strategy and maintaining a robust capital position.",
      "url": "https://www.sharewise.com/us/news_articles/Strategic_Buyouts_Diverse_Revenues_Aid_Raymond_James_Amid_Cost_Woes_Zacks_20251124_1513",
      "source": "www.sharewise.com",
      "published": "20251124T151300",
      "overall_sentiment_score": 0.219261,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.292153,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.603081
    },
    {
      "title": "Vestor Capital LLC Acquires 183,163 Shares of Air Products and Chemicals, Inc. $APD",
      "summary": "Vestor Capital LLC significantly increased its holdings in Air Products and Chemicals Inc. (APD), purchasing an additional 183,163 shares, making it their 10th-largest holding. This comes amidst mixed analyst ratings and price target cuts from several brokerage firms, although the consensus remains a \"Moderate Buy.\" Air Products and Chemicals recently beat EPS expectations but missed revenue, while also announcing a quarterly dividend and providing FY2026 guidance.",
      "url": "https://www.marketbeat.com/instant-alerts/filing-vestor-capital-llc-acquires-183163-shares-of-air-products-and-chemicals-inc-apd-2025-11-23/",
      "source": "MarketBeat",
      "published": "20251124T143008",
      "overall_sentiment_score": -0.061024,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.127917,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.611213
    },
    {
      "title": "Left Brain Wealth Management LLC Purchases New Stake in Rollins, Inc. $ROL",
      "summary": "Left Brain Wealth Management LLC has acquired a new position in Rollins, Inc. (NYSE:ROL) during the second quarter, purchasing 54,946 shares valued at approximately $3.1 million. Other institutional investors also increased their stakes significantly, leading to institutional ownership of 51.79% in the company. Rollins recently beat earnings expectations, reported strong revenue growth, increased its quarterly dividend, and maintains a \"Moderate Buy\" consensus rating from analysts.",
      "url": "https://www.marketbeat.com/instant-alerts/filing-left-brain-wealth-management-llc-purchases-new-stake-in-rollins-inc-rol-2025-11-23/",
      "source": "MarketBeat",
      "published": "20251124T141005",
      "overall_sentiment_score": 0.234446,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.218,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.641479
    },
    {
      "title": "C's CFO Transition & U.S. Banking Revamp: A Move Toward Future Growth?",
      "summary": "Citigroup (C) is undergoing significant leadership changes and a strategic reorganization of its U.S. consumer business. CFO Mark Mason will step down, succeeded by Gonzalo Luchetti, while the company integrates Retail Banking into its Wealth business and elevates U.S. Consumer Cards to a core business. These moves aim to boost profitability, streamline operations, and enhance Citigroup's competitive position in its ongoing transformation.",
      "url": "https://sg.finance.yahoo.com/news/cs-cfo-transition-u-banking-140600327.html",
      "source": "Yahoo Finance Singapore",
      "published": "20251124T140600",
      "overall_sentiment_score": 0.222767,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.06962,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.630081
    },
    {
      "title": "Act Two Investors LLC Sells 63,951 Shares of NXP Semiconductors N.V. $NXPI",
      "summary": "Act Two Investors LLC decreased its stake in NXP Semiconductors N.V. by 58.7% during Q2, selling 63,951 shares and now owning 45,020 shares valued at $9.84 million. Other institutional investors like Wellington Management Group LLP and Boston Partners increased their holdings. The article also details recent analyst ratings, financial performance, and insider selling activities for NXP Semiconductors.",
      "url": "https://www.marketbeat.com/instant-alerts/filing-act-two-investors-llc-sells-63951-shares-of-nxp-semiconductors-nv-nxpi-2025-11-24/",
      "source": "MarketBeat",
      "published": "20251124T133613",
      "overall_sentiment_score": 0.178173,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.138558,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.641799
    },
    {
      "title": "Prudential Financial Inc. Has $133.38 Million Stock Position in Lam Research Corporation $LRCX",
      "summary": "Prudential Financial Inc. increased its stake in Lam Research Corporation by 3.9% in the second quarter, bringing its total holdings to 1,370,288 shares valued at $133.38 million. Other institutional investors also adjusted their positions in the company, which reported strong Q3 earnings and announced a quarterly dividend. Insider selling activity and various analyst ratings with updated price targets were also detailed.",
      "url": "https://www.marketbeat.com/instant-alerts/filing-prudential-financial-inc-has-13338-million-stock-position-in-lam-research-corporation-lrcx-2025-11-24/",
      "source": "MarketBeat",
      "published": "20251124T121213",
      "overall_sentiment_score": 0.271354,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.210456,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.619544
    },
    {
      "title": "JPMorgan Chase & Co. Has $861.48 Million Holdings in Raymond James Financial, Inc. $RJF",
      "summary": "JPMorgan Chase & Co. significantly increased its stake in Raymond James Financial, Inc. by 41.6% in Q2, bringing its total holdings to 5,616,998 shares valued at approximately $861.48 million. Raymond James Financial also reported strong quarterly earnings, beating analyst estimates with $3.11 EPS and $3.73 billion in revenue, accompanied by solid financial metrics like an 18.33% ROE. Analysts currently have an average \"Hold\" rating on the stock with a price target of $177.20.",
      "url": "https://www.marketbeat.com/instant-alerts/filing-jpmorgan-chase-co-has-86148-million-holdings-in-raymond-james-financial-inc-rjf-2025-11-23/",
      "source": "MarketBeat",
      "published": "20251124T120650",
      "overall_sentiment_score": 0.204935,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.296332,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.889939
    },
    {
      "title": "Neo Ivy Capital Management Acquires New Stake in Ulta Beauty Inc. $ULTA",
      "summary": "Neo Ivy Capital Management has acquired a new stake of 856 shares worth $400,000 in Ulta Beauty Inc. (ULTA) during Q2, increasing institutional ownership to 90.39%. This move comes as analysts raise price targets for ULTA to around $600, with the company recently beating earnings and revenue expectations. Several other institutional investors, including T. Rowe Associates Inc. MD and JPMorgan Chase & Co., also significantly boosted their holdings in Ulta Beauty.",
      "url": "https://www.marketbeat.com/instant-alerts/filing-neo-ivy-capital-management-acquires-new-stake-in-ulta-beauty-inc-ulta-2025-11-23/",
      "source": "MarketBeat",
      "published": "20251124T115211",
      "overall_sentiment_score": 0.327541,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.306761,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.600052
    },
    {
      "title": "Strategy Inc (MSTR) Stock Today, November 26, 2025: Short Seller Exit, MSCI Index Risk and a $5.1B Bitcoin Move",
      "summary": "Strategy Inc (MSTR) stock saw a bounce on November 26, 2025, after a multi-week slide, influenced by short covering and Bitcoin's stabilization. Key developments included legendary short seller Jim Chanos closing his MSTR short position, rising interest and dividend costs for Strategy, and significant MSCI index exclusion risk. Additionally, Strategy Inc moved $5.1 billion in Bitcoin from Coinbase to Fidelity, diversifying its custody arrangements.",
      "url": "https://ts2.tech/en/strategy-inc-mstr-stock-today-november-26-2025-short-seller-exit-msci-index-risk-and-a-5-1b-bitcoin-move/",
      "source": "ts2.tech",
      "published": "20251124T110936",
      "overall_sentiment_score": -0.208241,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.240361,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.559892
    },
    {
      "title": "Charles Schwab Investment Management Inc. Reduces Stock Holdings in Parker-Hannifin Corporation $PH",
      "summary": "Charles Schwab Investment Management Inc. reduced its stake in Parker-Hannifin Corporation by 0.1% in Q2 2025, selling 1,070 shares and retaining 1,593,277 shares valued at $1.113 billion. Other institutional investors adjusted their holdings, and the company reported strong quarterly earnings, beating analyst estimates, and provided positive FY2026 EPS guidance while declaring a quarterly dividend. Analysts maintain a \"Moderate Buy\" consensus rating with a target price of $860.71, despite recent insider selling.",
      "url": "https://www.marketbeat.com/instant-alerts/filing-charles-schwab-investment-management-inc-reduces-stock-holdings-in-parker-hannifin-corporation-ph-2025-11-23/",
      "source": "MarketBeat",
      "published": "20251124T102447",
      "overall_sentiment_score": 0.199971,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.136117,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.571055
    },
    {
      "title": "Covalis Capital LLP Makes New Investment in United Airlines Holdings Inc $UAL",
      "summary": "Covalis Capital LLP initiated a new position in United Airlines Holdings Inc (NASDAQ:UAL) during Q2 2025, acquiring 10,393 shares valued at approximately $828,000. Other institutional investors also significantly increased their stakes in UAL, contributing to 69.69% institutional ownership. United Airlines reported strong Q3 earnings, beating estimates and providing optimistic Q4 2025 guidance, with analysts maintaining a \"Buy\" rating and an average price target of $125.38.",
      "url": "https://www.marketbeat.com/instant-alerts/filing-covalis-capital-llp-makes-new-investment-in-united-airlines-holdings-inc-ual-2025-11-23/",
      "source": "MarketBeat",
      "published": "20251124T095215",
      "overall_sentiment_score": 0.164273,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.130868,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.630458
    },
    {
      "title": "Charles Schwab Investment Management Inc. Has $543.77 Million Position in WEC Energy Group, Inc. $WEC",
      "summary": "Charles Schwab Investment Management Inc. increased its stake in WEC Energy Group, Inc. by 0.2% in the second quarter, bringing its total holdings to 5,221,475 shares valued at over $543 million. Other institutional investors also adjusted their positions in WEC, with the company's stock showing a market capitalization of $36.13 billion and a P/E ratio of 21.00. Analysts have a \"Moderate Buy\" consensus rating for WEC, with an average price target of $120.21.",
      "url": "https://www.marketbeat.com/instant-alerts/filing-charles-schwab-investment-management-inc-has-54377-million-position-in-wec-energy-group-inc-wec-2025-11-24/",
      "source": "MarketBeat",
      "published": "20251124T094603",
      "overall_sentiment_score": 0.203168,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.123604,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.641964
    },
    {
      "title": "Wall Street giants including BlackRock dump MicroStrategy shares",
      "summary": "Major Wall Street institutions, including BlackRock and JPMorgan Chase, significantly reduced their MicroStrategy (MSTR) holdings in Q3 2025, divesting $5.38 billion. This comes amidst a challenging period for the Bitcoin-heavy company, facing scrutiny over its valuation model and potential delisting from key equity indices like MSCI due to its digital asset treasury model. The firm's stock has plunged, reflecting broader crypto market downturns and institutional concerns.",
      "url": "https://www.thestreet.com/crypto/markets/wall-street-blackrock-dump-microstrategy-shares",
      "source": "TheStreet",
      "published": "20251124T094600",
      "overall_sentiment_score": -0.121109,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.140315,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.61068
    },
    {
      "title": "Franklin Resources Inc. Sells 62,290 Shares of American Electric Power Company, Inc. $AEP",
      "summary": "Franklin Resources Inc. reduced its stake in American Electric Power Company, Inc. by 4.3% in the last quarter, selling 62,290 shares and now owning 1,375,712 shares worth $142.74 million. Other institutional investors like Legal & General Group Plc and Swiss National Bank increased their holdings, while insider selling by Director Benjamin G. S. Fowke III and EVP Kelly J. Ferneau also occurred. The article also provides details on AEP's financial performance, dividend increase, and recent analyst ratings.",
      "url": "https://www.marketbeat.com/instant-alerts/filing-franklin-resources-inc-sells-62290-shares-of-american-electric-power-company-inc-aep-2025-11-24/",
      "source": "MarketBeat",
      "published": "20251124T093225",
      "overall_sentiment_score": 0.130475,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.308324,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.61625
    },
    {
      "title": "Ensign Peak Advisors Inc Sells 21,051 Shares of Raymond James Financial, Inc. $RJF",
      "summary": "Ensign Peak Advisors Inc significantly reduced its stake in Raymond James Financial (RJF) by selling 21,051 shares, decreasing its holdings by 23.4% to 68,818 shares valued at approximately $10.56 million. Despite this insider selling, institutional investors collectively own 83.83% of RJF, and the company recently surpassed quarterly earnings estimates with $3.11 EPS and $3.73 billion in revenue. Analysts maintain a \"Hold\" consensus rating with an average target price of $177.20, though some have raised their price targets up to $190.00.",
      "url": "https://www.marketbeat.com/instant-alerts/filing-ensign-peak-advisors-inc-sells-21051-shares-of-raymond-james-financial-inc-rjf-2025-11-24/",
      "source": "MarketBeat",
      "published": "20251124T090800",
      "overall_sentiment_score": 0.07242,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.122322,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.637395
    },
    {
      "title": "JPMorgan faces major boycott after fresh crypto debanking allegations",
      "summary": "JPMorgan is facing backlash and calls for a boycott from the crypto community after fresh debanking allegations and its role in MSCI’s proposed rule changes affecting Bitcoin-treasury companies like MicroStrategy. The controversy reignites \"Operation Chokepoint 2.0\" concerns, with Strike CEO Jack Mallers revealing his accounts were terminated by JPMorgan and MicroStrategy's founder Michael Saylor defending his company's treasury strategy. The situation is unfolding at a vulnerable time for the crypto market, with Bitcoin and crypto-levered equities experiencing significant declines.",
      "url": "https://www.thestreet.com/crypto/policy/jpmorgan-faces-major-boycott-after-fresh-crypto-debanking-allegations",
      "source": "TheStreet",
      "published": "20251124T083600",
      "overall_sentiment_score": 0.002715,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.014962,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.34943
    },
    {
      "title": "Adobe announces $1.9b deal to acquire Semrush",
      "summary": "Adobe has agreed to acquire Semrush Holdings, Inc. for approximately $1.9 billion in an all-cash transaction. This acquisition aims to combine Adobe and Semrush's tools to provide marketers with enhanced brand visibility across various digital channels, including websites, search engines, and large language models. The deal, approved by both boards, is expected to close in the first half of 2026, pending regulatory approvals.",
      "url": "https://marketech-apac.com/adobe-announces-1-9b-deal-to-acquire-semrush/",
      "source": "marketech apac",
      "published": "20251124T065141",
      "overall_sentiment_score": 0.372168,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.30193,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.637153
    },
    {
      "title": "Analysts’ Top Technology Picks: Shift4 Payments (FOUR), Monday.com (MNDY)",
      "summary": "This article highlights bullish sentiments from analysts for Shift4 Payments (FOUR) and Monday.com (MNDY) in the Technology sector. Benchmark Co. reiterated a Buy rating for Shift4 Payments with a $100 price target, while J.P. Morgan maintained a Buy rating for Monday.com with a $285 price target. Both companies are seen to have significant upside potential according to analyst consensus.",
      "url": "https://www.theglobeandmail.com/investing/markets/stocks/FOUR/pressreleases/36045961/analysts-top-technology-picks-shift4-payments-four-mondaycom-mndy/",
      "source": "The Globe and Mail",
      "published": "20251124T060929",
      "overall_sentiment_score": 0.394842,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.309061,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.62337
    },
    {
      "title": "Bowhead Specialty Holdings Inc. Prices Senior Notes Offering",
      "summary": "Bowhead Specialty Holdings Inc. announced the pricing of a public offering of $150 million aggregate principal amount of its 7.750% Senior Notes due 2030, expected to close on November 25, 2025. The company plans to use the net proceeds to capitalize its insurance subsidiary for business growth and for general corporate purposes. Keefe, Bruyette & Woods, Piper Sandler, and J.P. Morgan are serving as joint book-running managers for the offering.",
      "url": "https://aijourn.com/bowhead-specialty-holdings-inc-prices-senior-notes-offering/",
      "source": "The AI Journal",
      "published": "20251124T052307",
      "overall_sentiment_score": 0.215424,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.127138,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.6366
    },
    {
      "title": "Bank of New York Mellon Corp Sells 199,158 Shares of Dynavax Technologies Corporation $DVAX",
      "summary": "Bank of New York Mellon Corp significantly reduced its stake in Dynavax Technologies (NASDAQ:DVAX), selling 199,158 shares and trimming its holdings by 22.4%. Despite mixed analyst ratings leading to a \"Hold\" consensus, Dynavax recently surpassed quarterly earnings and revenue estimates. The stock currently trades around $11.18, with institutional investors holding a substantial 96.96% of its shares.",
      "url": "https://www.marketbeat.com/instant-alerts/filing-bank-of-new-york-mellon-corp-sells-199158-shares-of-dynavax-technologies-corporation-dvax-2025-11-22/",
      "source": "MarketBeat",
      "published": "20251124T052232",
      "overall_sentiment_score": 0.100396,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.037359,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.637303
    },
    {
      "title": "RiverNorth/DoubleLine Strategic Opportunity Fund, Inc. Announces Final Results of Rights Offering",
      "summary": "RiverNorth/DoubleLine Strategic Opportunity Fund, Inc. (NYSE: OPP) has announced the final results of its transferable rights offering, which closed on November 18, 2025. The Fund will issue 1,180,525 new shares of common stock at a subscription price of $7.94 per share, generating approximately $9.4 million in gross proceeds. The investment objective of the Fund is current income and overall total return, with approximately $211.9 million of total net assets as of October 31, 2025.",
      "url": "https://www.theglobeandmail.com/investing/markets/stocks/OPP/pressreleases/36239790/rivernorthdoubleline-strategic-opportunity-fund-inc-announces-final-results-of-rights-offering/",
      "source": "The Globe and Mail",
      "published": "20251124T043248",
      "overall_sentiment_score": 0.039528,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.011396,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.565612
    },
    {
      "title": "Regal Rexnord enters new $2.35 billion credit agreement with JPMorgan Chase",
      "summary": "Regal Rexnord Corp (NYSE:RRX) has secured a new $2.35 billion credit agreement with a syndicate of financial institutions, with JPMorgan Chase Bank, N.A. acting as administrative agent. This agreement includes an $850 million unsecured delayed draw term loan and a $1.5 billion unsecured revolving line of credit. The company plans to use these facilities to refinance existing debt, fund working capital and capital expenditures, and for general corporate purposes, with a specific focus on refinancing its 6.050% Senior Notes due 2026.",
      "url": "https://www.investing.com/news/sec-filings/regal-rexnord-enters-new-235-billion-credit-agreement-with-jpmorgan-chase-93CH-4378373",
      "source": "Investing.com",
      "published": "20251124T042319",
      "overall_sentiment_score": 0.327043,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.230137,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.705492
    },
    {
      "title": "Hackers steal customer data from JPMorgan Chase and Citi",
      "summary": "Hackers have stolen customer data from a third-party company named SitusAMC, which is used by major Wall Street banks including JPMorgan Chase and Citi. SitusAMC, a company that processes mortgage applications among other real estate loans, confirmed that corporate data and customer-related information have been compromised. The FBI is currently investigating the incident, highlighting the vulnerability of financial security through third-party vendors.",
      "url": "https://9to5mac.com/2025/11/24/hackers-steal-customer-data-from-jpmorgan-chase-and-citi/",
      "source": "9to5Mac",
      "published": "20251124T041300",
      "overall_sentiment_score": -0.36437,
      "overall_sentiment_label": "Bearish",
      "ticker_sentiment_score": -0.419907,
      "ticker_sentiment_label": "Bearish",
      "relevance_score": 1.0
    },
    {
      "title": "FlexShares Ultra-Short Income Fund (NYSEARCA:RAVI) Trading Up 0% – Should You Buy?",
      "summary": "FlexShares Ultra-Short Income Fund (NYSEARCA:RAVI) saw its stock price trade up 0% during mid-day trading with substantial trading volume. Institutional investors have been actively increasing their stakes in RAVI, indicating growing interest in the fund. RAVI is an actively managed ETF that invests in ultra-short-term investment-grade debt.",
      "url": "https://www.defenseworld.net/2025/11/20/flexshares-ultra-short-income-fund-nysearcaravi-trading-up-0-should-you-buy.html",
      "source": "Defense World",
      "published": "20251124T041122",
      "overall_sentiment_score": 0.235233,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.21235,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.567907
    },
    {
      "title": "Hawthorn Bancshares (NASDAQ:HWBK) Downgraded by Wall Street Zen to \"Hold\"",
      "summary": "Wall Street Zen downgraded Hawthorn Bancshares (NASDAQ:HWBK) from a \"buy\" to a \"hold\" rating, aligning with Weiss Ratings' reissued \"hold (c)\" rating, resulting in a consensus \"Hold\" for the stock. The company recently reported $0.88 EPS on $17.25 million revenue, with institutional investors holding approximately 30.73% of the stock. Shares opened at $32.75, with a market capitalization of $225.91 million.",
      "url": "https://www.marketbeat.com/instant-alerts/hawthorn-bancshares-nasdaqhwbk-downgraded-by-wall-street-zen-to-hold-2025-11-23/",
      "source": "MarketBeat",
      "published": "20251124T041003",
      "overall_sentiment_score": -0.090331,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.1372,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.648253
    },
    {
      "title": "C1 Fund Inc. Adds Alchemy to Portfolio of Leading Digital Asset Infrastructure Companies",
      "summary": "C1 Fund Inc. announced its investment in Alchemy, a key infrastructure provider for Web3, which powers over 70% of top crypto applications and processes more than $100 billion in transactions annually. This investment aligns with C1 Fund's strategy to build a concentrated portfolio of digital-asset services and technology companies with long-term scaling potential, further expanding its holdings to include other major players like Kraken, Ripple, Chainalysis, and Figment. The decision reflects C1 Fund's confidence in Alchemy's role as a core enabler of next-generation digital-asset applications and its commitment to durable value creation within the digital-asset economy.",
      "url": "https://www.businesswire.com/news/home/20251125461920/en/C1-Fund-Inc.-Adds-Alchemy-to-Portfolio-of-Leading-Digital-Asset-Infrastructure-Companies",
      "source": "Business Wire",
      "published": "20251124T035403",
      "overall_sentiment_score": 0.317359,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.269172,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.560014
    },
    {
      "title": "JPMorgan Chase closes Strike CEO Jack Mallers' accounts, spurring crypto debanking concerns",
      "summary": "JPMorgan Chase closed accounts belonging to Strike CEO Jack Mallers without explanation, citing \"concerning activity.\" This incident has reignited concerns about \"Operation Chokepoint 2.0,\" an alleged effort by regulators to pressure financial institutions into denying services to crypto businesses. Mallers' experience highlights ongoing tensions between traditional banking and the cryptocurrency sector.",
      "url": "https://www.theblock.co/post/380099/strike-jack-maller-jpmorgan",
      "source": "The Block",
      "published": "20251124T022700",
      "overall_sentiment_score": -0.226408,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.247811,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 1.0
    },
    {
      "title": "U.S. Bank review 2025: How to know if you qualify for the best perks",
      "summary": "This article provides a comprehensive review of U.S. Bank's offerings in 2025, covering its checking, savings, money market, and CD accounts, as well as unique perks. It details rates, fees, eligibility for waivers, and explains who the bank is best suited for and who might consider alternatives. The review also highlights U.S. Bank's digital banking capabilities and customer service.",
      "url": "https://fortune.com/article/us-bank-review/",
      "source": "Fortune",
      "published": "20251123T145152",
      "overall_sentiment_score": 0.141188,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.071047,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.592333
    },
    {
      "title": "Stevens Capital Management LP Acquires 30,093 Shares of Wells Fargo & Company $WFC",
      "summary": "Stevens Capital Management LP significantly increased its stake in Wells Fargo & Company ($WFC) by 93.0% in Q2, acquiring an additional 30,093 shares to own a total of 62,442 shares valued at $5.00 million. This move makes Wells Fargo its 18th largest holding, representing about 1.4% of its portfolio. The article also details Wells Fargo's recent financial performance, dividends, and analyst ratings, alongside other institutional investor activities.",
      "url": "https://www.marketbeat.com/instant-alerts/filing-stevens-capital-management-lp-acquires-30093-shares-of-wells-fargo-company-wfc-2025-11-22/",
      "source": "MarketBeat",
      "published": "20251123T143024",
      "overall_sentiment_score": 0.344952,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.301703,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.649869
    },
    {
      "title": "Franklin Resources Inc. Sells 21,416 Shares of Marsh & McLennan Companies, Inc. $MMC",
      "summary": "Franklin Resources Inc. reduced its stake in Marsh & McLennan Companies by 1.4% in Q2, selling 21,416 shares and retaining 1,521,433 shares valued at approximately $332.65 million. Concurrently, Marsh & McLennan CEO John Q. Doyle also sold 21,079 shares. The article also details other institutional investor activity, Marsh & McLennan's recent financial performance, dividends, and analyst ratings.",
      "url": "https://www.marketbeat.com/instant-alerts/filing-franklin-resources-inc-sells-21416-shares-of-marsh-mclennan-companies-inc-mmc-2025-11-22/",
      "source": "MarketBeat",
      "published": "20251123T124206",
      "overall_sentiment_score": 0.064793,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.097528,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.638519
    },
    {
      "title": "JPMorgan Chase & Co. Purchases 276,247 Shares of GE Vernova Inc. $GEV",
      "summary": "JPMorgan Chase & Co. increased its stake in GE Vernova Inc. by 21.7% in the second quarter, acquiring an additional 276,247 shares, bringing its total ownership to over 1.5 million shares valued at $820 million. Other institutional investors like AQR Capital Management and Amundi also significantly boosted their holdings. This news comes alongside insider selling, recent analyst rating adjustments, and details on GE Vernova's financial performance and dividend declaration.",
      "url": "https://www.marketbeat.com/instant-alerts/filing-jpmorgan-chase-co-purchases-276247-shares-of-ge-vernova-inc-gev-2025-11-23/",
      "source": "MarketBeat",
      "published": "20251123T115638",
      "overall_sentiment_score": 0.214853,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.200989,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.806297
    },
    {
      "title": "JPMorgan Chase & Co. Sells 616,865 Shares of Xcel Energy Inc. $XEL",
      "summary": "JPMorgan Chase & Co. reduced its stake in Xcel Energy Inc. by 3.0% in Q2, selling 616,865 shares but still holding over 20 million shares valued at approximately $1.375 billion. Xcel Energy's recent earnings report showed a miss on EPS ($1.24 vs $1.32 estimates) but a 7.4% year-over-year revenue increase to $3.92 billion. Analysts maintain a \"Moderate Buy\" consensus rating with an average price target of $87.14 for Xcel Energy.",
      "url": "https://www.marketbeat.com/instant-alerts/filing-jpmorgan-chase-co-sells-616865-shares-of-xcel-energy-inc-xel-2025-11-22/",
      "source": "MarketBeat",
      "published": "20251123T115149",
      "overall_sentiment_score": 0.189074,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.050023,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.721811
    },
    {
      "title": "Handlesanken Fonder AB Purchases 31,825 Shares of Colgate-Palmolive Company $CL",
      "summary": "Handelsbanken Fonder AB significantly increased its stake in Colgate-Palmolive Company by purchasing 31,825 additional shares, bringing their total holdings to 352,436 shares valued at $32.04 million. This move comes as Colgate-Palmolive reported strong Q2 earnings, beating analyst EPS estimates, and continues to offer a dividend yield of 2.6%. While some analysts have trimmed price targets, the consensus remains a \"Moderate Buy\" for the stock.",
      "url": "https://www.marketbeat.com/instant-alerts/filing-handelsbanken-fonder-ab-purchases-31825-shares-of-colgate-palmolive-company-cl-2025-11-22/",
      "source": "MarketBeat",
      "published": "20251123T114407",
      "overall_sentiment_score": 0.19951,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.108911,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.641586
    },
    {
      "title": "C - Citigroup Inc Stock Price and Quote",
      "summary": "This article provides a comprehensive overview of Citigroup Inc. (C) stock, including its current price, key financial metrics, stock performance, and recent analyst ratings. It also details insider transactions and incorporates recent news headlines concerning the company's financial performance, reorganizations, partnerships, and executive changes.",
      "url": "https://finviz.com/quote.ashx?t=C",
      "source": "Finviz",
      "published": "20251123T103550",
      "overall_sentiment_score": 0.192512,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.111186,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.598268
    },
    {
      "title": "‘Any Sell-Off Is a Buying Opportunity’: Why This Advisor Just Bet $5.7 Million on a JPMorgan Bond ETF",
      "summary": "Tandem Financial, a Colorado-based firm, recently initiated a $5.7 million position in the JPMorgan Active Bond ETF (JBND), acquiring 104,880 shares. This move signals their confidence in the bond market's recovery amidst moderating interest rates. Tandem Financial's investment highlights a strategy of viewing market sell-offs as buying opportunities, aligning with J.P. Morgan Asset Management's outlook for continued support in global bond markets.",
      "url": "https://www.theglobeandmail.com/investing/markets/markets-news/Motley%20Fool/35858257/any-sell-off-is-a-buying-opportunity-why-this-advisor-just-bet-5-7-million-on-a-jpmorgan-bond-etf/",
      "source": "The Globe and Mail",
      "published": "20251123T030923",
      "overall_sentiment_score": 0.408215,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.34158,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.648578
    },
    {
      "title": "Quantum Computing Inc. (QCI) Reports on Its Third Quarter 2025 Financial Results",
      "summary": "Quantum Computing Inc. (QCI) reported a significant 280% year-over-year revenue increase in Q3 2025, reaching $384,000, and a net income of $2.4 million primarily due to non-operational gains. The company also secured $1.25 billion in capital raises, establishing a $1.5 billion liquid position to fund future growth and expansion of its photonic chip foundry. QCI highlighted commercial success with a US bank for its quantum security solutions and advanced its partnership with NASA.",
      "url": "https://quantumcomputingreport.com/quantum-computing-inc-qci-reports-on-its-third-quarter-2025-financial-results/",
      "source": "Quantum Computing Report",
      "published": "20251122T215913",
      "overall_sentiment_score": 0.286585,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.239713,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.570736
    },
    {
      "title": "Hormel Foods (NYSE:HRL) Price Target Cut to $27.00 by Analysts at JPMorgan Chase & Co.",
      "summary": "JPMorgan Chase & Co. has cut its price target for Hormel Foods (NYSE:HRL) to $27.00 from $30.00 but maintained an \"overweight\" rating due to an implied 18.41% upside. Other analysts have also adjusted their ratings and price targets, resulting in a consensus \"Hold\" rating with an average target of $28.86 for the company. Hormel Foods recently missed quarterly EPS estimates but provided FY2025 guidance.",
      "url": "https://www.marketbeat.com/instant-alerts/hormel-foods-nysehrl-price-target-cut-to-2700-by-analysts-at-jpmorgan-chase-co-2025-11-21/",
      "source": "MarketBeat",
      "published": "20251122T162317",
      "overall_sentiment_score": -0.127763,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.038913,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.600986
    },
    {
      "title": "Franklin Resources Inc. Acquires 89,054 Shares of Parker-Hannifin Corporation $PH",
      "summary": "Franklin Resources Inc. increased its stake in Parker-Hannifin Corporation by 7.9% in the second quarter, acquiring an additional 89,054 shares to own a total of 1,215,542 shares valued at approximately $849.02 million. This comes as Parker-Hannifin reported strong quarterly earnings, beating analyst estimates, and announced a quarterly dividend of $1.80 per share. However, recent insider selling by two VPs has been noted.",
      "url": "https://www.marketbeat.com/instant-alerts/filing-franklin-resources-inc-acquires-89054-shares-of-parker-hannifin-corporation-ph-2025-11-21/",
      "source": "MarketBeat",
      "published": "20251122T125832",
      "overall_sentiment_score": 0.142887,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.113993,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.561921
    },
    {
      "title": "Prudential PLC Buys 15,242 Shares of Fortive Corporation $FTV",
      "summary": "Prudential PLC increased its stake in Fortive Corporation by 9.8%, acquiring an additional 15,242 shares to hold a total of 171,303 shares valued at approximately $8.93 million. This comes as Fortive announced a quarterly dividend of $0.06 per share and saw an insider sale of 2,192 shares by SVP Stacey A. Walker. Analyst ratings generally suggest a \"Hold\" with an average target price of $57.38 for FTV.",
      "url": "https://www.marketbeat.com/instant-alerts/filing-prudential-plc-buys-15242-shares-of-fortive-corporation-ftv-2025-11-21/",
      "source": "MarketBeat",
      "published": "20251122T115804",
      "overall_sentiment_score": 0.110456,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.136937,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.639516
    },
    {
      "title": "PNC Financial Services Group Inc. Has $1.08 Million Holdings in Antero Resources Corporation $AR",
      "summary": "PNC Financial Services Group Inc. significantly increased its stake in Antero Resources Corporation, holding 26,774 shares valued at $1.08 million. Insider Brendan E. Krueger also purchased additional shares, increasing corporate insider ownership to 6.30%. Analysts maintain a \"Moderate Buy\" consensus rating with a target price of $44.00 for Antero Resources.",
      "url": "https://www.marketbeat.com/instant-alerts/filing-pnc-financial-services-group-inc-has-108-million-holdings-in-antero-resources-corporation-ar-2025-11-21/",
      "source": "MarketBeat",
      "published": "20251122T104321",
      "overall_sentiment_score": 0.203212,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.133522,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.601776
    },
    {
      "title": "Bank of America Securities Sticks to Its Sell Rating for MidCap Financial Investment Corporation (MFIC)",
      "summary": "Bank of America Securities analyst Derek Hewett reiterated a Sell rating on MidCap Financial Investment Corporation (MFIC) with a price target of $12.00. Hewett, who covers the Financial sector, has an average return of 4.1% and a 54.55% success rate. MFIC's latest quarterly revenue was $53.04 million with a net profit of $18.12 million, and the consensus among analysts is Hold with a price target of $12.61.",
      "url": "https://www.theglobeandmail.com/investing/markets/stocks/MFIC/pressreleases/36268279/bank-of-america-securities-sticks-to-its-sell-rating-for-midcap-financial-investment-corporation-mfic/",
      "source": "The Globe and Mail",
      "published": "20251122T102606",
      "overall_sentiment_score": -0.156141,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.114884,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.609275
    },
    {
      "title": "The Hartford Insurance Group, Inc. (NYSE:HIG) Given Average Recommendation of \"Moderate Buy\" by Analysts",
      "summary": "The Hartford Insurance Group, Inc. (NYSE:HIG) has received an average \"Moderate Buy\" rating from analysts, with a consensus price target of $140.8571. Several brokerages recently updated their ratings and price targets for HIG, including Morgan Stanley, Citigroup, Weiss Ratings, JPMorgan Chase & Co., and Piper Sandler. The company also announced an increased quarterly dividend and detailed recent insider stock sales and institutional investment activity.",
      "url": "https://www.marketbeat.com/instant-alerts/the-hartford-insurance-group-inc-nysehig-given-average-recommendation-of-moderate-buy-by-analysts-2025-11-22/",
      "source": "MarketBeat",
      "published": "20251122T072133",
      "overall_sentiment_score": 0.188706,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.149398,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.614555
    },
    {
      "title": "Ethereum Spot ETFs Record $55.7M Net Inflow as Fidelity’s FETH Dominates the Market",
      "summary": "Ethereum spot ETFs saw a significant net inflow of $55.7 million on November 21st, ending a week of outflows and indicating renewed institutional interest. Fidelity's FETH ETF spearheaded this recovery with a dominant $95.3 million inflow, pushing its cumulative inflows to over $2.54 billion. Despite recent market volatility, the overall trend suggests strong institutional trust in Ethereum as a long-term asset.",
      "url": "https://www.bitget.com/news/detail/12560605077235",
      "source": "Bitget",
      "published": "20251122T000937",
      "overall_sentiment_score": 0.298915,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.131681,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.561873
    },
    {
      "title": "AgriFORCE (Nasdaq: AGRI) wins over 95% shareholder approval for AVAX pivot, $300M PIPE",
      "summary": "AgriFORCE Growing Systems (Nasdaq: AGRI) has received overwhelming shareholder approval for its transformation into a Nasdaq-listed company focused on the Avalanche ecosystem, aiming to maximize ownership of AVAX. The transaction includes a $300 million private investment (PIPE) led by Hivemind Capital and is expected to close around October 30, 2025. Post-closing, the company will rebrand to AVAX One and change its ticker, with a strategy to hold $700 million in AVAX tokens and raise up to an additional $250 million in capital.",
      "url": "https://www.stocktitan.net/news/AGRI/agri-force-growing-systems-agri-announces-shareholder-approval-in-3a9zwzx4991i.html",
      "source": "Stock Titan",
      "published": "20251121T200909",
      "overall_sentiment_score": 0.271965,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.225235,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.602718
    }
  ]
}