{
  "ticker": "JPM",
  "date": "2025-06-30",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T13:00:18.464520",
  "source": "alpha_vantage",
  "article_count": 32,
  "articles": [
    {
      "title": "Home Depot making $4.3 billion acquisition in expansion of pro offerings",
      "summary": "The Home Depot is expanding its offerings to professional contractors by facilitating its subsidiary SRS Distribution Inc.'s acquisition of GMS Inc., a North American specialty building products distributor, for approximately $4.3 billion. This move aims to accelerate SRS's goal of becoming a leading multi-category building materials distributor and increase Home Depot's pro business. The combined entity will boast a network of over 1,200 locations and more than 8,000 trucks to serve residential and commercial Pro customers.",
      "url": "https://chainstoreage.com/home-depot-making-43-billion-acquisition-expansion-pro-offerings",
      "source": "Chain Store Age",
      "published": "20250630T000000",
      "overall_sentiment_score": 0.332332,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.214873,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.571018
    },
    {
      "title": "The Home Depot Enters Into Agreement for SRS Distribution to Acquire GMS",
      "summary": "The Home Depot's subsidiary, SRS Distribution Inc., has entered into a definitive agreement to acquire GMS Inc., a leading North American specialty building products distributor, for approximately $4.3 billion in equity value ($5.5 billion enterprise value). This acquisition will expand The Home Depot's distribution offerings and capabilities for professional contractors by adding GMS's drywall, ceilings, and steel framing distribution to SRS's existing businesses. The transaction is expected to be accretive to adjusted EPS within the first year and significantly broaden the distribution footprint across the U.S. and Canada.",
      "url": "https://ir.homedepot.com/news-releases/2025/06-30-2025-130354727",
      "source": "The Home Depot",
      "published": "20250630T000000",
      "overall_sentiment_score": 0.301818,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.138699,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.557627
    },
    {
      "title": "State Street's private credit ETF wins first flows for months",
      "summary": "State Street Global Advisors (SSGA) public-private credit ETF, the SPDR SSGA IG Public & Private Credit ETF (PRIV), has received its first inflows in over two months. The ETF, launched in partnership with Apollo, recorded $16m in net inflows on Tuesday, according to Morningstar Direct data. This marks a significant return of investor interest after a period of inactivity.",
      "url": "https://citywire.com/pro-buyer/news/state-streets-private-credit-etf-wins-first-flows-for-months/a2468952",
      "source": "Citywire",
      "published": "20250627T111026",
      "overall_sentiment_score": 0.3462,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.139946,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.641322
    },
    {
      "title": "VEA vs AVDE: Which One Offers Better International Exposure?",
      "summary": "This article discusses an ETF Battle between the actively managed Avantis International Equity ETF (AVDE) and the index-linked Vanguard FTSE Developed Markets ETF (VEA). Referee Ron DeLegge and judges Athan Psarofagis and Mike Akins compare these international stock ETFs on criteria like cost, exposure strategy, performance, and yield to determine which offers better international exposure. The piece aims to educate investors on the differences between active and passive management in international stock ETFs.",
      "url": "https://www.etfguide.com/vea-vs-avde-which-one-offers-better-international-exposure/",
      "source": "ETFguide",
      "published": "20250626T221043",
      "overall_sentiment_score": 0.114501,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.002562,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.630215
    },
    {
      "title": "Barclays Bank PLC Updates Announcement of 2 Cash Tender Offers and Consent Solicitations",
      "summary": "Barclays Bank PLC has extended the expiration deadline for its cash tender offers and consent solicitations for two series of exchange-traded notes (ETNs) to September 24, 2025. The announcement details the purchase prices for the iPath® CBOE S&P 500 BuyWrite Index SM ETN and the iPath® Bloomberg Energy Subindex Total Return SM ETN, alongside the number of notes already tendered. It also provides important disclaimers and risk considerations for investors.",
      "url": "https://markets.financialcontent.com/stocks/article/bizwire-2025-6-26-barclays-bank-plc-updates-announcement-of-2-cash-tender-offers-and-consent-solicitations?Language=Spanish",
      "source": "FinancialContent",
      "published": "20250625T231000",
      "overall_sentiment_score": 0.081774,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.128309,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.635249
    },
    {
      "title": "Hashdex Nasdaq Crypto Index US ETF: A Game-Changer for Simplified Crypto Investment",
      "summary": "The Hashdex Nasdaq Crypto Index US ETF (NCIQ) offers U.S. investors diversified exposure to leading digital assets like Bitcoin and Ethereum through a single, tradeable product. As the first multi-asset spot crypto ETF in the U.S., NCIQ aims to simplify crypto investment with its transparent methodology, competitive fee structure (0.25% until end of 2025, then 0.50%), and robust security measures. The ETF tracks the Nasdaq Crypto US Index (NCIUS) and is designed for scalability, with potential plans to include assets like XRP, Solana, and Chainlink as regulations evolve.",
      "url": "https://www.okx.com/learn/hashdex-nasdaq-crypto-index-etf",
      "source": "OKX",
      "published": "20250625T062818",
      "overall_sentiment_score": 0.348418,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.243156,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.568163
    },
    {
      "title": "Anthony Pompliano Raises $751M for Bitcoin Treasury Company in Record SPAC Deal",
      "summary": "Anthony Pompliano's firm ProCap BTC has secured $751.5 million in financing and will merge with SPAC Columbus Circle Capital Corp. I (NASDAQ: CCCM) to form ProCap Financial, marking the largest initial fundraise for a public Bitcoin treasury company. The new entity will launch with up to $1 billion in Bitcoin on its balance sheet, positioning it as a major player in the Bitcoin treasury space. ProCap Financial plans to generate revenue and profits from its Bitcoin holdings through various strategies, with Pompliano leading the public company.",
      "url": "https://www.blockhead.co/2025/06/24/anthony-pompliano-raises-751m-for-bitcoin-treasury-company-in-record-spac-deal/",
      "source": "Blockhead",
      "published": "20250624T134500",
      "overall_sentiment_score": 0.313836,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.133422,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.573977
    },
    {
      "title": "VIDEO: ETF of the Week: SPMO",
      "summary": "VettaFi's Head of Research, Todd Rosenbluth, discusses the Invesco S&P 500 Momentum ETF (SPMO) with Chuck Jaffe, highlighting its popularity and significant inflows. The ETF invests in the 100 S&P 500 stocks with the best relative strength, rebalancing every six months, and offers exposure not just to technology but also to financials and consumer staples. While SPMO is a risk-on, tactical complement to a diversified portfolio, it's not suggested as a core holding due to its momentum-driven strategy.",
      "url": "https://www.etftrends.com/etf-education-channel/etf-of-the-week/video-etf-of-the-week-spmo/",
      "source": "ETF Trends",
      "published": "20250624T110944",
      "overall_sentiment_score": 0.371602,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.302829,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.637179
    },
    {
      "title": "Tech, Financials, Industrials: 3 Leading Sectors of 2025",
      "summary": "As 2025 reaches its midpoint, the Tech, Financial, and Industrial sectors have emerged as significant outperformers despite market volatility driven by geopolitical tensions and policy shifts. The Financial Select Sector SPDR ETF (XLF) and the Technology Select Sector SPDR ETF (XLK) have both returned approximately 3.9% year-to-date, reflecting strong institutional backing and growth. The Industrial Select Sector SPDR ETF (XLI) has surprisingly led with nearly 8% growth, fueled by infrastructure, defense spending, and reshoring trends.",
      "url": "https://www.theglobeandmail.com/investing/markets/stocks/XLF-A/pressreleases/33019539/tech-financials-industrials-3-leading-sectors-of-2025/",
      "source": "The Globe and Mail",
      "published": "20250623T064400",
      "overall_sentiment_score": 0.368963,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.323304,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.611195
    },
    {
      "title": "Irving-based Caris Life Sciences raises $494 million in IPO",
      "summary": "Caris Life Sciences, an Irving-based healthcare company specializing in cancer diagnosis and treatment technology, recently raised $494 million in its U.S. initial public offering. The company sold 23.5 million shares at $21 each, surpassing its marketed range. Caris utilizes AI and machine learning to analyze oncology data, offering both tissue-based and blood-based molecular profiling solutions.",
      "url": "https://www.dallasnews.com/business/local-companies/2025/06/18/irving-based-caris-life-sciences-raises-494-million-in-ipo/",
      "source": "Dallas News",
      "published": "20250618T180904",
      "overall_sentiment_score": 0.324602,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.421316,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.59029
    },
    {
      "title": "JAAA ETF: 5.96% Yield, 0 Duration – Is It Time To Buy?",
      "summary": "The JAAA ETF offers a 5.96% yield with near-zero duration, making it a compelling short-term fixed-income investment. It invests in AAA-rated CLO tranches, providing strong credit insulation and significant liquidity, despite concerns about potential spread compression from high inflows. The article concludes with a \"STRONG BUY\" rating, highlighting its resilience against inflation and falling bond prices.",
      "url": "https://www.tradingnews.com/news/jaa-etf-at-50-usd-ofers-5-96-yield",
      "source": "TradingNEWS",
      "published": "20250618T035357",
      "overall_sentiment_score": 0.205269,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.075682,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.560539
    },
    {
      "title": "Fresh $55M SPAC IPO Hits Nasdaq: BEST SPAC I Launches with Unique Share-Rights Structure",
      "summary": "BEST SPAC I Acquisition Corp. (BSAAU) has completed its $55 million initial public offering, selling 5,500,000 units at $10.00 each on the Nasdaq Capital Market. Each unit includes one Class A ordinary share and one right, which converts into one-tenth of a share upon a business combination. The SPAC aims to pursue mergers, acquisitions, or similar business combinations, with Maxim Group LLC acting as the sole book-running manager and holding an over-allotment option.",
      "url": "https://www.stocktitan.net/news/BSAAU/best-spac-i-acquisition-corp-announces-closing-of-55-million-initial-abj8j38r3ftd.html",
      "source": "Stock Titan",
      "published": "20250617T001000",
      "overall_sentiment_score": 0.420345,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.077035,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.580654
    },
    {
      "title": "3 Reasons to Buy FAS and 3 Reasons Not to",
      "summary": "The article analyzes the Direxion Daily Financial Bull 3x Shares (FAS) ETF, which aims to triple the daily performance of the S&P Financial Select Sector Index. It presents three reasons to consider investing in FAS, such as potential market-beating gains in a strong financial sector, and three reasons to avoid it, including its daily reset nature, credit risk from swap contracts, and sensitivity to interest rates. The author concludes that FAS is suitable for bold investors who understand its leveraged risks and expect a favorable financial market environment.",
      "url": "https://www.fool.com/investing/general/2025/06/28/3-reasons-to-buy-fas-and-3-reasons-not-to/",
      "source": "The Motley Fool",
      "published": "20250628T092200",
      "overall_sentiment_score": 0.140518,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.217742,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.630175
    },
    {
      "title": "Carvana Co.: Garcia sells $17.9 million in CVNA stock",
      "summary": "Ernest C. Garcia II, a ten percent owner of Carvana Co. (NYSE: CVNA), sold a total of 54,938 shares of Class A Common Stock for approximately $17.9 million on June 24 and June 25, 2025. These sales were conducted under a 10b5-1 trading plan. The article also notes Carvana's strong financial health and includes recent analyst updates with various price targets and ratings.",
      "url": "https://www.investing.com/news/insider-trading-news/carvana-co-garcia-sells-179-million-in-cvna-stock-93CH-4113838",
      "source": "Investing.com",
      "published": "20250626T185400",
      "overall_sentiment_score": 0.221945,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.279975,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.563087
    },
    {
      "title": "Airbnb CTO Balogh sells $79k in shares",
      "summary": "Airbnb CTO Aristotle Balogh sold 600 shares of Class A Common Stock for $79,362 on June 20, 2025. This transaction, executed under a Rule 10b5-1 trading plan, follows a period where Airbnb maintains strong financial health and active share buybacks. The company has a mixed outlook from analysts, with some reiterating \"outperform\" ratings while others have downgraded to \"sell,\" amidst legal disputes and slowing performance indicators.",
      "url": "https://www.investing.com/news/insider-trading-news/airbnb-cto-balogh-sells-79k-in-shares-93CH-4109268",
      "source": "Investing.com",
      "published": "20250624T102614",
      "overall_sentiment_score": -0.056896,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.22632,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.589763
    },
    {
      "title": "Duolingo director hacker sells $4.7m in stock",
      "summary": "Severin Hacker, Duolingo's Chief Tech Officer and Director, sold 9,000 shares of Class A Common Stock for approximately $4.7 million on June 20, 2025, while also exercising options to acquire 10,000 shares. This comes as Duolingo's stock experienced a decline due to Apple's new Live Translation feature, though analysts like JPMorgan, DA Davidson, and Scotiabank have raised price targets citing strong user growth and monetization strategies.",
      "url": "https://www.investing.com/news/insider-trading-news/duolingo-director-hacker-sells-47m-in-stock-93CH-4106896",
      "source": "Investing.com",
      "published": "20250623T230846",
      "overall_sentiment_score": 0.108234,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.349756,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.62274
    },
    {
      "title": "Northern Trust commits to independence after WSJ report on potential merger with BNY",
      "summary": "Northern Trust announced its full commitment to remaining independent following a Wall Street Journal report that Bank of New York Mellon had approached it for a potential merger. While BNY and Northern Trust CEOs had discussions, no formal offer was made, and analysts express skepticism about the merger's probability due to regulatory hurdles and Northern Trust's stance. This news caused Northern Trust shares to rise and BNY Mellon shares to fall.",
      "url": "https://www.reuters.com/business/finance/bank-new-york-mellon-approached-northern-trust-discuss-potential-merger-wsj-2025-06-22/",
      "source": "Reuters",
      "published": "20250623T170200",
      "overall_sentiment_score": 0.037636,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.068399,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.580774
    },
    {
      "title": "Palantir could profit from the Middle East conflict. But here’s why Wall Street thinks its stock is overpriced.",
      "summary": "Palantir is poised to benefit from its defense and intelligence technology due to rising tensions in the Middle East, with its advanced AI platforms like Gotham being crucial for government contracts. Despite this, Wall Street analysts believe the company's stock is currently overpriced compared to their average price targets. Laila Maidan, a Tech and Investing reporter at MarketWatch, details how Palantir's involvement with the U.S. Army signals its increasing importance in modern warfare.",
      "url": "https://www.marketwatch.com/story/palantir-could-profit-from-the-middle-east-conflict-but-heres-why-wall-street-thinks-its-stock-is-overpriced-00d90c5a?gaa_at=eafs&gaa_n=AWEtsqeRWSlkc7VgC7X25OXcZ9qrAhLV9QjUwrb5KgqbS2pWx7RGT_7DQUL_&gaa_ts=6919ec43&gaa_sig=Qh4hjR6RooJJdigCuAX_PEjYSFgaIqZhmSNzhMRwGb7t5OdB11hKTJS8F1tZlxBj0E2Un2kqNf4Dc4UVa5qFPA%3D%3D",
      "source": "MarketWatch",
      "published": "20250623T164200",
      "overall_sentiment_score": 0.107743,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.049446,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.545091
    },
    {
      "title": "BNY Mellon Investment Adviser, Inc. Announces Closing of Reorganization of BNY Mellon Municipal Income, Inc. With and Into a BNY Mellon Municipal Open-end Fund",
      "summary": "BNY Mellon Investment Adviser, Inc. announced the successful reorganization of BNY Mellon Municipal Income, Inc. (DMF) into BNY Mellon AMT-Free Municipal Bond Fund (DMUAX), effective June 20, 2025. Stockholders of DMF received Class A shares of the Acquiring Fund, with fractional shares paid in cash. This strategic move consolidates assets under one of the world's largest asset managers, BNY Investments.",
      "url": "https://markets.financialcontent.com/bostonherald/article/bizwire-2025-6-23-bny-mellon-investment-adviser-inc-announces-closing-of-reorganization-of-bny-mellon-municipal-income-inc-with-and-into-a-bny-mellon-municipal-open-end-fund",
      "source": "FinancialContent",
      "published": "20250623T111700",
      "overall_sentiment_score": 0.124652,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.143756,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.586155
    },
    {
      "title": "With 83% ownership, Alliant Energy Corporation (NASDAQ:LNT) boasts of strong institutional backing",
      "summary": "Alliant Energy Corporation (NASDAQ:LNT) is largely controlled by institutional investors, who collectively own 83% of the company's shares. This significant institutional backing suggests credibility among professional investors, but also means the stock price could be vulnerable to their trading decisions. The top 12 shareholders hold 50% of the company, with Vanguard, BlackRock, and State Street Global Advisors being the largest single institutional investors.",
      "url": "https://finance.yahoo.com/news/83-ownership-alliant-energy-corporation-183952105.html",
      "source": "Yahoo Finance",
      "published": "20250619T183952",
      "overall_sentiment_score": 0.249891,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.207417,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.571715
    },
    {
      "title": "Caris Life Sciences Announces Pricing of Initial Public Offering",
      "summary": "Caris Life Sciences has announced the pricing of its initial public offering, with 23,529,412 shares of common stock offered at $21.00 per share. Trading is expected to begin on the Nasdaq Global Select Market on June 18, 2025, under the ticker symbol \"CAI.\" The offering will close on June 20, 2025, with BofA Securities, J.P. Morgan, and Goldman Sachs & Co. LLC acting as lead book-running managers.",
      "url": "https://www.prnewswire.com/news-releases/caris-life-sciences-announces-pricing-of-initial-public-offering-302484552.html",
      "source": "PR Newswire",
      "published": "20250617T214700",
      "overall_sentiment_score": 0.347913,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.308123,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.718827
    },
    {
      "title": "Biomea Fusion, Inc. Announces Commencement of Underwritten Public Offering of Common Stock and Warrants",
      "summary": "Biomea Fusion, Inc. has announced an underwritten public offering of common stock and accompanying warrants to raise capital for its clinical-stage programs in diabetes and obesity. The offering is managed by Jefferies as the sole book-running manager and is expected to close around June 20, 2025. This strategic move aims to bolster the company's financial position and support the ongoing development of its oral small molecule treatments.",
      "url": "https://www.nasdaq.com/articles/biomea-fusion-inc-announces-commencement-underwritten-public-offering-common-stock-and",
      "source": "Nasdaq",
      "published": "20250617T164000",
      "overall_sentiment_score": 0.019659,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.149307,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.620907
    },
    {
      "title": "Companies are issuing the least amount of 30-year bonds in 14 years. What that tells investors.",
      "summary": "U.S. companies are issuing the least amount of 30-year bonds in 14 years, signaling their reluctance to make long-term financing commitments. This trend is attributed to higher interest rates and policy uncertainty, particularly under a potential second Trump term. Corporations are hoping for policy clarity and lower interest rates in the future before committing to long-term debt.",
      "url": "https://www.marketwatch.com/story/companies-are-issuing-the-least-amount-of-30-year-bonds-in-14-years-what-that-tells-investors-1f565d91?gaa_at=eafs&gaa_n=AWEtsqfzDhBwkvgKHszO-oQQjmAxweEle5xqMvXpBRGsRQnhym6l6TE8F6Ct&gaa_ts=69073a93&gaa_sig=1WVF6oKd4fX5IyrAzZLE_ZjKGWNgrlo8wNJuIv9QvjX-NrPo6On9-4u-1amf_Gl7qkK47S63bkIPF1ag4xxlNQ%3D%3D",
      "source": "MarketWatch",
      "published": "20250630T132300",
      "overall_sentiment_score": -0.094063,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.140496,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.601865
    },
    {
      "title": "Ethereum ETF Explained: Everything You Need to Know",
      "summary": "This article explains what an Ethereum ETF is, how it works, and why investors might choose it over direct ETH ownership. It details the differences between spot and futures Ethereum ETFs and provides a step-by-step guide on how to invest. The piece also lists top Ethereum ETFs for 2025 and discusses the advantages and disadvantages of this investment vehicle.",
      "url": "https://www.bitget.com/academy/ethereum-etf-explained-what-is-it-how-it-works",
      "source": "Bitget",
      "published": "20250623T103610",
      "overall_sentiment_score": 0.241426,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.287562,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.580086
    },
    {
      "title": "Everybody Wants Alts",
      "summary": "The article discusses the growing trend of alternative asset managers targeting individual investors, dubbed \"The Relentless Ask.\" It highlights the significant interest among young, high-net-worth individuals in alternative investments like pre-IPO unicorns, real estate, and crypto, noting that only 2% of high net worth portfolios are currently in alternatives. The author advises caution for new investors in these assets due to the wide distribution of returns and illiquid nature compared to public markets, and questions the accessibility of the best private investments for those with limited funds.",
      "url": "https://www.theirrelevantinvestor.com/p/everybody-wants-alts-df94",
      "source": "The Irrelevant Investor",
      "published": "20250623T000000",
      "overall_sentiment_score": 0.144612,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.161624,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.730159
    },
    {
      "title": "Brazil Leads Crypto ETF Race With New Hybrid Bitcoin/Gold Product",
      "summary": "Brazil is set to launch a new hybrid Bitcoin and gold ETF, GBTC11, through Hashdex and Buena Vista Capital, further solidifying its leadership in the crypto ETF market. This product will dynamically adjust allocations between Bitcoin and gold based on market conditions, offering investors a sophisticated tool for diversification and wealth preservation. Brazil's robust capital markets infrastructure for crypto assets and its upcoming regulatory framework for Virtual Asset Service Providers are expected to continue attracting investment and innovation in the digital asset space.",
      "url": "https://www.forbes.com/sites/astanley/2025/06/30/brazil-leads-crypto-etf-race-with-new-hybrid-bitcoingold-product/",
      "source": "Forbes",
      "published": "20250630T135200",
      "overall_sentiment_score": 0.430015,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.339572,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.556992
    },
    {
      "title": "Bond giant PIMCO sees emerging markets in 'Goldilocks' moment",
      "summary": "Bond fund PIMCO believes emerging markets are experiencing a \"Goldilocks\" moment due to a significant capital rotation driven by a weakening U.S. dollar and investor shifts from U.S. assets. The firm, managing $70 billion in EM assets, is \"very constructive\" on the asset class, citing robust fundamentals and sustained capital inflows, with expectations of continued growth in net capital inflows to emerging markets. This trend is fueled by factors like import tariffs, rising U.S. debt concerns, and a loss of confidence in the U.S. government.",
      "url": "https://www.reuters.com/markets/europe/bond-giant-pimco-sees-emerging-markets-goldilocks-moment-2025-06-26/",
      "source": "Reuters",
      "published": "20250626T160200",
      "overall_sentiment_score": 0.337483,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.287645,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.586906
    },
    {
      "title": "Investors Rush to Pour Cash Into $7.4 Trillion US Money-Market Fund Industry",
      "summary": "US money-market funds have reached a record $7.4 trillion in assets, with investors pouring over $320 billion into them this year. This surge is largely driven by the Federal Reserve's monetary policy, which has maintained attractive returns despite earlier Wall Street expectations of rate cuts. Even as the Fed has begun cutting rates, these funds continue to grow, significantly boosted by retail investors.",
      "url": "https://www.thewealthadvisor.com/article/investors-rush-pour-cash-74-trillion-us-money-market-fund-industry",
      "source": "The Wealth Advisor",
      "published": "20250623T212830",
      "overall_sentiment_score": 0.146946,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.201771,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.598555
    },
    {
      "title": "Vanguard offers joint lowest-fee global aggregate ETF after cuts across Europe range",
      "summary": "Vanguard has cut fees across seven fixed income ETFs in Europe, extending its fee reduction strategy across the Atlantic. These cuts, affecting 13 share classes, position the Vanguard Global Aggregate Bond UCITS ETF (VAGP) as one of the lowest-fee global aggregate ETFs in Europe. The company estimates these changes will save investors approximately $3.5 million annually.",
      "url": "https://www.etfstream.com/articles/vanguard-offers-joint-lowest-fee-global-aggregate-etf-after-cuts-across-europe-range",
      "source": "ETF Stream",
      "published": "20250623T012154",
      "overall_sentiment_score": 0.18719,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.22214,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.647406
    },
    {
      "title": "Sustainable Investing in Emerging Markets: Making an Impact With Active Fixed Income ETFs",
      "summary": "This article discusses the potential of sustainable investing in emerging markets through active fixed-income ETFs, particularly focusing on green, social, and sustainability (GSS) bonds. It highlights the attractive returns and positive impact these bonds can offer, emphasizing the need for an active management approach given the diverse and nuanced nature of these markets. The piece also provides case studies of Indonesia and Cemex to illustrate successful sustainable financing initiatives.",
      "url": "https://am.gs.com/en-au/advisors/insights/article/2025/making-an-impact-with-active-fixed-income-etf",
      "source": "Goldman Sachs Asset Management",
      "published": "20250618T000000",
      "overall_sentiment_score": 0.316263,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.392753,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.659586
    },
    {
      "title": "The Rise of Active Fixed Income ETFs | Chief Investment Officer",
      "summary": "The article discusses the significant growth and transformative impact of active fixed-income ETFs in the investment community. It highlights how these funds offer differentiated bond strategies and flexibility, enabling investors to navigate market volatility and access attractive opportunities beyond traditional benchmarks. The authors emphasize that active fixed-income ETFs are becoming a cornerstone in asset allocation, revolutionizing investment approaches in the bond market.",
      "url": "https://www.ai-cio.com/news/the-evolution-and-revolution-of-active-fixed-income-etfs/",
      "source": "Chief Investment Officer",
      "published": "20250617T000000",
      "overall_sentiment_score": 0.159378,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.332763,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.621298
    },
    {
      "title": "JPM Launches New Active Global Government Bond ETF in Europe",
      "summary": "JPMorgan Asset Management has expanded its active fixed-income offerings in Europe with the introduction of the JPM Global Government Bond Active UCITS ETF (JGOV). This new ETF, benchmarked against the Bloomberg Global Aggregate Treasuries Index, captures global government and government-guaranteed bonds, and is managed by a team of experienced portfolio managers and a global research team with a 0.23% TER. The launch signifies JPMAM's continued focus on active fixed-income solutions in the European market, following other recent active ETF introductions.",
      "url": "https://www.etf.com/sections/news/jpm-launches-new-active-global-government-bond-etf-europe",
      "source": "ETF.com",
      "published": "20250616T000000",
      "overall_sentiment_score": 0.167602,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.309229,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.973347
    }
  ]
}