{
  "ticker": "JPM",
  "date": "2025-01-13",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T12:58:25.106114",
  "source": "alpha_vantage",
  "article_count": 50,
  "articles": [
    {
      "title": "WilmerHale Advises Revvity in $1.5B Financing",
      "summary": "WilmerHale represented Revvity, Inc. in connection with its new $1.5 billion syndicated revolving credit facility. The facility involves Bank of America, JPMorgan, Goldman Sachs, PNC Bank, and Wells Fargo Bank, acting in various agent and arranger roles. The unsecured, multi-currency credit facility has a five-year maturity and closed on January 7, 2025.",
      "url": "https://www.wilmerhale.com/en/insights/news/20250108-wilmerhale-advises-revvity-in-1-5b-financing",
      "source": "WilmerHale",
      "published": "20250108T000000",
      "overall_sentiment_score": 0.368858,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.33505,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.630825
    },
    {
      "title": "J.P. Morgan Exchange-Traded Fund Trust - JPMorgan USD Emerging Markets Sovereign Bond ETF announces Monthly dividend, payable on December 03, 2025",
      "summary": "J.P. Morgan Exchange-Traded Fund Trust - JPMorgan USD Emerging Markets Sovereign Bond ETF (JPMB) has announced a monthly dividend of USD 0.1812 per share. The dividend is payable on December 03, 2025, with an ex-date and record date of December 01, 2025.",
      "url": "https://www.marketscreener.com/news/j-p-morgan-exchange-traded-fund-trust-jpmorgan-usd-emerging-markets-sovereign-bond-etf-announces-ce7d51d9da8af024",
      "source": "MarketScreener",
      "published": "20250105T100939",
      "overall_sentiment_score": 0.249303,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.123118,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.603348
    },
    {
      "title": "Ingram Micro Files For IPO; ‘INGM’ Share Price Undecided",
      "summary": "Ingram Micro has filed for an IPO, planning to list on the New York Stock Exchange under the symbol 'INGM' to pay down a portion of its $1.16 billion debt. The Irvine, Calif.-based IT distribution giant, which generated $48 billion in net sales in 2023, has not yet determined the number of shares or price range for the offering. This marks Ingram Micro's third attempt to go public, having previously been acquired by Platinum Equity in 2021 and by HNA Group in 2016.",
      "url": "https://www.crn.com/news/cloud/2024/ingram-micro-files-for-ipo-ingm-share-price-undecided",
      "source": "CRN Magazine",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.159451,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.105459,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.61645
    },
    {
      "title": "Banking, finance sector layoffs hit NJ, include Prudential and JPMorgan Chase",
      "summary": "Several major banking and financial institutions, including Prudential Financial and JPMorgan Chase, have announced layoffs in New Jersey due to efforts to tighten budgets amid uncertain economic conditions. These job cuts are attributed to banks reducing back-office costs, stable earnings, and the Federal Reserve's interest rate hikes impacting mortgage demand and leading to stricter capital requirements. Despite some layoffs, JPMorgan Chase has also reported significant hiring and a growth in its overall headcount since 2020.",
      "url": "https://www.northjersey.com/story/news/business/2024/04/10/banking-finance-sector-layoffs-nj-prudential-financial-jpmorgan-chase-td-bank-charles-schwab/73258708007/",
      "source": "Bergen Record",
      "published": "20241231T235959",
      "overall_sentiment_score": -0.245898,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.144817,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.934254
    },
    {
      "title": "M&T Bank's Profits Climb Thanks To Fee Growth And Loan Optimism",
      "summary": "M&T Bank reported a significant boost in third-quarter profits, driven by increased fees from institutional services and wealth management, and a strategic reduction in credit loss provisions. Despite a drop in net interest income, the bank maintained stability, leading to an increase in net income available to shareholders. M&T Bank's shares have surged, outperforming the S&P 500, indicating investor confidence in regional banks' resilience amidst Federal Reserve rate cuts.",
      "url": "https://finimize.com/content/mt-banks-profits-climb-thanks-to-fee-growth-and-loan-optimism",
      "source": "Finimize",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.303466,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.242588,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.589974
    },
    {
      "title": "Interstate Power and Light Company Prices Debt Offering",
      "summary": "Interstate Power and Light Company (IPL), a subsidiary of Alliant Energy Corporation, announced the pricing of a debt offering totaling $650 million, consisting of $350 million in senior debentures due 2034 and $300 million due 2054. The net proceeds will be used to retire existing debt and for general corporate purposes, with the closing expected on September 6, 2024. The offering was managed by a group of underwriters including Barclays Capital Inc. and Goldman Sachs & Co. LLC.",
      "url": "https://www.businesswire.com/news/home/20240905329147/en/Interstate-Power-and-Light-Company-Prices-Debt-Offering",
      "source": "Business Wire",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.194615,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.133769,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.647227
    },
    {
      "title": "KKR Used Equity Rather Than Debt to Fund Acquisition of Broker April Group",
      "summary": "KKR & Co. funded its €2.3 billion acquisition of French insurance broker April Group solely with equity, a departure from traditional debt-funded buyouts. This move reflects the current market environment where banks are reluctant to extend large loans due to existing buyout debt and rising interest rates. KKR plans to introduce debt financing later when terms are more favorable, highlighting a shift in leveraged finance as private credit funds partially fill the void left by banks.",
      "url": "https://pe-insights.com/kkr-used-equity-rather-than-debt-to-fund-acquisition-of-broker-april-group/",
      "source": "Private Equity Insights",
      "published": "20241231T235959",
      "overall_sentiment_score": -0.197736,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.230956,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.617841
    },
    {
      "title": "YPF in $500 Million Offering and Concurrent Tender and Exchange Offers",
      "summary": "Cleary Gottlieb represented YPF S.A. in a successful $500 million offering of its 8.75% senior notes due 2031, which priced on September 4, 2024. Concurrently, YPF launched tender and exchange offers for existing senior notes, aiming to purchase or exchange up to $500 million in outstanding debt. These concurrent offers are contingent on the successful closure of the new bond offering, reinforcing YPF's position as Argentina's leading energy company.",
      "url": "https://www.clearygottlieb.com/news-and-insights/news-listing/ypf-in-500-million-offering-and-concurrent-tender-and-exchange-offers-sept-2024",
      "source": "Cleary Gottlieb",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.20073,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.212667,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.534207
    },
    {
      "title": "AIG Closes Sale of 21.6% Ownership Stake of Corebridge to Nippon Life",
      "summary": "American International Group, Inc. announced the successful closure of the sale of approximately 120 million shares of its Corebridge Financial common stock to Nippon Life Insurance Company. The transaction was valued at $31.47 per share, totaling an aggregate purchase price of $3.8 billion. AIG engaged Wachtell, Lipton, Rosen & Katz as legal counsel and J.P. Morgan Securities LLC as financial advisor for the deal.",
      "url": "https://www.businesswire.com/news/home/20241209985774/en/AIG-Closes-Sale-of-21.6-Ownership-Stake-of-Corebridge-to-Nippon-Life",
      "source": "Business Wire",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.279588,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.126437,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.611965
    },
    {
      "title": "Valkyrie cofounder predicts Wednesday approval amid Bitcoin ETF frenzy: ‘It’s almost surreal’",
      "summary": "Steven McClurg, cofounder and CIO of Valkyrie, is highly optimistic about the SEC approving spot Bitcoin ETFs by Wednesday, describing the experience as \"surreal\" after years of anticipation. He discussed Valkyrie's strategy, including their BRRR ticker, their preference for cash creates in ETFs, and their focus on expertise rather than being the lowest-cost provider. McClurg also addressed concerns about their custodian Coinbase's legal issues and provided his perspective on how Bitcoin ETFs align with the broader ethos of cryptocurrency.",
      "url": "https://fortune.com/crypto/2024/01/09/valkyrie-bitcoin-etf-blackrock-approval-sec-gensler/",
      "source": "Fortune",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.222374,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.162264,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.558374
    },
    {
      "title": "BlackRock and JPMorgan are backing a $15 billion investor fund to rebuild Ukraine",
      "summary": "BlackRock and JPMorgan are supporting a new investor fund, the Ukraine Development Fund, aiming to raise $15 billion to reconstruct Ukraine after two years of war. This initiative will bring together various investors and focus on key sectors like manufacturing, infrastructure, agriculture, and energy, with BlackRock's Financial Markets Advisory Group and JPMorgan providing services pro bono. The fund is envisioned as a major public-private collaboration, similar to Germany's KfW post-WWII, to address the estimated half-a-trillion-dollar cost of rebuilding.",
      "url": "https://qz.com/blackrock-jpmorgan-private-investors-ukraine-fund-1851334929",
      "source": "Quartz",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.346042,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.342012,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.935747
    },
    {
      "title": "NCR Voyix Reports Second Quarter Results and Announces Strategic Actions",
      "summary": "NCR Voyix reported its second-quarter 2024 financial results, including a GAAP revenue of $876 million. The company announced strategic actions, such as the divestiture of its Digital Banking business to Veritas Capital for $2.45 billion and a new outsourced design and manufacturing agreement with Ennoconn Corp. Additionally, NCR Voyix initiated a multi-phase cost reduction program, aiming for significant leverage reduction and improved financial performance.",
      "url": "https://www.businesswire.com/news/home/20240806568036/en/NCR-Voyix-Reports-Second-Quarter-Results-and-Announces-Strategic-Actions",
      "source": "Business Wire",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.158989,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.123737,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.610153
    },
    {
      "title": "T-Mobile Agrees to Sell $2.5 Billion of Senior Notes",
      "summary": "T-Mobile US, Inc. announced that its subsidiary, T-Mobile USA, Inc., has agreed to sell $2.5 billion in aggregate principal amount of senior notes through a registered public offering. The offering includes three tranches of notes due in 2029, 2035, and 2055, with closing expected on September 26, 2024. The net proceeds are intended for general corporate purposes, including share repurchases, dividends, and refinancing existing debt.",
      "url": "https://www.businesswire.com/news/home/20240923686495/en/T-Mobile-Agrees-to-Sell-%242.5-Billion-of-Senior-Notes",
      "source": "Business Wire",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.129518,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.118018,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.632235
    },
    {
      "title": "Sportradar valued at nearly $8bn in U.S. market debut",
      "summary": "Sportradar Group AG, a Switzerland-based sports data provider, debuted on the U.S. market with shares opening flat, valuing the company at nearly $8 billion. The company raised $672 million by selling shares at $27 per Class A ordinary share, planning to use the proceeds for growth and acquisitions. Sportradar provides software, data, and content to over 1,600 customers in 120 countries, including DraftKings, Twitter, and ESPN.",
      "url": "https://pe-insights.com/sportradar-valued-at-nearly-8bn-in-u-s-market-debut/",
      "source": "Private Equity Insights",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.246993,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.144626,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.633595
    },
    {
      "title": "A major finance firm is requiring its 35,000 employees to take a generative AI bootcamp",
      "summary": "S&P Global is partnering with Accenture to put all 35,000 of its employees through a \"comprehensive gen AI learning program\" starting this month. This initiative aims to equip S&P Global's workforce with AI fluency, addressing the financial service industry's increasing reliance on AI and AI talent. The collaboration also extends to AI development and benchmarking across the financial services industry, combining Accenture's Foundation Model Services with S&P AI Benchmarks by Kensho.",
      "url": "https://qz.com/sp-global-accenture-generative-ai-financial-services-1851611961",
      "source": "Quartz",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.375564,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.308289,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.614078
    },
    {
      "title": "Sally Beauty Holdings Announces the Completion of a Registered Public Offering of $600 Million of Senior Notes Due 2032",
      "summary": "Sally Beauty Holdings, through its subsidiaries Sally Holdings LLC and Sally Capital Inc., announced the completion of a registered public offering of $600 million aggregate principal amount of Senior Notes due 2032. The proceeds from this offering, along with existing credit facilities and cash, will be used to redeem all outstanding $679.96 million aggregate principal amount of senior unsecured notes due 2025. The redemption is expected to be completed on or about March 13, 2024, with BofA Securities, J.P. Morgan, and Truist Securities acting as joint book-running managers.",
      "url": "https://www.businesswire.com/news/home/20240227375207/en/Sally-Beauty-Holdings-Announces-the-Completion-of-a-Registered-Public-Offering-of-%24600-Million-of-Senior-Notes-Due-2032",
      "source": "Business Wire",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.268127,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.213504,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.640056
    },
    {
      "title": "Corporate Bonds Risks, Returns Vs. Equities, Treasuries",
      "summary": "This article examines the risk and return profiles of corporate bonds relative to sovereign bonds (U.S. Treasuries) and equities. It highlights how investment-grade corporate bonds behave similarly to Treasuries with some equity correlation, while high-yield bonds strongly correlate with equities. The article also discusses how corporate bond and equity markets can diverge during different economic cycles, especially in the late stages of expansions, and points out current downside risks for corporate bonds due to rising consumer loan defaults.",
      "url": "https://www.cmegroup.com/insights/economic-research/2024/corporate-bonds-risks-returns-vs-equities-treasuries.html",
      "source": "CME Group",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.138352,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.106716,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.565203
    },
    {
      "title": "Germany’s Deutsche Bank looks across the pond as it aims to become Wall Street’s most powerful European rival",
      "summary": "Deutsche Bank is ambitiously expanding its U.S. wealth management division, hiring senior private bankers in key cities like San Francisco and Los Angeles, to become a leading European rival to Wall Street firms. The bank aims for double-digit revenue growth despite stagnating wealth management revenues in Q1, focusing on ultra-high-net-worth individuals and leveraging its turnaround success since 2019. This strategic move aligns with its broader goal of growing wealth management in regions like Southeast Asia and the Middle East, while also benefiting from recent banking crises that have driven clients to consider foreign lenders.",
      "url": "https://fortune.com/europe/2024/07/22/germany-deutsche-bank-looks-across-the-pond-as-it-aims-to-become-wall-streets-us-most-powerful-european-rival-new-york-san-francisco-los-angeles/",
      "source": "Fortune",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.131662,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.10905,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.556596
    },
    {
      "title": "Dan Gilbert wants to make more Rocket shares available. How that could affect the company",
      "summary": "Dan Gilbert, founder and chairman of Rocket Companies Inc., plans to increase the number of shares available to public stockholders, aiming to reduce his 93% personal stake. Experts suggest this move could increase institutional investor interest and stabilize the stock, but a secondary offering might cause a temporary price decrease. The company's stock has seen significant fluctuations, and increasing the float could help it gain broader market appeal beyond day traders.",
      "url": "https://www.detroitnews.com/story/business/2024/09/20/how-increasing-rockets-float-could-affect-the-company-and-its-stock-price/75268986007/",
      "source": "The Detroit News",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.081276,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.148094,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.627308
    },
    {
      "title": "Tactical asset allocation: diversify your portfolio",
      "summary": "This article introduces the Composite Dual Momentum (CDM) strategy, a tactical asset allocation approach designed to diversify portfolios and enhance returns. The CDM strategy utilizes both relative and absolute momentum across four asset classes to identify strong-performing assets while minimizing drawdowns. Despite its historical success and risk-adjusted returns, the article notes that a significant portion of the portfolio is often held in cash, which can potentially drag on performance.",
      "url": "https://finimize.com/content/this-strategy-aims-to-diversify-your-portfolio-and-boost-its-returns",
      "source": "Finimize",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.210763,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.123428,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.608706
    },
    {
      "title": "Fidelity Adds Staking To Spot Ethereum ETF Application",
      "summary": "Fidelity has amended its spot Ethereum ETF application to include staking a portion of the fund's Ether, potentially through a third-party provider, to earn network rewards. This move follows similar proposals from Ark Invest and Franklin Templeton, though analysts like James Seyffart and Eric Balchunas remain skeptical about the SEC's approval of spot Ether ETFs by the May deadline. Lawmakers have also expressed concerns about further crypto ETP approvals, citing risks to retail investors.",
      "url": "https://thedefiant.io/news/cefi/fidelity-adds-staking-to-spot-ethereum-etf-application",
      "source": "The Defiant",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.208166,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.248345,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.614077
    },
    {
      "title": "Trump names Fiserv CEO Bisignano to head the Social Security Administration",
      "summary": "President-elect Donald Trump has nominated Frank Bisignano, CEO of Fiserv Inc., to lead the Social Security Administration. Bisignano, known for transforming large corporations and being Wisconsin's highest-paid public company CEO, will continue his role at Fiserv until confirmed. The nomination comes as Social Security trust funds face insolvency by 2034, and Bisignano's political donations have primarily supported Republicans, including Trump.",
      "url": "https://www.jsonline.com/story/news/local/2024/12/05/trump-taps-fiserv-ceo-bisignano-to-lead-social-security-administration/76792991007/",
      "source": "Milwaukee Journal Sentinel",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.035444,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.068054,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.606063
    },
    {
      "title": "Wall Street is loving GM right now",
      "summary": "Analysts are bullish on General Motors (GM) after the company surpassed earnings expectations and increased its full-year guidance, leading to multiple price target raises from firms like Wedbush, J.P. Morgan, Deutsche Bank, and Barclays. The positive sentiment is driven by strong third-quarter results and strategic share buybacks, despite some challenges in the Chinese market and losses from its Cruise autonomous vehicle unit. GM's CFO anticipates further share count reduction, aiming to return excess capital to shareholders.",
      "url": "https://qz.com/general-motors-earnings-analyst-stock-raise-wall-street-1851679588",
      "source": "Quartz",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.355461,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.314323,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.611915
    },
    {
      "title": "So long London? Goldman Sachs is turning to Birmingham and Warsaw for talent in lower-cost European cities",
      "summary": "Goldman Sachs is expanding its operations in lower-cost European cities like Birmingham and Warsaw, moving away from traditional financial hubs like London. This strategy aims to reduce expenses and tap into a wider talent pool, as seen with their growing Birmingham office which is set to house up to 1,000 staff. Other major banks like JPMorgan Chase & Co. and Citigroup Inc. are following similar trends, contributing to economic boosts in cities outside of London.",
      "url": "https://fortune.com/europe/2024/09/16/wall-street-banks-hiring-low-cost-european-cities-goldman-sachs-birmingham/",
      "source": "Fortune",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.247758,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.249155,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.634648
    },
    {
      "title": "News | Rexford aids US industrial rebound with one of 2024's priciest Los Angeles deals",
      "summary": "Rexford Industrial Realty acquired a 300,000-square-foot warehouse in Los Angeles for $137.2 million, marking one of the region's most expensive industrial deals in 2024. This acquisition, coupled with increased import activity at Southern California ports and a rebound in U.S. consumer spending, signals a potential rebound in the industrial market despite recent softening. REITs like Rexford and EQT Exeter are increasingly driving industrial transactions, taking advantage of lower borrowing and purchase costs.",
      "url": "https://www.costar.com/article/548640563/rexford-aids-us-industrial-rebound-with-one-of-2024s-priciest-los-angeles-deals",
      "source": "CoStar",
      "published": "20241230T223900",
      "overall_sentiment_score": 0.238819,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.132497,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.639199
    },
    {
      "title": "Western Asset EMD team exits for PPM America",
      "summary": "Western Asset Management's (WAM) emerging markets debt team, comprising four investment professionals, has departed to join PPM America, a subsidiary of Jackson Financial. The team includes Mark Hughes, Kevin Ritter, Matthew Graves, and Kevin Zhang, who have worked together since 2008. They express excitement about joining PPM America due to its team-based culture and focus on fundamental research.",
      "url": "https://citywire.com/pro-buyer/news/western-asset-emd-team-exits-for-ppm-america/a2457669",
      "source": "Citywire",
      "published": "20250113T000000",
      "overall_sentiment_score": 0.153061,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.334199,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.618196
    },
    {
      "title": "Blackstone sells preferred equity stake in CityCenter to Realty Income",
      "summary": "Blackstone Inc. is selling a preferred equity stake in the CityCenter Las Vegas complex to Realty Income Corp. for $800 million, while Blackstone Real Estate will retain 100% common equity ownership. This investment is expected to provide Realty Income with an initial unlevered return rate of 7.4% and increases its 2025 investment volume outlook to over $6.0 billion. The transaction builds on a strategic relationship between the two companies, with the property continuing to be operated by MGM Resorts International under an existing triple net lease.",
      "url": "https://www.investing.com/news/stock-market-news/blackstone-sells-preferred-equity-stake-in-citycenter-to-realty-income-93CH-4384831",
      "source": "Investing.com",
      "published": "20250112T170900",
      "overall_sentiment_score": 0.173831,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.010465,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.577824
    },
    {
      "title": "BankOnBuffalo parent company will acquire Pa. bank in $214M deal",
      "summary": "CNB Bank, the parent company of BankOnBuffalo, announced its first acquisition since 2020, agreeing to buy Essa Bank in an all-stock deal valued at $214 million. This move marks a significant expansion for CNB Bank within the banking sector.",
      "url": "https://www.bizjournals.com/buffalo/news/2025/01/10/cnb-bank-acquisition-essa-bank-bankonbuffalo.html",
      "source": "The Business Journals",
      "published": "20250110T000000",
      "overall_sentiment_score": 0.179006,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.105303,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.622561
    },
    {
      "title": "KeyCorp appoints J.P. Morgan vet as new head of Key Family Wealth",
      "summary": "KeyCorp has appointed Robert Weiss, a J.P. Morgan veteran, as the new head of its Key Family Wealth business. Weiss succeeds Gary Poth and will report to Key Wealth president Joe Skarda. This appointment comes during a period of significant growth for Key's wealth management business, which has been a strong contributor to the company's fee income.",
      "url": "https://www.crainscleveland.com/banking-finance/keycorp-names-robert-weiss-head-key-family-wealth",
      "source": "Crain's Cleveland Business",
      "published": "20250106T145000",
      "overall_sentiment_score": 0.227234,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.145643,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.739172
    },
    {
      "title": "Thanks to AI Demand, Analysts are Doubling Down on These 2 Utility Stocks for 2025",
      "summary": "Analysts are recommending PPL Corporation (PPL) and Entergy Corporation (ETR) as top utility stock picks for 2025, driven by surging electricity demand from AI data centers. PPL is highlighted for its Kentucky generation and Pennsylvania transmission opportunities, while Entergy recently secured a significant deal with Meta Platforms to build new natural gas plants and support solar/battery capacity for a data center. Both companies are expected to benefit from increased earnings growth and robust infrastructure investment plans fueled by AI demand.",
      "url": "https://www.theglobeandmail.com/investing/markets/stocks/ETR/pressreleases/30310869/thanks-to-ai-demand-analysts-are-doubling-down-on-these-2-utility-stocks-for-2025/",
      "source": "The Globe and Mail",
      "published": "20250106T084500",
      "overall_sentiment_score": 0.424397,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.349932,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.56182
    },
    {
      "title": "Charles Schwab, Fidelity, Vanguard Customers Reported Log-In Troubles as Stocks Plummeted",
      "summary": "Customers of major brokerage firms like Charles Schwab, Fidelity, and Vanguard experienced log-in issues on Monday morning amidst a global stock market selloff. These technical difficulties prevented some clients from accessing their accounts during a critical period of market turbulence. The incidents highlight the challenges faced by financial institutions during high-volume trading events.",
      "url": "https://www.barrons.com/advisor/articles/schwab-fidelity-vanguard-outages-stock-market-selloff-897da5ad?gaa_at=eafs&gaa_n=AWEtsqcplX5XrY_9Q5vd9O1vD4m7XNL70xp5qytj5Uo0C3FLWlagm3ylcwIL&gaa_ts=69076148&gaa_sig=in_McYvdh4AF4Rpu36C3qG3mPuaYRlva7ZFiurrX7V4ZL2JYmqRvw1aXoit_am_LRyIeev4ZKYIeNlGgnwjDZg%3D%3D",
      "source": "Barron's",
      "published": "20241231T235959",
      "overall_sentiment_score": -0.140585,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.129946,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.648997
    },
    {
      "title": "Northern Trust Appoints Ayla Kalani Los Angeles Market Leader",
      "summary": "Northern Trust has appointed Ayla Kalani as Los Angeles Market Leader to head its wealth management business for high-net-worth individuals and families across Century City, Pasadena, and Santa Barbara. Kalani, who previously worked at J.P. Morgan Private Bank, brings extensive experience in investment management, private banking, and business development. Michele Havens, West Region President, highlighted Kalani's client-centric leadership and expertise in driving growth for the firm.",
      "url": "https://aijourn.com/northern-trust-appoints-ayla-kalani-los-angeles-market-leader/",
      "source": "The AI Journal",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.269793,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.129753,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.633699
    },
    {
      "title": "Bob Hoyt",
      "summary": "Bob Hoyt was appointed Group Chief Legal Officer of HSBC Holdings plc in January 2021. He previously served as Group General Counsel at Barclays plc and General Counsel and Chief Regulatory Affairs Officer for PNC Financial Services Group. Hoyt also held positions at the US Department of the Treasury and as Special Assistant and Associate Counsel to US President George W. Bush.",
      "url": "https://www.hsbc.com/who-we-are/our-people/senior-management/bob-hoyt",
      "source": "HSBC",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.123003,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.103812,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.628882
    },
    {
      "title": "Feds approved $1.3 billion Provident-Lakeland 'super-community bank' merger",
      "summary": "Federal officials have approved the $1.3 billion merger between Lakeland Bank and Provident Bank, creating a \"super community bank\" with over $25 billion in assets despite calls for tougher community banking standards. The merger comes after a redlining settlement against Lakeland Bank, with Provident inheriting the mandate to open branches in underserved areas. Critics express concerns that banking mergers lead to fewer branches and services for vulnerable populations, creating \"banking deserts.\"",
      "url": "https://www.northjersey.com/story/news/business/2024/04/15/feds-approve-provident-bank-lakeland-bank-merger-nj-community-banks/73326420007/",
      "source": "Bergen Record",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.221537,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.119983,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.609611
    },
    {
      "title": "Goldman Sachs, Carlyle CEOs race to $50 million bonuses with Trump election win",
      "summary": "The article discusses how a potential Donald Trump election win could lead to significant bonuses for CEOs at major Wall Street firms like Goldman Sachs and Carlyle Group. This anticipation is driven by investor expectations of lighter banking regulation, corporate tax cuts, and less resistance to corporate takeovers under a Trump administration, causing financial stocks to rally and helping executives meet performance targets for long-term incentive packages. CEOs such as David Solomon of Goldman Sachs and Harvey Schwartz of Carlyle Group stand to gain over $50 million each if their companies' stocks maintain current levels.",
      "url": "https://www.detroitnews.com/story/business/2024/11/08/goldman-sachs-carlyle-ceos-race-to-50-million-bonuses-with-trump-election-win/76130345007/",
      "source": "The Detroit News",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.369619,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.323336,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.846305
    },
    {
      "title": "Destra Capital to Acquire Altegris Funds",
      "summary": "Destra Capital Advisors LLC announced its acquisition of the investment management contracts for several Altegris/AACA and Altegris funds, along with related assets, including the Altegris Winton Futures Fund LP. This acquisition aims to enhance Destra's alternative investment offerings by integrating Altegris's multi-strategy, real estate, and managed futures solutions. The transaction, which includes adding three mutual funds and a private commodity pool to Destra's lineup and retaining Matt Osborne as Portfolio Manager, is expected to close in Q2 2024.",
      "url": "https://www.businesswire.com/news/home/20240327928461/en/Destra-Capital-to-Acquire-Altegris-Funds",
      "source": "Business Wire",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.297942,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.252009,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.630255
    },
    {
      "title": "Japan Joins the Rate-Hike Club As Rate Cuts Loom",
      "summary": "The Bank of Japan raised interest rates for the first time in 17 years, ending an eight-year experiment with negative rates. This move led to a sell-off in the yen and a rally in the Nikkei 225, contradicting typical market reactions to rate hikes but mirroring prior responses to negative rate implementations. The article suggests that negative rates act as a tax on the banking system, and their cessation could paradoxically stimulate economic growth, a trend observed in experiments with negative rates in Europe as well.",
      "url": "https://www.cmegroup.com/insights/economic-research/2024/japan-joins-the-rate-hike-club-as-rate-cuts-loom.html",
      "source": "CME Group",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.194412,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.109526,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.603291
    },
    {
      "title": "KeyCorp Deal Could Be a Model for Regional Banks",
      "summary": "KeyCorp's recent sale of a nearly 15% stake to Canada’s Bank of Nova Scotia for $2.8 billion has been met with a positive market reaction, with KeyCorp shares surging over 9%. This deal is seen as a potential model for other regional banks to build capital and reposition their bond portfolios. The market's upbeat response to this strategic move suggests it could be a blueprint for regional lenders navigating current economic landscapes.",
      "url": "https://www.wsj.com/finance/keycorp-deal-could-be-a-model-for-regional-banks-05ef70db?gaa_at=eafs&gaa_n=AWEtsqcpTbU_bMpahD-8jtDf0udUZq4LkZJHgv_juNBsIZnxy4hRjxELWztR&gaa_ts=690758fc&gaa_sig=QOLLltrWye5l2n7mSUegUkonJJx3VcoVC04rC4Lt1LGY1rL-X_qYRPkJGncNNACJONDgXdZZ3I7KBczoHTCY5g%3D%3D",
      "source": "The Wall Street Journal",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.218761,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.235372,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.577067
    },
    {
      "title": "J.M. Smucker's CEO says the family-run business is a 'meritocracy'",
      "summary": "Mark Smucker, CEO of J.M. Smucker and great-great-grandson of the founder, asserts that the family business operates as a meritocracy, despite its familial roots. He emphasizes that his position was earned through hard work and a non-linear path, not solely due to his family name. Smucker also outlined rules for his children interested in joining the company, including working elsewhere first and pursuing a graduate degree.",
      "url": "https://qz.com/jm-smucker-nepo-baby-meritocracy-1851396919",
      "source": "Quartz",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.134481,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.07412,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.615189
    },
    {
      "title": "4 Ways to Lock In Yields Above 5%",
      "summary": "With the Federal Reserve likely to begin cutting interest rates, investors are looking for ways to lock in current high yields. Strategies like multiyear guaranteed annuities and defined-maturity ETFs can help preserve income for one to five years. This proactive approach aims to counter the expected erosion of yields in money-market funds and high-yield savings accounts once rates decline.",
      "url": "https://www.wsj.com/finance/investing/secure-high-yield-4-strategies-d663ba88?gaa_at=eafs&gaa_n=AWEtsqcIvAyN_r_pK2J2RF2cMQf-uTvywAhUmB1qfK1fSorqp05YNSn9QHwS&gaa_ts=69074d6f&gaa_sig=VTMRFpMBFFtHke2cLZUW38LQ-YSTgMxlRQE2VWnkS1c8gjnJzRSNA4mob5br6bAjBLnyJ3hb8nX8b9jR7vAdsQ%3D%3D",
      "source": "The Wall Street Journal",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.093351,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.126144,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.603538
    },
    {
      "title": "|CoinDesk ownership Bullish fires top editorial staff amid newsroom controversy",
      "summary": "|Bullish, owner of CoinDesk, fired three top editors amidst controversy over an article about crypto billionaire Justin Sun. The dispute arose after Bullish leadership allegedly forced the removal of an accurate article critical of Sun, leading to internal backlash and resignations. This move casts doubt on CoinDesk's editorial independence, especially given Sun's company, Tron, is a major sponsor of CoinDesk's Consensus conference.",
      "url": "https://fortune.com/crypto/2024/12/20/coindesk-ownership-bullish-layoff-editors-kevin-reynolds-justin-sun/",
      "source": "Fortune",
      "published": "20241231T235959",
      "overall_sentiment_score": -0.17305,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.144805,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.614119
    },
    {
      "title": "Wells Fargo has fired a bunch of employees after finding out they were pretending to work",
      "summary": "Wells Fargo has fired over a dozen employees from its wealth and investment management team for \"simulating keyboard activity\" to appear busy while not actually working. This incident, revealed in a FINRA filing, highlights the use of \"mouse jigglers\" and similar tools by remote workers seeking to avoid detection. The bank's action supports the wider Wall Street push for employees to return to the office, contrasting with the benefits experts have noted for hybrid work models.",
      "url": "https://fortune.com/2024/06/14/wells-fargo-employees-keyboard-simulation-fake-work/",
      "source": "Fortune",
      "published": "20241231T235959",
      "overall_sentiment_score": -0.096353,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.10504,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.658047
    },
    {
      "title": "Deals & Recruiting Roundup: SEIA, Raymond James, Osaic, Citi, And More",
      "summary": "This Deals & Recruiting Roundup highlights significant movements in the wealth management industry including M&A activities by Focus and Savant, advisor recruitments by Raymond James and Bison Wealth, and strategic partnerships like Osaic with HarborOne. It also features key leadership appointments at Cetera, Ameriprise, WCG, and Citi, alongside J.P. Morgan Wealth Management topping J.D. Power rankings and a profile of Cameron Stagg of SEIA as Recruiter of the Month. Larry Roth's \"Larry's Take\" emphasizes the critical role of human talent and strong executive teams in the success and retention within wealth management firms.",
      "url": "https://www.wealthsolutionsreport.com/deals-recruiting-roundup-seia-raymond-james-osaic-citi-and-more/",
      "source": "Wealth Solutions Report",
      "published": "20241230T115600",
      "overall_sentiment_score": 0.30945,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.549095,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.627525
    },
    {
      "title": "JPMorgan Chase reportedly joins the 5-days-a-week RTO wave",
      "summary": "J.P. Morgan Chase & Co. is reportedly joining Goldman Sachs in requiring employees to work from the office five days a week, hinting at a potential new norm for financial services firms. CEO Jamie Dimon has been a strong proponent of in-person work, stating that \"In general, there's nothing like face-to-face.\" This move comes despite warnings from some experts about potential employee dissatisfaction and signaling employer mistrust regarding all-or-nothing work arrangements.",
      "url": "https://www.hrdive.com/news/jpmorgan-chase-reportedly-joins-the-5-days-a-week-rto-wave/736842/",
      "source": "HR Dive",
      "published": "20250108T000000",
      "overall_sentiment_score": 0.051166,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.106899,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 1.0
    },
    {
      "title": "2024 Top Mortgage Professionals In Orlando",
      "summary": "Orlando Magazine has published its list of 2024 Top Mortgage Professionals in Orlando, compiled by DataJoe Research. The list includes a diverse group of preferred lenders and mortgage professionals selected through an online peer-voting process and research campaign. The article features their names, companies, and websites as a resource for future homebuyers.",
      "url": "https://www.orlandomagazine.com/2024-top-mortgage-professionals-in-orlando/",
      "source": "Orlando Magazine",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.118966,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.112635,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.623483
    },
    {
      "title": "First bank failure of year is South Jersey’s Republic Bank; what it means for you",
      "summary": "Republic Bank, a South Jersey institution, became the first U.S. bank failure of the year on Friday, leading to its closure by a regulator and subsequent takeover by Fulton Bank. The FDIC appointed itself as receiver for Republic, which had approximately $6 billion in assets and $4 billion in deposits. Fulton Bank NA will acquire substantially all of Republic’s assets and assume its deposits, doubling Fulton’s presence in the Philadelphia market and ensuring uninterrupted access for Republic's customers.",
      "url": "https://www.courierpostonline.com/story/news/local/south-jersey/2024/04/26/republic-bank-failure-fulton-bank-acquires-assets-fdic/73476765007/",
      "source": "Courier-Post",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.031673,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.11651,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.640395
    },
    {
      "title": "AI Enables Major Healthcare Advances At JP Morgan Event",
      "summary": "The JP Morgan Healthcare Conference is increasingly focusing on AI's transformative role in medicine. Nvidia is a key player, powering digital healthcare devices and collaborating with institutions like Mayo Clinic and IQVIA to drive AI-driven diagnostics and genomic insights. The article posits that AI will revolutionize healthcare, particularly in eradicating diseases like cancer, by leveraging vast clinical data to develop personalized medicine.",
      "url": "https://www.forbes.com/sites/karlfreund/2025/01/13/ai-enables-major-healthcare-advances-at-jp-morgan-event/",
      "source": "Forbes",
      "published": "20250113T090000",
      "overall_sentiment_score": 0.356705,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.411666,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Students and graduates",
      "summary": "JPMorgan Chase offers various programs for students and graduates, including school programs, pre-internships, internships, and full-time roles, designed to foster skill development and career growth. The company emphasizes mentorship, growth opportunities, and community impact, with a focus on preparing entrants for diverse career paths, including technology.",
      "url": "https://www.jpmorganchase.com/careers/explore-opportunities/students-and-graduates",
      "source": "JPMorganChase",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.285963,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.500548,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Why It Might Be Time For A Small-Cap Comeback",
      "summary": "This article discusses the potential for a comeback in small-cap stocks in both the US and Europe, which have underperformed larger companies due to factors like interest rate hikes and slower growth. It suggests that with anticipated interest rate cuts and cheaper valuations, small-cap companies could see profitable returns. The piece also highlights specific ETFs and active management strategies for investors looking to capitalize on this potential shift.",
      "url": "https://finimize.com/content/why-it-might-be-time-for-a-small-cap-comeback",
      "source": "Finimize",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.199808,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.140988,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.608016
    },
    {
      "title": "Now You Can Avoid Taxes Like the Rich and Famous - WSJ",
      "summary": "This article discusses how technology, particularly AI, is making tax-optimization strategies more accessible to a broader audience, moving beyond the exclusive domain of sophisticated investors. It highlights the growing trend of products designed to defer tax payments, including new funds. The piece also explains basic income tax principles related to investments, such as interest, dividends, and capital gains.",
      "url": "https://www.wsj.com/finance/investing/tax-optimization-strategies-ai-6bd8927c?page=1&gaa_at=eafs&gaa_n=AWEtsqe4nYyLk-qNgOIHIkMZCdp53OG28vtlwEkUxZPbdIXh-3lfWKVoXwYV&gaa_ts=69076282&gaa_sig=FHvCQzqafp_zC48XPQPfTikg_YT9A5BOOG0xOkKSFW5BnsPza5q-vBqOtrZ1LqUlRBcLTEoLgqXmL3YzTxKnMQ%3D%3D",
      "source": "The Wall Street Journal",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.060936,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.113045,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.618342
    }
  ]
}