{
  "ticker": "JPM",
  "date": "2025-02-24",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T12:58:53.263434",
  "source": "alpha_vantage",
  "article_count": 24,
  "articles": [
    {
      "title": "Getty Images Holdings, Inc. Announces Comprehensive Refinancing of Approximately $1.042 Billion Existing Term Loans",
      "summary": "Getty Images Holdings, Inc. announced the comprehensive refinancing of approximately $1.042 billion in existing term loans, which were set to mature in February 2026. This refinancing involves new $580 million U.S. dollar and €440 million euro term facilities to repay the existing loans, enhancing the company's financial liquidity and agility. The company's $300 million senior unsecured notes due March 2027 remain outstanding.",
      "url": "https://www.globenewswire.com/news-release/2025/02/21/3030702/0/en/Getty-Images-Holdings-Inc-Announces-Comprehensive-Refinancing-of-Approximately-1-042-Billion-Existing-Term-Loans.html",
      "source": "GlobeNewswire",
      "published": "20250221T160600",
      "overall_sentiment_score": 0.493715,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.101671,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.633784
    },
    {
      "title": "YieldMax set to enter Europe with active income ETF",
      "summary": "YieldMax is expanding into the European market with an active income ETF, having filed for regulatory approval in Ireland for a big tech income strategy. The new UCITS-format ETF will be similar to its US counterpart, the YieldMax Target 12 Big 50 Option Income ETF (BIGY), aiming for a 12% annual income and capital appreciation. This move follows a trend of increasing covered call strategy launches in Europe by firms like JPMAM and BlackRock.",
      "url": "https://www.etfstream.com/articles/yieldmax-set-to-enter-europe-with-active-income-etf",
      "source": "ETF Stream",
      "published": "20250219T100658",
      "overall_sentiment_score": 0.187972,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.320709,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.606278
    },
    {
      "title": "Physically-backed gold ETFs do not lend their gold | Post by Joseph Cavatoni | Gold Focus blog",
      "summary": "This article clarifies that US-listed physically-backed gold ETFs, such as SPDR Gold Trust (GLD) and iShares Gold Trust (IAU), do not lend their gold due to product design and regulatory restrictions. Instead, the lending of gold ETF shares occurs between shareholders, contributing to market liquidity without involving the trusts directly. The author details why these ETFs cannot lend gold and explains the process of borrowing and lending ETF shares, emphasizing the benefits to the broader gold market.",
      "url": "https://www.gold.org/goldhub/gold-focus/2025/02/physically-backed-gold-etfs-do-not-lend-their-gold",
      "source": "World Gold Council",
      "published": "20250217T000000",
      "overall_sentiment_score": 0.152262,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.129516,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.638373
    },
    {
      "title": "This Innovative ETF Lets You Follow Republican Politicians’ Trades | KRUZ ETF",
      "summary": "The Unusual Whales Subversive Republican Trading ETF (KRUZ) allows investors to track the stock trades of Republican members of Congress and their spouses, capitalizing on their statistically uncanny market outperformance. This innovative ETF, which has outperformed the S&P 500 by over 50% since its inception, suggests that politicians may be trading on insider knowledge despite denials. While there are ethical concerns and reporting lags, the KRUZ ETF provides a legal method for investors to potentially benefit from these informed trades, with top holdings including JPMorgan Chase, Comfort Systems USA, and Nvidia.",
      "url": "https://247wallst.com/investing/2025/02/15/this-innovative-etf-lets-you-follow-republican-politicians-trades-kruz-etf/",
      "source": "24/7 Wall St.",
      "published": "20250215T085500",
      "overall_sentiment_score": 0.339905,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.234223,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.611784
    },
    {
      "title": "QQQ vs. XLG: Which Concentrated ETF Has More Upside from Here?",
      "summary": "This article compares two concentrated ETFs, Invesco QQQ Trust (QQQ) and Invesco S&P 500 Top 50 ETF (XLG), which both offer significant exposure to information technology and mega-cap companies. While QQQ tracks the Nasdaq 100, XLG focuses on the top 50 largest companies in the S&P 500, providing broader sector diversification beyond just tech. The author suggests XLG might be the better option for investors who appreciate mega-caps and seek better resilience against tech-induced market volatility due to its inclusion of strong financial firms.",
      "url": "https://247wallst.com/investing/2025/02/14/qqq-vs-xlg-which-concentrated-etf-has-more-upside-from-here/",
      "source": "24/7 Wall St.",
      "published": "20250214T155700",
      "overall_sentiment_score": 0.294905,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.328823,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.615449
    },
    {
      "title": "CompoSecure director John Cote buys $9.99m in Class A stock",
      "summary": "CompoSecure director John Cote recently purchased 646,893 shares of Class A Common Stock worth approximately $9.99 million between February 12 and 14, 2025. These transactions, made through affiliated entities, underscore Cote's strong confidence in CompoSecure, especially given the company's impressive 217% return over the past year and its strong financial health. The company is also undergoing strategic changes, including a spin-off of Resolute Holdings Management, Inc. and the elimination of its dual-class structure.",
      "url": "https://www.investing.com/news/insider-trading-news/composecure-director-john-cote-buys-999m-in-class-a-stock-93CH-3871738",
      "source": "Investing.com",
      "published": "20250214T093700",
      "overall_sentiment_score": 0.287399,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.125409,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.637374
    },
    {
      "title": "Super Micro says DOJ, SEC subpoenaed documents",
      "summary": "Super Micro Computer announced it received subpoenas from the Department of Justice and Securities and Exchange Commission following allegations in a short-seller report. This comes after the company's accounting drew scrutiny, leading to an auditor resignation and an internal probe. Despite the investigation, Super Micro's CEO expressed confidence in upcoming filings and reported strong preliminary financial results including significant revenue growth projections.",
      "url": "https://www.cfodive.com/news/supermicro-doj-sec-subpoenaed-documents-accounting/739992/",
      "source": "CFO Dive",
      "published": "20250212T000000",
      "overall_sentiment_score": -0.099326,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.108855,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.6232
    },
    {
      "title": "Goldman Sachs ends IPO diversity policy citing legal developments",
      "summary": "Goldman Sachs has cancelled its four-year-old policy requiring public companies to have two diverse board members to be taken public, citing \"legal developments.\" This move follows other corporations re-evaluating social policies amidst expectations of increased scrutiny from U.S. President Donald Trump, and comes after a court ruling against Nasdaq's board diversity requirement. Goldman Sachs stated it still believes in the benefits of diverse boards and will encourage companies to adopt this approach.",
      "url": "https://www.reuters.com/business/finance/goldman-sachs-ends-ipo-diversity-pledge-2025-02-11/",
      "source": "Reuters",
      "published": "20250211T162300",
      "overall_sentiment_score": 0.048891,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.049676,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.637532
    },
    {
      "title": "Analysis: The emerging vogue for active ETFs",
      "summary": "Active ETFs are gaining traction in the investment world, with new product launches from Jupiter, Avantis, and Robeco signaling a shift in investor interest. Despite currently representing a small portion of the global ETF market, demand is growing, particularly among professional investors looking for alpha generation, ease of use, transparency, and cost-effectiveness. However, their growth in the European market might be tempered by the lack of the tax advantages they enjoy in the US.",
      "url": "https://adv.portfolio-adviser.com/analysis-the-emerging-vogue-for-active-etfs/",
      "source": "PA Adviser",
      "published": "20250224T000000",
      "overall_sentiment_score": 0.23295,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.242645,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.642785
    },
    {
      "title": "Lucky Strike executive vice chairman Parker sells $20.2m in shares",
      "summary": "Lucky Strike executive vice chairman Brett I. Parker sold 1,747,434 shares of Class A common stock for approximately $20.2 million. This transaction occurred amidst a nearly 13% decline in the company's stock value and follows a fiscal second-quarter 2025 report that missed revenue and EBITDA expectations. Despite these challenges, Lucky Strike secured $150 million in new term loans and plans strategic growth, including converting 75 Bowlero locations and expanding its Family Entertainment Centers, while analysts show mixed opinions on its stock.",
      "url": "https://www.investing.com/news/insider-trading-news/lucky-strike-executive-vice-chairman-parker-sells-202m-in-shares-93CH-3884821",
      "source": "Investing.com",
      "published": "20250221T185200",
      "overall_sentiment_score": -0.239961,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.200175,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.619019
    },
    {
      "title": "Why iQIYI, Inc. (IQ) Crashed on Thursday",
      "summary": "Shares of iQIYI, Inc. (IQ) dropped significantly on Thursday following disappointing earnings performance in the last year and an announcement of fundraising activities. The company reported a net loss in Q4 2024 and a full-year revenue decline, leading to investor sell-offs. IQ plans to raise $300 million through convertible bond offerings to repay existing debt and for general corporate purposes.",
      "url": "https://finance.yahoo.com/news/why-iqiyi-inc-iq-crashed-122341871.html",
      "source": "Yahoo Finance",
      "published": "20250221T000000",
      "overall_sentiment_score": -0.045343,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.149816,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.608146
    },
    {
      "title": "Elme Communities could be for sale",
      "summary": "Elme Communities is evaluating strategic alternatives to maximize shareholder value, following a similar move by Aimco, as its stock trades at a discount to private market values. Analysts believe Elme is a likely M&A candidate due to its meaningful asset value discount and simple debt structure, but potential government reforms could introduce uncertainty. Goldman Sachs & Co. and Jones Lang LaSalle Securities are serving as financial advisors, with Hogan Lovells US as legal counsel.",
      "url": "https://www.multifamilydive.com/news/elme-communities-mergers-and-acquisitions-apartment-sales/740576/",
      "source": "Multifamily Dive",
      "published": "20250221T000000",
      "overall_sentiment_score": 0.12698,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.100828,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.635445
    },
    {
      "title": "Managing Cash With Money Market Funds vs. ETFs",
      "summary": "This article examines the growing trend of money market ETFs as an alternative to traditional money market mutual funds for cash management. It highlights key differences, including tradability, floating NAVs, and accessibility, while noting their similar regulatory frameworks and investment goals. The piece also discusses the impact of interest rates and market uncertainty on the appeal of these cash management tools.",
      "url": "https://www.etftrends.com/managing-cash-money-market-funds-etfs/",
      "source": "ETF Trends",
      "published": "20250221T000000",
      "overall_sentiment_score": 0.184165,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.105061,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.341168
    },
    {
      "title": "First Horizon Corporation to Participate in the 2025 RBC Capital Markets Global Financial Institutions Conference",
      "summary": "First Horizon Corporation announced that its Chairman, President, and CEO, Bryan Jordan, will participate in the 2025 RBC Capital Markets Global Financial Institutions Conference on March 4, 2025. A live webcast and audio replay will be available on the company's Investor Relations website. The company also provided an overview of its financial services and strong market position.",
      "url": "https://finance.yahoo.com/news/first-horizon-corporation-participate-2025-211500028.html",
      "source": "Yahoo Finance",
      "published": "20250220T211500",
      "overall_sentiment_score": 0.026357,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.093562,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.630753
    },
    {
      "title": "The One That Got Away: This Small Town Is Left in Limbo After Betting Big on GMO Salmon",
      "summary": "The town of Pioneer, Ohio, heavily invested in AquaBounty's GMO salmon farm, hoping for economic transformation and job creation. Despite significant public assistance and incentives, the project has stalled, leaving the town with unfulfilled promises and financial burdens. This article details the sequence of events, including the controversial role of the mayor, Ed Kidston, and the environmental and financial challenges that led to the project's failure.",
      "url": "https://www.propublica.org/article/aquabounty-pioneer-ohio-gmo-salmon-fish",
      "source": "ProPublica",
      "published": "20250218T050038",
      "overall_sentiment_score": -0.501709,
      "overall_sentiment_label": "Bearish",
      "ticker_sentiment_score": -0.123287,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.604173
    },
    {
      "title": "JPMorgan Chase reduces stake in PRS REIT to 6.37%",
      "summary": "JPMorgan Chase & Co. has reduced its stake in The PRS REIT PLC to 6.37% of voting rights, falling below the 7% threshold on November 27. The reduction, approximately 0.73 percentage points from its previous 7.10% holding, was made through its subsidiary J.P. Morgan Securities plc and included both direct voting rights and financial instruments. The PRS REIT specializes in the UK residential real estate market's private rented sector and trades on the London Stock Exchange.",
      "url": "https://www.investing.com/news/company-news/jpmorgan-chase-reduces-stake-in-prs-reit-to-637-93CH-4385349",
      "source": "Investing.com",
      "published": "20250212T044700",
      "overall_sentiment_score": 0.109749,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.103286,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.917632
    },
    {
      "title": "Wolfe Research upgrades American Homes 4 Rent stock rating to Outperform",
      "summary": "Wolfe Research upgraded American Homes 4 Rent (NYSE:AMH) to Outperform from Peerperform, setting a price target of $38.00 due to compelling valuation. The upgrade anticipates an 18% total return by year-end 2026, including dividends, highlighting the company's strong financial health and consistent dividend payments. This positive outlook comes despite \"imperfect\" market conditions, and follows a recent earnings beat and mixed analyst reactions including a downgrade from Goldman Sachs.",
      "url": "https://www.investing.com/news/analyst-ratings/wolfe-research-upgrades-american-homes-4-rent-stock-rating-to-outperform-93CH-4268281",
      "source": "Investing.com",
      "published": "20250210T065100",
      "overall_sentiment_score": 0.121407,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.34456,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.615355
    },
    {
      "title": "Artius II Acquisition completes IPO, raises $220 million",
      "summary": "Artius II Acquisition Inc. (NASDAQ: AACBU) announced the successful completion of its initial public offering, raising $220 million. The SPAC offered 22 million units at $10 each, with additional funds from a private placement to its sponsor. The proceeds are held in a trust account, and the company's shares and rights trade on Nasdaq under symbols AACB and AACBR, respectively.",
      "url": "https://www.investing.com/news/sec-filings/artius-ii-acquisition-completes-ipo-raises-220-million-93CH-3884506",
      "source": "Investing.com",
      "published": "20250221T160200",
      "overall_sentiment_score": 0.272103,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.110407,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.620408
    },
    {
      "title": "JPMorgan Chase CEO James Dimon sells $233.8 million in stock",
      "summary": "JPMorgan Chase CEO James Dimon sold 783,361 shares of company stock worth approximately $233.8 million on February 20, 2025, through pre-arranged trading plans. Despite the sale, Dimon maintains substantial holdings, and the stock is rated \"GOOD\" by InvestingPro. Recent company news includes preferred stock issuance, job cuts, an end to climate stress tests, and a survey indicating institutional traders' disinterest in cryptocurrency trading.",
      "url": "https://www.investing.com/news/insider-trading-news/jpmorgan-chase-ceo-james-dimon-sells-2338-million-in-stock-93CH-3882235",
      "source": "Investing.com",
      "published": "20250220T182300",
      "overall_sentiment_score": -0.078964,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.14368,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 1.0
    },
    {
      "title": "JP Morgan AM Aims to Convert $1.3B Mutual Fund to ETF",
      "summary": "J.P. Morgan Asset Management plans to convert its $1.3 billion JPMorgan Unconstrained Debt Fund into the JPMorgan Flexible Debt ETF (JFLX), pending board approval in May 2025. This move aims to provide enhanced trading flexibility, increased portfolio transparency, and potential tax efficiency for clients. The conversion reflects growing client interest in flexible investment strategies via ETFs, especially amidst market volatility.",
      "url": "https://www.connectmoney.com/stories/jp-morgan-am-aims-to-convert-1-3b-mutual-fund-to-etf/",
      "source": "connectmoney.com",
      "published": "20250220T065758",
      "overall_sentiment_score": 0.200221,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.425621,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Fidelity strengthens ETF portfolio focus with new suites",
      "summary": "Fidelity Investments has introduced two new suites of all-ETF model portfolios, strengthening its focus on wealth managers. These new offerings, Fidelity Target Allocation ETF Model Portfolios and Fidelity Target Risk ETF Model Portfolios, incorporate both proprietary and third-party ETFs and are designed to cater to various risk profiles. The firm noted a significant rise in ETF adoption among advisors, with 53% of portfolios including ETFs as of Q4 2024, up from 44% in 2023.",
      "url": "https://www.investmentnews.com/etfs/fidelity-strengthens-etf-portfolio-focus-with-new-suites/259396",
      "source": "InvestmentNews",
      "published": "20250220T000000",
      "overall_sentiment_score": 0.242894,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.253425,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.643918
    },
    {
      "title": "Active vs Passive ETFs – Insights from European Investors",
      "summary": "A new European ETF study reveals that while passive ETFs remain popular among European investors, active ETFs are rapidly gaining ground. The study highlights geographical differences in ETF adoption and investor perceptions of pros and cons, with BlackRock/iShares dominating passive ETFs and J.P. Morgan leading in active ETFs.",
      "url": "https://rankiapro.com/en/insights/active-vs-passive-etfs-insights-european-investors/",
      "source": "RankiaPro",
      "published": "20250217T000000",
      "overall_sentiment_score": 0.196736,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.301248,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.749423
    },
    {
      "title": "JP Morgan Unveils New Active ETF",
      "summary": "J.P. Morgan Asset Management has launched the JPMorgan Flexible Income ETF (JFLI) on the New York Stock Exchange, marking its first active multi-asset ETF. The fund, designed to offer a blend of income and capital growth across developed and emerging markets, has an expense ratio of 0.35%. This initiative aims to provide investors with a flexible and diversified solution in the growing multi-asset income category.",
      "url": "https://etftrends.com/jp-morgan-unveils-new-active-etf/",
      "source": "ETF Trends",
      "published": "20250213T000000",
      "overall_sentiment_score": 0.229478,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.443895,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.923505
    },
    {
      "title": "Understanding the Advantages of Active ETFs vs. Mutual Funds",
      "summary": "The article highlights the growing trend of investors moving from mutual funds to active ETFs, detailing several advantages of active ETFs. These benefits include greater liquidity, enhanced tax efficiency, increased transparency, and lower costs for investors, despite active ETFs still representing less than half of U.S.-listed ETFs. It also notes the increase in active ETF launches since 2019 and the entry of major asset managers like MFS Investment Management into the space.",
      "url": "https://www.etftrends.com/financial-literacy-channel/understanding-advantages-active-etfs-compared-mutual-funds/",
      "source": "ETF Trends",
      "published": "20250211T000000",
      "overall_sentiment_score": 0.143606,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.105104,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.330906
    }
  ]
}