{
  "ticker": "JPM",
  "date": "2025-06-09",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T13:00:04.260558",
  "source": "alpha_vantage",
  "article_count": 38,
  "articles": [
    {
      "title": "Ategrity Specialty Holdings LLC Announces Launch of Initial Public Offering",
      "summary": "Ategrity Specialty Holdings LLC has announced the launch of an initial public offering of 6,666,667 shares of common stock, with an expected price between $14.00 and $16.00 per share. The company will convert to Ategrity Specialty Insurance Company Holdings and plans to list its common stock on the New York Stock Exchange under the symbol \"ASIC.\" J.P. Morgan and Barclays are lead bookrunning managers for the offering, which aims to increase capitalization and financial flexibility.",
      "url": "https://programbusiness.com/news/ategrity-specialty-holdings-llc-announces-launch-of-initial-public-offering/",
      "source": "Program Business",
      "published": "20250609T200920",
      "overall_sentiment_score": 0.278292,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.246604,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.627998
    },
    {
      "title": "Flutter Entertainment Plc: Growth or Bubble?",
      "summary": "Flutter Entertainment Plc's stock is trending up following merger speculations and strategic expansion into the Brazilian online betting sector. While the company demonstrates financial strength with significant revenue and a sound debt-to-equity ratio, concerns exist around its profitability margins and the risks associated with aggressive expansion and new debt offerings. The article questions whether these moves signal a thriving future or a precarious business bubble, urging investors to closely monitor performance metrics and management's execution.",
      "url": "https://stockstotrade.com/news/flutter-entertainment-plc-flut-news-2025_06_09/",
      "source": "StocksToTrade",
      "published": "20250609T160400",
      "overall_sentiment_score": 0.286487,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.10654,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.610552
    },
    {
      "title": "Barclays Cuts More Than 200 Investment Bank Jobs to Reduce Costs",
      "summary": "Barclays Plc is preparing to cut over 200 jobs in its investment bank as part of CEO C.S. Venkatakrishnan’s strategy to increase profitability. The layoffs, affecting about 3% of the investment bank’s staff in areas like investment banking, global markets, and research, will include managing directors as the most senior roles impacted.",
      "url": "https://www.bloomberg.com/news/articles/2025-06-09/barclays-cuts-more-than-200-investment-bank-jobs-to-reduce-costs",
      "source": "Bloomberg.com",
      "published": "20250609T143000",
      "overall_sentiment_score": 0.160154,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.255657,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.943762
    },
    {
      "title": "Circle Announces Pricing of Upsized Initial Public Offering",
      "summary": "Circle Internet Group, Inc. has announced the pricing of its upsized initial public offering of 34,000,000 shares of Class A common stock at $31.00 per share, with shares expected to trade on the NYSE under \"CRCL\" starting June 5, 2025. The offering includes 14,800,000 shares from Circle and 19,200,000 from selling stockholders, with major investment banks serving as bookrunners. The company issues USDC and EURC stablecoins and offers financial technology services.",
      "url": "https://www.businesswire.com/news/home/20250604831596/en/Circle-Announces-Pricing-of-Upsized-Initial-Public-Offering",
      "source": "Business Wire",
      "published": "20250604T053023",
      "overall_sentiment_score": 0.257709,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.24066,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.629767
    },
    {
      "title": "Ategrity Specialty could raise up to $106.7m from IPO",
      "summary": "Ategrity Specialty Holdings LLC has launched an Initial Public Offering (IPO) of 6,666,667 shares of common stock, expecting to raise between $93.3 million and $106.7 million. The company has applied to list its common stock on the New York Stock Exchange under the symbol “ASIC” and aims to enhance capitalization, establish a public market, and grow its business. J.P. Morgan and Barclays are acting as joint lead bookrunning managers for the offering.",
      "url": "https://www.reinsurancene.ws/ategrity-specialty-could-raise-up-to-106-7m-from-ipo/",
      "source": "Reinsurance News",
      "published": "20250604T000000",
      "overall_sentiment_score": 0.278195,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.213991,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.628023
    },
    {
      "title": "Ategrity Specialty Holdings LLC Announces Launch of Initial Public Offering",
      "summary": "Ategrity Specialty Holdings LLC announced the launch of its initial public offering of 6,666,667 shares of common stock, with an expected price range of $14.00 to $16.00 per share. The company will convert to Ategrity Specialty Insurance Company Holdings and plans to list its common stock on the New York Stock Exchange under the symbol \"ASIC,\" using proceeds to grow its business and for general corporate purposes. J.P. Morgan and Barclays are acting as joint lead bookrunning managers for the offering.",
      "url": "https://markets.financialcontent.com/stocks/article/bizwire-2025-6-3-ategrity-specialty-holdings-llc-announces-launch-of-initial-public-offering",
      "source": "FinancialContent",
      "published": "20250603T075200",
      "overall_sentiment_score": 0.206106,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.149456,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.642896
    },
    {
      "title": "Fed lifts Wells Fargo’s asset cap",
      "summary": "The Federal Reserve has lifted the $1.95 trillion asset cap imposed on Wells Fargo since 2018, determining the bank met all conditions for its removal. While the growth restriction is gone, other provisions of the 2018 enforcement action remain in place. Analysts and Wells Fargo's CEO view this as a significant milestone, though some, like Sen. Elizabeth Warren, criticize the decision.",
      "url": "https://www.bankingdive.com/news/fed-lifts-wells-fargo-asset-cap/749736/",
      "source": "Banking Dive",
      "published": "20250603T000000",
      "overall_sentiment_score": 0.288349,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.225604,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.596591
    },
    {
      "title": "Norwalk-based financial technology company FactSet announces new CEO",
      "summary": "FactSet Research Systems, a Norwalk-based financial technology company, announced Sanoke Viswanathan as its new CEO, succeeding Phil Snow. Viswanathan, formerly an executive at JPMorgan Chase, is set to begin in September 2025. The article highlights Snow's decade-long tenure, FactSet's financial growth during his leadership, and details Viswanathan's compensation package and background.",
      "url": "https://www.ctpost.com/business/article/factset-norwalk-ceo-phil-snow-sanoke-viswanathan-20358784.php",
      "source": "CTPost",
      "published": "20250603T000000",
      "overall_sentiment_score": 0.28613,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.116259,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.622463
    },
    {
      "title": "MainStreet Bank reports vendor cyber incident that leaked customer info",
      "summary": "MainStreet Bank has disclosed a cyberattack on one of its vendors that resulted in the exposure of sensitive information for approximately 5% of its customers. While bank systems were not compromised and no funds were stolen, the incident highlights ongoing concerns among banking associations regarding the SEC's cyber incident disclosure rule. These associations argue that the rule forces premature disclosures, potentially aiding attackers and creating confusion over \"material impact.\"",
      "url": "https://therecord.media/Main-street-cyber-incident-bank",
      "source": "The Record from Recorded Future News",
      "published": "20250602T182713",
      "overall_sentiment_score": -0.172771,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.118101,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.635635
    },
    {
      "title": "These 4 Dividend ETFs (QQQI, JEPQ, SPYI, MSTY) Are Passive Income Machines",
      "summary": "This article highlights four high-yield exchange-traded funds (ETFs)—QQQI, JEPQ, SPYI, and MSTY—as tools for generating passive income. It details their individual characteristics, including distribution yields, expense ratios, underlying indices, and risk levels, to help investors diversify their portfolios and create a steady income stream. The author emphasizes that while some offer high yields and diversification, others carry higher risk for potentially larger returns.",
      "url": "https://247wallst.com/investing/2025/06/02/these-4-dividend-etfs-qqqi-jepq-spyi-msty-are-passive-income-machines/",
      "source": "24/7 Wall St.",
      "published": "20250602T111300",
      "overall_sentiment_score": 0.330409,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.260901,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.56191
    },
    {
      "title": "Chime Financial (CHYM) IPO: What You Need to Know",
      "summary": "Chime Financial, a prominent digital-first banking platform, is set to go public on the Nasdaq Global Select Market under the ticker “CHYM,” following its S-1 filing on May 13, 2025. The IPO involves an offering of 32 million Class A shares priced between $24.00 and $26.00, with proceeds aimed at funding product innovation, customer acquisition, and potential M&A. While promising significant growth in the fintech sector, the offering presents risks for investors due to its dual-class share structure, founder control, and current lack of profitability.",
      "url": "https://www.tradingcalendar.com/post/chime-chym-ipo",
      "source": "www.tradingcalendar.com",
      "published": "20250602T000000",
      "overall_sentiment_score": 0.148722,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.112032,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.620169
    },
    {
      "title": "Bitcoin, Banks, Brokers Will Decide Next Big Market Move, Says BofA's Hartnett",
      "summary": "Bank of America's chief strategist Michael Hartnett suggests that the next major market move will be determined by the performance of brokers, banks, and Bitcoin. He indicates that markets are at a tipping point, with upward breaks in these areas signaling bullish sentiment and downward breaks suggesting a sharp reversal. Hartnett also discusses \"peak tariffs,\" a bearish dollar outlook favoring gold and international equities, and warns of a potential \"bigger bubble\" if U.S. policymakers cut tariffs, taxes, and interest rates.",
      "url": "https://www.sahmcapital.com/news/content/bitcoin-banks-brokers-will-decide-next-big-market-move-says-bofas-hartnett-2025-05-30",
      "source": "Sahm",
      "published": "20250530T174200",
      "overall_sentiment_score": 0.352444,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.379922,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.636316
    },
    {
      "title": "Better Dividend Growth ETF: Vanguard Dividend Appreciation ETF or iShares Core Dividend Growth ETF",
      "summary": "This article compares two prominent dividend growth ETFs: the Vanguard Dividend Appreciation ETF (VIG) and the iShares Core Dividend Growth ETF (DGRO). It details their different index tracking methodologies, top holdings, expense ratios, and historical performance to help investors decide which fund is better suited for their dividend growth strategy. While DGRO offers a slightly higher yield, VIG boasts a lower expense ratio, making both solid options depending on investor priorities.",
      "url": "https://finviz.com/news/70430/better-dividend-growth-etf-vanguard-dividend-appreciation-etf-or-ishares-core-dividend-growth-etf",
      "source": "Finviz",
      "published": "20250530T103300",
      "overall_sentiment_score": 0.292624,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.33128,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.611945
    },
    {
      "title": "Is Ulta’s Stock a Beauty Buy?",
      "summary": "Ulta Beauty Inc. (ULTA) experienced a 15.44% stock increase driven by strong Q1 fiscal 2025 results, exceeding analyst predictions for net sales and EPS. The company also raised its fiscal 2025 projections, leading to increased price targets from Oppenheimer and Deutsche Bank. Despite some caution regarding increased SG&A, analysts generally maintain an \"outperform\" or \"buy\" rating, indicating confidence in Ulta's strategic growth and market resilience.",
      "url": "https://stockstotrade.com/news/ulta-beauty-inc-ulta-news-2025_05_30/",
      "source": "StocksToTrade",
      "published": "20250530T100400",
      "overall_sentiment_score": 0.275203,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.105231,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.624533
    },
    {
      "title": "ACI Worldwide Launches Cloud Payments Platform Connetic",
      "summary": "ACI Worldwide has launched ACI Connetic, a new cloud-native payments platform designed to consolidate multiple payment processing systems into a single hub. This platform integrates various major payment networks, including Swift cross-border payments and RTGS systems. ACI Connetic aims to help banks modernize their infrastructure, streamline operations, and reduce complexity by offering a scalable, intelligent, and resilient solution for faster and more secure payments.",
      "url": "https://fintechmagazine.com/articles/aci-worldwide-launches-cloud-payments-platform-connetic",
      "source": "FinTech Magazine",
      "published": "20250528T130851",
      "overall_sentiment_score": 0.182042,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.061467,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.560754
    },
    {
      "title": "Irving’s Caris Life Sciences Files for IPO, Backed by AI-Driven Precision Oncology Platform",
      "summary": "Irving-based Caris Life Sciences, a leader in precision oncology, has filed for an initial public offering (IPO) to list its Class A common stock on the Nasdaq Global Select Market under the ticker symbol CAI. The company, founded in 2008, uses an AI-driven platform that integrates genomic, proteomic, and clinical data to provide personalized cancer insights. Caris has raised $1.86 billion since 2018 and recently secured $168 million in growth capital, positioning itself for expansion in the competitive AI-powered healthcare sector.",
      "url": "https://dallasinnovates.com/irvings-caris-life-sciences-files-for-ipo-backed-by-ai-driven-precision-oncology-platform/",
      "source": "Dallas Innovates",
      "published": "20250528T000831",
      "overall_sentiment_score": 0.312501,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.273595,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.629387
    },
    {
      "title": "AI health tech company Caris Life files to go public on the Nasdaq",
      "summary": "Caris Life Sciences, an Irving-based AI health tech company, has filed an S-1 registration statement to go public on the Nasdaq. The diagnostic firm specializes in using AI and machine learning to identify cancer signals and predict patient response, having raised nearly $2 billion since 2018. This move comes as the technology IPO market faces significant uncertainty and volatility.",
      "url": "https://www.dallasnews.com/business/2025/05/27/ai-health-tech-company-caris-life-files-to-go-public-on-the-nasdaq/",
      "source": "Dallas News",
      "published": "20250527T165400",
      "overall_sentiment_score": 0.24856,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.310638,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.616096
    },
    {
      "title": "Baker Hughes Announces Sale of Precision Sensors & Instrumentation Product Line to Crane Company for $1.15 Billion",
      "summary": "Baker Hughes announced the sale of its Precision Sensors & Instrumentation (PSI) product line, including the Druck, Panametrics, and Reuter-Stokes brands, to Crane Company for approximately $1.15 billion. This divestiture aligns with Baker Hughes' strategy to optimize its portfolio, focus on core competencies, and reallocate capital to higher-return opportunities. The transaction, pending regulatory approvals, is expected to close in late 2025 or early 2026.",
      "url": "https://www.nasdaq.com/articles/baker-hughes-announces-sale-precision-sensors-instrumentation-product-line-crane-company",
      "source": "Nasdaq",
      "published": "20250609T084400",
      "overall_sentiment_score": 0.143427,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.133893,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.645744
    },
    {
      "title": "Qudian: A slow-motion privatization?",
      "summary": "Qudian (QD.US) has announced it is considering winding down its last-mile delivery service due to intense competition, which caused its revenue to drop by more than half in the first quarter of 2025. The company has a history of failed business ventures but maintains a large cash holding, which its founder, Luo Min, has been using for share buybacks, possibly signaling a slow move towards privatization.",
      "url": "https://thebambooworks.com/qudian-a-slow-motion-privatization/",
      "source": "thebambooworks.com",
      "published": "20250606T070934",
      "overall_sentiment_score": 0.091363,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.121164,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.612163
    },
    {
      "title": "Goldman Sach’s GPIQ ETF is beating JPMorgan’s JEPQ: Is it a buy?",
      "summary": "The article compares two covered call ETFs, Goldman Sachs' GPIQ and JPMorgan's JEPQ, highlighting that GPIQ has shown superior performance in total return despite being the underdog. Both ETFs aim to provide exposure to technology companies and monthly dividends through a covered call strategy, but GPIQ has a lower expense ratio and a more dynamic approach. While past performance isn't definitive, the article suggests GPIQ might be the better choice for those looking to complement Nasdaq 100 index investments.",
      "url": "https://invezz.com/news/2025/06/04/goldman-sachs-gpiq-etf-is-beating-jpmorgans-jepq-is-it-a-buy/",
      "source": "Invezz",
      "published": "20250604T080957",
      "overall_sentiment_score": 0.150676,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.119062,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.600289
    },
    {
      "title": "KKR ranks as top alternative asset manager in Fortune 500",
      "summary": "KKR led among alternative asset managers, including Blackstone and Apollo Global Management, by ranking 145th on the Fortune 500 this year, despite having the smallest assets under management compared to the other two firms. While private equity has faced challenges with declining exits and fundraising, these firms have diversified into credit, real estate, and infrastructure to mitigate the impact. KKR, with $664 billion in AUM and $30 billion in gross revenue, surpassed Apollo and Blackstone in the rankings based on revenue.",
      "url": "https://fortune.com/2025/06/04/kkr-ranks-as-top-alternative-asset-manager-in-fortune-500/",
      "source": "Fortune",
      "published": "20250604T080100",
      "overall_sentiment_score": -0.067244,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.128412,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.555264
    },
    {
      "title": "Who owns WWE after the TKO merger (and before) | Vince McMahon, Dwayne Johnson, Ari Emanuel ownership - as of June 2025",
      "summary": "This article details the ownership structure of WWE after the TKO merger, highlighting Silver Lake's controlling stake through Endeavor, which now owns over 60% of TKO shares. It explains how Vince McMahon lost his controlling ownership after the merger, retaining only about 3% of TKO stock after selling shares in June 2025. The piece also outlines the roles of key executives like Ari Emanuel and Mark Shapiro, and details Dwayne \"The Rock\" Johnson's addition to the TKO Board and his stock compensation.",
      "url": "https://wrestlenomics.com/articles/2024/who-owns-wwe-after-the-tko-merger-and-before/",
      "source": "Wrestlenomics",
      "published": "20250604T012514",
      "overall_sentiment_score": 0.120223,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.139818,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.647501
    },
    {
      "title": "FactSet anuncia Sanoke Viswanathan como CEO",
      "summary": "A FactSet Research Systems Inc. anunciou Sanoke Viswanathan como seu novo CEO, a partir de setembro de 2025, sucedendo Phil Snow que se aposentará. Viswanathan, ex-JPMorgan Chase, traz vasta experiência em liderança, inovação digital e crescimento global, e sua escolha alinha-se com a estratégia da FactSet de impulsionar o crescimento e fortalecer sua posição em soluções financeiras baseadas em dados através de IA e análise de dados. A empresa, sob a liderança anterior de Phil Snow, dobrou sua receita e expandiu sua base de clientes, e projeta receita anual entre US$ 2,305 bilhões e US$ 2,325 bilhões.",
      "url": "https://br.advfn.com/jornal/2025/06/factset-anuncia-sanoke-viswanathan-como-ceo",
      "source": "ADVFN",
      "published": "20250603T000818",
      "overall_sentiment_score": 0.187378,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.117327,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.605549
    },
    {
      "title": "US Regulators Reportedly Set To Ease Bank Leverage Rules In Major Post-2008 Crisis Rollback",
      "summary": "This article reports that U.S. regulators are reportedly preparing to ease bank leverage rules. This move would represent a significant rollback of regulations that were implemented after the 2008 financial crisis. The changes could impact how banks manage their capital and risk.",
      "url": "https://www.msn.com/en-us/money/markets/us-regulators-reportedly-set-to-ease-bank-leverage-rules-in-major-post-2008-crisis-rollback/ar-AA1FU5Rs?ocid=finance-verthp-feeds&apiversion=v2&noservercache=1&domshim=1&renderwebcomponents=1&wcseo=1&batchservertelemetry=1&noservertelemetry=1",
      "source": "MSN",
      "published": "20250601T132828",
      "overall_sentiment_score": 0.315442,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.315177,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.710586
    },
    {
      "title": "Apollo Teams Up With JPMorgan, Goldman to Trade Private Credit",
      "summary": "Apollo Global Management Inc. is collaborating with JPMorgan Chase & Co., Goldman Sachs Group Inc., and three other banks to expand private credit trading. These banks will act as broker-dealers, facilitating the syndication of investment-grade debt originated by Apollo by either buying the debt or brokering sales to third parties. Citigroup Inc. is also reportedly in discussions to join this initiative.",
      "url": "https://www.bloomberg.com/news/articles/2025-05-29/apollo-teams-up-with-jpmorgan-goldman-to-trade-private-credit",
      "source": "Bloomberg.com",
      "published": "20250529T150400",
      "overall_sentiment_score": 0.373183,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.331488,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.933128
    },
    {
      "title": "Apollo Global Management Partners With Banks to Trade Private Credit",
      "summary": "Apollo Global Management is partnering with five banks, including JPMorgan Chase & Co. and Goldman Sachs Group, to create a marketplace for trading private credit. This collaboration aims to increase liquidity, enabling Apollo to originate larger loans and cater more effectively to individual investors. The initiative also supports the banks' plans to build trading desks in the growing private credit market, which has boomed to an estimated $1.7 trillion.",
      "url": "https://www.pymnts.com/news/banking/2025/apollo-global-management-partners-with-banks-to-trade-private-credit/",
      "source": "PYMNTS.com",
      "published": "20250529T004528",
      "overall_sentiment_score": 0.316788,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.345029,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.84957
    },
    {
      "title": "M & T Bank a Top Socially Responsible Dividend Stock With 2.9% Yield (MTB)",
      "summary": "M&T Bank Corp (MTB) has been recognized as a Top Socially Responsible Dividend Stock by Dividend Channel due to its strong 2.9% yield and adherence to social and environmental criteria. The company is also a constituent of the iShares USA ESG Select ETF (SUSA). M&T Bank pays an annualized dividend of $5.4/share, with its most recent ex-date being June 2, 2025.",
      "url": "https://www.nasdaq.com/articles/m-t-bank-top-socially-responsible-dividend-stock-29-yield-mtb",
      "source": "Nasdaq",
      "published": "20250528T074000",
      "overall_sentiment_score": 0.193008,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.127691,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.621902
    },
    {
      "title": "NVDY: Attractive Into Nvidia's Q1 Report, With Stock +50% From The April Low",
      "summary": "This article reiterates a buy rating on the YieldMax NVDA Option Income Strategy ETF (NVDY), citing its high option income potential. Despite underperforming NVDA and having a high expense ratio, NVDY's yield, sourced from call option selling, is compelling given NVIDIA's valuation and upcoming Q1 results. The author suggests NVDY offers an attractive risk/reward for income-focused investors, especially as NVIDIA approaches its earnings report.",
      "url": "https://seekingalpha.com/article/4789948-nvdy-etf-attractive-into-nvidia-q1-with-stock-plus-50-percent-from-the-april-low",
      "source": "Seeking Alpha",
      "published": "20250526T232700",
      "overall_sentiment_score": 0.225789,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.011843,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.616617
    },
    {
      "title": "Caris Life Sciences files registration statement for proposed IPO",
      "summary": "Caris Life Sciences has filed a registration statement with the US SEC for a proposed initial public offering of its Class A common stock. The company plans to list its shares on the Nasdaq Global Select Market under the ticker symbol “CAI”. Major financial institutions including BofA Securities, J.P. Morgan, and Goldman Sachs & Co. LLC will serve as lead book-running managers for the offering.",
      "url": "https://medicalbuyer.co.in/caris-life-sciences-files-registration-statement-for-proposed-ipo/",
      "source": "Medical Buyer",
      "published": "20250526T052237",
      "overall_sentiment_score": 0.193893,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.136063,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.648018
    },
    {
      "title": "Jefferies hires Lazard's Thomas for activism defense, sources say",
      "summary": "Jefferies has hired Richard Thomas, a veteran Lazard banker, as the global head of its activism defense practice, as companies face increasing pressure from activist investors. Thomas, formerly co-head of Lazard's Equity Advisory, will replace Chris Young and report to Chris Roop, head of M&A for the Americas. The move highlights the growing importance of activism defense as a lucrative business for investment banks.",
      "url": "https://www.reuters.com/sustainability/sustainable-finance-reporting/jefferies-hires-lazards-thomas-activism-defense-sources-say-2025-06-04/",
      "source": "Reuters",
      "published": "20250604T201900",
      "overall_sentiment_score": 0.077286,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.132783,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.644218
    },
    {
      "title": "Priming Asia’s ETF growth",
      "summary": "The Asia Pacific ex-Japan ETF market is experiencing significant growth, with assets reaching a record $979.3 billion by July 2024, driven by market volatility and demand for diversified, cost-efficient products. Banks and their Delta-One desks play a crucial role in enabling this growth by providing access to complex markets, seeding new ETFs, market making, and offering comprehensive end-to-end services. The article highlights HSBC's strong position in this evolving landscape due to its global reach, robust balance sheet, and full-service offering, especially in supporting the expanding Asia-Middle East trade corridor.",
      "url": "https://www.euromoney.com/article/ci50481mmrwo8s400kckw8ssw/sponsored-content/priming-asias-etf-growth/",
      "source": "Euromoney",
      "published": "20250529T000000",
      "overall_sentiment_score": 0.262523,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.320954,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.607204
    },
    {
      "title": "JPM swaps PMs on 2 mid-cap funds with combined $17bn",
      "summary": "JP Morgan Asset Management is making changes to the portfolio management teams of two mid-cap funds, the $11.7bn JPMorgan Mid Cap Growth fund and the $5.3bn JPMorgan Mid Cap Equity fund. Daniel Bloomgarden has moved to a new role within the firm's multi-asset solutions group as global head of research, and Michael Stein has been added to both funds. These changes were effective on May 27.",
      "url": "https://citywire.com/pro-buyer/news/jpm-swaps-pms-on-2-mid-cap-funds-with-combined-17bn/a2466807",
      "source": "Citywire",
      "published": "20250528T000000",
      "overall_sentiment_score": 0.049025,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.002518,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 1.0
    },
    {
      "title": "Best Finance Stocks in USA December 2025",
      "summary": "This article provides a list of top-performing finance stocks in the USA for December 2025, curated by Meyka AI based on factors like value, growth, momentum, and investor interest. It highlights leading companies in banking, insurance, payments, and fintech, offering a comprehensive table with financial data for each stock. The article also explains why tracking finance stocks is important for market insight and opportunity discovery.",
      "url": "https://meyka.com/market/US/finance-stocks/",
      "source": "Meyka",
      "published": "20250605T140940",
      "overall_sentiment_score": 0.277639,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.429474,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Low-cost index funds for simple investing",
      "summary": "This article highlights the benefits of low-cost index funds as an efficient and transparent way to invest, often outperforming actively managed funds. It explains passive investing principles, compares passive vs. active strategies, and provides a selection of low-fee tracker index funds across different geographies (UK, US, Emerging Markets, Global) for investors to consider. The piece emphasizes the importance of low costs and suggests factors to consider when choosing index funds and ETFs.",
      "url": "https://moneyweek.com/investments/funds/604317/best-low-cost-index-funds-to-buy",
      "source": "MoneyWeek",
      "published": "20250604T160926",
      "overall_sentiment_score": 0.226813,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.312117,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.622138
    },
    {
      "title": "Bonds with credit risk may outperform government debt",
      "summary": "Tariffs and expansionary fiscal policies have shifted the global bond landscape, leading to a weaker outlook for developed market sovereign bonds. However, this environment presents opportunities in corporate credit and select emerging market bonds, which are entering this period with improved credit quality and may offer diversification benefits. Higher inflation and slowing growth are expected to keep the Federal Reserve on hold, while other central banks might lower rates.",
      "url": "https://www.troweprice.com/financial-intermediary/us/en/insights/articles/2025/q2/bonds-with-credit-risk-may-outperform-government-debt.html",
      "source": "T. Rowe Price",
      "published": "20250601T000000",
      "overall_sentiment_score": 0.215149,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.126381,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.327752
    },
    {
      "title": "A envergadura de TI do JPMorgan Chase & Co.",
      "summary": "Darrin Alves, CIO de plataformas de infraestrutura do JPMorgan Chase & Co. (JPMC), detalha a estratégia de TI do banco, que combina data centers corporativos robustos com uma abordagem multinuvem e híbrida. A empresa, um gigante bancário, visa resiliência e eficiência, tendo superado a meta de mover uma grande porcentagem de seus dados e aplicações para a nuvem. Apesar dos investimentos significativos em tecnologia, o JPMC mantém e otimiza seus data centers on-premise, priorizando segurança e conformidade regulatória.",
      "url": "https://www.datacenterdynamics.com/br/an%C3%A1lises/a-envergadura-de-ti-do-jpmorgan-chase-co/",
      "source": "Data Center Dynamics",
      "published": "20250529T000848",
      "overall_sentiment_score": 0.180347,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.446931,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "BNP Paribas AM launches European defence ETF",
      "summary": "BNP Paribas Asset Management has launched the \"Easy Bloomberg Europe Defense ETF\" on the Euronext Paris exchange, with plans for wider availability. This ETF focuses on European defence stocks, replicating the Bloomberg Europe Defense Select Index, and aims to capitalize on increased government spending in the defence sector. The launch follows similar initiatives by other asset managers and offers investors a diversified portfolio of companies involved in various aspects of the defence industry.",
      "url": "https://funds-europe.com/bnp-paribas-asset-management-launches-european-defence-etf/",
      "source": "Funds Europe",
      "published": "20250527T085828",
      "overall_sentiment_score": 0.257039,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.338566,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.611175
    },
    {
      "title": "Circle Launches Initial Public Offering",
      "summary": "Circle Internet Group, Inc. announced the launch of its initial public offering of 24,000,000 shares of Class A common stock, with 9,600,000 shares offered by Circle and 14,400,000 by selling stockholders. The initial public offering price is expected to be between $24.00 and $26.00 per share, and the company has applied to list its Class A common stock on the NYSE under the ticker symbol \"CRCL\". J.P. Morgan, Citigroup, and Goldman Sachs & Co. LLC are acting as joint lead active bookrunners for the offering.",
      "url": "https://www.circle.com/pressroom/circle-launches-initial-public-offering",
      "source": "Circle Internet",
      "published": "20250527T000000",
      "overall_sentiment_score": 0.367262,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.335197,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.740274
    }
  ]
}