{
  "ticker": "JPM",
  "date": "2025-03-17",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T12:59:07.404933",
  "source": "alpha_vantage",
  "article_count": 18,
  "articles": [
    {
      "title": "Capstone Holdings’ Unanticipated Surge: Is Now the Time?",
      "summary": "Capstone Holding Corp. (CAPS) experienced a significant 15.6% stock surge fueled by reports of a successful AI firm partnership and a new secondary offering of 1.25 million shares at $4.00 each. While the company's financial canvas shows a modest EBITDA margin and a high debt-to-equity ratio, its strong asset turnover and interest coverage provide some stability. Investors are evaluating whether this surge signals a genuine growth trajectory or is merely speculative, with market observers watching closely how the secondary offering impacts future performance.",
      "url": "https://stockstotrade.com/news/capstone-holding-corp-caps-news-2025_03_17-2/",
      "source": "StocksToTrade",
      "published": "20250317T140400",
      "overall_sentiment_score": 0.105112,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.218652,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.640111
    },
    {
      "title": "Goldman Sachs offers its newest option for downside protection in volatile markets",
      "summary": "Goldman Sachs Asset Management has launched a new buffer exchange-traded fund, the Goldman Sachs U.S. Large Cap Buffer 3 ETF, designed to offer investors downside protection in volatile markets. This ETF aims to protect against losses of 5% to 15% while still allowing for 5% to 7% upside participation, resetting quarterly. The firm's Chief Transformation Officer, Bryon Lake, introduced the product as a \"tried and true strategy\" for dealing with market uncertainty.",
      "url": "https://www.nbcwashington.com/news/business/money-report/goldman-sachs-offers-its-newest-option-for-downside-protection-in-volatile-markets/3868684/",
      "source": "NBC4 Washington",
      "published": "20250315T043203",
      "overall_sentiment_score": 0.228482,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.143538,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.622441
    },
    {
      "title": "2024 Annual Report",
      "summary": "Goldman Sachs' 2024 Annual Report highlights strong financial performance with significant increases in net revenues, earnings per share, and return on equity. The report details the success of its Global Banking & Markets and Asset & Wealth Management divisions, the formation of the Capital Solutions Group, and ongoing investments in efficiency and people. Chairman and CEO David Solomon discusses the firm's strategic path, challenges, and future outlook amidst a dynamic global economic environment.",
      "url": "https://www.goldmansachs.com/investor-relations/financials/current/annual-reports/2024-annual-report",
      "source": "Goldman Sachs",
      "published": "20250314T000000",
      "overall_sentiment_score": 0.285215,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.204239,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.629876
    },
    {
      "title": "Wells Fargo SWOT 2025 | SWOT Analysis of Wells Fargo",
      "summary": "This article provides an in-depth SWOT analysis of Wells Fargo for 2025, detailing its strengths such as global presence and strong financials, and weaknesses including past scandals and aging systems. It also identifies opportunities like increasing investment banking share and digital transformation, alongside threats such as economic fluctuations and intense competition.",
      "url": "https://bstrategyhub.com/wells-fargo-swot-analysis/",
      "source": "Business Strategy Hub",
      "published": "20250313T000000",
      "overall_sentiment_score": 0.080363,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.126065,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.642796
    },
    {
      "title": "Board Approves Termination of Investment Sub-Advisory Agreement for First Trust TCW Securitized Plus ETF",
      "summary": "First Trust Advisors L.P. announced that the Board of Trustees of First Trust Exchange-Traded Fund VIII voted to terminate the investment sub-advisory agreement for the First Trust TCW Securitized Plus ETF, effective May 9, 2025. First Trust Advisors L.P. will assume portfolio management responsibilities for the Fund, maintaining existing investment strategies. The company, along with its affiliate First Trust Portfolios L.P., manages approximately $266 billion in collective assets.",
      "url": "https://markets.financialcontent.com/lethbridgeherald/article/bizwire-2025-3-11-board-approves-termination-of-investment-sub-advisory-agreement-for-first-trust-tcw-securitized-plus-etf",
      "source": "FinancialContent",
      "published": "20250311T080000",
      "overall_sentiment_score": 0.085695,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.427924,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.604702
    },
    {
      "title": "NY State Senators Urge Comptroller DiNapoli to Begin Pension Fund Divestment in Tesla, Inc.",
      "summary": "New York State Senators are urging Comptroller Thomas DiNapoli to begin divesting the state's pension fund from Tesla, Inc. Citing Tesla's recent stock volatility and significant profit decline, the senators believe that divestment is a prudent step to protect the long-term stability of the pension fund, which serves over one million members. The letter highlights a 28% plunge in Tesla shares in February and a 71% drop in Q4 2024 profits compared to the previous year.",
      "url": "https://www.nysenate.gov/newsroom/press-releases/2025/patricia-fahy/ny-state-senators-urge-comptroller-dinapoli-begin",
      "source": "The New York State Senate (.gov)",
      "published": "20250311T000000",
      "overall_sentiment_score": -0.188593,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.105378,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.645408
    },
    {
      "title": "Wells Fargo sues JPMorgan over $481M CRE loan",
      "summary": "Wells Fargo has sued JPMorgan Chase, accusing the bank of failing to conduct due diligence on a $481 million commercial real estate loan originated in 2019. Wells, acting as trustee for investors, alleges JPMorgan knowingly used false and inflated financial information from Chetrit Group and then quickly offloaded the risk to investors, keeping millions in fees. The Chetrit Group defaulted on the loan in 2022, owing over $285 million, and Wells Fargo is seeking to have JPMorgan repurchase the loan or pay damages.",
      "url": "https://www.bankingdive.com/news/wells-fargo-sues-jpmorgan-481m-cre-loan/742138/",
      "source": "Banking Dive",
      "published": "20250311T000000",
      "overall_sentiment_score": -0.411411,
      "overall_sentiment_label": "Bearish",
      "ticker_sentiment_score": -0.39725,
      "ticker_sentiment_label": "Bearish",
      "relevance_score": 0.951873
    },
    {
      "title": "AlTi expands into Germany with Kontora Family Office deal",
      "summary": "AlTi Tiedemann Global has acquired Kontora Family Office, marking its entry into the German market and expanding its European presence. This acquisition, backed by Allianz X, aligns with AlTi's strategy to grow its services for ultra-high-net-worth clients globally. Kontora's co-chief executive officers, Stephan Buchwald and Dr. Patrick Maurenbrecher, will take senior roles within AlTi.",
      "url": "https://www.investmentnews.com/ria-news/alti-tiedemann-expands-into-germany-with-kontora-family-office/259603",
      "source": "InvestmentNews",
      "published": "20250307T222818",
      "overall_sentiment_score": 0.209257,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.138723,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.636416
    },
    {
      "title": "Magnolia oil & gas CEO Stavros Christopher G buys $55,137 in stock",
      "summary": "Magnolia Oil & Gas CEO and Director Stavros Christopher G recently acquired 2,500 shares of the company’s Class A Common Stock for approximately $55,137, increasing his direct holdings to 892,372 shares. This insider purchase comes as the stock trades near its 52-week low, with InvestingPro indicating it may be undervalued. The company also announced a 15% dividend increase, reflecting strong operational performance, although analyst ratings are mixed with JPMorgan raising its price target while Goldman Sachs downgraded the stock due to limited catalysts.",
      "url": "https://www.investing.com/news/insider-trading-news/magnolia-oil--gas-ceo-stavros-christopher-g-buys-55137-in-stock-93CH-3908322",
      "source": "Investing.com",
      "published": "20250305T090913",
      "overall_sentiment_score": 0.098396,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.242863,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.61253
    },
    {
      "title": "Check out India's first IPO-focused ETF and FoF: Should you invest?",
      "summary": "Mirae Asset has launched India's first IPO-focused ETF and Fund of Fund (FoF) to provide diversified exposure to newly listed companies, tracking those within the top 500 by market capitalization after a three-month listing period. This fund aims to offer a structured way to invest in IPOs, which are often underrepresented in traditional funds, targeting long-term investors comfortable with higher volatility and a minimum five-year investment horizon. The NFO for the ETF closes on March 5, 2025, and for the FoF on March 11, 2025.",
      "url": "https://www.cnbctv18.com/personal-finance/mirae-asset-mutual-fund-nfo-etf-fof-scheme-india-first-ipo-focused-investment-19568406.htm",
      "source": "CNBC TV18",
      "published": "20250304T183943",
      "overall_sentiment_score": 0.131205,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.126367,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.606839
    },
    {
      "title": "Culp elects new member to board of directors",
      "summary": "Culp Inc., a producer of mattress and upholstery fabrics, has announced the election of William L. Tyson to its board of directors. Tyson brings over 30 years of experience in investment banking and capital markets, having served in executive leadership and strategic development roles for various financial institutions. The company believes his expertise will be valuable in executing its strategy and enhancing stakeholder value.",
      "url": "https://specialtyfabricsreview.com/2025/03/13/board-of-directors/",
      "source": "Specialty Fabrics Review",
      "published": "20250313T000000",
      "overall_sentiment_score": 0.079992,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.037662,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.5873
    },
    {
      "title": "Deutsche Bank Goes on Hiring Spree to Boost Emerging-Market Team",
      "summary": "Deutsche Bank AG is expanding its emerging-market credit trading business by hiring at least four traders and salespeople from Jefferies Financial Group Inc. The new hires include Justin Weinberg for the Latin America credit desk, and Sam Loeffler, Ryan Burke, and Alex Atallah for bond trading and sales. This move aims to strengthen Deutsche Bank's presence in credit trading in Latin America and the EMEA regions.",
      "url": "https://www.bloomberg.com/news/articles/2025-03-11/deutsche-bank-goes-on-hiring-spree-to-boost-emerging-market-team",
      "source": "Bloomberg.com",
      "published": "20250311T140400",
      "overall_sentiment_score": 0.167095,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.138102,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.612538
    },
    {
      "title": "Consumer Advocates: Corporate Pardons for Wells Fargo, Bank of America, J.P. Morgan Chase, and Zelle Parent Company Mark Trump CFPB’s “Open Season for Ripping Off Americans”",
      "summary": "Consumer advocates are criticizing the Trump administration's leadership at the CFPB for dismissing a major enforcement case against Zelle's parent company, Early Warning Services, and owner banks like Wells Fargo, Bank of America, and J.P. Morgan Chase. This action concerns alleged failures to protect consumers from over $870 million in fraud. Critics argue these corporate pardons signal an \"open season\" for companies to exploit Americans without accountability, highlighting a pattern of similar dismissals totaling billions in consumer harm.",
      "url": "https://protectborrowers.org/consumer-advocates-corporate-pardons-for-wells-fargo-bank-of-america-j-p-morgan-chase-and-zelle-parent-company-mark-trump-cfpbs-open-season-for-ripping-off-americans/",
      "source": "Protect Borrowers",
      "published": "20250304T000000",
      "overall_sentiment_score": -0.418437,
      "overall_sentiment_label": "Bearish",
      "ticker_sentiment_score": -0.44913,
      "ticker_sentiment_label": "Bearish",
      "relevance_score": 0.712737
    },
    {
      "title": "Watch JPMorgan: US Exceptionalism Dominates Equity ETF Flows",
      "summary": "JPMorgan's Global Head of ETFs, Travis Spence, discusses the dominant role of US exceptionalism in equity ETF flows, noting that 80% of current flows into US equities go to benchmarks like the S&P and NASDAQ. He also highlights a significant increase in active management within ETFs, particularly in ultra-short fixed income and derivative income strategies, and touches on growing interest in global and European equities among UCITS investors. Spence also identifies potential for growth in the Chinese ETF market, especially in active management, and notes growing interest in Australia, Taiwan, and active fixed income strategies globally.",
      "url": "https://www.bloomberg.com/news/videos/2025-03-17/jpmorgan-us-exceptionalism-dominates-equity-etf-flows-video",
      "source": "Bloomberg.com",
      "published": "20250317T044900",
      "overall_sentiment_score": 0.177888,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.308344,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.841516
    },
    {
      "title": "JP Morgan AM unveils Europe-first active EM local bond ETF in double launch",
      "summary": "JP Morgan Asset Management (JPMAM) has launched two new active ETFs: Europe’s first active emerging markets local currency bond ETF (JLOC) and an active Paris-aligned global EM strategy ETF (JSEM). JLOC aims to outperform the JPMorgan Government Bond and Emerging Markets Global Diversified indices, while JSEM invests in Paris-aligned EM stocks and utilizes a bottom-up stock selection process. These launches expand JPMAM's active ETF suite, offering investors enhanced yield, diversification, and decarbonization objectives.",
      "url": "https://www.etfstream.com/articles/jp-morgan-am-unveils-europe-first-active-em-local-bond-etf-in-double-launch-1",
      "source": "ETF Stream",
      "published": "20250312T000000",
      "overall_sentiment_score": 0.214114,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.446205,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.996061
    },
    {
      "title": "Investors Are Rethinking U.S. Exceptionalism—And Shifting to Europe",
      "summary": "Investors are increasingly shifting capital to European equities, particularly German stocks, due to high U.S. valuations and compelling opportunities abroad. Germany's DAX Index is significantly outperforming the S&P 500, driven by strong earnings and favorable policy reforms. This signals a potential end to U.S. market dominance and highlights the importance of global diversification.",
      "url": "https://www.etftrends.com/model-portfolio-channel/investors-are-rethinking-u-s-exceptionalism-and-shifting-to-europe/",
      "source": "ETF Trends",
      "published": "20250307T000000",
      "overall_sentiment_score": 0.150416,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": -0.109863,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.636423
    },
    {
      "title": "ZROZ, Long Bond ETFs Lead Fixed-Income Performance",
      "summary": "The article highlights that long-term bond ETFs like ZROZ and EDV have significantly outperformed other fixed-income ETFs due to falling consumer confidence and expectations of slower economic growth, leading to a decline in long-term Treasury yields. It explains how these rate-sensitive ETFs work, their high duration, and identifies suitable investors while also cautioning about their high volatility and downside risk if interest rates rise.",
      "url": "https://www.etf.com/sections/features/zroz-edv-long-term-bond-etfs-top-performing",
      "source": "ETF.com",
      "published": "20250303T000000",
      "overall_sentiment_score": -0.128694,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.218965,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.576547
    },
    {
      "title": "Short-Term Bond ETFs Rake In Billions Amid Recession Alarm Bells",
      "summary": "Investors are pouring billions into ultra-short bond exchange-traded funds (ETFs) such as the iShares 0-3 Month Treasury Bond ETF (SGOV) and SPDR Bloomberg 1-3 Month T-Bill ETF (BIL) as recessionary concerns mount due to Donald Trump's economic policies and a stock-market rout. This flight to safety is driven by heightened recession risk and the anticipation of potential Federal Reserve interest rate cuts. Other funds like the JPMorgan Ultra-Short Income ETF (JPST) have also seen significant inflows, highlighting a general trend towards less volatile, lower-risk assets during market turmoil.",
      "url": "https://fortune.com/2025/03/10/short-term-bond-etfs-rake-in-billions-amid-recession-alarm-bells/",
      "source": "Fortune",
      "published": "20250310T145000",
      "overall_sentiment_score": 0.102765,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.130464,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.647393
    }
  ]
}