{
  "ticker": "JPM",
  "date": "2025-07-21",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T13:00:32.775339",
  "source": "alpha_vantage",
  "article_count": 50,
  "articles": [
    {
      "title": "Citi hires Vargas from JPMorgan to lead equity capital markets in North America",
      "summary": "Citigroup has hired Bernal Vargas from JPMorgan Chase to lead its equity capital markets division in North America. Vargas, formerly head of Americas cash equity sales at JPMorgan, will join Citi later this year. This move is part of Citi's broader strategy to expand its investment banking business, which includes other high-profile hires and planned headcount increases in Japan and Australia.",
      "url": "https://www.reuters.com/business/finance/citi-hires-vargas-jpmorgan-lead-equity-capital-markets-north-america-2025-07-21/",
      "source": "Reuters",
      "published": "20250721T192800",
      "overall_sentiment_score": 0.133266,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.108058,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.817798
    },
    {
      "title": "JEPI ETF: Passive Income Darling or Overhyped Risk Trap? What Investors Need to Know",
      "summary": "This article examines the JPMorgan Equity Premium Income ETF (JEPI), questioning its \"rockstar\" status despite its popularity and significant asset growth. The author argues that JEPI's appeal has diminished as its yield has fallen relative to elevated T-bill rates, and its reliance on opaque swap contracts for its covered call strategy makes it difficult for investors to fully understand the underlying risks. The analysis highlights JEPI's performance during market downturns, suggesting it's not a safe haven and could disappoint investors in prolonged selloffs.",
      "url": "https://www.fxempire.com/forecasts/article/jepi-etf-passive-income-darling-or-overhyped-risk-trap-what-investors-need-to-know-1534707",
      "source": "FXEmpire",
      "published": "20250721T110000",
      "overall_sentiment_score": -0.054407,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.132529,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.649053
    },
    {
      "title": "Cleveland-Cliffs looks to sell idle steel plants to data center developers",
      "summary": "Cleveland-Cliffs is exploring the sale of its idle steel mills and other \"non-core\" assets, including to data center developers, to reduce debt and rightsize operations. The company reported record-high Q2 steel shipments and $4.9 billion in revenue, despite a net loss of $470 million due to one-time plant idling costs. The move comes as the company focuses on cost-cutting and strong steel sales, aided by Section 232 tariffs.",
      "url": "https://www.manufacturingdive.com/news/cleveland-cliffs-explores-sale-idle-steel-plants-q2-earnings/753563/",
      "source": "Manufacturing Dive",
      "published": "20250721T000000",
      "overall_sentiment_score": 0.215066,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.137149,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.602367
    },
    {
      "title": "Harbor Capital Advisors Expands Growing ETF Lineup With the Harbor Active Small Cap ETF",
      "summary": "Harbor Capital Advisors has launched the Harbor Active Small Cap ETF (SMLL), an actively managed ETF that invests in a blend of growth and value small-cap companies. The ETF provides exclusive access to Portfolio Manager Glenn Gawronski's investment approach, focusing on businesses with sustainable competitive advantages and competent management. SMLL seeks to offer a cost-effective, transparent, and tax-efficient way for advisors to access the small-cap blend space.",
      "url": "https://news.futunn.com/en/post/47248774/harbor-capital-advisors-expands-growing-etf-lineup-with-the-harbor",
      "source": "富途牛牛",
      "published": "20250719T150940",
      "overall_sentiment_score": 0.419147,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.112373,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.604221
    },
    {
      "title": "The Quiet Outperformer: Why EM Bonds Deserve a Second Look",
      "summary": "Emerging Markets (EM) bonds have been quietly outperforming U.S. and global broad markets for the past decade, driven by higher yields and strong fundamentals. Despite investor disinterest, this trend is shifting due to ongoing global risks and favorable metrics compared to developed markets. VanEck suggests EM bonds offer diversification and potential continued outperformance for fixed-income portfolios.",
      "url": "https://www.vaneck.com/es/en/blog/emerging-markets/the-quiet-outperformer-why-em-bonds-deserve-a-second-look/",
      "source": "VanEck",
      "published": "20250718T013004",
      "overall_sentiment_score": 0.310034,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.246059,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.644979
    },
    {
      "title": "Volcon Announces over $500,000,000 Private Placement to Initiate Bitcoin Treasury Strategy",
      "summary": "Volcon, Inc. has announced a private placement totaling over $500 million, with the majority of the proceeds intended to acquire Bitcoin as its primary treasury reserve asset. This strategic shift will also see new appointments to its board, including Ryan Lane of Empery Asset Management as co-CEO and Chairman, to guide the company's Bitcoin treasury strategy. Volcon aims to safeguard shareholder value and align with a digital future while continuing to transform its electric off-road power sports business.",
      "url": "https://www.augustachronicle.com/press-release/story/3008/volcon-announces-over-500000000-private-placement-to-initiate-bitcoin-treasury-strategy/",
      "source": "The Augusta Chronicle",
      "published": "20250717T160932",
      "overall_sentiment_score": 0.275749,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.148919,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.584415
    },
    {
      "title": "Volcon Announces over $500,000,000 Private Placement to Initiate Bitcoin Treasury Strategy",
      "summary": "Volcon, Inc. announced a private placement of over $500,000,000 to institutional and accredited investors, with Empery Asset Management, LP acting as the lead investor. The company intends to use at least 95% of the proceeds to acquire Bitcoin, establishing a Bitcoin Treasury Strategy with Gemini Nustar LLC. Ryan Lane, co-founder of Empery Asset Management, has been appointed co-CEO and Chairman of Volcon's Board of Directors to lead this new strategic direction.",
      "url": "https://www.mycentraljersey.com/press-release/story/2886/volcon-announces-over-500000000-private-placement-to-initiate-bitcoin-treasury-strategy/",
      "source": "Central New Jersey News",
      "published": "20250717T151026",
      "overall_sentiment_score": 0.256852,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.107536,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.567538
    },
    {
      "title": "Ethereum Heats Up With Record ETF Inflows And 6-Month Price Peak",
      "summary": "Yesterday saw record single-day inflows of $727 million into US Ethereum spot ETFs, significantly boosting Ether's price by 9% to $3,430, a level not seen since January 31st. Major contributions came from BlackRock's iShares Ethereum Trust ($500 million) and the Fidelity Ethereum Fund ($113 million), indicating strong institutional and retail investor interest. This surge in inflows is fueling optimism among analysts, with some eyeing $4,000 as the next price target for Ether.",
      "url": "https://www.tradingview.com/news/newsbtc:1c28c74e5094b:0-ethereum-heats-up-with-record-etf-inflows-and-6-month-price-peak/",
      "source": "TradingView",
      "published": "20250717T035259",
      "overall_sentiment_score": 0.404985,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.241046,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.560538
    },
    {
      "title": "Citigroup Earnings: Improved Profitability Driven by Higher NII",
      "summary": "Citigroup reported improved profitability in the second quarter, driven by robust net interest income, with earnings of $1.96 per share. Management provided an improved outlook, including an expectation of 10%-11% return on tangible equity in 2026, which led to a positive market reaction. While analysts plan to increase their fair value estimate for Citi stock, they remain skeptical about a complete turnaround given the bank's business mix and potential downside risks in a negative macro environment.",
      "url": "https://www.morningstar.com/stocks/citigroup-earnings-improved-profitability-driven-by-higher-nii",
      "source": "Morningstar",
      "published": "20250716T000000",
      "overall_sentiment_score": 0.22088,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.179155,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.608159
    },
    {
      "title": "News | Banks shrink exposure to problem office loans, led by Wells Fargo",
      "summary": "Wells Fargo reported an improvement in credit quality within its office-building loan portfolio in Q2 2025, with overdue payments decreasing by 3.2% to $7.96 billion. Other major banks like JPMorgan Chase and Citigroup also reported earnings, with banks generally reducing their exposure to nonperforming office loans. Despite some signs of relief, experts anticipate another 12 to 18 months for banks to purge these loans to manageable levels.",
      "url": "https://www.costar.com/article/2119927792/banks-shrink-exposure-to-problem-office-loans-led-by-wells-fargo",
      "source": "CoStar",
      "published": "20250715T204000",
      "overall_sentiment_score": 0.113977,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.121542,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.802984
    },
    {
      "title": "Bluerock seeks to list real estate fund with investors already heading for the exits.",
      "summary": "The Bluerock Total Income+ Real Estate Fund, a $4.1 billion interval fund, is attempting to list its shares publicly despite heavy investor redemptions. Analysts note that redemptions are currently outrunning fundraising, forcing the company to consider selling real estate assets to meet demand. This move aims to provide liquidity for investors, but experts are skeptical about how the fund will perform in public markets given the current economic climate and the fund's redemption issues, exacerbated by rising interest rates since 2022.",
      "url": "https://www.investmentnews.com/equities/bluerock-seeks-to-list-real-estate-fund-with-investors-already-heading-for-the-exits/261308",
      "source": "InvestmentNews",
      "published": "20250715T045715",
      "overall_sentiment_score": -0.243783,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": 0.241874,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.618907
    },
    {
      "title": "Brian Selmo: ‘Winning by Not Losing’",
      "summary": "Brian Selmo, portfolio manager and research director at First Pacific Advisors, discusses his investment philosophy centered on \"winning by not losing\" in a volatile market. He shares insights on managing risks, current market trends including AI and the Magnificent Seven, and the opportunities he finds in small- and mid-cap companies and selective private assets. Selmo also highlights the importance of qualitative analysis, particularly management quality, in their long-term investment decisions.",
      "url": "https://www.morningstar.com/funds/brian-selmo-winning-by-not-losing",
      "source": "Morningstar",
      "published": "20250715T000000",
      "overall_sentiment_score": 0.301048,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.414434,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.621575
    },
    {
      "title": "BlackRock Now Holds Over 2 Million ETH Through Its ETF",
      "summary": "BlackRock has significantly increased its Ethereum holdings through its ETHA ETF, now controlling over 2 million ETH, which constitutes 1.65% of the total supply. The ETF saw enormous inflows of over $900 million in one week and a 17% price jump, demonstrating BlackRock's growing influence and strategic moves in the crypto market. This concentration raises questions about the decentralization of Ethereum and the broader crypto ecosystem.",
      "url": "https://www.bitget.com/news/detail/12560604863677",
      "source": "Bitget",
      "published": "20250714T011000",
      "overall_sentiment_score": 0.256777,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.127983,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.595427
    },
    {
      "title": "McGraw Hill to Trade on NYSE: Here’s What the IPO Reveals (MH)",
      "summary": "McGraw Hill, a leader in EdTech, is set to go public on the NYSE under the ticker \"MH,\" offering 24.39 million shares at $19.00-$22.00 each. The IPO aims to raise capital for debt reduction and product development, while Platinum Equity will retain significant voting power. This move marks a pivotal moment for legacy education companies transitioning into the digital era, validating digital learning models and serving as a valuation benchmark for the EdTech sector.",
      "url": "https://www.tradingcalendar.com/post/mcgraw-hill-mh-ipo-edu",
      "source": "www.tradingcalendar.com",
      "published": "20250714T000000",
      "overall_sentiment_score": 0.15781,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.139869,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.358553
    },
    {
      "title": "Brookfield Asset Management Ltd. Class A (BAM) Gets a Hold from J.P. Morgan",
      "summary": "J.P. Morgan analyst Ken Worthington maintained a Hold rating on Brookfield Asset Management Ltd. Class A (BAM) with a $56.00 price target. This rating comes despite the company's shares closing yesterday at C$77.33, alongside negative insider sentiment indicated by increased insider selling. The analyst consensus on BAM is a Moderate Buy with a C$81.75 average price target, suggesting a potential 5.72% upside from current levels.",
      "url": "https://www.theglobeandmail.com/investing/markets/stocks/BAM/pressreleases/33367995/brookfield-asset-management-ltd-class-a-bam-gets-a-hold-from-jp-morgan/",
      "source": "The Globe and Mail",
      "published": "20250712T180912",
      "overall_sentiment_score": 0.11557,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.103718,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.62149
    },
    {
      "title": "Firefly Aerospace Files Registration Statement for Proposed Initial Public Offering",
      "summary": "Firefly Aerospace announced the filing of a registration statement on Form S-1 with the U.S. SEC for a proposed initial public offering of its common stock. The company intends to list its common stock on the Nasdaq Global Market under the ticker symbol \"FLY.\" Goldman Sachs & Co. LLC, J.P. Morgan, Jefferies, and Wells Fargo Securities are acting as lead bookrunning managers for the offering.",
      "url": "https://fireflyspace.com/news/firefly-aerospace-files-registration-statement-for-proposed-initial-public-offering/",
      "source": "Firefly Aerospace",
      "published": "20250711T000000",
      "overall_sentiment_score": 0.360938,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.333149,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.745646
    },
    {
      "title": "Flutter secures 100% ownership of FanDuel through new agreement with Boyd",
      "summary": "Flutter Entertainment has acquired 100% ownership of FanDuel Group by purchasing Boyd Gaming Corporation's 5% stake for approximately $1.755 billion, valuing FanDuel at around $31 billion. This agreement also extends their strategic partnership until 2038, leading to an estimated annual savings of $65 million for Flutter through reduced market access costs. The transaction, funded by new debt financing, is expected to close in Q3 2025, further solidifying FanDuel's market leadership in the US sports betting and iGaming sector.",
      "url": "https://flutter.com/news-media/press-releases/flutter-secures-100-ownership-of-fanduel-through-new-agreement-with-boyd/",
      "source": "Flutter Entertainment",
      "published": "20250710T210939",
      "overall_sentiment_score": 0.146,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.056091,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.566723
    },
    {
      "title": "Cogent Biosciences Announces Closing of Upsized Public Offering of Shares of Common Stock and Full Exercise of Underwriters’ Option to Purchase Additional Shares",
      "summary": "Cogent Biosciences announced the closing of an upsized underwritten public offering, including the full exercise of the underwriters' option to purchase additional shares. The offering comprised 25,555,556 shares of common stock at $9.00 per share, generating approximately $230 million in gross proceeds. The company plans to use the net proceeds for the continued development, regulatory, and commercial preparation of bezuclastinib and other product candidates, as well as for general corporate purposes.",
      "url": "https://www.globenewswire.com/news-release/2025/07/10/3113658/0/en/Cogent-Biosciences-Announces-Closing-of-Upsized-Public-Offering-of-Shares-of-Common-Stock-and-Full-Exercise-of-Underwriters-Option-to-Purchase-Additional-Shares.html",
      "source": "GlobeNewswire",
      "published": "20250710T160100",
      "overall_sentiment_score": 0.257827,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.146062,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.639436
    },
    {
      "title": "Pentagon to become largest shareholder in rare earth miner MP Materials; shares surge 50%",
      "summary": "The Defense Department will become the largest shareholder in rare earth miner MP Materials after agreeing to buy $400 million of its preferred stock. This investment aims to expand MP Materials' rare earths processing capacity and magnet production in the U.S., reducing dependence on foreign sources, particularly China. The deal caused MP Materials' shares to surge by about 50%, and the company plans to build a second magnet manufacturing facility with Pentagon support.",
      "url": "https://www.cnbc.com/2025/07/10/pentagon-to-become-largest-shareholder-in-rare-earth-magnet-maker-mp-materials.html",
      "source": "CNBC",
      "published": "20250710T111210",
      "overall_sentiment_score": 0.468136,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.346027,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.64879
    },
    {
      "title": "Ralph Lauren stock hits all-time high at 289.34 USD",
      "summary": "Ralph Lauren's stock reached an all-time high of $289.34, reflecting strong financial performance, a 61.3% increase over the past year, and investor confidence. The luxury fashion company boasts a market capitalization of $17.52 billion and a gross profit margin of 68.55%. Recent analyst adjustments to price targets and the appointment of Angela Ahrendts as the new Lead Independent Director also underscore the company's strategic initiatives and growth prospects.",
      "url": "https://www.investing.com/news/company-news/ralph-lauren-stock-hits-alltime-high-at-28934-usd-93CH-4128579",
      "source": "Investing.com",
      "published": "20250709T110600",
      "overall_sentiment_score": 0.381725,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.261271,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.58101
    },
    {
      "title": "Vanguard Faces New Competition Across Malvern Campus from Pacer Appearance",
      "summary": "Pacer Financial, co-founded by Sean O’Hara and Joe Thomson, is emerging as a significant competitor to Vanguard, drawing over $40 billion into its exchange-traded funds (ETFs) and rivaling some of Vanguard’s offerings despite charging higher fees. Pacer differentiates itself with funds like COWZ, which focuses on companies with high free-cash-flow yield, generating substantial returns against the market. This new competition is developing right across from Vanguard's Malvern campus, as reported by The Philadelphia Inquirer.",
      "url": "https://vista.today/2025/07/vanguard-pacer-malvern-campus/",
      "source": "VISTA.Today",
      "published": "20250709T052800",
      "overall_sentiment_score": 0.187735,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.109577,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.64311
    },
    {
      "title": "Cogent Biosciences Raises $150M in Stock Offering to Advance Precision Therapy Commercialization",
      "summary": "Cogent Biosciences (NASDAQ: COGT) announced a proposed $150 million public offering of common stock, with an option for underwriters to purchase an additional $22.5 million in shares. The proceeds are intended to fund the development, regulatory activities, and commercial preparation of its lead candidate bezuclastinib and other product candidates, as well as provide working capital. J.P. Morgan, Leerink Partners, and Guggenheim Securities are serving as joint book-running managers for the offering.",
      "url": "https://www.stocktitan.net/news/COGT/cogent-biosciences-announces-proposed-150-million-public-offering-of-aiuv00rtrxrw.html",
      "source": "Stock Titan",
      "published": "20250708T162600",
      "overall_sentiment_score": 0.196156,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.137458,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.609448
    },
    {
      "title": "HSBC Bank carried out an International Secondary Public Offering of Grupo Financiero Galicia’s ADSs",
      "summary": "HSBC Bank plc executed an international secondary public offering involving 11,721,449 American Depositary Shares (ADSs) of Grupo Financiero Galicia S.A., each representing ten Class B ordinary shares. The offering was priced at US$54.25 per ADS, totaling over US$635 million, and was registered with the U.S. SEC. The ADSs are listed on the Nasdaq Capital Market under \"GGAL,\" and the transaction was carried out entirely outside of Argentina, with HSBC Bank plc as the sole selling shareholder.",
      "url": "https://bruchoufunes.com/en/we-advised-hsbc-bank-on-an-international-secondary-public-offering-of-adss-of-grupo-financiero-galicia/",
      "source": "Bruchou & Funes de Rioja",
      "published": "20250708T065741",
      "overall_sentiment_score": 0.315722,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.247113,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.602026
    },
    {
      "title": "[424B3] Inverse VIX Short-Term Futures ETNs due March 22, 2045 Prospectus Filed Pursuant to Rule 424(b)(3)",
      "summary": "This SEC filing (Form 424B3) from July 7, 2025, pertains to Inverse VIX Short-Term Futures ETNs due March 22, 2045. It includes an index supplement related to the J.P. Morgan Kronos US Equity (JPUSKRSE) Excess Return Index, providing hypothetical and actual historical monthly and annual returns from 1988 through 2025. The document also outlines selected risks associated with investing in these notes and important disclaimers regarding the use of hypothetical backtested returns.",
      "url": "https://www.stocktitan.net/sec-filings/VYLD/424b3-inverse-vix-short-term-futures-et-ns-due-march-22-2045-prospect-4b9983f34c3c.html",
      "source": "Stock Titan",
      "published": "20250707T052249",
      "overall_sentiment_score": 0.005932,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.035941,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.61022
    },
    {
      "title": "PNC Financial Services Group (NYSE:PNC) Is Increasing Its Dividend To $1.70",
      "summary": "The PNC Financial Services Group (NYSE:PNC) is set to increase its quarterly dividend to $1.70, a 6.3% rise from the previous year, resulting in a 3.3% dividend yield. The company has a strong track record of dividend payments with a payout ratio of 45% and anticipated EPS growth of 34.1% over the next three years. This makes PNC an attractive income stock due to its solid earnings coverage and consistent dividend growth.",
      "url": "https://simplywall.st/stocks/us/banks/nyse-pnc/pnc-financial-services-group/news/pnc-financial-services-group-nysepnc-is-increasing-its-divid-1",
      "source": "Simply Wall Street",
      "published": "20250707T000000",
      "overall_sentiment_score": 0.232617,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.105455,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.608959
    },
    {
      "title": "IonQ Announces Pricing of $1.0 Billion Equity Offering",
      "summary": "IonQ announced the pricing of a $1.0 billion equity offering, including common stock and pre-funded warrants, purchased by Heights Capital Management. This offering is expected to increase IonQ's pro-forma cash to approximately $1.68 billion as of March 31, 2025, significantly bolstering its global quantum computing and networking expansion strategy. J.P. Morgan served as the sole underwriter for the transaction.",
      "url": "https://thequantuminsider.com/2025/07/07/ionq-announces-pricing-of-1-0-billion-equity-offering/",
      "source": "The Quantum Insider",
      "published": "20250707T000000",
      "overall_sentiment_score": 0.514865,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.148619,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.616495
    },
    {
      "title": "Tompkins Financial Advisors Strengthens Western New York Presence With Appointment of New Managing Director",
      "summary": "Tompkins Financial Advisors has appointed Michael Proctor as the new Managing Director for its Western New York market, enhancing its regional presence. Proctor brings over 30 years of experience in banking and finance, including leadership roles at J.P. Morgan Investments and Citizens Investment Services, to lead Tompkins' wealth management advisors. This appointment aims to strengthen Tompkins' growth and position as a trusted financial partner in the region.",
      "url": "https://www.greaterrochesterchamber.com/2025/07/17/tompkins-financial-advisors-strengthens-western-new-york-presence-with-appointment-of-new-managing-director/",
      "source": "Greater Rochester Chamber of Commerce",
      "published": "20250717T170934",
      "overall_sentiment_score": 0.265424,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.116433,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.727433
    },
    {
      "title": "Vorys Represents Civista in Pending Acquisition of Farmers Savings Bank and Recent Public Offering",
      "summary": "Vorys is representing Civista Bancshares, Inc. in its pending acquisition of The Farmers Savings Bank for $34.925 million in cash and 1,434,491 common shares, a deal expected to close in Q4 2025. This acquisition will increase Civista's assets to approximately $4.4 billion and expand its branch network in Ohio. Additionally, Vorys served as legal counsel for Civista's recent public offering which raised over $80 million through the sale of 3,788,238 common shares.",
      "url": "https://www.vorys.com/news-vorys-represents-civista-in-pending-acquisition-of-farmers-savings-bank-and-recent-public-offering",
      "source": "Vorys",
      "published": "20250717T053115",
      "overall_sentiment_score": 0.162358,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.123374,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.631578
    },
    {
      "title": "3 Big Reasons to Love Magnite (MGNI)",
      "summary": "Magnite (MGNI) has seen a significant stock price increase of 55.4% in the past six months, reaching $24 per share, driven by solid quarterly results. The article attributes this positive performance to three key factors: skyrocketing revenue with a 33.3% compounded annual growth rate over five years, excellent free cash flow margins averaging 23.6% over the last five years, and an increasing return on invested capital (ROIC) which signals improved efficiency. These points suggest Magnite is a strong business, prompting investors to consider its future prospects.",
      "url": "https://markets.financialcontent.com/wral/article/stockstory-2025-7-17-3-big-reasons-to-love-magnite-mgni",
      "source": "FinancialContent",
      "published": "20250717T000400",
      "overall_sentiment_score": 0.125926,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.231969,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.610402
    },
    {
      "title": "Citizens and U.S. Bancorp post strong Q2; Latest news from Washington on the GENIUS Act",
      "summary": "U.S. Bancorp and Citizens Financial both reported stronger-than-expected second-quarter earnings, with U.S. Bancorp's profits rising 13% year-over-year and Citizens Financial beating Wall Street estimates for earnings and revenue. The article also touches on legislative developments regarding the stablecoin-focused GENIUS Act and new regulatory guidance from the OCC, Federal Reserve, and FDIC concerning banks holding crypto assets. Additionally, it highlights increasing loan growth observed at several banks, including PNC Financial Services Group.",
      "url": "https://www.linkedin.com/pulse/citizens-us-bancorp-post-strong-q2-latest-news-from-washington-3bzvf",
      "source": "LinkedIn",
      "published": "20250717T000000",
      "overall_sentiment_score": 0.445298,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.101918,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.640625
    },
    {
      "title": "iShares Core DAX ETF: Der Gigant unter den Indexfonds",
      "summary": "The iShares Core DAX UCITS ETF (EXS1) is highlighted as the largest and most efficient DAX ETF, offering full market coverage through physical replication of the 40 leading German companies. The article emphasizes its thesaurizing nature, cost-efficiency, and strong technical indicators, despite a briefly overheated RSI. It is recommended for long-term investors seeking to invest in the German economy.",
      "url": "https://www.boerse-express.com/news/articles/ishares-core-dax-etf-der-gigant-unter-den-indexfonds-809455",
      "source": "Börse Express",
      "published": "20250716T040043",
      "overall_sentiment_score": 0.286219,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.201537,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.642427
    },
    {
      "title": "Biodexa Pharmaceuticals to implement 1:10 ADR ratio change",
      "summary": "Biodexa Pharmaceuticals PLC announced a 1:10 ADR ratio change, effective July 31, 2025, to modify its ADR ratio from one ADR representing 10,000 ordinary shares to one ADR representing 100,000 ordinary shares. This adjustment acts as a one-for-ten reverse ADR split to meet Nasdaq's minimum bid price requirement. The company also provided updates on its clinical trials for familial adenomatous polyposis (FAP) and type 1 diabetes, and recent financial developments including a $3 million grant for its eRapa program.",
      "url": "https://www.investing.com/news/company-news/biodexa-pharmaceuticals-to-implement-110-adr-ratio-change-93CH-4136612",
      "source": "Investing.com",
      "published": "20250715T163300",
      "overall_sentiment_score": 0.009787,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.02258,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.617221
    },
    {
      "title": "Gunjan Kedia Acsends to CEO of U.S. Bancorp",
      "summary": "Gunjan Kedia has been appointed CEO of U.S. Bancorp (NYSE: USB) following the company's annual meeting of shareholders, succeeding Andy Cecere who will transition to executive chairman. Kedia, who joined U.S. Bancorp in 2016 and most recently served as president, brings nearly 30 years of experience in financial services to her new role. The transition highlights U.S. Bancorp's focus on succession planning and internal talent development.",
      "url": "https://www.thecannatareport.com/kedia-is-ceo-of-us-bancorp/",
      "source": "The Cannata Report -",
      "published": "20250715T000000",
      "overall_sentiment_score": 0.35192,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.240352,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.639111
    },
    {
      "title": "Amidst Institutional Interest, BlackRock, Fidelity, Grayscale Dominate Crypto ETF Assets",
      "summary": "BlackRock, Fidelity, and Grayscale dominate the crypto ETF market, managing over 85% of all crypto ETF assets under management, totaling approximately $123 billion. Institutional investors show increasing confidence in cryptocurrency, with 75% expecting it to be part of institutional portfolios within five years and a significant majority anticipating more traditional financial institutions to launch crypto funds soon. These findings suggest a growing belief in crypto's potential for attractive risk-adjusted returns, driving its integration into institutional investment strategies.",
      "url": "https://www.planadviser.com/amidst-institutional-interest-blackrock-fidelity-grayscale-dominate-crypto-etf-assets/",
      "source": "planadviser",
      "published": "20250715T000000",
      "overall_sentiment_score": 0.195225,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.240979,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.617617
    },
    {
      "title": "US stock market future slips as Trump’s 30% tariffs rattle global trade; Dow, S&P 500, Nasdaq dip while Bo",
      "summary": "US stock futures slipped after President Donald Trump announced 30% tariffs on imports from the EU and Mexico, beginning August 1st, stoking global trade tensions. Investors are also closely watching second-quarter earnings reports from major banks, upcoming inflation data, and the growing rift between Trump and Federal Reserve Chair Jerome Powell. Despite the market dip, Boeing saw gains while Apple and Tesla slid, and Bitcoin hit a new record high.",
      "url": "https://m.economictimes.com/news/international/us/u-s-stock-futures-fall-as-trumps-30-tariffs-rattle-global-trade-dow-sp-500-nasdaq-dip-while-boeing-jumps-and-apple-tesla-slide-ahead-of-earnings-cpi-data/articleshow/122438518.cms",
      "source": "The Economic Times",
      "published": "20250714T174000",
      "overall_sentiment_score": -0.043496,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.201202,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.638262
    },
    {
      "title": "Going into Earnings, Is Schwab Stock a Buy, a Sell, or Fairly Valued?",
      "summary": "This article from Morningstar assesses Charles Schwab (SCHW) stock ahead of its Q2 2025 earnings release. It delves into key metrics like cash sweep trends and net interest margin guidance, concluding that the stock is fairly valued with a wide economic moat despite a high uncertainty rating. Investors are advised to watch commentary on cash sweeps and NIM guidance.",
      "url": "https://www.morningstar.com/stocks/going-into-earnings-is-schwab-stock-buy-sell-or-fairly-valued-4",
      "source": "Morningstar",
      "published": "20250714T000000",
      "overall_sentiment_score": 0.146415,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.134603,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.619857
    },
    {
      "title": "FDRR: Look At FCPI Instead",
      "summary": "The Fidelity Dividend ETF for Rising Rates (FDRR) invests in large-cap dividend stocks correlated with U.S. Treasury yields, but has underperformed its benchmark despite strong dividend growth during a period of rising interest rates. The article suggests considering FCPI, another Fidelity ETF focused on inflation, which has a similar expense ratio and trading volume but a more convincing track record. This update reviews FDRR's performance and holdings since a previous review in September 2024.",
      "url": "https://seekingalpha.com/article/4800598-fdrr-look-at-fcpi-instead",
      "source": "Seeking Alpha",
      "published": "20250711T072400",
      "overall_sentiment_score": -0.034133,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.06613,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.630956
    },
    {
      "title": "This Trump Trade Boomed After Election—Now It May Be Making A Comeback",
      "summary": "Regional bank stocks, once a favored \"Trump trade\" that surged after the 2024 election, have underperformed in 2025. However, Wall Street veteran Ed Yardeni suggests a potential comeback due to their low valuations and optimistic earnings growth prospects, especially if deregulation and M&A activity increase. Investors are encouraged to reconsider regional banks, which trade at historically low price-to-earnings ratios compared to larger financial institutions.",
      "url": "https://www.sahmcapital.com/news/content/this-trump-trade-boomed-after-electionnow-it-may-be-making-a-comeback-2025-07-10",
      "source": "Sahm",
      "published": "20250710T185500",
      "overall_sentiment_score": 0.168467,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.232023,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.856254
    },
    {
      "title": "Hewlett Packard Enterprise stock hits all-time high of 25.44 USD",
      "summary": "Hewlett Packard Enterprise (HPE) stock achieved an all-time high of $25.44, with a market capitalization of $32.71 billion, reflecting strong investor confidence and strategic initiatives. The company boasts an 88.32% return over the past six months and 11 consecutive years of dividend payments, alongside robust revenue growth and positive analyst sentiment. Recent developments include raised price targets from Goldman Sachs, JPMorgan, and Evercore ISI, following the Juniper Networks acquisition and leadership changes.",
      "url": "https://www.investing.com/news/company-news/hewlett-packard-enterprise-stock-hits-alltime-high-of-2544-usd-93CH-4275159",
      "source": "Investing.com",
      "published": "20250710T093100",
      "overall_sentiment_score": 0.238715,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.218138,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.627227
    },
    {
      "title": "BlackRock, Fidelity, Grayscale Dominate Crypto ETF Assets Amidst Institutional Interest",
      "summary": "BlackRock, Fidelity Investments, and Grayscale Investments collectively manage over 85% of all crypto ETF assets, totaling approximately $123 billion, according to ISS Market Intelligence. This dominance coincides with a Nickel Digital survey indicating that 75% of institutional investors expect cryptocurrency to be part of institutional allocations within five years, and a significant majority anticipate more traditional financial institutions launching crypto funds. The article also notes increasing regulatory support for digital assets, including the passage of the GENIUS Act.",
      "url": "https://www.ai-cio.com/news/blackrock-fidelity-grayscale-dominate-crypto-etf-assets-amidst-institutional-interest/",
      "source": "Chief Investment Officer",
      "published": "20250710T000000",
      "overall_sentiment_score": 0.308236,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.231717,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.618934
    },
    {
      "title": "JPMorganChase signs on at new Sauer Center office building",
      "summary": "JPMorganChase is relocating its commercial and corporate banking teams to a new 3,700-square-foot office space in the recently completed Sauer Center office building in Richmond. This move from their downtown James Center location will provide a more modern layout and expanded capacity for their commercial banking operations, which have been growing in the Richmond market since 2010. The addition of JPMorganChase further validates the Sauer Center as a premier location for professional service firms.",
      "url": "https://richmondbizsense.com/2025/07/07/jpmorganchase-signs-on-at-new-sauer-center-office-building/",
      "source": "Richmond BizSense",
      "published": "20250707T000000",
      "overall_sentiment_score": 0.252028,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.467411,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Fund Giants Put Faith in ‘Trump Put’ to Keep Stock Rally Rolling",
      "summary": "Major asset managers like Invesco, Fidelity International, and JPMorgan Asset Management are increasing their investments in risk assets, especially US and Asian technology shares and emerging markets. This bullish strategy is based on the expectation that while Donald Trump may threaten economic disruption, he will ultimately pull back, allowing the stock rally to continue.",
      "url": "https://www.bloomberg.com/news/articles/2025-07-21/fund-giants-put-faith-in-trump-put-to-keep-stock-rally-rolling",
      "source": "Bloomberg.com",
      "published": "20250721T103000",
      "overall_sentiment_score": 0.270228,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.287603,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.66276
    },
    {
      "title": "Lobbying Update: $40,000 of SOUTHERN COMPANY lobbying was just disclosed | SO Stock News",
      "summary": "SOUTHERN COMPANY (SO) recently disclosed $40,000 in lobbying expenditures for Q2 2025, covering energy, environmental, and tax reform issues. The article also details recent congressional stock trades, insider trading activity, and significant hedge fund movements related to SO stock. Analyst ratings and price targets for SO are also provided, with a median target of $94.0 from 11 analysts.",
      "url": "https://www.quiverquant.com/news/Lobbying+Update%3A+%2440%2C000+of+SOUTHERN+COMPANY+lobbying+was+just+disclosed",
      "source": "Quiver Quantitative",
      "published": "20250718T022400",
      "overall_sentiment_score": 0.199972,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.326458,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.605517
    },
    {
      "title": "Vanguard to close subscale US corporate bond ESG ETF",
      "summary": "Vanguard is liquidating its US dollar-denominated ESG corporate bond ETF (V3SU) on October 23rd due to its failure to attract sufficient assets under management. The ETF, which currently holds $17.4 million, was deemed by Vanguard as not covering its fixed costs and hindering economies of scale. However, this decision does not impact Vanguard's broader ESG fund range, which continues to provide options for investors with ESG preferences.",
      "url": "https://www.etfstream.com/news/vanguard-to-close-subscale-us-corporate-bond-esg-etf",
      "source": "ETF Stream",
      "published": "20250717T035203",
      "overall_sentiment_score": 0.238198,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.307025,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.64101
    },
    {
      "title": "For Big Banks, the Trump Era Is Proving Profitable Thus Far",
      "summary": "Major U.S. banks like JPMorgan Chase reported strong quarterly earnings, defying expectations of decline amid trade uncertainties in the second Trump era. Jamie Dimon, JPMorgan CEO, expressed increased optimism about the \"resilient\" U.S. economy, crediting delayed tariffs and extended corporate tax breaks. The reports indicate that Wall Street is thriving despite broader economic shifts, finding profitability in uncertainty.",
      "url": "https://www.nytimes.com/2025/07/15/business/jpmorgan-wells-fargo-citi-banks-economy.html",
      "source": "The New York Times",
      "published": "20250715T000000",
      "overall_sentiment_score": 0.390677,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.461415,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.917291
    },
    {
      "title": "Watch Inflation Has Bottomed for 2025: DoubleLine's Sherman",
      "summary": "Jeffrey Sherman, Deputy CIO at DoubleLine, discusses his views on inflation, the Federal Reserve's rate path, and the US mortgage market. He believes inflation has bottomed for the year and expresses skepticism about immediate rate cuts, citing increasing tariff pressures and conflicting signals in Treasury markets. Sherman also touches on the potential privatization of Fannie Mae and Freddie Mac, suggesting it could exacerbate housing unaffordability.",
      "url": "https://www.bloomberg.com/news/videos/2025-07-21/inflation-has-bottomed-for-2025-doubleline-s-sherman-video",
      "source": "Bloomberg.com",
      "published": "20250721T215900",
      "overall_sentiment_score": 0.08881,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.026051,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.634933
    },
    {
      "title": "Wall Street Wants to Make Private Markets a Little More Public",
      "summary": "Private markets are becoming increasingly attractive on Wall Street as companies stay private longer and valuations soar. Fund managers, brokerage houses, and start-ups are creating products aimed at expanding access to these historically exclusive investments, with support from regulators. The move seeks to make private equity more accessible beyond traditional \"accredited investors.\"",
      "url": "https://www.nytimes.com/2025/07/19/business/dealbook/private-market-boom.html",
      "source": "The New York Times",
      "published": "20250719T000000",
      "overall_sentiment_score": 0.065929,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.061956,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.553612
    },
    {
      "title": "Watch out: The world’s biggest money managers just issued ‘stagflation’ warning",
      "summary": "Eighty percent of the world's top money managers are warning of economic stagnation or \"stagflation\" in the year ahead, according to a BofA Securities survey. Despite these concerns, there is an underlying belief that missing out on a booming market presents a significant risk. The managers acknowledge the difficult combination of a stagnant economy and high inflation, reminiscent of the 1970s.",
      "url": "https://www.marketwatch.com/story/the-worlds-biggest-money-managers-just-issued-a-stagflation-warning-but-look-at-what-theyre-buying-97cd52c0?gaa_at=eafs&gaa_n=AWEtsqc86GwOxJiSabxOWT3a2H4egWnQjCtYCf-YAl7bGLo9uE2J0iobvtp-&gaa_ts=691d9d96&gaa_sig=BIuFweDC8AyyQ5LAIs8qXSX3ydvvcz43mc4oNjD7v05ZbZvUzW_EF-lTj8C8NLwPntM9q-vSf7iUEqDM6VndJQ%3D%3D",
      "source": "MarketWatch",
      "published": "20250716T100500",
      "overall_sentiment_score": -0.107071,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.117737,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.615395
    },
    {
      "title": "Fund Files: Neuberger flips EM fund to ETF, Guggenheim plots BDC",
      "summary": "Neuberger Berman plans to convert its $104 million Emerging Markets Debt fund (NERIX) into an ETF on August 8, which will involve a different principal investment strategy focusing on hard currency-denominated securities. The article also touches on other fund-related news, including a Guggenheim BDC plot. The conversion signals a strategic shift for Neuberger Berman's EM debt offering.",
      "url": "https://citywire.com/pro-buyer/news/fund-files-neuberger-flips-em-fund-to-etf-guggenheim-plots-bdc/a2470217",
      "source": "Citywire",
      "published": "20250715T000000",
      "overall_sentiment_score": 0.245659,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.292589,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.604785
    },
    {
      "title": "HEDGE FLOW Hedge funds dump banks, buy the dip in consumer staples, Goldman Sachs says",
      "summary": "Hedge funds have been observed selling off bank stocks for the second consecutive week while simultaneously increasing their investments in consumer staples, according to a Goldman Sachs note. This shift occurs just ahead of major bank earnings announcements and the release of U.S. consumer price data. The move into consumer staples is seen as a defensive strategy amid concerns over the impact of tariffs and potential recession fears.",
      "url": "https://www.reuters.com/sustainability/boards-policy-regulation/hedge-flow-hedge-funds-dump-banks-buy-dip-consumer-staples-goldman-sachs-says-2025-07-14/",
      "source": "Reuters",
      "published": "20250714T114900",
      "overall_sentiment_score": -0.208799,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.233049,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.626443
    }
  ]
}