{
  "ticker": "JPM",
  "date": "2025-09-01",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T13:01:01.242953",
  "source": "alpha_vantage",
  "article_count": 33,
  "articles": [
    {
      "title": "JPMorgan (JPM) Announces Dividends for Preferred Stock",
      "summary": "JPMorgan Chase & Co. (JPM) has announced dividends for its Series II and OO preferred stocks. Shareholders of Series II will receive $179.80 per preferred share and $17.98 per depositary share, while Series OO holders will get $162.50 per preferred share and $16.25 per depositary share. These dividends are payable on October 1, 2025, to stockholders of record as of September 2, 2025.",
      "url": "https://finance.yahoo.com/news/jpmorgan-jpm-announces-dividends-preferred-031451373.html",
      "source": "Yahoo Finance",
      "published": "20250818T131013",
      "overall_sentiment_score": 0.215698,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.423117,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "State Street Joins J.P. Morgan’s Digital Debt Service as First Third-Party Custodian",
      "summary": "State Street has become the first third-party custodian to join J.P. Morgan's Digital Debt Service, expanding institutional access to blockchain-based debt securities through a $100 million commercial paper transaction. This integration allows State Street to manage depository records for tokenized debt securities via a digital wallet, leveraging J.P. Morgan's Kinexys Digital Assets platform. The collaboration aims to provide a fully integrated front-, middle-, and back-office solution built on blockchain technology, advancing the digital transformation in fixed income markets.",
      "url": "https://www.leaprate.com/forex/institutional/state-street-joins-j-p-morgans-digital-debt-service-as-first-third-party-custodian/",
      "source": "LeapRate",
      "published": "20250822T080400",
      "overall_sentiment_score": 0.30554,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.343079,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.939183
    },
    {
      "title": "Treasury Excellence with Fossil Group in India",
      "summary": "Fossil Group, a global design, marketing, and distribution company, partnered with J.P. Morgan Payments to transform its treasury operations in India due to challenges in managing foreign exchange risks across its widespread global presence. This collaboration led to the implementation of automated solutions for payment matching, net-pricing outcomes, and unitized time deposits for liquidity management. As a result, Fossil Group achieved significant time and cost savings exceeding $150,000, strengthened its financial position, and established best practices for FX management.",
      "url": "https://www.jpmorgan.com/insights/payments/operations-optimization/fossil-group-treasury-excellence",
      "source": "J.P. Morgan",
      "published": "20250830T031442",
      "overall_sentiment_score": 0.227226,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.460366,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.834707
    },
    {
      "title": "First-Ever Third-Party Custody on Blockchain: State Street Joins JPMorgan's $100M Digital Debt Platform",
      "summary": "State Street has become the first third-party custodian to launch on J.P. Morgan's Digital Debt Service, integrating blockchain-based debt securities custody for institutional clients. This collaboration, marked by a $100 million commercial paper transaction with State Street Investment Management, modernizes short-term debt markets by enabling precision-timed, T+0 settlement. The initiative aims to provide a seamless client experience for blockchain-based debt instruments while adhering to traditional custody standards.",
      "url": "https://www.stocktitan.net/news/STT/state-street-becomes-first-third-party-custodian-to-launch-on-j-p-qlgzzp1fuc5i.html",
      "source": "Stock Titan",
      "published": "20250821T114500",
      "overall_sentiment_score": 0.391748,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.306729,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.831573
    },
    {
      "title": "Netskope files for Nasdaq IPO as SASE vendor eyes next growth stage",
      "summary": "Netskope, a SASE and SSE vendor, has filed for an IPO on the Nasdaq under the ticker \"NTSK,\" with Morgan Stanley and J.P. Morgan serving as lead book-running managers. The company generated $328 million in revenue for the first half of 2025 and saw its annual recurring revenue increase to $707 million. Netskope is seeking to raise capital for its next stage of growth, with the IPO potentially targeting sometime after Labor Day.",
      "url": "https://www.sdxcentral.com/news/netskope-files-for-nasdaq-ipo-as-sase-vendor-eyes-next-growth-stage/",
      "source": "SDxCentral",
      "published": "20250826T121046",
      "overall_sentiment_score": 0.285346,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.250063,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.714345
    },
    {
      "title": "Major Debt Refinancing: Charter Communications Launches Notes Offering to Replace 6.15% 2026 Debt",
      "summary": "Charter Communications (NASDAQ: CHTR) announced an offering of senior secured fixed rate notes through its subsidiaries. The proceeds will be used primarily to repay existing debt, including the 6.150% Senior Secured Notes due 2026, fund potential stock buybacks, and cover related expenses. The offering is managed by Citigroup Global Markets, J.P. Morgan Securities, and Morgan Stanley.",
      "url": "https://www.stocktitan.net/news/CHTR/charter-offers-senior-secured-3y29fdp1q71t.html",
      "source": "Stock Titan",
      "published": "20250818T152713",
      "overall_sentiment_score": 0.095051,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.140468,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.64274
    },
    {
      "title": "A New Breed of Active Commodity Funds Is Beating Indexers. It’s All About Strategy.",
      "summary": "The article discusses a recent shift in commodity funds towards active management, contrasting it with the broader trend of investors moving from actively managed stock funds to passive index funds. This move in commodity funds is presented as beneficial for investors, and the article aims to explain why this new breed of active and quasi-active commodity funds is becoming appealing.",
      "url": "https://www.barrons.com/articles/commodity-funds-active-management-bd7efdaa?gaa_at=eafs&gaa_n=AWEtsqfH6fYLXmzoSAMyPSDnt9ACtLK6tKHYG61ChvK_EBv5ZmyH5jGyxMTU&gaa_ts=695fbdbe&gaa_sig=AjPbeMQAVlfZ0ByP9NOxaZkp-Wvw9i2R_5m9gvm0sGCEJIdJfmfk669PCflJjERKOfsZy3Pd9pYoWTJmCUdshw%3D%3D",
      "source": "Barron's",
      "published": "20250827T141013",
      "overall_sentiment_score": 0.094986,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.13874,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.641933
    },
    {
      "title": "Prologis Stocks: Behind the Recent Dynamics",
      "summary": "Prologis Inc. (NYSE: PLD) stocks have seen a 4.87% increase, driven by strong tech sentiment and significant operational performance, including processing $3.2 trillion in goods last year. Analyst opinions are mixed, with Jefferies maintaining a Buy rating and a $123 target, while Citigroup adjusted its target to $140 from $150. Despite cautious valuation measures, Prologis demonstrates robust financial health with strong profitability metrics and a low debt-to-equity ratio, navigating market uncertainties with core business strength.",
      "url": "https://stockstotrade.com/news/prologis-inc-pld-news-2025_08_19-2/",
      "source": "StocksToTrade",
      "published": "20250819T160400",
      "overall_sentiment_score": 0.199588,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.28222,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.638918
    },
    {
      "title": "Nexstar Media Group, Inc. Enters into Definitive Agreement To Acquire TEGNA Inc. for $6.2 Billion in Accretive Transaction",
      "summary": "Nexstar Media Group, Inc. announced a definitive agreement to acquire TEGNA Inc. for $6.2 billion in cash, including TEGNA's net debt. This acquisition, priced at $22.00 per share, represents a 31% premium and aims to enhance Nexstar's position as a leading local media company. The combined entity expects to generate approximately $300 million in annual net synergies and significant accretion to Nexstar's Adjusted Free Cash Flow.",
      "url": "https://www.newsnationnow.com/press/nexstar-media-group-inc-enters-into-definitive-agreement-to-acquire-tegna-inc-for-6-2-billion-in-accretive-transaction/",
      "source": "NewsNation",
      "published": "20250819T073600",
      "overall_sentiment_score": 0.22335,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.111046,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.638651
    },
    {
      "title": "Flash Macro: U.S. Jobs",
      "summary": "The August jobs report indicates that the U.S. labor market is near stall speed with only 22k jobs added and significant downward revisions to prior months. This report strengthens the argument for the Federal Reserve to cut interest rates, especially given the rising unemployment rate and ongoing manufacturing recession. The authors suggest that despite accommodative financial conditions, the Fed needs to act to support housing, lower-income workers, and levered structures, and they anticipate several rate cuts into 2026.",
      "url": "https://www.kkr.com/insights/flash-macro-jobs-update-august-2025",
      "source": "KKR",
      "published": "20250901T000000",
      "overall_sentiment_score": 0.281545,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.254839,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.636799
    },
    {
      "title": "The Indiana bank that lent to a Who’s Who of mortgage fraud players",
      "summary": "Merchants Bank, an Indiana-based institution, faces significant financial write-downs totaling $46 million due to its extensive lending to players involved in large-scale mortgage fraud. The bank's rapid growth was fueled by loans to individuals and entities now facing charges and jail sentences for schemes like inflating financials and property flipping. Despite red flags and ongoing investigations into its borrowers, Merchants continued to provide funding, relying on opaque securitizations to offload risk while potentially facilitating fraudulent activities in the multifamily industry.",
      "url": "https://therealdeal.com/national/2025/08/20/merchants-banks-kept-lending-to-bad-borrowers/",
      "source": "The Real Deal",
      "published": "20250820T120000",
      "overall_sentiment_score": -0.382228,
      "overall_sentiment_label": "Bearish",
      "ticker_sentiment_score": -0.113824,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.636181
    },
    {
      "title": "Truist kicks off a major branch expansion",
      "summary": "Charlotte-based Truist announced a major expansion plan to open 100 new branches and renovate 300 existing ones over the next five years in high-growth markets. This initiative aims to enhance offerings for affluent customers, grow business in key markets, and complement digital services with \"insights-driven\" branches providing in-person expertise. While specific locations are not yet disclosed, Charlotte is highlighted as a significant investment area for the bank.",
      "url": "https://www.axios.com/local/charlotte/2025/08/20/truist-kicks-off-a-major-branch-expansion",
      "source": "Axios",
      "published": "20250820T000000",
      "overall_sentiment_score": 0.227105,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.114783,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.634942
    },
    {
      "title": "Rent the Runway Announces Strategic Recapitalization to Strengthen Balance Sheet and Support Growth Initiatives",
      "summary": "Rent the Runway (RENT) announced a strategic recapitalization to bolster its balance sheet by reducing debt, lowering interest expenses, and extending maturity dates. This involves partnerships with STORY3 Capital Partners and Nexus Capital Management, along with Aranda Principal Strategies, which will convert a substantial portion of its debt into equity and contribute new capital for growth. The company, which will remain publicly traded, also plans a rights offering for existing shareholders and aims to close the transaction by December 31, 2025.",
      "url": "https://www.quiverquant.com/news/Rent+the+Runway+Announces+Strategic+Recapitalization+to+Strengthen+Balance+Sheet+and+Support+Growth+Initiatives",
      "source": "Quiver Quantitative",
      "published": "20250821T121400",
      "overall_sentiment_score": 0.099182,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.10065,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.632269
    },
    {
      "title": "HPE Stock Surges Amidst AI Advancements",
      "summary": "Hewlett Packard Enterprise (HPE) stock surged by 3.49% due to strategic advancements in AI, including new servers with NVIDIA GPUs and partnerships like the one with Subaru for AI-driven automotive safety. Deutsche Bank increased its price target for HPE shares to $26, boosted by the Juniper acquisition and a substantial UK court ruling awarding HPE $944M. The company's focus on AI and strategic collaborations positions it for potential future growth despite recent mixed financial results.",
      "url": "https://stockstotrade.com/news/hewlett-packard-enterprise-company-hpe-news-2025_08_21/",
      "source": "StocksToTrade",
      "published": "20250821T200300",
      "overall_sentiment_score": 0.307996,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.132368,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.631654
    },
    {
      "title": "Lumentum Stock Surge: Buying Opportunity?",
      "summary": "Lumentum Holdings Inc. (NASDAQ: LITE) has seen its stock surge by 7.74% due to positive market sentiment driven by strategic expansion into U.S. semiconductor capacity for AI-driven Co-Packaged Optics, strong Q4 2025 financial results, and upward revisions of price targets by analysts. The company reported robust revenue and net income, with a focus on Datacom products and cloud/networking growth, leading to assured financial liquidity and sustainable growth. Experts and market reactions suggest a promising trajectory for Lumentum, positioning it as a key player in evolving AI and optics industries.",
      "url": "https://stockstotrade.com/news/lumentum-holdings-inc-lite-news-2025_08_28/",
      "source": "StocksToTrade",
      "published": "20250828T140400",
      "overall_sentiment_score": 0.459326,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.212159,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.630476
    },
    {
      "title": "Guess Being Taken Private",
      "summary": "Authentic Brands Group is taking downtown-based Guess? Inc. private in a $1.4 billion deal. The transaction involves Authentic Brands acquiring 51% of Guess common stock, with existing shareholders retaining 49%. This move aims to provide Guess with enhanced flexibility and strengthen its competitive position in the fashion industry.",
      "url": "https://labusinessjournal.com/featured/guess-being-taken-private/",
      "source": "Los Angeles Business Journal",
      "published": "20250825T175831",
      "overall_sentiment_score": 0.233779,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.182073,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.626742
    },
    {
      "title": "Petrobras open to IG4 plan to take control of Braskem, sources say",
      "summary": "Brazil's state-run oil firm Petrobras is reportedly receptive to a proposal from IG4 Capital to acquire Novonor's controlling stake in Braskem. IG4 recently secured exclusive rights to negotiate with Novonor and Petrobras to swap Novonor's debt for Braskem shares, with a potential deal finalizing within months and leading to a management overhaul for Braskem.",
      "url": "https://www.reuters.com/business/energy/petrobras-open-ig4-plan-take-control-braskem-sources-say-2025-08-29/",
      "source": "Reuters",
      "published": "20250829T043500",
      "overall_sentiment_score": 0.230211,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.142641,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.622635
    },
    {
      "title": "Tout pour votre épargne, 1er guide épargne de France",
      "summary": "The article \"Fonds obligataires datés\" (Dated Bond Funds) from FranceTransactions.com provides a comprehensive guide to dated bond funds, including a selection of such funds with their characteristics like maturity, category (Investment Grade/High Yield), potential returns, and accessibility through various life insurance/PER products. It also defines what a dated bond fund is and presents a ranking of the top-rated dated bond funds by readers, along with brief descriptions of several specific funds.",
      "url": "https://www.francetransactions.com/bourse/fonds/fonds-obligataires-dates/",
      "source": "FranceTransactions.com",
      "published": "20250826T170000",
      "overall_sentiment_score": 0.246766,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.342371,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.62129
    },
    {
      "title": "Everquote director Neble sells $15,667 in shares",
      "summary": "EverQuote director George R. Neble sold 671 shares of Class A Common Stock for a total of $15,667 on August 15, 2025. This transaction was part of a pre-arranged trading plan, and Neble now directly owns 53,503 shares. The company, which is an insurance marketplace, reported strong Q2 2025 financial results with significant revenue growth and a rise in net income.",
      "url": "https://www.investing.com/news/insider-trading-news/everquote-director-neble-sells-15667-in-shares-93CH-4198861",
      "source": "Investing.com",
      "published": "20250818T191100",
      "overall_sentiment_score": -0.067746,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.182634,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.619085
    },
    {
      "title": "MannKind to Acquire scPharmaceuticals, Accelerating Revenue Growth and Emerging as a Patient-Centric Leader in Cardiometabolic and Lung Diseases",
      "summary": "MannKind Corporation announced a definitive merger agreement to acquire scPharmaceuticals Inc. for an upfront cash payment of $5.35 per share plus a contingent value right up to $1.00, totaling up to $6.35 per share. This acquisition expands MannKind's presence into cardiorenal medicine with scPharmaceuticals' FDA-approved FUROSCIX, aiming to diversify revenue streams, accelerate double-digit growth, and leverage existing infrastructures for enhanced market reach in cardiometabolic and lung diseases. The transaction is expected to close in the fourth quarter of 2025.",
      "url": "https://finance.yahoo.com/news/mannkind-acquire-scpharmaceuticals-accelerating-revenue-113100267.html",
      "source": "Yahoo Finance",
      "published": "20250825T225735",
      "overall_sentiment_score": 0.229109,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.143746,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.618393
    },
    {
      "title": "Washington Newsletter, Q3 2025",
      "summary": "The Invesco Washington Newsletter for Q3 2025 highlights key legislative and regulatory developments, including the passage of new crypto regulations (GENIUS Act and CLARITY Act) and increased congressional scrutiny of trade policy following \"Liberation Day.\" It also details the \"One Big Beautiful Bill Act\" (OBBBA), outlining significant individual and corporate tax modifications, and provides a global view of trade and political developments.",
      "url": "https://www.invesco.com/us/en/insights/washington-newsletter-q3-2025.html",
      "source": "Invesco",
      "published": "20250822T000000",
      "overall_sentiment_score": 0.141026,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.214373,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.611232
    },
    {
      "title": "Who Owns ServiceNow? Biggest Shareholders and Recent Insider Trades",
      "summary": "This article details the major shareholders and recent insider trading activities of ServiceNow (NYSE: NOW). It highlights that the company's ownership is dominated by large asset managers and institutional investors, with mixed signals from active fund managers. Insider transactions show consistent selling by officers, though in small volumes, suggesting a cautions approach to current valuations.",
      "url": "https://www.tikr.com/blog/who-owns-servicenow-biggest-shareholders-and-recent-insider-trades",
      "source": "TIKR.com",
      "published": "20250829T000000",
      "overall_sentiment_score": -0.071234,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.227545,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.609992
    },
    {
      "title": "Product & Service Launches",
      "summary": "Vanguard and Wellington have filed for three new active equity ETFs, expected to launch in Q4 2025, focusing on dividend growth, growth, and value strategies with expense ratios from 0.30% to 0.40%. Manulife John Hancock Investments has launched a Global Senior Loan ETF, aiming for high current income, and Janus Henderson Investors has introduced a Global Artificial Intelligence ETF to invest in disruptive AI companies. These launches expand product offerings in the ETF market.",
      "url": "https://www.plansponsor.com/product-service-launches_8_21_2025/",
      "source": "plansponsor",
      "published": "20250821T000000",
      "overall_sentiment_score": 0.392753,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.308284,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.607217
    },
    {
      "title": "Tilray, Okta, Alaska Air, American Airlines: Trending Tickers",
      "summary": "This article discusses trending stocks Tilray Brands (TLRY), Okta (OKTA), Alaska Air (ALK), and American Airlines (AAL), with insights from Unlimited co-founder Bob Elliott. Tilray saw a price target increase due to cannabis reclassification sentiment, while Okta was upgraded on strong platform resonance. American Airlines faced a downgrade, but Alaska Air received an upgrade based on its measured approach and Hawaii merger.",
      "url": "https://finance.yahoo.com/video/tilray-okta-alaska-air-american-195447914.html",
      "source": "Yahoo Finance",
      "published": "20250825T151040",
      "overall_sentiment_score": 0.249346,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.149923,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.601943
    },
    {
      "title": "William “Bill” Erbey: A Mindset Grounded in Strategic Foresight and Systematic Innovation",
      "summary": "This article profiles William \"Bill\" Erbey, recognizing his five-decade career in finance, analytics, and innovation. It highlights his significant impact on mortgage servicing, particularly through Ocwen Financial Corporation during the 2008 financial crisis, and his continued entrepreneurial ventures in diverse sectors like cryptocurrency and medical technology. The piece emphasizes his strategic foresight and systematic approach to solving inefficiencies through technological and data-driven solutions.",
      "url": "https://gritdaily.com/william-erbey-finance-fintech-innovation/",
      "source": "Grit Daily News",
      "published": "20250821T140946",
      "overall_sentiment_score": 0.379372,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.216655,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.601147
    },
    {
      "title": "POOL Stock Review: Q2 2025 Earnings, Price Target & Analyst Ratings - News and Statistics",
      "summary": "Pool Corporation (POOL) has underperformed the market over the past year, with its stock declining despite a positive reaction to its Q2 2025 earnings report. Analysts maintain a \"Moderate Buy\" rating, with Oppenheimer raising its price target, suggesting a potential upside. Broader trends in construction and leisure sectors are impacting the company's performance.",
      "url": "https://www.indexbox.io/blog/pool-corporation-pool-stock-analysis-2025-performance-and-outlook/",
      "source": "IndexBox",
      "published": "20250827T220928",
      "overall_sentiment_score": 0.285551,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.204066,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.590366
    },
    {
      "title": "Gold Royalty Corp’s Stock on the Rise: Analyst Upgrades and Financial Outperformance",
      "summary": "Gold Royalty Corp's stock has surged by 12.14% due to positive market sentiment and analyst upgrades, with Scotiabank and H.C. Wainwright raising price targets reflecting confidence in improved cash flow and successful asset operations. Despite a strong gross margin, the company faces profitability challenges and valuation concerns, though robust free cash flow and strategic asset management indicate operational resilience and a bullish outlook. Investors are advised to consider entry at market support levels and implement stop-loss strategies to mitigate risk.",
      "url": "https://stockstotrade.com/news/goldroyaltycorp-groy-news-2025_08_30/",
      "source": "StocksToTrade",
      "published": "20250830T144700",
      "overall_sentiment_score": 0.354478,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.343411,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.589172
    },
    {
      "title": "Connect Biopharma Holdings Limited to Participate in Upcoming Healthcare Conferences",
      "summary": "Connect Biopharma Holdings Limited (Nasdaq: CNTB) will participate in two key healthcare conferences in September 2025: the Cantor Global Healthcare Conference and the H.C. Wainwright 27th Annual Global Investment Conference. Management will discuss clinical advancements and engage in fireside chats, with live webcasts and archived replays available. The company, based in San Diego, focuses on developing novel therapies for inflammatory diseases, particularly with its rademikibart candidate for asthma and COPD.",
      "url": "https://www.quiverquant.com/news/Connect+Biopharma+Holdings+Limited+to+Participate+in+Upcoming+Healthcare+Conferences",
      "source": "Quiver Quantitative",
      "published": "20250827T131300",
      "overall_sentiment_score": 0.235077,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.124055,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.588095
    },
    {
      "title": "INVESTCORE 2031",
      "summary": "Alienor Capital has launched INVESTCORE 2031, a new dated bond fund targeting an annual yield of 4.85% with an investment horizon until 2031. The fund employs a \"buy and hold\" strategy for euro-denominated debt securities, primarily from EU private issuers, and is available for subscription until December 31, 2026. This launch follows the success of InvestCore 2028, reinforcing Alienor Capital's expertise in dated bond funds.",
      "url": "https://www.francetransactions.com/bourse/fonds/fonds-obligataires-dates/investcore-2031.html",
      "source": "FranceTransactions.com",
      "published": "20250826T000000",
      "overall_sentiment_score": 0.381444,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.256507,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.578985
    },
    {
      "title": "Antelope Enterprise Holdings Limited Enters Phase Two of Bitcoin Strategy with BitGo Partnership | AEHL Stock News",
      "summary": "Antelope Enterprise Holdings Limited (NASDAQ: AEHL) has embarked on the second phase of its Bitcoin investment strategy by partnering with BitGo for secure digital asset custody. This collaboration aims to enhance asset security, transparency, and compliance through BitGo's multi-signature key management system. AEHL plans to regularly update the market on its Bitcoin acquisitions and holdings as it expands into the Web3 and crypto-finance sectors, capitalizing on favorable market conditions and Bitcoin's growing value.",
      "url": "https://www.quiverquant.com/news/Antelope+Enterprise+Holdings+Limited+Enters+Phase+Two+of+Bitcoin+Strategy+with+BitGo+Partnership",
      "source": "Quiver Quantitative",
      "published": "20250818T133100",
      "overall_sentiment_score": 0.231701,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.14088,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.577034
    },
    {
      "title": "Earnings call transcript: Ardmore Shipping beats Q2 2025 earnings expectations",
      "summary": "Ardmore Shipping (ASC) surpassed Q2 2025 earnings expectations with adjusted EPS of €0.22 and robust revenue of €72.05 million, leading to a 2.84% pre-market stock increase. The strong performance was driven by favorable tanker rates and strategic capital allocation, with the company maintaining excellent financial health and a positive outlook for Q3 2025. Management emphasized opportunistic capital allocation, focusing on value and financial flexibility while navigating geopolitical shifts and trade flow changes.",
      "url": "https://www.investing.com/news/transcripts/earnings-call-transcript-ardmore-shipping-beats-q2-2025-earnings-expectations-93CH-4198936",
      "source": "Investing.com",
      "published": "20250818T210905",
      "overall_sentiment_score": 0.237593,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.134982,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.574779
    },
    {
      "title": "Mike Cagney's Figure Technology publicly files for IPO; revenue grows 22% in first half of 2025",
      "summary": "Mike Cagney's blockchain-based lender, Figure Technology Solutions, has publicly filed its S-1 registration statement for an IPO, aiming to list on Nasdaq under the ticker FIGR. The company reported a 22.4% year-over-year revenue increase to $190.6 million and a net income of $29 million in the first half of 2025. Goldman Sachs, Jefferies, and BofA Securities are lead underwriters for the offering, which will fund general corporate purposes.",
      "url": "https://www.theblock.co/post/367364/figure-technology-publicly-files-ipo",
      "source": "The Block",
      "published": "20250818T224000",
      "overall_sentiment_score": 0.171176,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.076487,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.562921
    },
    {
      "title": "Bitwise Seeks Approval for First U.S. Spot Chainlink ETF",
      "summary": "Bitwise Asset Management has filed with the U.S. SEC to launch the first U.S. spot exchange-traded fund (ETF) tied to Chainlink (LINK). The proposed ETF would track LINK’s daily price via a Chainlink-to-dollar benchmark, holding underlying tokens with Coinbase Custody Trust Company. This initiative aims to provide U.S. investors with regulated access to LINK, similar to products already available in Europe.",
      "url": "https://dailycoin.com/bitwise-seeks-first-us-spot-chainlink-link-etf/",
      "source": "DailyCoin",
      "published": "20250827T113000",
      "overall_sentiment_score": 0.488837,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.25547,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.552895
    }
  ]
}