{
  "ticker": "JPM",
  "date": "2025-12-15",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T13:02:12.819467",
  "source": "alpha_vantage",
  "article_count": 50,
  "articles": [
    {
      "title": "JPMorgan Chase Stock After Hours Today (Dec. 15, 2025): JPM Price, Top Headlines, Analyst Forecasts, and What to Watch Before the Market Opens Dec. 16",
      "summary": "JPMorgan Chase (NYSE: JPM) saw its stock remain steady in after-hours trading on December 15, 2025, following a day of significant news including the launch of its tokenized money market fund, a leadership retirement, and involvement in a large industrial financing project. Analysts like TD Cowen raised price targets, while investors anticipate key economic data releases the following day amidst a backdrop of delayed government statistics and Fed policy discussions.",
      "url": "https://ts2.tech/en/jpmorgan-chase-stock-after-hours-today-dec-15-2025-jpm-price-top-headlines-analyst-forecasts-and-what-to-watch-before-the-market-opens-dec-16/",
      "source": "ts2.tech",
      "published": "20251215T231319",
      "overall_sentiment_score": 0.092415,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.27578,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Barclays Lifts PT on Blackstone (BX) to $172 From $165",
      "summary": "Barclays has raised its price target on Blackstone Inc. (NYSE: BX) to $172 from $165, maintaining an Equal Weight rating, based on a constructive market outlook for alternative asset managers in 2026. Separately, Blackstone Credit & Insurance announced a $1 billion forward flow origination partnership with Harvest Commercial Capital for acquiring small business loans secured by commercial real estate. Despite potential growth, Insider Monkey suggests other AI stocks might offer higher returns and lower risk.",
      "url": "https://www.insidermonkey.com/blog/barclays-lifts-pt-on-blackstone-bx-to-172-from-165-1660514/",
      "source": "Insider Monkey",
      "published": "20251215T224600",
      "overall_sentiment_score": 0.387875,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.347023,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.619806
    },
    {
      "title": "Ready Capital slashes quarterly dividend to $0.01 per share",
      "summary": "Ready Capital Corporation (NYSE:RC) announced a significant cut to its quarterly cash dividend, reducing it to $0.01 per share, reflecting a 50% year-over-year decrease. This decision aims to strengthen the company's balance sheet and maintain financial flexibility amid a 63.75% decline in its stock over the past year. Despite a recent earnings beat for Q3 2025, analysts like KBW have lowered price targets due to concerns over the company's interest-earning portfolio and increasing credit costs.",
      "url": "https://www.investing.com/news/company-news/ready-capital-slashes-quarterly-dividend-to-001-per-share-93CH-4409210",
      "source": "Investing.com",
      "published": "20251215T220907",
      "overall_sentiment_score": 0.092253,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.142392,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.564667
    },
    {
      "title": "Financial Sector Breaks Out as Capital Rotates and Leadership Shifts",
      "summary": "The financial sector appears to be breaking out of a multi-month consolidation, signaling renewed momentum and potential sector leadership, driven by capital rotation and improving investor sentiment. This move is prominently shown by the XLF ETF clearing a significant resistance level, and companies like JPMorgan Chase, Bank of America, Charles Schwab, and even Robinhood are positioned to benefit from these shifts. The article suggests that financials may be entering a sustained leadership phase, making them a sector investors should pay close attention to.",
      "url": "https://www.theglobeandmail.com/investing/markets/stocks/BAC/pressreleases/36651037/financial-sector-breaks-out-as-capital-rotates-and-leadership-shifts/",
      "source": "The Globe and Mail",
      "published": "20251215T220838",
      "overall_sentiment_score": 0.452742,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.470135,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.883748
    },
    {
      "title": "Sprott Silver Miners & Physical Silver ETF Reaches $500 Million in Assets in Less Than a Year",
      "summary": "The Sprott Silver Miners & Physical Silver ETF (Nasdaq: SLVR) achieved $500 million in assets under management on December 11, 2025, less than a year after its launch. This ETF provides pure-play exposure to silver miners and physical silver, a sector experiencing increased investor interest due to rising silver prices and an ongoing supply deficit. SLVR is part of Sprott’s comprehensive precious metals and critical materials ETF offerings.",
      "url": "https://www.stocktitan.net/news/SII/sprott-silver-miners-physical-silver-etf-reaches-500-million-in-4txjc6qnwq4u.html",
      "source": "Stock Titan",
      "published": "20251215T210928",
      "overall_sentiment_score": 0.119497,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.107826,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.586682
    },
    {
      "title": "Kodiak Sciences (Nasdaq: KOD) launches proposed 6M-share stock sale",
      "summary": "Kodiak Sciences (Nasdaq: KOD) has announced a proposed underwritten public offering of 6 million shares of common stock, with an option for underwriters to purchase an additional 900,000 shares. The offering is subject to market and other conditions, and all shares will be sold by Kodiak Sciences. J.P. Morgan, Jefferies, Evercore ISI, and UBS Investment Bank are serving as joint book-running managers for the offering.",
      "url": "https://www.stocktitan.net/news/KOD/kodiak-sciences-announces-proposed-public-offering-of-common-hmavn46x8cbq.html",
      "source": "Stock Titan",
      "published": "20251215T210922",
      "overall_sentiment_score": -0.106962,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.131821,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.633768
    },
    {
      "title": "Immunome Announces Proposed Public Offering of Common Stock",
      "summary": "Immunome, Inc. announced its plan to commence an underwritten public offering to sell $400 million of shares of its common stock, with an option for underwriters to purchase an additional $60 million. Leerink Partners, J.P. Morgan, TD Cowen, Goldman Sachs & Co. LLC, and Guggenheim Securities are serving as joint bookrunning managers. The offering is subject to market conditions and is being made pursuant to a shelf registration statement filed with the SEC.",
      "url": "https://www.businesswire.com/news/home/20251215295131/en/Immunome-Announces-Proposed-Public-Offering-of-Common-Stock",
      "source": "Business Wire",
      "published": "20251215T210921",
      "overall_sentiment_score": -0.077398,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.130671,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.620443
    },
    {
      "title": "PayPal Submits Applications to Establish an Industrial Bank to Expand Access to Financial Services for U.S. Small Businesses",
      "summary": "PayPal Holdings, Inc. has applied to establish PayPal Bank, a Utah-chartered industrial loan company, which aims to provide more efficient business lending solutions to U.S. small businesses and offer interest-bearing savings accounts. This move is intended to strengthen PayPal's business, reduce reliance on third parties, and improve access to capital for small businesses. If approved, customer deposits would be eligible for FDIC insurance.",
      "url": "https://www.prnewswire.com/news-releases/paypal-submits-applications-to-establish-an-industrial-bank-to-expand-access-to-financial-services-for-us-small-businesses-302642655.html",
      "source": "PR Newswire",
      "published": "20251215T210823",
      "overall_sentiment_score": 0.27518,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.178815,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.599792
    },
    {
      "title": "IMAX (IMAX) Stock Trades Up, Here Is Why",
      "summary": "Shares of IMAX (NYSE:IMAX) rose 3.1% after JP Morgan upgraded the stock to 'Overweight' and increased its price target to $47.00, citing a strong upcoming film slate and network expansion potential. This upgrade follows a recent 7.6% gain driven by positive analyst ratings and a deepened strategic partnership in China with Wanda Film. IMAX has seen significant growth in 2025, reaching a new 52-week high of $39.23, reflecting investor confidence in its future.",
      "url": "https://finviz.com/news/254488/imax-imax-stock-trades-up-here-is-why",
      "source": "Finviz",
      "published": "20251215T200855",
      "overall_sentiment_score": 0.30902,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.301417,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.641161
    },
    {
      "title": "Wells Fargo (WFC) Stock: Latest News, Analyst Forecasts, and What to Watch Into 2026 (Dec. 15, 2025)",
      "summary": "This article details the latest news, analyst forecasts, and key factors influencing Wells Fargo (WFC) stock as of December 15, 2025. It highlights recent analyst price target hikes, an investment banking expansion, efficiency driven by AI, and capital structure changes, all contributing to the stock's strong rally in 2025. Investors are focused on net interest income, expense control, and the bank's ability to deliver on post-asset-cap growth opportunities.",
      "url": "https://ts2.tech/en/wells-fargo-wfc-stock-latest-news-analyst-forecasts-and-what-to-watch-into-2026-dec-15-2025/",
      "source": "ts2.tech",
      "published": "20251215T200851",
      "overall_sentiment_score": 0.167321,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.127014,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.5436
    },
    {
      "title": "Galaxy Digital Stock (GLXY) Today: Solana ETF Launch, JPMorgan’s Tokenized Debt Deal, and Wall Street Price Targets",
      "summary": "Galaxy Digital (GLXY) experienced a dip in its stock price despite engaging in significant activities, including the launch of a Solana ETF with Invesco and a tokenized debt deal with JPMorgan on the Solana blockchain. Analysts remain largely bullish on GLXY, citing its hybrid model as a digital assets platform and an emerging AI data center infrastructure provider, though price targets vary widely due to inherent market uncertainties. The company's strategic moves position it as a key \"picks-and-shovels\" provider in on-chain finance rather than solely a bet on crypto prices.",
      "url": "https://ts2.tech/en/galaxy-digital-stock-glxy-today-solana-etf-launch-jpmorgans-tokenized-debt-deal-and-wall-street-price-targets/",
      "source": "ts2.tech",
      "published": "20251215T200846",
      "overall_sentiment_score": 0.24361,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.33406,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.724388
    },
    {
      "title": "Coherent’s Tech Leap: Time to Buy?",
      "summary": "Coherent Corp. (NYSE: COHR) stock is up 2.92% amid positive investor sentiment driven by a JPMorgan upgrade to a $215 price target and the launch of a 300mm silicon carbide platform. This technological advancement aims to address thermal efficiency needs in AI data centers and enhance AR/VR devices, positioning Coherent at the forefront of specialized tech markets. Despite strong market expectations, reflected in a high P/E ratio, and some caution from Morgan Stanley regarding AI stocks, Coherent's strategic initiatives and financial stability indicators like a manageable debt-to-equity ratio suggest a notable trajectory for the company.",
      "url": "https://stockstotrade.com/news/coherent-corp-cohr-news-2025_12_15/",
      "source": "StocksToTrade",
      "published": "20251215T200838",
      "overall_sentiment_score": 0.070043,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.022198,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.627004
    },
    {
      "title": "PepsiCo Stock (PEP) News on Dec. 15, 2025: Leadership Shake-Up, Elliott-Backed Turnaround Plan, and Fresh Analyst Forecasts",
      "summary": "PepsiCo Inc. (PEP) is undergoing significant changes on December 15, 2025, with a leadership shake-up, an Elliott-backed turnaround plan, and updated analyst forecasts. Steven Williams is moving to a global role, and Ram Krishnan is set to become CEO of PepsiCo North America, focusing on integration and growth. The company revealed a 2026 playbook emphasizing affordability, innovation, and cost reduction, alongside preliminary financial targets aimed at satisfying activist investors and driving market performance, though some analysts remain skeptical.",
      "url": "https://ts2.tech/en/pepsico-stock-pep-news-on-dec-15-2025-leadership-shake-up-elliott-backed-turnaround-plan-and-fresh-analyst-forecasts/",
      "source": "ts2.tech",
      "published": "20251215T200813",
      "overall_sentiment_score": 0.16391,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.327396,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.682201
    },
    {
      "title": "Citigroup Stock (NYSE: C) News Today, Dec. 15, 2025: Shares Push Toward 2008 Highs as JPMorgan Upgrade, Banamex Sale Update and BlackRock Wealth Deal Take Center Stage",
      "summary": "Citigroup (NYSE: C) stock is experiencing a surge, nearing its 2008 highs, driven by several key catalysts. These include a major \"overweight\" upgrade from JPMorgan, new developments in the planned sale of a 25% stake in Banamex, and a significant wealth management partnership with BlackRock where BlackRock will manage approximately $80 billion of Citi's wealth-management client assets. The stock's performance reflects investor optimism regarding Citi's ongoing restructuring, improving profitability, and strategic partnerships.",
      "url": "https://ts2.tech/en/citigroup-stock-nyse-c-news-today-dec-15-2025-shares-push-toward-2008-highs-as-jpmorgan-upgrade-banamex-sale-update-and-blackrock-wealth-deal-take-center-stage/",
      "source": "ts2.tech",
      "published": "20251215T195315",
      "overall_sentiment_score": 0.370838,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.344434,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.72954
    },
    {
      "title": "Guarantor: JPMorgan Chase & Co.",
      "summary": "JPMorgan Chase Financial Company LLC is offering $2,752,000 in Yield Notes linked to Amazon.com, Inc. common stock, fully guaranteed by JPMorgan Chase & Co. These notes offer a 10.05% per annum interest rate over their term, but investors risk losing principal if Amazon's stock price falls below a specified trigger value. The notes are unsecured obligations and involve credit risk from both the issuer and the guarantor.",
      "url": "https://www.streetinsider.com/SEC+Filings/Form+424B2+JPMORGAN+CHASE+%26amp%3B+CO/25739923.html",
      "source": "StreetInsider",
      "published": "20251215T180858",
      "overall_sentiment_score": 0.107024,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.131651,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 1.0
    },
    {
      "title": "Financial Sector Breaks Out as Capital Rotates and Leadership Shifts",
      "summary": "The financial sector, represented by the Financial Select Sector SPDR Fund (XLF), has experienced a significant breakout after an extended consolidation period, signaling a potential shift in market leadership and capital rotation. This move comes amid broader market concerns and highlights improving sentiment and performance for financial institutions. JPMorgan Chase, Bank of America, Charles Schwab, and even Robinhood are identified as key players benefiting from, or poised to benefit from, this renewed strength in the financial sector.",
      "url": "https://www.theglobeandmail.com/investing/markets/stocks/JPM/pressreleases/36651037/financial-sector-breaks-out-as-capital-rotates-and-leadership-shifts/",
      "source": "The Globe and Mail",
      "published": "20251215T180856",
      "overall_sentiment_score": 0.351129,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.332453,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.86034
    },
    {
      "title": "Capital One stock price target raised to $268 from $248 at BofA Securities",
      "summary": "BofA Securities increased its price target for Capital One Financial to $268 from $248, reiterating a \"Buy\" rating due to solid credit performance, attractive capital returns, and strategic benefits from the Discover acquisition. Despite slower card loan growth, November credit metrics showed positive trends, with the stock trading near its 52-week high. Other firms like Wolfe Research, TD Cowen, and UBS also maintain positive outlooks on Capital One.",
      "url": "https://www.investing.com/news/analyst-ratings/capital-one-stock-price-target-raised-to-268-from-248-at-bofa-securities-93CH-4408867",
      "source": "Investing.com",
      "published": "20251215T175558",
      "overall_sentiment_score": 0.34927,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.323888,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.602195
    },
    {
      "title": "Aegon Ltd Stock (AEG) Today: Transamerica Rebrand, U.S. Relocation Plan, Buybacks, and the UK Sale Watchlist (Dec. 15, 2025)",
      "summary": "Aegon Ltd. (AEG) is undergoing a major strategic shift, planning to relocate its headquarters to the U.S. and rebrand as Transamerica Inc. by 2028. This move, along with new financial targets, a new buyback program, and a UK business review, has led to a market repricing despite causing an initial stock drop due to investor disappointment in near-term capital returns. The article details the company's financial outlook, buyback schedule, risk-reduction strategies, and ongoing sale speculation for its UK and potentially Spain & Portugal operations.",
      "url": "https://ts2.tech/en/aegon-ltd-stock-aeg-today-transamerica-rebrand-u-s-relocation-plan-buybacks-and-the-uk-sale-watchlist-dec-15-2025/",
      "source": "ts2.tech",
      "published": "20251215T170947",
      "overall_sentiment_score": -0.17527,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.148195,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.604139
    },
    {
      "title": "Goldman Stock Trades Near 52-Week High: How to Approach Now?",
      "summary": "Goldman Sachs Group (GS) shares are trading near their 52-week high, driven by strong M&A activity, strategic streamlining, and significant investment in private equity. The company's robust liquidity supports capital distribution through buybacks and dividends. Analysts are bullish on GS's earnings prospects, recommending investors hold the stock for long-term growth despite its current valuation being slightly above the industry average.",
      "url": "https://www.theglobeandmail.com/investing/markets/stocks/GS/pressreleases/36627695/goldman-stock-trades-near-52-week-high-how-to-approach-now/",
      "source": "The Globe and Mail",
      "published": "20251215T170815",
      "overall_sentiment_score": 0.269659,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.214144,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.642678
    },
    {
      "title": "Evercore ISI Raises Zions Bancorporation, N.A. (NASDAQ:ZION) Price Target to $65.00",
      "summary": "Evercore ISI has raised its price target for Zions Bancorporation, N.A. (NASDAQ:ZION) to $65.00 from $61.00, maintaining an \"outperform\" rating and implying a 9.04% upside. This adjustment reflects continued analyst attention on ZION, which currently holds a \"Hold\" consensus rating despite individual targets varying significantly. The company's stock recently traded near a one-year high, supported by its financial metrics and institutional investment activity.",
      "url": "https://www.marketbeat.com/instant-alerts/evercore-isi-raises-zions-bancorporation-na-nasdaqzion-price-target-to-6500-2025-12-15/",
      "source": "MarketBeat",
      "published": "20251215T160946",
      "overall_sentiment_score": 0.184711,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.271956,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.639331
    },
    {
      "title": "Smith & Nephew plc (LON:SN) Receives Consensus Rating of \"Moderate Buy\" from Analysts",
      "summary": "Analysts have issued a \"Moderate Buy\" consensus rating for Smith & Nephew plc (LON:SN), with six research firms providing coverage resulting in an average 12-month target price of GBX 1,439.67. Insider Deepak Nath recently sold 1,240 shares, and the company's stock traded up 0.1% during midday trading on high volume. Smith & Nephew is a medical device company operating in orthopaedics, sports medicine, and advanced wound management.",
      "url": "https://www.marketbeat.com/instant-alerts/smith-nephew-plc-lonsn-receives-consensus-rating-of-moderate-buy-from-analysts-2025-12-15/",
      "source": "MarketBeat",
      "published": "20251215T160941",
      "overall_sentiment_score": 0.179083,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.34936,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.569628
    },
    {
      "title": "Bank of America (BAC) Stock Today: Latest News, Analyst Forecasts, and Key Catalysts for 2026 (Dec. 15, 2025)",
      "summary": "Bank of America (BAC) stock is in focus today, December 15, 2025, driven by the Federal Reserve's recent rate cut and an increasing narrative of banks benefiting from AI efficiency. Analysts maintain a \"Buy\" consensus with mid-single-digit upside, projecting an average 12-month price target in the high-$50s. Key catalysts include the Fed's rate path, capital markets revenue, buyback pace, and the execution of AI initiatives, with the next earnings call on January 14, 2026, being a critical event for investors.",
      "url": "https://ts2.tech/en/bank-of-america-bac-stock-today-latest-news-analyst-forecasts-and-key-catalysts-for-2026-dec-15-2025/",
      "source": "ts2.tech",
      "published": "20251215T160812",
      "overall_sentiment_score": 0.255248,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.228357,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.643361
    },
    {
      "title": "Goldman Sachs Stock (NYSE: GS) Today: Latest News, Analyst Forecasts, and 2026 Catalysts (Dec. 15, 2025)",
      "summary": "Goldman Sachs stock (NYSE: GS) is trading higher on December 15, 2025, driven by its leadership in the Dow's momentum, strategic investments in the Texas Stock Exchange, and expansion of wealth-management products. The article highlights that GS is currently trading above many analyst price targets, suggesting high expectations for its 2026 performance in dealmaking, asset management, and sustained growth. Upcoming Q4 2025 earnings on January 15, 2026, will be a critical catalyst to justify its valuation amid market debates on growth and \"AI bubble\" concerns.",
      "url": "https://ts2.tech/en/goldman-sachs-stock-nyse-gs-today-latest-news-analyst-forecasts-and-2026-catalysts-dec-15-2025/",
      "source": "ts2.tech",
      "published": "20251215T160803",
      "overall_sentiment_score": 0.155367,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.128661,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.611425
    },
    {
      "title": "Renaissancere Holdings stock hits 52-week high at 275.0 USD",
      "summary": "Renaissancere Holdings stock reached a 52-week high of $275.00, marking a period of growth with a 4.68% increase over the past year and significant returns over the last six months and year-to-date. This Bermuda-based reinsurance company, with a P/E ratio of 7.85 and a \"GREAT\" InvestingPro Financial Health score, appears slightly undervalued according to Fair Value estimates, supported by share buybacks and a 31-year streak of dividend increases. Recent news also includes a quarterly dividend, a renewed share repurchase program of up to $750 million, and mixed analyst ratings from BMO Capital, Goldman Sachs, JPMorgan, and Evercore ISI.",
      "url": "https://www.investing.com/news/company-news/renaissancere-holdings-stock-hits-52week-high-at-2750-usd-93CH-4408484",
      "source": "Investing.com",
      "published": "20251215T152116",
      "overall_sentiment_score": -0.190888,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.233782,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.620173
    },
    {
      "title": "Marex Group plc Makes New $549,000 Investment in Joby Aviation, Inc. $JOBY",
      "summary": "Marex Group plc initiated a new investment in Joby Aviation, Inc. by purchasing 52,061 shares valued at approximately $549,000 in Q2. Other institutional investors like Toyota Motor Corp also significantly increased their stakes, while company insiders sold shares. Despite mixed analyst ratings and an average price target of $13.43, Joby Aviation's revenue saw substantial growth, although it missed EPS expectations.",
      "url": "https://www.marketbeat.com/instant-alerts/filing-marex-group-plc-makes-new-549000-investment-in-joby-aviation-inc-joby-2025-12-15/",
      "source": "MarketBeat",
      "published": "20251215T150904",
      "overall_sentiment_score": 0.037647,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.143218,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.639737
    },
    {
      "title": "BlackRock Scoops Up $80 Billion In Citi Client Assets",
      "summary": "BlackRock has taken over the management of $80 billion in client assets from Citigroup, with key Citi investment staff moving to BlackRock. This deal, finalized in September, expands BlackRock's wealth management role through a joint brand and reflects a broader trend of consolidation and partnership within the financial sector. The market reaction saw BlackRock's shares slightly down and Citi's up, signaling confidence in both firms' strategic moves towards increased efficiency and client reach.",
      "url": "https://finimize.com/content/blackrock-scoops-up-80-billion-in-citi-client-assets",
      "source": "Finimize",
      "published": "20251215T150859",
      "overall_sentiment_score": 0.168608,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.113557,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.649956
    },
    {
      "title": "Tesla Stock (TSLA) Surges on Driverless Robotaxi Test Buzz as Board Pay Scrutiny and 2026 Forecasts Fuel the Debate (Dec. 15, 2025)",
      "summary": "Tesla shares surged today on news of \"no-occupant\" robotaxi testing in Austin, which was confirmed by CEO Elon Musk, suggesting a more aggressive testing phase for its autonomous technology. This surge comes amidst ongoing scrutiny over board compensation, current U.S. sales figures indicating a tougher demand environment for its core car business, and new bullish 2026 forecasts from analysts like Wedbush, who see Tesla as an AI platform. Investors are weighing the potential of autonomy against regulatory risks and the company's financial performance.",
      "url": "https://ts2.tech/en/tesla-stock-tsla-surges-on-driverless-robotaxi-test-buzz-as-board-pay-scrutiny-and-2026-forecasts-fuel-the-debate-dec-15-2025/",
      "source": "ts2.tech",
      "published": "20251215T150850",
      "overall_sentiment_score": 0.054359,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.112227,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.637788
    },
    {
      "title": "Xcel Energy Commences Cash Offers to Purchase Up to $345 Million of Northern States Power Company First Mortgage Bonds",
      "summary": "Xcel Energy Inc. has initiated cash offers to purchase up to $345 million in aggregate principal amount of three series of first mortgage bonds issued by its subsidiary, Northern States Power Company. The offers prioritize acceptance based on designated levels, with all validly tendered bonds in accepted series being purchased without proration. The offers will expire on December 19, 2025, and bondholders can withdraw tenders until that date.",
      "url": "https://www.quiverquant.com/news/Xcel+Energy+Commences+Cash+Offers+to+Purchase+Up+to+%24345+Million+of+Northern+States+Power+Company+First+Mortgage+Bonds",
      "source": "Quiver Quantitative",
      "published": "20251215T142258",
      "overall_sentiment_score": 0.17775,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.147433,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.57651
    },
    {
      "title": "J.P. Morgan AM (JPM) offers Ethereum tokenized Treasury fund via Morgan Money",
      "summary": "J.P. Morgan Asset Management has launched My OnChain Net Yield Fund (MONY), its first tokenized money market fund, on the public Ethereum blockchain. This 506(c) private placement allows qualified investors to invest in U.S. Treasury securities and repurchase agreements, with daily dividend reinvestment and subscription/redemption options in cash or stablecoins via the Morgan Money platform. The initiative underscores J.P. Morgan's commitment to blockchain-based financial innovation and positions it as a leading GSIB in the tokenized money market space.",
      "url": "https://www.stocktitan.net/news/JPM/j-p-morgan-asset-management-launches-its-first-tokenized-money-9o241fgxlgto.html",
      "source": "Stock Titan",
      "published": "20251215T140825",
      "overall_sentiment_score": 0.310025,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.404444,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Amiral Gestion Buys New Position in Paycom Software, Inc. $PAYC",
      "summary": "Amiral Gestion recently acquired a new stake in Paycom Software Inc. (NYSE:PAYC), purchasing 27,979 shares valued at approximately $6.47 million, making it their 12th largest holding. Despite a slight EPS miss of $0.02, Paycom reported a 9.2% increase in year-over-year revenue to $493.3 million. The company maintains a \"Hold\" consensus rating from analysts, a 0.9% dividend yield, and significant institutional ownership.",
      "url": "https://www.marketbeat.com/instant-alerts/filing-amiral-gestion-buys-new-position-in-paycom-software-inc-payc-2025-12-15/",
      "source": "MarketBeat",
      "published": "20251215T140822",
      "overall_sentiment_score": 0.268852,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.133093,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.625142
    },
    {
      "title": "JPMorgan Adjusts Charles River Laboratories International PT to $190 From $165, Maintains Neutral Rating",
      "summary": "JPMorgan has adjusted its price target for Charles River Laboratories International (NYSE: CRL) to $190, an increase from the previous $165, while maintaining a Neutral rating on the stock. This update reflects the firm's revised outlook for the company, following other analyst activities for CRL. The article also provides recent news headlines and stock performance data for Charles River Laboratories International.",
      "url": "https://www.marketscreener.com/news/jpmorgan-adjusts-charles-river-laboratories-international-pt-to-190-from-165-maintains-neutral-ra-ce7d50d9da88f124",
      "source": "marketscreener.com",
      "published": "20251215T140303",
      "overall_sentiment_score": 0.105269,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.099727,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.611297
    },
    {
      "title": "Strategy (MSTR) Survives Nasdaq 100 Reshuffle — Can It Endure an MSCI Ban?",
      "summary": "Strategy (MSTR) successfully retained its spot in the Nasdaq 100 despite having over 50% of its assets in Bitcoin. However, the company faces a significant challenge as MSCI is considering excluding firms with substantial digital asset holdings from its indexes by February 2026, which could lead to $8.8 billion in outflows for Strategy. A decision from MSCI is anticipated by January 15, which could heavily impact Strategy's stock, already down 39% year-to-date.",
      "url": "https://247wallst.com/investing/2025/12/15/strategy-mstr-survives-nasdaq-100-reshuffle-can-it-endure-an-msci-ban/",
      "source": "24/7 Wall St.",
      "published": "20251215T134330",
      "overall_sentiment_score": 0.136046,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.116148,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.626516
    },
    {
      "title": "Chase (NYSE: JPM) adds dining, AHA donations, Norwegian Cruise Line to Q1 5% cash back",
      "summary": "Chase Freedom and Freedom Flex cardmembers will earn 5% cash back on dining, donations to the American Heart Association, and Norwegian Cruise Line purchases for Q1 2026. This initiative allows cardmembers to maximize rewards on popular activities and support a significant cause. JPMorgan Chase is a national supporter of the American Heart Association, and cardmembers can activate these bonus categories starting January 1, 2026.",
      "url": "https://www.stocktitan.net/news/JPM/chase-freedom-introduces-q1-2026-categories-dining-supporting-the-wjaynb0ywvq8.html",
      "source": "Stock Titan",
      "published": "20251215T130234",
      "overall_sentiment_score": 0.362447,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.457257,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "JPMorgan To Rival BlackRock, Goldman Sachs With $100M Tokenized Money Market Fund",
      "summary": "JPMorgan Chase has launched its first tokenized money-market fund, \"My OnChain Net Yield Fund\" (MONY), on the Ethereum blockchain, seeded with $100 million of its own capital. This move positions JPMorgan alongside BlackRock and Goldman Sachs in the accelerating trend of Wall Street firms adopting tokenization for financial products, offering benefits like operational efficiency and on-chain yield for qualified investors. The bank's stock, JPM, is currently consolidating near record highs with strong bullish technical indicators.",
      "url": "https://www.benzinga.com/crypto/cryptocurrency/25/12/49388632/jpmorgan-to-rival-blackrock-goldman-sachs-with-100m-tokenized-money-market-fund",
      "source": "Benzinga",
      "published": "20251215T121727",
      "overall_sentiment_score": 0.250325,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.420675,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "AllianceBernstein (NYSE: AB) launches active AB US Equity ETF XCHG on NYSE today",
      "summary": "AllianceBernstein (NYSE: AB) has launched the actively managed AB US Equity ETF (NYSE: XCHG) on the New York Stock Exchange. The ETF aims for long-term capital growth by investing at least 80% of its net assets in U.S. company equity securities, utilizing a 351-exchange mechanism for tax efficiency. This addition expands AB's U.S. ETF lineup to 23 funds, managing over $13 billion in assets as of December 15, 2025.",
      "url": "https://www.stocktitan.net/news/AB/alliance-bernstein-launches-ab-us-equity-etf-xchg-on-the-new-york-72r22fjnmvvr.html",
      "source": "Stock Titan",
      "published": "20251215T120923",
      "overall_sentiment_score": 0.041488,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.055364,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.556149
    },
    {
      "title": "Titan America SA (NYSE:TTAM) to Issue Dividend of $0.04",
      "summary": "Titan America SA (NYSE:TTAM) has announced a cash dividend of $0.04 per share, payable on December 29th, with an ex-dividend date of December 17th. The company recently reported Q3 EPS of $0.31, meeting estimates, and revenue of $436.85 million, slightly below estimates, representing a 6.2% year-over-year increase. Several institutional investors have adjusted their positions in TTAM, with the stock currently trading with a market capitalization of $3.06 billion.",
      "url": "https://www.marketbeat.com/instant-alerts/titan-america-sa-nysettam-to-issue-dividend-of-004-2025-12-15/",
      "source": "MarketBeat",
      "published": "20251215T120855",
      "overall_sentiment_score": 0.141569,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.13629,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.618776
    },
    {
      "title": "Stance Capital LLC Buys Shares of 8,647 JPMorgan Chase & Co. $JPM",
      "summary": "Stance Capital LLC recently acquired a new stake in JPMorgan Chase & Co. (NYSE:JPM), purchasing 8,647 shares valued at approximately $2.5 million. This makes JPMorgan Chase & Co. the 18th largest holding in Stance Capital LLC's portfolio. Other institutional investors, such as Kingstone Capital Partners Texas LLC and Geode Capital Management LLC, also significantly increased their positions in JPM.",
      "url": "https://www.marketbeat.com/instant-alerts/filing-stance-capital-llc-buys-shares-of-8647-jpmorgan-chase-co-jpm-2025-12-15/",
      "source": "MarketBeat",
      "published": "20251215T115531",
      "overall_sentiment_score": 0.31987,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.265524,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.987397
    },
    {
      "title": "Will the SPDR S&P 500 ETF (SPY) Stock Hit $800 in 2026?",
      "summary": "The article discusses the potential for the SPDR S&P 500 ETF (SPY) to reach $800 in 2026, which would require a 21.5% increase. It highlights that accommodative monetary policies from the Federal Reserve, including interest rate cuts and bond purchases, are expected to fuel this growth despite any perceived tariff turmoil. FOMC officials' projections for falling inflation and rising GDP in 2026 also support a positive outlook for the stock market.",
      "url": "https://247wallst.com/investing/2025/12/15/will-the-spdr-sp-500-etf-spy-stock-hit-800-in-2026/",
      "source": "24/7 Wall St.",
      "published": "20251215T111800",
      "overall_sentiment_score": 0.32709,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.260547,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.609525
    },
    {
      "title": "B. Riley Wealth Advisors Inc. Purchases New Shares in Main Street Capital Corporation $MAIN",
      "summary": "B. Riley Wealth Advisors Inc. initiated a new position in Main Street Capital Corporation (NYSE:MAIN), acquiring 28,518 shares valued at approximately $1.685 million during the second quarter. Other institutional investors like JPMorgan Chase & Co. and Invesco Ltd. also significantly increased their stakes in MAIN, bringing the total institutional ownership to 20.31%. Main Street Capital maintains a \"Hold\" consensus rating from analysts with an average price target of $62.43 and offers a monthly dividend of $0.26, reflecting an annualized yield of about 5.0%.",
      "url": "https://www.marketbeat.com/instant-alerts/filing-b-riley-wealth-advisors-inc-purchases-new-shares-in-main-street-capital-corporation-main-2025-12-15/",
      "source": "MarketBeat",
      "published": "20251215T110858",
      "overall_sentiment_score": 0.143352,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.137372,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.638147
    },
    {
      "title": "3M (MMM) Stock: What to Know Before the U.S. Market Opens on Monday, Dec. 15, 2025",
      "summary": "This article details key factors influencing 3M (MMM) stock ahead of the U.S. market open on Monday, December 15, 2025. It covers a recent analyst downgrade, the company's turnaround efforts under CEO William Brown, ongoing legal liabilities related to PFAS and Combat Arms earplugs, and its dividend policy. The piece emphasizes that 3M's valuation now reflects much of the turnaround optimism, making it sensitive to incremental news.",
      "url": "https://ts2.tech/en/3m-mmm-stock-what-to-know-before-the-u-s-market-opens-on-monday-dec-15-2025/",
      "source": "ts2.tech",
      "published": "20251215T110818",
      "overall_sentiment_score": -0.061096,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.064594,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.578951
    },
    {
      "title": "Goldman Stock Trades Near 52-Week High: How to Approach Now?",
      "summary": "Goldman Sachs Group, Inc. (GS) shares are trading near their 52-week high, having outperformed competitors JPMorgan and Morgan Stanley with a 51.5% gain over the past year. The company's growth is driven by strong M&A momentum in its investment banking segment, strategic streamlining efforts away from consumer banking, and aggressive expansion into private equity. With robust liquidity and consistent capital returns, analysts are bullish on GS's earnings prospects, though its valuation appears slightly expensive compared to industry averages.",
      "url": "https://finviz.com/news/254302/goldman-stock-trades-near-52-week-high-how-to-approach-now",
      "source": "Finviz",
      "published": "20251215T103300",
      "overall_sentiment_score": 0.299253,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.247434,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.616907
    },
    {
      "title": "Roomba maker iRobot files for bankruptcy and will go private",
      "summary": "iRobot Corp., the creator of the Roomba robot vacuum, has filed for bankruptcy and will be taken private by its main Chinese supplier, Shenzhen PICEA Robotics Co. The company experienced declining earnings post-Covid despite an attempted acquisition by Amazon that fell through due to EU competition concerns. The bankruptcy plan aims to keep iRobot as a going concern, allowing it to fulfill commitments to employees and creditors.",
      "url": "https://www.detroitnews.com/story/business/2025/12/15/roomba-maker-irobot-files-for-bankruptcy-and-will-go-private/87775059007/",
      "source": "The Detroit News",
      "published": "20251215T101700",
      "overall_sentiment_score": -0.308026,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.101833,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.630162
    },
    {
      "title": "Corient Private Wealth LLC Sells 2,761 Shares of Parker-Hannifin Corporation $PH",
      "summary": "Corient Private Wealth LLC recently reduced its stake in Parker-Hannifin Corporation (NYSE:PH) by 1.2%, selling 2,761 shares and holding 0.18% of the company's stock valued at $162.5 million. Other institutional investors showed mixed activity, with some increasing and others decreasing their positions. Parker-Hannifin reported strong quarterly earnings, topping analyst estimates, and announced a quarterly dividend, while analysts maintain a \"Moderate Buy\" rating with an average target price of $889.50.",
      "url": "https://www.marketbeat.com/instant-alerts/filing-corient-private-wealth-llc-sells-2761-shares-of-parker-hannifin-corporation-ph-2025-12-15/",
      "source": "MarketBeat",
      "published": "20251215T100948",
      "overall_sentiment_score": 0.304093,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.346021,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.57994
    },
    {
      "title": "JPMorgan Lifts Alcoa (AA) Target to $45 in 2026 Metals Outlook",
      "summary": "JPMorgan has increased its price target for Alcoa Corporation (AA) to $45 from $35, maintaining a Neutral rating, as part of its 2026 outlook for North American metals and mining companies. This adjustment follows Alcoa's improved third-quarter earnings and strategic efforts like the acquisition of Alumina Limited and investments in its Massena Operations, including a new energy agreement and a $60 million upgrade. The company continues to focus on expanding operations and lowering costs to build long-term shareholder value.",
      "url": "https://finviz.com/news/254057/jpmorgan-lifts-alcoa-aa-target-to-45-in-2026-metals-outlook",
      "source": "Finviz",
      "published": "20251215T094700",
      "overall_sentiment_score": 0.207709,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.105381,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.623749
    },
    {
      "title": "Geneos Wealth Management Inc. Raises Stock Holdings in JPMorgan Active Small Cap Value ETF $JPSV",
      "summary": "Geneos Wealth Management Inc. significantly increased its stake in the JPMorgan Active Small Cap Value ETF (NYSEARCA:JPSV) by 122.2% during the second quarter, now owning 125,844 shares valued at $7,088,000. This makes Geneos Wealth Management Inc. the largest institutional holder with approximately 30.69% of the ETF. Royal Bank of Canada also grew its holdings in JPSV, which opened at $60.12 and has a market capitalization of $24.65 million.",
      "url": "https://www.defenseworld.net/2025/12/15/geneos-wealth-management-inc-raises-stock-holdings-in-jpmorgan-active-small-cap-value-etf-jpsv.html",
      "source": "Defense World",
      "published": "20251215T090840",
      "overall_sentiment_score": 0.164984,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.228827,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.646532
    },
    {
      "title": "B. Riley Wealth Advisors Inc. Purchases New Shares in Thermo Fisher Scientific Inc. $TMO",
      "summary": "B. Riley Wealth Advisors Inc. acquired a new stake in Thermo Fisher Scientific Inc. (NYSE:TMO) by purchasing 5,647 shares valued at approximately $2.29 million during the second quarter. The medical research company recently reported strong quarterly earnings, beating analyst estimates, and authorized a $5.0 billion share repurchase program. Despite significant insider selling over the past three months, institutional investors continue to adjust their positions in TMO.",
      "url": "https://www.marketbeat.com/instant-alerts/filing-b-riley-wealth-advisors-inc-purchases-new-shares-in-thermo-fisher-scientific-inc-tmo-2025-12-15/",
      "source": "MarketBeat",
      "published": "20251215T082634",
      "overall_sentiment_score": 0.304335,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.304876,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.620271
    },
    {
      "title": "Catalyst Pharmaceuticals to Participate in the 44th Annual J.P. Morgan Healthcare Conference",
      "summary": "Catalyst Pharmaceuticals announced that its President and CEO, Rich Daly, along with other management team members, will present at the 44th Annual J.P. Morgan Healthcare Conference on January 12, 2026, at 3:45 PM PST. The presentation will be webcast live and a replay will be available on the company's website. Catalyst Pharmaceuticals is a commercial-stage biopharmaceutical company focused on developing and commercializing novel medicines for rare diseases.",
      "url": "https://www.globenewswire.com/news-release/2025/12/15/3205390/0/en/Catalyst-Pharmaceuticals-to-Participate-in-the-44th-Annual-J-P-Morgan-Healthcare-Conference.html",
      "source": "GlobeNewswire",
      "published": "20251215T080300",
      "overall_sentiment_score": 0.212857,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.102324,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.601009
    },
    {
      "title": "Chemours Company (CC) Up More than 12% Since Q3, Here’s What Wall Street Thinks About the Stock",
      "summary": "The Chemours Company (NYSE:CC) has seen its stock price increase by over 12% since its Q3 2025 results, despite subpar earnings. Wall Street analysts maintain a mixed outlook, with J.P. Morgan reiterating a Hold rating and lowering its price target, while Alembic Global maintained a Buy rating with a lowered price target. The company's Q3 revenue decreased year-over-year, attributed to declines in Freon Refrigerants and Foam, Propellants & Other sales, though offset by a significant increase in Opteon™ Refrigerants.",
      "url": "https://www.insidermonkey.com/blog/chemours-company-cc-up-more-than-12-since-q3-heres-what-wall-street-thinks-about-the-stock-1659830/?amp=1",
      "source": "Insider Monkey",
      "published": "20251215T050910",
      "overall_sentiment_score": -0.064326,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.107554,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.621547
    },
    {
      "title": "VivoPower Announces Update to Annual General Meeting",
      "summary": "VivoPower International PLC announced an update regarding its Annual General Meeting (AGM), stating it will proceed with the ordinary business but adjourn the meeting due to an advanced stage material corporate transaction. This transaction could significantly alter the shareholder base and necessitate new or obviate proposed special resolutions. The company plans to reconvene the adjourned meeting in due course to conclude all outstanding business.",
      "url": "https://www.globenewswire.com/news-release/2025/12/15/3205166/0/en/VivoPower-Announces-Update-to-Annual-General-Meeting.html",
      "source": "GlobeNewswire",
      "published": "20251215T040000",
      "overall_sentiment_score": 0.123124,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.104221,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.616921
    },
    {
      "title": "KeyCorp (KEY): Reassessing Valuation After Bullish Revenue Outlook and Expanded Share Repurchase Plans",
      "summary": "KeyCorp (KEY) has announced a bullish revenue outlook and expanded share repurchase plans, leading to a rise in its stock price. Despite this, the stock is still trading at a discount to analyst targets and intrinsic value estimates, raising questions about whether it's a buying opportunity or if future growth is already priced in. Analysts project an annual revenue growth of 10.5% for KeyCorp over the next three years, with profit margins expected to increase significantly.",
      "url": "https://simplywall.st/stocks/us/banks/nyse-key/keycorp/news/keycorp-key-reassessing-valuation-after-bullish-revenue-outl",
      "source": "Simply Wall Street",
      "published": "20251214T214619",
      "overall_sentiment_score": 0.181673,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.110886,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.606162
    }
  ]
}