{
  "ticker": "JPM",
  "date": "2026-01-26",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T13:02:41.673428",
  "source": "alpha_vantage",
  "article_count": 50,
  "articles": [
    {
      "title": "Walkner Condon Buys $3.8 Million Worth of First Trust Capital Strength ETF in Q4",
      "summary": "Walkner Condon Financial Advisors LLC increased its holding in First Trust Capital Strength ETF (FTCS) by 41,581 shares, valued at an estimated $3.84 million, making FTCS its tenth-largest holding. The ETF focuses on well-capitalized U.S. companies with strong market positions, offering stability and consistent performance with lower volatility than the broader market. Despite underperforming the S&P 500 in recent years, its disciplined selection process screens for financially robust and stable companies, making it suitable for risk-averse investors seeking equity exposure.",
      "url": "https://www.fool.com/coverage/filings/2026/01/26/walkner-condon-buys-usd3-8-million-worth-of-first-trust-capital-strength-etf-in-q4/",
      "source": "The Motley Fool",
      "published": "20260126T232757",
      "overall_sentiment_score": 0.21729,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.115388,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.627253
    },
    {
      "title": "How (BBEU) Movements Inform Risk Allocation Models",
      "summary": "This article analyzes Jpmorgan Betabuilders Europe Etf (BBEU) using AI models to inform risk allocation, indicating a neutral near and mid-term outlook but a positive long-term bias. It provides specific trading strategies—Position, Momentum Breakout, and Risk Hedging—with entry zones, targets, and stop losses. The analysis also includes multi-timeframe signal strengths, support, and resistance levels for BBEU.",
      "url": "https://news.stocktradersdaily.com/news_release/132/How_BBEU_Movements_Inform_Risk_Allocation_Models_012626081201_1769433121.html",
      "source": "Stock Traders Daily",
      "published": "20260126T225745",
      "overall_sentiment_score": 0.12093,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.143798,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.628725
    },
    {
      "title": "Mizuho hires Deutsche Bank veteran Richard Robinson as senior industrials banker",
      "summary": "Mizuho Financial Group has appointed Richard Robinson as vice chairman and managing director in its Industrials Group. Robinson, formerly global vice chairman at Deutsche Bank, brings extensive experience advising industrials, materials, and energy clients, including over $500 billion in M&A deals and $35 billion in equity and debt offerings. He will be based in New York and report to David Hunt and Doug Jackson.",
      "url": "https://wtvbam.com/2026/01/26/mizuho-hires-deutsche-bank-veteran-richard-robinson-as-senior-industrials-banker/",
      "source": "WTVB",
      "published": "20260126T223645",
      "overall_sentiment_score": 0.258605,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.308569,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.627987
    },
    {
      "title": "General Motors Q4 Earnings Preview: Auto Giant Goes For 14th Straight Double Beat",
      "summary": "General Motors (NYSE: GM) is expected to report its Q4 earnings, aiming for its 14th consecutive revenue beat and 13th EPS beat. The company is navigating a complex strategy of promoting EV growth while scaling back certain EV efforts to focus on more profitable traditional vehicles and U.S. production. Analysts have raised price targets ahead of the earnings report.",
      "url": "https://www.benzinga.com/trading-ideas/previews/26/01/50142556/general-motors-q4-earnings-preview-auto-giant-goes-for-14th-straight-double-beat",
      "source": "Benzinga",
      "published": "20260126T212332",
      "overall_sentiment_score": 0.302669,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.304371,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.616544
    },
    {
      "title": "Citizens Financial Group to redeem subordinated notes in February",
      "summary": "Citizens Financial Group (NYSE:CFG) announced it will redeem all outstanding subordinated notes due February 11, 2031, on February 11, 2026. This move comes as the bank's stock has shown strong performance, with a 28.83% price return over the last six months. The redemption involves three series of fixed-rate reset subordinated notes, with payment at 100% of the principal plus accrued interest.",
      "url": "https://www.investing.com/news/company-news/citizens-financial-group-to-redeem-subordinated-notes-in-february-93CH-4465695",
      "source": "Investing.com",
      "published": "20260126T180150",
      "overall_sentiment_score": 0.206419,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.115764,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.573986
    },
    {
      "title": "Principal Financial Group CEO Strable-Soethout sells $742k in shares",
      "summary": "Deanna D. Strable-Soethout, CEO of Principal Financial Group Inc, sold 8,025 shares of common stock for approximately $742,794 on January 22, 2026, under a pre-arranged trading plan. This transaction leaves her with 54,227 indirectly owned shares. The company recently exceeded Q3 2025 earnings expectations, though JPMorgan downgraded its stock rating to Neutral citing better value elsewhere in the life insurance sector.",
      "url": "https://m.investing.com/news/insider-trading-news/principal-financial-group-ceo-strablesoethout-sells-742k-in-shares-93CH-4465707?ampMode=1",
      "source": "Investing.com",
      "published": "20260126T172708",
      "overall_sentiment_score": -0.160408,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.211823,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.608838
    },
    {
      "title": "Texas Capital Bancshares (NASDAQ:TCBI) Price Target Raised to $110.00",
      "summary": "TD Cowen has raised its price target for Texas Capital Bancshares (NASDAQ:TCBI) to $110.00 from $103.00, maintaining a \"hold\" rating, suggesting a potential upside of 13.37%. This follows the bank's strong fourth-quarter performance, where it surpassed EPS and revenue estimates. Despite multiple analysts adjusting their price targets, the consensus rating for TCBI remains \"Hold\" with an average target of $100.42.",
      "url": "https://www.marketbeat.com/instant-alerts/texas-capital-bancshares-nasdaqtcbi-price-target-raised-to-11000-2026-01-26/",
      "source": "MarketBeat",
      "published": "20260126T162743",
      "overall_sentiment_score": 0.179094,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.142629,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.642352
    },
    {
      "title": "The Truth About Glen Burnie Bancorp (GLBZ): Tiny Bank, Wild Stock Moves, Big Risk?",
      "summary": "This article analyzes Glen Burnie Bancorp (GLBZ), a small Maryland community bank, calling its stock wild and risky. It details GLBZ's micro-cap nature, thin trading volume, and potential for dramatic price swings, despite its traditional banking model. The piece concludes that GLBZ is a high-risk, low-hype, niche play best suited for investors comfortable with significant volatility and deep financial analysis, rather than casual investors.",
      "url": "https://www.ad-hoc-news.de/boerse/ueberblick/the-truth-about-glen-burnie-bancorp-glbz-tiny-bank-wild-stock-moves/68521260",
      "source": "AD HOC NEWS",
      "published": "20260126T160019",
      "overall_sentiment_score": -0.14933,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.12779,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.623453
    },
    {
      "title": "Orion Office REIT stock upgraded to Buy at Jones Trading on strategic review",
      "summary": "Jones Trading upgraded Orion Office REIT (NYSE:ONL) stock from Hold to Buy, setting a $3.00 price target, signaling a significant upside. This upgrade follows Orion's strategic review announcement and a cooperation agreement with its largest shareholder, The Kawa Fund Limited. The research firm estimates Orion's net asset value per share at $5.04, indicating the stock is undervalued despite debt and potential vacancies.",
      "url": "https://m.investing.com/news/analyst-ratings/orion-office-reit-stock-upgraded-to-buy-at-jones-trading-on-strategic-review-93CH-4465550?ampMode=1",
      "source": "Investing.com",
      "published": "20260126T152733",
      "overall_sentiment_score": 0.193882,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.10852,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.637837
    },
    {
      "title": "JPMorgan Chase & Co. (JPM) issues $6 billion in notes to support liquidity and financing",
      "summary": "JPMorgan Chase & Co. (JPM) has announced the issuance of $6 billion in fixed-rate and floating-rate notes. This strategic move aims to bolster the company's liquidity, enhance its capital position, and provide financing for general corporate purposes. The issuance comprises various tranches with differing maturity dates and interest rate structures.",
      "url": "https://www.msn.com/en-us/money/topstocks/jpmorgan-chase-co-jpm-issues-6-billion-in-notes-to-support-liquidity-and-financing/ar-AA1V0L1U?ocid=finance-verthp-feeds",
      "source": "MSN",
      "published": "20260126T152649",
      "overall_sentiment_score": 0.423884,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.39361,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "JPMorganChase & Co. (JPM) Issues $6 Billion in Notesto Support Liquidity and Financing",
      "summary": "JPMorgan Chase & Co. (JPM) has issued $6 billion in public offerings, including various fixed and floating-rate notes, to bolster its liquidity and financing. This move aims to diversify and extend the company's maturity profile. Despite a recent stock decline due to lower investment banking fees, analysts like TD Cowen maintain a Buy rating on JPM, citing strong Q4 earnings that surpassed estimates.",
      "url": "https://uk.finance.yahoo.com/news/jpmorgan-chase-co-jpm-issues-151322760.html",
      "source": "Yahoo Finance UK",
      "published": "20260126T151722",
      "overall_sentiment_score": 0.21949,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.216006,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "JPMorgan Chase & Co. (JPM) Issues $6 Billion in Notes to Support Liquidity and Financing",
      "summary": "JPMorgan Chase & Co. (JPM) has completed a $6 billion public offering of notes, including floating-rate and fixed-to-floating-rate notes with various maturities, to bolster its liquidity and financing. This move follows TD Cowen's reiteration of a Buy rating for JPM with a $400 price target, driven by the bank's stronger-than-expected fourth-quarter earnings. Despite positive earnings, the stock saw a slight decline due to lower investment banking fees.",
      "url": "https://finance.yahoo.com/news/jpmorgan-chase-co-jpm-issues-151322760.html",
      "source": "Yahoo Finance",
      "published": "20260126T151643",
      "overall_sentiment_score": 0.298131,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.262111,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Pan American Silver (NYSE:PAAS) Reaches New 52-Week High Following Analyst Upgrade",
      "summary": "Pan American Silver (NYSE:PAAS) stock reached a new 52-week high after Wall Street Zen upgraded its rating from hold to buy. Despite several analyst upgrades, the consensus price target remains below the current share price. The company reported a 19.3% increase in revenue year-over-year and raised its quarterly dividend to $0.14 per share, even as EPS slightly missed estimates.",
      "url": "https://www.marketbeat.com/instant-alerts/pan-american-silver-nysepaas-reaches-new-52-week-high-following-analyst-upgrade-2026-01-26/",
      "source": "MarketBeat",
      "published": "20260126T145801",
      "overall_sentiment_score": 0.140428,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.110395,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.618637
    },
    {
      "title": "NVIDIA Launches Earth-2 Family of Open Models — the World’s First Fully Open Set of Models and Tools for AI Weather",
      "summary": "NVIDIA has unveiled the Earth-2 family of open models, libraries, and frameworks, marking the world's first fully open and accelerated AI software stack for weather and climate prediction. These technologies aim to make AI-powered weather forecasting more accessible and efficient for various organizations worldwide. The Earth-2 family includes new models like Medium Range, Nowcasting, and Global Data Assimilation, which offer enhanced accuracy and speed over traditional methods, building on existing models for a comprehensive weather intelligence ecosystem.",
      "url": "https://blogs.nvidia.com/blog/nvidia-earth-2-open-models/",
      "source": "NVIDIA Blog",
      "published": "20260126T142932",
      "overall_sentiment_score": 0.232214,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.133152,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.552327
    },
    {
      "title": "Regions appoints CFO following retirement",
      "summary": "Regions Financial Corp. has announced the appointment of Anil Chadha as its new CFO, succeeding David Turner who is retiring after two decades with the bank. Chadha, previously controller and head of corporate finance, will now manage all financial operations including investor relations, corporate treasury, and reporting. Turner, who played a key role in the bank's growth, expressed confidence in Chadha's expertise and strategic vision.",
      "url": "https://www.atmmarketplace.com/news/regions-appoints-cfo-following-retirement/",
      "source": "ATM Marketplace",
      "published": "20260126T140750",
      "overall_sentiment_score": 0.152039,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.145411,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.645112
    },
    {
      "title": "National Wealth Management Group LLC Raises Stock Position in UnitedHealth Group Incorporated $UNH",
      "summary": "National Wealth Management Group LLC significantly increased its stake in UnitedHealth Group (NYSE:UNH) by 130.5% in the third quarter, now holding 5,218 shares valued at $1.80 million. Other major investors, including Berkshire Hathaway, also adjusted their positions, with institutional investors owning 87.86% of the company. Analysts maintain a \"Moderate Buy\" rating for UNH, with an average price target of $386.33, following the company's Q3 earnings beat and consistent dividend payments.",
      "url": "https://www.marketbeat.com/instant-alerts/filing-national-wealth-management-group-llc-raises-stock-position-in-unitedhealth-group-incorporated-unh-2026-01-26/",
      "source": "MarketBeat",
      "published": "20260126T133927",
      "overall_sentiment_score": 0.385838,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.372689,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.628624
    },
    {
      "title": "Should iShares Russell 1000 Value ETF (IWD) Be on Your Investing Radar?",
      "summary": "The article discusses the iShares Russell 1000 Value ETF (IWD), highlighting it as a comprehensive option for investors looking for exposure to the Large Cap Value segment of the US equity market. It details the ETF's characteristics, including its passive management, significant asset under management, low expense ratio, sector allocation, top holdings, and performance metrics. The article concludes by recommending IWD as a \"Strong Buy\" based on its Zacks ETF Rank and suggests alternatives for investors.",
      "url": "https://www.sharewise.com/us/news_articles/Should_iShares_Russell_1000_Value_ETF_IWD_Be_on_Your_Investing_Radar_Zacks_20260126_1220",
      "source": "www.sharewise.com",
      "published": "20260126T132825",
      "overall_sentiment_score": 0.226209,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.133845,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.64562
    },
    {
      "title": "Should Schwab U.S. Large-Cap Value ETF (SCHV) Be on Your Investing Radar?",
      "summary": "The article analyzes the Schwab U.S. Large-Cap Value ETF (SCHV), highlighting its low expense ratio, significant assets under management ($14.74 billion), and focus on large-cap value stocks. It discusses SCHV's sector exposure, top holdings, and performance, noting a Zacks ETF Rank of 2 (Buy) due to its strong asset class return, low expense ratio, and momentum. The piece concludes that SCHV is an excellent option for investors seeking exposure to the Large Cap Value segment, also comparing it to similar ETFs like SCHD and VTV.",
      "url": "https://www.sharewise.com/us/news_articles/Should_Schwab_US_LargeCap_Value_ETF_SCHV_Be_on_Your_Investing_Radar_Zacks_20260126_1220",
      "source": "sharewise.com",
      "published": "20260126T132724",
      "overall_sentiment_score": 0.249847,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.211314,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.652114
    },
    {
      "title": "Equifax Introduces Income Confirm to Strengthen Decisioning Confidence During the Credit Card Origination Process",
      "summary": "Equifax has launched Income Confirm, a new product integrating verified employment and income data from The Work Number with an Equifax Consumer Credit Report. This offering aims to enhance credit card origination by providing lenders with a more comprehensive view of applicant risk and financial capacity. Income Confirm helps lenders make faster, more accurate decisions and optimize initial credit lines, leading to a smoother experience for applicants.",
      "url": "https://www.prnewswire.com/news-releases/equifax-introduces-income-confirm-to-strengthen-decisioning-confidence-during-the-credit-card-origination-process-302669020.html",
      "source": "PR Newswire",
      "published": "20260126T124935",
      "overall_sentiment_score": 0.26183,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.205946,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.648547
    },
    {
      "title": "DeFi Technologies Announces Valour Receives UK Regulatory Approval and Begins Offering Select Yield-Bearing Crypto ETPs to UK Retail Investors via the London Stock Exchange",
      "summary": "DeFi Technologies, through its subsidiary Valour, has received UK regulatory approval to offer select yield-bearing crypto ETPs to UK retail investors via the London Stock Exchange, starting January 26, 2026. The approved products include 1Valour Bitcoin Physical Staking and 1Valour Ethereum Physical Staking, allowing retail investors regulated access to digital assets with a staking yield component. This marks a significant expansion, moving from professional to retail access in one of the world's most important financial markets.",
      "url": "https://www.prnewswire.com/de/pressemitteilungen/defi-technologies-announces-valour-receives-uk-regulatory-approval-and-begins-offering-select-yield-bearing-crypto-etps-to-uk-retail-investors-via-the-london-stock-exchange-302669811.html",
      "source": "PR Newswire",
      "published": "20260126T123000",
      "overall_sentiment_score": 0.419164,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.21533,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.572393
    },
    {
      "title": "Lbp Am Sa Acquires 93,997 Shares of Fomento Economico Mexicano S.A.B. de C.V. $FMX",
      "summary": "Lbp Am Sa increased its stake in Fomento Economico Mexicano S.A.B. de C.V. (FMX) by 22.1%, acquiring 93,997 additional shares, bringing its total to 518,532 shares valued at approximately $51.14 million. The company's stock, FMX, recently missed its quarterly EPS estimates but increased its quarterly dividend to $2.0531, resulting in an annualized dividend of $8.21 and a 7.7% yield. Analysts generally hold a \"Hold\" rating for FMX, with an average price target of $101.63.",
      "url": "https://www.marketbeat.com/instant-alerts/filing-lbp-am-sa-acquires-93997-shares-of-fomento-economico-mexicano-sab-de-cv-fmx-2026-01-26/",
      "source": "MarketBeat",
      "published": "20260126T122830",
      "overall_sentiment_score": 0.043733,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.120091,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.612749
    },
    {
      "title": "Why Exponent (EXPO) Stock Is Trading Up Today",
      "summary": "Exponent (EXPO) shares rose 2.3% after JPMorgan initiated coverage with an 'Overweight' rating and a $100 price target, citing the company's leadership in science and engineering consulting and expected revenue growth acceleration. JPMorgan projects a 35% upside potential for the stock. Despite this positive movement, the stock is still trading 19.1% below its 52-week high from January 2025.",
      "url": "https://finviz.com/news/287289/why-exponent-expo-stock-is-trading-up-today",
      "source": "Finviz",
      "published": "20260126T121100",
      "overall_sentiment_score": 0.255113,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.217191,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.645137
    },
    {
      "title": "Should Schwab U.S. Large-Cap Value ETF (SCHV) Be on Your Investing Radar?",
      "summary": "The Schwab U.S. Large-Cap Value ETF (SCHV), launched in December 2009, is a passively managed ETF offering exposure to the Large Cap Value segment of the US equity market. With over $14.74 billion in assets and a low expense ratio of 0.04%, it's considered a cost-effective option. The ETF holds a Zacks ETF Rank of 2 (Buy) and has performed well, gaining about 3.95% year-to-date and 15.15% in the last year as of January 26, 2026.",
      "url": "https://sg.finance.yahoo.com/news/schwab-u-large-cap-value-112002698.html",
      "source": "Yahoo Finance Singapore",
      "published": "20260126T112000",
      "overall_sentiment_score": 0.413764,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.312512,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.603111
    },
    {
      "title": "Goldman Sachs Adjusts Price Target on JPMorgan Chase & Co. to $397 From $386, Maintains Buy Rating",
      "summary": "Goldman Sachs has increased its price target for JPMorgan Chase & Co. (JPM) to $397 from $386, while reiterating a Buy rating on the stock. This adjustment reflects an updated outlook on the financial institution. JPMorgan Chase & Co. is a major banking group engaged in retail banking, investment and market banking, asset management, and commercial banking, with significant operations across the United States, Europe-Middle East-Africa, Asia-Pacific, and Latin America.",
      "url": "https://www.marketscreener.com/news/goldman-sachs-adjusts-price-target-on-jpmorgan-chase-co-to-397-from-386-maintains-buy-rating-ce7e5bdbdb8cf625",
      "source": "marketscreener.com",
      "published": "20260126T105949",
      "overall_sentiment_score": 0.281619,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.395201,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Teacher Retirement System of Texas Acquires Shares of 18,539 Ferrari N.V. $RACE",
      "summary": "The Teacher Retirement System of Texas has acquired 18,539 shares of Ferrari N.V. ($RACE), valued at approximately $8.995 million, marking a new position for the institutional investor. Ferrari recently exceeded quarterly earnings expectations with $2.50 EPS and $2.07 billion in revenue, and despite its stock trading near a 52-week low, analysts maintain a \"Moderate Buy\" rating with a target price of $480.67. Recent positive news includes the unveiling of the SF-26 F1 car and positive commentary from Lewis Hamilton, though execution risks remain a concern.",
      "url": "https://www.marketbeat.com/instant-alerts/filing-teacher-retirement-system-of-texas-acquires-shares-of-18539-ferrari-nv-race-2026-01-26/",
      "source": "MarketBeat",
      "published": "20260126T105727",
      "overall_sentiment_score": 0.174339,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.134237,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.609569
    },
    {
      "title": "Turbulence and Transformation: A Deep Dive into United Airlines (UAL)",
      "summary": "United Airlines (UAL) is navigating a unique period of high revenues and operational challenges, particularly due to extreme weather, while pursuing an aggressive \"United Next\" fleet strategy. The company's focus on premium travel, expanded global network, and technological innovations like Starlink integration position it for future growth despite industry risks. Wall Street analysts are moderately bullish, citing its strategic initiatives and strong financial recovery post-pandemic.",
      "url": "https://markets.financialcontent.com/stocks/article/finterra-2026-1-26-turbulence-and-transformation-a-deep-dive-into-united-airlines-ual",
      "source": "FinancialContent",
      "published": "20260126T103200",
      "overall_sentiment_score": 0.250969,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.100152,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.570567
    },
    {
      "title": "JPMorgan Chase & Co. (JPM) Issues $6 Billion in Notes to Support Liquidity and Financing",
      "summary": "JPMorgan Chase & Co. (JPM) successfully completed a $6 billion public offering of notes, including floating-rate and fixed-to-floating-rate notes, to support its financing and liquidity initiatives. This comes after the company reported positive fourth-quarter earnings, exceeding analyst estimates, although the stock declined slightly due to lower-than-anticipated investment banking fees. Analysts like TD Cowen have reiterated a Buy rating with a price target of $400, indicating potential upside.",
      "url": "https://finviz.com/news/286955/jpmorgan-chase-co-jpm-issues-6-billion-in-notes-to-support-liquidity-and-financing",
      "source": "Finviz",
      "published": "20260126T101300",
      "overall_sentiment_score": 0.199891,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.283484,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Glacier Bancorp, Inc (GBCI) Q4 2025 Earnings Call Transcript",
      "summary": "Glacier Bancorp (GBCI) reported strong financial results for Q4 and full year 2025, driven by two strategic acquisitions and significant growth across key metrics like total assets, net income, and loan portfolios. The company successfully integrated Bank of Idaho and is set to convert Guaranty Bank and Trust in February, expecting continued margin expansion and a target efficiency ratio in the mid-50s by year-end 2026. Management expressed optimism for future growth, both organically and through M&A, particularly in expanding markets like Texas.",
      "url": "https://news.alphastreet.com/glacier-bancorp-inc-gbci-q4-2025-earnings-call-transcript/",
      "source": "AlphaStreet",
      "published": "20260126T092857",
      "overall_sentiment_score": 0.398386,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.297548,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.568949
    },
    {
      "title": "Goldman Sachs Predicts Uneventful Fed Policy Review Ahead",
      "summary": "Goldman Sachs anticipates an uneventful Federal Reserve policy review due to stable inflation and job growth, suggesting interest rates will remain unchanged. The firm forecasts two rate cuts this year, starting in June, to address potential economic slowdown. Despite a slight slowdown in December, the labor market remains strong, further supporting the Fed's decision to maintain current borrowing costs at its January meeting.",
      "url": "https://intellectia.ai/news/stock/goldman-sachs-predicts-uneventful-fed-policy-review-ahead",
      "source": "Intellectia AI",
      "published": "20260126T070939",
      "overall_sentiment_score": 0.277779,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.266143,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.580022
    },
    {
      "title": "UBS, Citigroup, Morgan Stanley boost bonus for investment bankers by 20%",
      "summary": "Investment bankers in Asia at UBS, Citigroup, and Morgan Stanley are expected to receive an average 20% increase in bonuses for 2025, marking their best payday since 2021. This surge is attributed to robust IPO activity, vibrant stock and bond markets, and a steady flow of mergers and acquisitions in the past year, which significantly boosted the banks' revenues. Fundraising on the Hong Kong stock exchange alone reached US$37.22 billion in 2025, a 229% increase from the previous year.",
      "url": "https://www.scmp.com/business/banking-finance/article/3341062/ubs-citigroup-morgan-stanley-boost-bonus-investment-bankers-20",
      "source": "South China Morning Post",
      "published": "20260126T002801",
      "overall_sentiment_score": 0.271023,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.260713,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.63886
    },
    {
      "title": "Did FDA Alignment on BEAM-302’s Accelerated Pathway Just Shift Beam Therapeutics' (BEAM) Investment Narrative?",
      "summary": "Beam Therapeutics (BEAM) recently secured FDA alignment for an accelerated approval pathway for its BEAM-302 gene-editing program, targeting Alpha-1 Antitrypsin Deficiency. This development is seen as a significant de-risking event for BEAM-302 and could boost interest in Beam's base-editing platform. While the regulatory roadmap is clearer, investors should also consider the company's ongoing losses, unprofitability, insider selling, and potential cash needs, alongside widely varying fair value estimates from analysts.",
      "url": "https://simplywall.st/stocks/us/pharmaceuticals-biotech/nasdaq-beam/beam-therapeutics/news/did-fda-alignment-on-beam-302s-accelerated-pathway-just-shif",
      "source": "Simply Wall Street",
      "published": "20260125T213250",
      "overall_sentiment_score": 0.18066,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.127619,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.621535
    },
    {
      "title": "After 160 years, Huntington Bancshares is powering digital growth—by opening a branch almost every 2 weeks, says CFO",
      "summary": "Huntington Bancshares, a 160-year-old regional bank, is aggressively expanding its physical branch network by opening a new branch almost every two weeks, particularly in new markets. This strategy, led by CFO Zach Wasserman, aims to capture new customers and deposits while also enhancing the bank's digital offerings. Despite the emphasis on digital banking, the company believes physical branches remain crucial for growth and customer acquisition, especially as larger banks retreat from some markets.",
      "url": "https://www.msn.com/en-us/money/smallbusiness/after-160-years-huntington-bancshares-is-powering-digital-growth-by-opening-a-branch-almost-every-2-weeks-says-cfo/ar-AA1UPdvC?apiversion=v2&domshim=1&noservercache=1&noservertelemetry=1&batchservertelemetry=1&renderwebcomponents=1&wcseo=1",
      "source": "MSN",
      "published": "20260125T195637",
      "overall_sentiment_score": -0.040134,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.135288,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.620035
    },
    {
      "title": "The Truth About Thomson Reuters Corp: Why Finance Nerds Are Quietly Obsessed",
      "summary": "This article explores why Thomson Reuters Corp (TRI) is quietly a favorite among professional investors despite its low public profile compared to flashy tech stocks. It highlights TRI's sticky subscription-based business model, its integration of AI into critical professional tools, and its pricing power in industries like legal, tax, and finance. The piece suggests that while not a \"meme stock,\" TRI is considered a solid, defensive compounder for long-term, fundamentals-first portfolios.",
      "url": "https://www.ad-hoc-news.de/boerse/ueberblick/the-truth-about-thomson-reuters-corp-why-finance-nerds-are-quietly/68518581",
      "source": "AD HOC NEWS",
      "published": "20260125T161959",
      "overall_sentiment_score": 0.278521,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.236825,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.616608
    },
    {
      "title": "A Look At Home Bancshares (HOMB) Valuation After Recent Share Price Softness",
      "summary": "Home Bancshares (HOMB) shares recently closed at $28.35, showing a modest loss over the past year despite positive long-term returns. The stock has a value score of 5 and an indicated intrinsic discount of about 44%, with Simply Wall St's model suggesting a fair value of $33.13, indicating it is undervalued. This valuation is supported by consistent investment in specialized lending, increased non-interest income, and enhanced digital banking, though reliance on acquisitions and concentrated loan exposure present potential risks.",
      "url": "https://www.sahmcapital.com/news/content/a-look-at-home-bancshares-homb-valuation-after-recent-share-price-softness-2026-01-25",
      "source": "Sahm",
      "published": "20260125T150021",
      "overall_sentiment_score": 0.205003,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.138941,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.646636
    },
    {
      "title": "Wealth Enhancement Advisory Services LLC Acquires 9,117 Shares of Medpace Holdings, Inc. $MEDP",
      "summary": "Wealth Enhancement Advisory Services LLC significantly increased its stake in Medpace Holdings, Inc. (NASDAQ:MEDP) during the third quarter, purchasing 9,117 additional shares and bringing its total holdings to 15,193 shares valued at approximately $8.08 million. This move is part of broader institutional interest in Medpace, though insider selling has also been noted. The article also provides an overview of analyst ratings, Medpace's financial performance, and company profile.",
      "url": "https://www.marketbeat.com/instant-alerts/filing-wealth-enhancement-advisory-services-llc-acquires-9117-shares-of-medpace-holdings-inc-medp-2026-01-25/",
      "source": "MarketBeat",
      "published": "20260125T125835",
      "overall_sentiment_score": 0.054461,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.1298,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.58172
    },
    {
      "title": "Wealth Enhancement Advisory Services LLC Increases Position in Raymond James Financial, Inc. $RJF",
      "summary": "Wealth Enhancement Advisory Services LLC increased its stake in Raymond James Financial, Inc. (NYSE:RJF) by 14.1% in the third quarter. Other institutional investors like Norges Bank and JPMorgan Chase & Co. also made significant moves in their holdings. The financial services provider recently beat Q3 earnings expectations and increased its quarterly dividend, though an insider sold a substantial number of shares.",
      "url": "https://www.marketbeat.com/instant-alerts/filing-wealth-enhancement-advisory-services-llc-increases-position-in-raymond-james-financial-inc-rjf-2026-01-25/",
      "source": "MarketBeat",
      "published": "20260125T125638",
      "overall_sentiment_score": 0.204142,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.247181,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.688456
    },
    {
      "title": "52,256 Shares in Regions Financial Corporation $RF Purchased by iA Global Asset Management Inc.",
      "summary": "iA Global Asset Management Inc. recently purchased 52,256 shares of Regions Financial Corporation (NYSE:RF) during the third quarter, valued at approximately $1.378 million. This move comes as Regions Financial initiated a $3 billion stock buyback program, suggesting management views the stock as undervalued despite missing recent EPS and revenue estimates. Analysts currently have a \"Hold\" rating on RF with a consensus target price of $29.27.",
      "url": "https://www.marketbeat.com/instant-alerts/filing-52256-shares-in-regions-financial-corporation-rf-purchased-by-ia-global-asset-management-inc-2026-01-25/",
      "source": "MarketBeat",
      "published": "20260125T104747",
      "overall_sentiment_score": 0.105091,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.10746,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.567816
    },
    {
      "title": "Trump's housing market plan contains a fatal flaw and multiple obstacles, Morgan Stanley says",
      "summary": "Morgan Stanley strategists contend that President Trump's housing market policies, including a $200 billion MBS purchase directive, will have only a marginal positive effect on homeowner affordability and will not significantly impact the \"lock-in\" effect of low mortgage rates. They project only a slight reduction in the year-end 2026 mortgage rate forecast and an unchanged home price appreciation forecast, concluding that structural issues and the enduring lock-in effect prevent a quick fix for the U.S. housing market. The report also dismisses bans on institutional investors as ineffective due to their limited market share.",
      "url": "https://fortune.com/2026/01/25/when-will-mortgage-rates-go-down-housing-affordability-trump-moves-outlook-forecast/",
      "source": "Fortune",
      "published": "20260125T102804",
      "overall_sentiment_score": -0.086967,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.008106,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.639261
    },
    {
      "title": "Commerzbank Aktiengesellschaft FI Acquires 5,705 Shares of The Goldman Sachs Group, Inc. $GS",
      "summary": "Commerzbank Aktiengesellschaft FI has increased its stake in The Goldman Sachs Group (NYSE:GS) by 10.4% in the third quarter, purchasing an additional 5,705 shares and now owning a total of 60,817 shares valued at $48.43 million. Goldman Sachs recently reported a strong Q4 earnings beat with $13.55 EPS and $15.71 billion in revenue, also raising its quarterly dividend by 12.5% to $4.50. Despite positive financial results and analyst upgrades, the article highlights potential governance risks due to CEO David Solomon's increased 2025 pay and recent insider stock sales totaling approximately $65 million.",
      "url": "https://www.marketbeat.com/instant-alerts/filing-commerzbank-aktiengesellschaft-fi-acquires-5705-shares-of-the-goldman-sachs-group-inc-gs-2026-01-25/",
      "source": "MarketBeat",
      "published": "20260125T100424",
      "overall_sentiment_score": 0.082928,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.00822,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.59036
    },
    {
      "title": "Commerzbank Aktiengesellschaft FI Purchases 71,216 Shares of Verizon Communications Inc. $VZ",
      "summary": "Commerzbank Aktiengesellschaft FI increased its stake in Verizon Communications Inc. by 26.4% in the third quarter of 2025, acquiring an additional 71,216 shares to hold a total of 340,605 shares valued at approximately $14.97 million. Other major institutions also expanded their positions, with institutional investors now owning about 62.06% of Verizon's stock. Verizon recently announced a quarterly dividend of $0.69 per share, equaling an attractive 7.0% yield.",
      "url": "https://www.marketbeat.com/instant-alerts/filing-commerzbank-aktiengesellschaft-fi-purchases-71216-shares-of-verizon-communications-inc-vz-2026-01-25/",
      "source": "MarketBeat",
      "published": "20260125T100400",
      "overall_sentiment_score": 0.145051,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.112092,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.611163
    },
    {
      "title": "International Business Machines Corporation $IBM Position Reduced by First Citizens Bank & Trust Co.",
      "summary": "First Citizens Bank & Trust Co. recently reduced its stake in International Business Machines (IBM) by 9.4%, selling 2,693 shares and holding 26,064 shares valued at $7.35 million. Despite this reduction, IBM has received broadly bullish analyst ratings, with a consensus \"Moderate Buy\" and an average price target of $306.86, following strong Q3 earnings that beat estimates. Institutional investors, led by Vanguard and State Street, hold a significant 58.96% of IBM's stock.",
      "url": "https://www.marketbeat.com/instant-alerts/filing-international-business-machines-corporation-ibm-position-reduced-by-first-citizens-bank-trust-co-2026-01-25/",
      "source": "MarketBeat",
      "published": "20260125T095926",
      "overall_sentiment_score": 0.357717,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.304596,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.551111
    },
    {
      "title": "1834 Investment Advisors Co. Sells 26,075 Shares of Ally Financial Inc. $ALLY",
      "summary": "1834 Investment Advisors Co. reduced its stake in Ally Financial Inc. by 11.0% in the third quarter, selling 26,075 shares and now holding 212,028 shares valued at approximately $8.31 million. Despite this reduction, Ally Financial reported strong Q4 results, beating EPS and revenue estimates, and authorized a $2 billion stock buyback and a $0.30 quarterly dividend, with CEO Michael Rhodes also increasing his stake, signaling insider confidence. Analyst sentiment is mixed, with some raising price targets while others express concerns over auto-lending margin weakness.",
      "url": "https://www.marketbeat.com/instant-alerts/filing-1834-investment-advisors-co-sells-26075-shares-of-ally-financial-inc-ally-2026-01-25/",
      "source": "MarketBeat",
      "published": "20260125T095858",
      "overall_sentiment_score": 0.131475,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.128763,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.62187
    },
    {
      "title": "Envestnet Portfolio Solutions Inc. Reduces Stock Holdings in U.S. Bancorp $USB",
      "summary": "Envestnet Portfolio Solutions Inc. reduced its stake in U.S. Bancorp by 13.4% in the third quarter, selling 25,811 shares and leaving them with 166,549 shares valued at approximately $8.05 million. Despite this reduction, U.S. Bancorp reported strong earnings, exceeding analyst expectations, and pays a quarterly dividend of $0.52 per share. The stock maintains a \"Moderate Buy\" consensus rating from analysts, with institutional investors holding a significant 77.6% ownership.",
      "url": "https://www.marketbeat.com/instant-alerts/filing-envestnet-portfolio-solutions-inc-reduces-stock-holdings-in-us-bancorp-usb-2026-01-25/",
      "source": "MarketBeat",
      "published": "20260125T090925",
      "overall_sentiment_score": 0.267922,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.302088,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.641082
    },
    {
      "title": "Fifth Third Weighs Credit Leadership Shift As Comerica Merger Nears Completion",
      "summary": "Fifth Third Bancorp is undergoing a significant transition with the planned retirement of its chief credit officer and the upcoming merger with Comerica. This period involves a leadership change as Kristof Schneider steps into the chief credit officer role, alongside the approved merger that will expand Fifth Third's operations. Investors should focus on the bank's execution of the merger, integration decisions, and credit discipline in light of these changes, particularly considering how the new leadership will align with the combined Comerica business and manage its enlarged loan portfolio.",
      "url": "https://simplywall.st/stocks/us/banks/nasdaq-fitb/fifth-third-bancorp/news/fifth-third-weighs-credit-leadership-shift-as-comerica-merge",
      "source": "Simply Wall Street",
      "published": "20260125T083919",
      "overall_sentiment_score": 0.148118,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.144748,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.603426
    },
    {
      "title": "Individual investors are Kingsoft Cloud Holdings Limited's (NASDAQ:KC) biggest owners and were rewarded after market cap rose by US$132m last week",
      "summary": "Individual investors collectively own 50% of Kingsoft Cloud Holdings Limited (NASDAQ:KC), making them the largest shareholder group. This ownership structure means individual investors significantly benefit from positive market movements, such as the recent US$132 million increase in market capitalization following a 3.7% gain. The article also notes that Kingsoft Corporation Limited and Xiaomi Corporation are major institutional shareholders, holding 33% and 10% respectively, while insiders own less than 1%.",
      "url": "https://ca.finance.yahoo.com/news/individual-investors-kingsoft-cloud-holdings-133904705.html",
      "source": "Yahoo! Finance Canada",
      "published": "20260125T083900",
      "overall_sentiment_score": 0.234613,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.100118,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.648946
    },
    {
      "title": "Osisko Development: Small-Cap Gold Hopeful Caught Between Dilution Fears And Upside Dreams",
      "summary": "Osisko Development's stock is under pressure despite high gold prices, reflecting market concerns about dilution and lengthy production timelines for junior miners. The company has seen a negative performance over the past year, with recent news focusing on incremental technical and permitting progress rather than immediate high-impact catalysts. Analysts are cautiously constructive, setting price targets above current levels, but investors remain wary of funding risks and execution challenges.",
      "url": "https://www.ad-hoc-news.de/boerse/news/ueberblick/osisko-development-small-cap-gold-hopeful-caught-between-dilution-fears/68517674",
      "source": "AD HOC NEWS",
      "published": "20260125T075831",
      "overall_sentiment_score": -0.034614,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.089871,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.597733
    },
    {
      "title": "Banc of California, Inc. (NYSE:BANC) Given Consensus Rating of \"Moderate Buy\" by Brokerages",
      "summary": "Banc of California (NYSE:BANC) has received a consensus \"Moderate Buy\" rating from brokerages, with an average 12-month price target of $20.45. This follows several analysts raising their price objectives after the bank beat Q4 earnings and revenue estimates. Despite beating expectations and providing positive 2026 guidance for net interest income growth and loan production, the stock traded down about 3.9% due to profit-taking and investor caution.",
      "url": "https://www.marketbeat.com/instant-alerts/banc-of-california-inc-nysebanc-given-consensus-rating-of-moderate-buy-by-brokerages-2026-01-25/",
      "source": "MarketBeat",
      "published": "20260125T075825",
      "overall_sentiment_score": 0.293146,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.273558,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.631039
    },
    {
      "title": "James River Group (NASDAQ:JRVR) Lowered to Hold Rating by Wall Street Zen",
      "summary": "Wall Street Zen has downgraded James River Group (NASDAQ:JRVR) from a \"buy\" to a \"hold\" rating, aligning with other firms like Zacks, Compass Point, and Weiss, resulting in a consensus \"Hold\" rating with an average target price of $6.40. The stock recently opened at $6.66, near its 12-month high, and institutional investors own a significant 95.21% stake, with some firms increasing their positions. James River Group last reported earnings of $0.32 EPS, exceeding analyst estimates, but analysts project a negative EPS for the current fiscal year.",
      "url": "https://www.marketbeat.com/instant-alerts/james-river-group-nasdaqjrvr-lowered-to-hold-rating-by-wall-street-zen-2026-01-25/",
      "source": "MarketBeat",
      "published": "20260125T075758",
      "overall_sentiment_score": -0.103578,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.106875,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.631604
    },
    {
      "title": "ITT Inc stock: resilience, rotation and what the latest pullback really signals",
      "summary": "ITT Inc's stock has seen a modest pullback recently but remains significantly up over the past quarter and year, indicating underlying strength. Analysts largely maintain a bullish stance, emphasizing the company's diversified industrial exposure, strong balance sheet, and disciplined capital allocation. The current dip is viewed more as a consolidation within an uptrend rather than a sign of fundamental weakness, suggesting a potential buying opportunity for long-term investors.",
      "url": "https://www.ad-hoc-news.de/news/ueberblick/itt-inc-stock-resilience-rotation-and-what-the-latest-pullback-really/68517460",
      "source": "AD HOC NEWS",
      "published": "20260125T074449",
      "overall_sentiment_score": 0.25892,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.225746,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.633013
    },
    {
      "title": "Citigroup Stock: Can This Old-School Banking Giant Still Surprise Wall Street?",
      "summary": "Citigroup's stock has outperformed expectations over the past year due to restructuring and rising interest rates, leading investors to question the remaining upside. The bank's strategy focuses on simplifying, focusing on core institutional businesses, and modernizing operations to drive future growth. While Wall Street's sentiment is cautiously positive, the stock's future performance hinges on consistent execution, capital returns, and navigating an unpredictable macro environment.",
      "url": "https://www.ad-hoc-news.de/boerse/news/ueberblick/citigroup-stock-can-this-old-school-banking-giant-still-surprise-wall/68517055",
      "source": "AD HOC NEWS",
      "published": "20260125T035852",
      "overall_sentiment_score": 0.147847,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.118939,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.671829
    }
  ]
}