{
  "ticker": "JPM",
  "date": "2026-01-05",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T13:02:27.073685",
  "source": "alpha_vantage",
  "article_count": 50,
  "articles": [
    {
      "title": "Plains All American Pipeline, L.P. and Plains GP Holdings Announce Fourth Quarter 2025 Distributions and Earnings Release Schedule",
      "summary": "Plains All American Pipeline, L.P. (PAA) and Plains GP Holdings (PAGP) announced increased quarterly cash distributions for Q4 2025, payable in February 2026. Due to a pending NGL asset sale, part of PAGP's Class A Share distribution is expected to be taxable as a dividend. Both companies will release their fourth-quarter 2025 earnings on February 6, 2026, followed by a conference call.",
      "url": "https://www.quiverquant.com/news/Plains+All+American+Pipeline%2C+L.P.+and+Plains+GP+Holdings+Announce+Fourth+Quarter+2025+Distributions+and+Earnings+Release+Schedule",
      "source": "Quiver Quantitative",
      "published": "20260105T230930",
      "overall_sentiment_score": 0.152888,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.130986,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.55709
    },
    {
      "title": "UBS Group AG Is Rebuilding Global Wealth Tech While Wall Street Sleeps",
      "summary": "UBS Group AG is transforming into a data-driven, platform-style wealth and investment bank, leveraging its post-Credit Suisse dominance. This reinvention focuses on a full-stack, digitally-enabled wealth and markets platform designed for global scale, serving diverse client segments. The strategy emphasizes technology as a multiplier for human advice, regulatory resilience as a key feature, and a clear focus on wealth-centric businesses for sustained earnings growth.",
      "url": "https://www.ad-hoc-news.de/boerse/ueberblick/ubs-group-ag-is-rebuilding-global-wealth-tech-while-wall-street-sleeps/68462344",
      "source": "AD HOC NEWS",
      "published": "20260105T230856",
      "overall_sentiment_score": 0.282716,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.183214,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.646305
    },
    {
      "title": "JPMorgan stock hits record intraday high, crosses $900 billion value as banks lead Wall Street rally",
      "summary": "JPMorgan Chase & Co. shares rose 2.6% on Monday to $334.04, pushing its market value above $900 billion, as financial stocks led a Wall Street rally ahead of bank earnings and the U.S. jobs report. The bank also launched a new Special Advisory Services unit and received a raised price target from Barclays, further boosting investor confidence.",
      "url": "https://ts2.tech/en/jpmorgan-stock-hits-record-intraday-high-crosses-900-billion-value-as-banks-lead-wall-street-rally/",
      "source": "ts2.tech",
      "published": "20260105T230820",
      "overall_sentiment_score": 0.261126,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.634667,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Colgate-Palmolive (CL) Remains Overweight as JPMorgan Sees Headwinds Easing in 2026",
      "summary": "JPMorgan has maintained its Overweight rating on Colgate-Palmolive (CL) and increased its price target to $88, anticipating an easing of economic headwinds in 2026. The firm notes that while 2025 presented challenges for household and personal care, improvements are expected as pressures like strain on low-income consumers and tariffs are lapped. Colgate-Palmolive, a \"Dividend King\" with 63 consecutive years of dividend increases, focuses on everyday essentials, innovation, and strategic pricing to maintain market position and manage costs.",
      "url": "https://www.insidermonkey.com/blog/colgate-palmolive-cl-remains-overweight-as-jpmorgan-sees-headwinds-easing-in-2026-1670149/?amp=1",
      "source": "Insider Monkey",
      "published": "20260105T215800",
      "overall_sentiment_score": 0.231901,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.101099,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.624468
    },
    {
      "title": "Colgate-Palmolive (CL) Remains Overweight as JPMorgan Sees Headwinds Easing in 2026",
      "summary": "JPMorgan has maintained an Overweight rating on Colgate-Palmolive (CL) and raised its price target to $88, anticipating an improvement in results as headwinds from 2025 are expected to ease in 2026. The company, a \"Dividend King\" with 63 consecutive years of dividend increases, is seen as resilient due to its focus on everyday essentials and strategic investments. Potential upside is also noted from its Hill’s pet nutrition business following increased pet adoptions.",
      "url": "https://finviz.com/news/267759/colgate-palmolive-cl-remains-overweight-as-jpmorgan-sees-headwinds-easing-in-2026",
      "source": "Finviz",
      "published": "20260105T215800",
      "overall_sentiment_score": 0.174764,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.122139,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.613614
    },
    {
      "title": "Legend Biotech stock hits a fresh 52-week low as biotech lags — JPMorgan update looms",
      "summary": "Legend Biotech (LEGN) shares fell 4.7% to a new 52-week low of $20.49, ahead of CEO Ying Huang's presentation at the annual J.P. Morgan Healthcare Conference on January 14. This decline occurred as the broader biotech sector also experienced a downturn. Investors are closely watching for updates on CARVYKTI, Legend's key cancer therapy, focusing on patient access, manufacturing, and demand trends for 2026.",
      "url": "https://ts2.tech/en/legend-biotech-stock-hits-a-fresh-52-week-low-as-biotech-lags-jpmorgan-update-looms/",
      "source": "ts2.tech",
      "published": "20260105T211014",
      "overall_sentiment_score": -0.107801,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.119873,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.635556
    },
    {
      "title": "CONMED leaders to share company update at J.P. Morgan Healthcare Conference",
      "summary": "CONMED Corporation announced that its President and CEO, Patrick J. Beyer, and EVP and CFO, Todd W. Garner, will present at the 44th Annual J.P. Morgan Healthcare Conference. The presentation is scheduled for Monday, January 12, 2026, at 3:00 p.m. PT (6:00 p.m. ET) in San Francisco, CA, and will be webcast live on the company's website. CONMED is a medical technology company specializing in devices and equipment for surgical procedures across various specialties.",
      "url": "https://www.stocktitan.net/news/CNMD/conmed-corporation-to-present-at-the-44th-annual-j-p-morgan-p5nce6y34yty.html",
      "source": "Stock Titan",
      "published": "20260105T210857",
      "overall_sentiment_score": 0.101448,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.122093,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.643512
    },
    {
      "title": "Maker of critical lab tools to speak at J.P. Morgan health event",
      "summary": "Mettler-Toledo International Inc. (NYSE: MTD) announced it will present at the 44th Annual J.P. Morgan Healthcare Conference on Monday, January 12, 2026, at 4:30 p.m. Pacific Standard Time. A live webcast of the presentation will be available on the company's investor relations website. Mettler-Toledo is a global supplier of precision instruments and services with strong leadership positions across its businesses.",
      "url": "https://www.stocktitan.net/news/MTD/mettler-toledo-international-inc-to-present-at-the-44th-annual-j-p-aua3s0ls8eue.html",
      "source": "Stock Titan",
      "published": "20260105T210834",
      "overall_sentiment_score": 0.142635,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.129675,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.649365
    },
    {
      "title": "Guarantor: JPMorgan Chase & Co.",
      "summary": "JPMorgan Chase Financial Company LLC has filed a preliminary pricing supplement for Uncapped Accelerated Barrier Notes linked to the S&P 500 Futures Excess Return Index, fully and unconditionally guaranteed by JPMorgan Chase & Co. These notes are designed for investors seeking an uncapped return of at least 1.70 times any appreciation of the index at maturity, but investors risk losing some or all of their principal. The notes are unsecured obligations and subject to the credit risk of both JPMorgan Financial and JPMorgan Chase & Co.",
      "url": "https://www.streetinsider.com/SEC+Filings/Form+424B2+JPMORGAN+CHASE+%26amp%3B+CO/25804278.html",
      "source": "StreetInsider",
      "published": "20260105T203228",
      "overall_sentiment_score": 0.006192,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.028746,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.349746
    },
    {
      "title": "Citigroup stock jumps to a fresh 52-week high as bank shares lead Wall Street rally",
      "summary": "Citigroup shares surged by approximately 4%, reaching a new 52-week high, as major U.S. banks led a Wall Street rally ahead of the earnings season. Investors are anticipating U.S. jobs and inflation data this week, with Citi's financial results expected on January 14. The broader market also saw gains following a U.S. military strike, while rate expectations continue to influence bank valuations.",
      "url": "https://ts2.tech/en/citigroup-stock-jumps-to-a-fresh-52-week-high-as-bank-shares-lead-wall-street-rally/",
      "source": "ts2.tech",
      "published": "20260105T203206",
      "overall_sentiment_score": 0.290719,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.281307,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.708544
    },
    {
      "title": "Equify Financial Secures $100 Million Capital Facility with JPMorgan Chase & Co. to Expand Commercial Lending Platform",
      "summary": "Equify Financial has closed a $100 million capital facility with JPMorgan Chase & Co., significantly strengthening its balance sheet and expanding its capacity for commercial lending to middle-market businesses across the U.S. This facility will support Equify's growing portfolio, focusing on equipment finance, asset-based lending, and structured solutions for capital-intensive industries. The transaction highlights Equify's commitment to being a flexible and reliable partner for business owners in dynamic market conditions.",
      "url": "https://www.businesswire.com/news/home/20260105017603/en/Equify-Financial-Secures-%24100-Million-Capital-Facility-with-JPMorgan-Chase-Co.-to-Expand-Commercial-Lending-Platform",
      "source": "Business Wire",
      "published": "20260105T201828",
      "overall_sentiment_score": 0.407498,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.429326,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.903571
    },
    {
      "title": "Form 424B2 JPMORGAN CHASE & CO",
      "summary": "JPMorgan Chase Financial Company LLC has filed a Form 424B2 for structured investments consisting of $405,000 Callable Contingent Interest Notes due January 6, 2031. These notes are linked to the performance of the Nasdaq-100 Index®, Russell 2000® Index, and S&P 500® Index, with payments fully guaranteed by JPMorgan Chase & Co. The notes offer contingent interest payments based on index performance but carry risks including potential loss of principal and no guaranteed interest.",
      "url": "https://www.streetinsider.com/SEC+Filings/Form+424B2+JPMORGAN+CHASE+%26amp%3B+CO/25804040.html",
      "source": "StreetInsider",
      "published": "20260105T200811",
      "overall_sentiment_score": 0.148972,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.141109,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 1.0
    },
    {
      "title": "Advisors say financial stocks ready for another run in 2026",
      "summary": "Financial advisors predict continued strong performance for financial stocks in 2026, driven by anticipated M&A activity and Federal Reserve rate cuts. While bulge bracket banks saw significant returns in 2025, some advisors suggest focusing on regional and small-cap banks, as well as alternative investment and wealth management firms, for future growth. Potential risks include a credit collapse or weakness in the labor market.",
      "url": "https://www.investmentnews.com/equities/bank-stocks-in-2026/263689",
      "source": "InvestmentNews",
      "published": "20260105T192816",
      "overall_sentiment_score": 0.330373,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.346326,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.63891
    },
    {
      "title": "Kinross Gold: Steady Climb Or Topping Out? What The Market Is Really Pricing Into KGC",
      "summary": "Kinross Gold's stock has quietly outperformed peers over the past year due to a strong gold price and capital returns, but a recent pullback has investors questioning if it's a healthy consolidation or the start of a downturn. While long-term holders point to improving fundamentals, short-term traders are debating whether the good news is already priced in. Wall Street analysts generally hold a constructive view on KGC, suggesting moderate upside from current levels.",
      "url": "https://www.ad-hoc-news.de/boerse/news/ueberblick/kinross-gold-steady-climb-or-topping-out-what-the-market-is-really/68461932",
      "source": "AD HOC NEWS",
      "published": "20260105T191014",
      "overall_sentiment_score": 0.112971,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.113716,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.601602
    },
    {
      "title": "Who Owns Cadence Design Systems? Top Shareholders and Recent Insider Trades",
      "summary": "Cadence Design Systems (NASDAQ: CDNS) is a leader in electronic design automation software with an $84.5 billion market value. The article details its top shareholders, including Vanguard, BlackRock, and State Street, who provide ownership stability. While institutions and some hedge funds show selective accumulation, recent insider trades indicate small-scale selling at higher price points, suggesting personal portfolio management rather than a major shift in business outlook.",
      "url": "https://www.tikr.com/blog/who-owns-cadence-design-systems-top-shareholders-and-recent-insider-trades",
      "source": "TIKR.com",
      "published": "20260105T190815",
      "overall_sentiment_score": 0.207382,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.099249,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.557353
    },
    {
      "title": "Citigroup Stock Finds Its Range: Dividend Magnet Meets Mixed Wall Street Conviction",
      "summary": "Citigroup's stock has seen modest gains recently, trading at a discount to book value and the broader banking sector. While analysts have mixed views, the company's strong dividend yield makes it attractive to income-oriented investors and value hunters. The future performance hinges on improving return metrics, managing expenses, and sustaining capital returns amidst ongoing simplification and regulatory efforts.",
      "url": "https://www.ad-hoc-news.de/boerse/news/ueberblick/citigroup-stock-finds-its-range-dividend-magnet-meets-mixed-wall-street/68461799",
      "source": "AD HOC NEWS",
      "published": "20260105T181511",
      "overall_sentiment_score": 0.219997,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.110339,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.608598
    },
    {
      "title": "Garrett Motion stock hits 52-week high at $17.92",
      "summary": "Garrett Motion (GTX) stock has reached a 52-week high of $17.92, driven by a 98.2% increase over the past year and strong investor confidence. The company's positive performance is supported by advancements in turbocharger technology and strategic partnerships, with InvestingPro data suggesting the stock is slightly undervalued. Recent financial results have surpassed expectations, and analysts like JPMorgan and BWS Financial have initiated or raised price targets, citing fewer headwinds in the internal combustion engine business and benefits from zero-emission vehicle offerings.",
      "url": "https://in.investing.com/news/company-news/garrett-motion-stock-hits-52week-high-at-1792-93CH-5172714",
      "source": "Investing.com India",
      "published": "20260105T181035",
      "overall_sentiment_score": 0.417592,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.312864,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.627822
    },
    {
      "title": "Why LendingClub (LC) Stock Is Trading Up Today",
      "summary": "Shares of LendingClub (NYSE:LC) jumped 4.3% after JPMorgan reaffirmed an Overweight rating and raised its price target to $25, citing a positive 2026 outlook for the financial sector. The stock cooled to $20.07, up 5% from its previous close, indicating investor confidence. The move also follows a recent Federal Reserve interest rate cut, which is generally favorable for fintech companies like LendingClub.",
      "url": "https://finviz.com/news/267343/why-lendingclub-lc-stock-is-trading-up-today",
      "source": "Finviz",
      "published": "20260105T180910",
      "overall_sentiment_score": 0.396232,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.313442,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.62517
    },
    {
      "title": "Why Exxon Mobil stock is up today: Venezuela shock lifts XOM as oil prices firm",
      "summary": "Exxon Mobil shares rose 2% after Venezuelan President Nicolas Maduro's capture, as analysts believe this could significantly improve Exxon's chances of recovering arbitration damages from assets seized in 2007. The move is significant because Venezuela holds 17% of global oil reserves, and changes in U.S. sanctions could affect oil supply and prices, benefiting oil producers like Exxon. However, the path to recovering assets and the impact on oil prices remain uncertain, with some analysts forecasting a softer crude baseline for 2026 despite the recent events.",
      "url": "https://ts2.tech/en/why-exxon-mobil-stock-is-up-today-venezuela-shock-lifts-xom-as-oil-prices-firm/",
      "source": "ts2.tech",
      "published": "20260105T180152",
      "overall_sentiment_score": 0.282394,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.138218,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.606213
    },
    {
      "title": "NaaS Technology Sets January 23, 2026 Extraordinary General Meeting for Key Shareholder Votes",
      "summary": "NaaS Technology Inc. announced an Extraordinary General Meeting (EGM) for January 23, 2026, in Langfang, Hebei Province, to vote on proposed resolutions. Shareholders as of January 2, 2026, are eligible to participate, with the board strongly endorsing a \"yes\" vote for these strategically important decisions. Despite the board's optimism, NaaS (NAAS) currently holds a Neutral rating from analysts, with a $3.50 price target, primarily due to financial performance concerns.",
      "url": "https://www.theglobeandmail.com/investing/markets/stocks/NAAS/pressreleases/36903059/naas-technology-sets-january-23-2026-extraordinary-general-meeting-for-key-shareholder-votes/",
      "source": "The Globe and Mail",
      "published": "20260105T175834",
      "overall_sentiment_score": 0.021595,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.140371,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.614777
    },
    {
      "title": "Evotec discloses increased JPMorgan stake after major holdings notification",
      "summary": "Evotec AG has reported that JPMorgan Chase & Co. has increased its stake in the company. This disclosure follows a major holdings notification, indicating a significant change in the investment bank's ownership percentage in the biotech firm.",
      "url": "https://www.msn.com/en-us/money/topstocks/evotec-discloses-increased-jpmorgan-stake-after-major-holdings-notification/ar-AA1TGjCd",
      "source": "MSN",
      "published": "20260105T165853",
      "overall_sentiment_score": 0.138419,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.201657,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Bernstein Adjusts Price Target on Republic Services to $220 From $205, Maintains Market Perform Rating",
      "summary": "Bernstein has increased its price target for Republic Services (RSG) to $220 from $205, while retaining a \"Market Perform\" rating. This adjustment comes amidst other recent analyst activities, including new coverage and price target changes from firms like Wells Fargo and Jefferies. Republic Services is a major player in waste management, with services spanning collection, transfer, disposal, and recycling.",
      "url": "https://www.marketscreener.com/news/bernstein-adjusts-price-target-on-republic-services-to-220-from-205-maintains-market-perform-rati-ce7e59dedc8af52d",
      "source": "marketscreener.com",
      "published": "20260105T163648",
      "overall_sentiment_score": 0.092296,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.015545,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.552882
    },
    {
      "title": "Insight Enterprises (NASDAQ:NSIT) Receives Outperform Rating from Barrington Research",
      "summary": "Barrington Research has reissued an \"outperform\" rating for Insight Enterprises (NASDAQ:NSIT), setting a $120 price target, which implies a potential 41.8% upside. Despite this, other analysts offer a mixed outlook, resulting in an average \"Hold\" rating and a $103.33 price target. The company recently missed quarterly revenue and EPS estimates and provided FY2025 guidance that aligns with consensus.",
      "url": "https://www.marketbeat.com/instant-alerts/insight-enterprises-nasdaqnsit-receives-outperform-rating-from-barrington-research-2026-01-05/",
      "source": "MarketBeat",
      "published": "20260105T161028",
      "overall_sentiment_score": -0.009156,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.000787,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.640606
    },
    {
      "title": "Form 424B2 ROYAL BANK OF CANADA",
      "summary": "This SEC filing details the Royal Bank of Canada's offering of Autocallable Strategic Accelerated Redemption Securities linked to a basket of three financial sector stocks (Goldman Sachs, JPMorgan Chase & Morgan Stanley). These notes have an approximate three-year term, automatically calling if the basket's value meets certain levels on observation dates, offering varying call premiums. The document outlines the terms, risks, hypothetical examples of payments, and U.S. federal income tax considerations for investors.",
      "url": "https://www.streetinsider.com/SEC+Filings/Form+424B2+ROYAL+BANK+OF+CANADA/25803005.html",
      "source": "StreetInsider",
      "published": "20260105T161022",
      "overall_sentiment_score": 0.062377,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.002309,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.844925
    },
    {
      "title": "2,400 Stocks or 315 Value Picks: Is SCHB or VTV a Better Fit for Your Portfolio?",
      "summary": "This article compares two ETFs, SCHB and VTV, to help investors decide which is a better fit for their portfolio. SCHB offers broad market coverage of over 2,400 U.S. stocks with a tech bias, while VTV focuses on about 315 large-cap value stocks, primarily in financials and healthcare, and offers a higher dividend yield. The choice depends on investment goals, with SCHB appealing to those seeking full market representation and VTV",
      "url": "https://www.theglobeandmail.com/investing/markets/stocks/BRK-B-N/pressreleases/36877015/2400-stocks-or-315-value-picks-is-schb-or-vtv-a-better-fit-for-your-portfolio/",
      "source": "The Globe and Mail",
      "published": "20260105T161018",
      "overall_sentiment_score": 0.16896,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.136107,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.620929
    },
    {
      "title": "Morgan Stanley Warns: AI Could Eliminate 200,000 Banking Jobs in Europe",
      "summary": "Morgan Stanley predicts that over 200,000 banking jobs in Europe could be eliminated by 2030, largely due to banks adopting artificial intelligence and closing physical branches to cut costs. This reduction, affecting about 10% of the workforce in 35 major lenders, will primarily impact \"central services\" roles. The push for automation is driven by investor pressure to improve profitability, despite some industry leaders urging caution against too rapid an adoption of AI.",
      "url": "https://www.techrepublic.com/article/news-morgan-stanley-200k-ai-jobs-lost-europe-2030/",
      "source": "TechRepublic",
      "published": "20260105T160837",
      "overall_sentiment_score": -0.162788,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.133043,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.607032
    },
    {
      "title": "Paychex (NASDAQ:PAYX) Hits New 12-Month Low Following Analyst Downgrade",
      "summary": "Paychex (NASDAQ:PAYX) stock recently dropped to a new 52-week low after Argus and several other analysts lowered their price targets, despite the company beating Q3 earnings and revenue estimates and providing positive FY2026 guidance. While trading at a P/E of 24.64, Paychex also offers a high dividend yield of 4.0% with a nearly 100% payout ratio. Institutional ownership remains strong, with major holders like Vanguard, State Street, and Charles Schwab increasing their positions.",
      "url": "https://www.marketbeat.com/instant-alerts/paychex-nasdaqpayx-hits-new-12-month-low-following-analyst-downgrade-2026-01-05/",
      "source": "MarketBeat",
      "published": "20260105T160833",
      "overall_sentiment_score": -0.253103,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.231868,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.600664
    },
    {
      "title": "Heartflow to Participate in the 44th Annual J.P. Morgan Healthcare Conference",
      "summary": "Heartflow, Inc. announced that members of its management will present at the 44th Annual J.P. Morgan Healthcare Conference on Tuesday, January 13, 2026. The company, a leader in AI technology for coronary artery disease, will have its presentation live-streamed and archived on its Investor Relations website. This event highlights Heartflow's commitment to advancing precision cardiovascular care through its clinically-proven AI platform.",
      "url": "https://www.globenewswire.com/news-release/2026/01/05/3213187/0/en/Heartflow-to-Participate-in-the-44th-Annual-J-P-Morgan-Healthcare-Conference.html",
      "source": "GlobeNewswire",
      "published": "20260105T160500",
      "overall_sentiment_score": 0.156903,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.110366,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.605166
    },
    {
      "title": "Why Xenon Pharmaceuticals stock is down today as JPM Healthcare Conference nears",
      "summary": "Xenon Pharmaceuticals (XENE) shares dropped 6.5% on Monday, January 5, 2026, ahead of the J.P. Morgan Healthcare Conference, despite a supportive analyst note from Cantor Fitzgerald. Investors are awaiting updates on the company's lead molecule, azetukalner, which is in Phase 3 trials for epilepsy and mood disorders, with topline data for its X-TOLE2 epilepsy study expected in early 2026. The biotech sector as a whole experienced a softer trading day, with XENE's decline being steeper than the general trend.",
      "url": "https://ts2.tech/en/why-xenon-pharmaceuticals-stock-is-down-today-as-jpm-healthcare-conference-nears/",
      "source": "ts2.tech",
      "published": "20260105T152200",
      "overall_sentiment_score": -0.044709,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.147279,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.611893
    },
    {
      "title": "Ação da Goldman Sachs atinge máxima histórica de US$ 920,01",
      "summary": "A ação da Goldman Sachs Group Inc. atingiu um novo recorde histórico de US$ 920,01, impulsionada por um aumento de 61,29% no último ano e desempenho superior aos concorrentes, com margens de lucro saudáveis e alto retorno sobre o patrimônio. A empresa está envolvida em iniciativas estratégicas, incluindo o financiamento de Kennedy Wilson e um investimento na Bolsa de Valores do Texas, além de liderar uma rodada de financiamento para a Skims, de Kim Kardashian. Analistas como o BofA Securities elevaram seu preço-alvo para a Goldman Sachs para US$900, mantendo a classificação de Compra.",
      "url": "https://br.investing.com/news/company-news/acao-da-goldman-sachs-atinge-maxima-historica-de-us-92001-93CH-1789807",
      "source": "Investing.com Brasil - Finanças, Câmbio e Investimentos",
      "published": "20260105T151006",
      "overall_sentiment_score": 0.227753,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.121747,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.617162
    },
    {
      "title": "HeartBeam to Attend JP Morgan 2026 Annual Healthcare Conference",
      "summary": "HeartBeam, Inc. (NASDAQ: BEAT) announced its attendance at the JP Morgan 2026 Annual Healthcare Conference, where its CEO and CFO will meet with investors and partners. They will discuss the recent FDA 510(k) clearance for HeartBeam’s cable-free synthesized 12-lead ECG software for arrhythmia assessment. The company plans a limited U.S. commercial launch in Q1 2026, targeting concierge and preventive cardiology practices.",
      "url": "https://www.01net.it/heartbeam-to-attend-jp-morgan-2026-annual-healthcare-conference/",
      "source": "01net",
      "published": "20260105T150943",
      "overall_sentiment_score": 0.360657,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.145478,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.605879
    },
    {
      "title": "Burlington stock hits 52-week high at 309.07 USD By Investing.com",
      "summary": "Burlington Stores Inc.'s stock reached a new 52-week high of $309.07, marking a significant milestone after increasing 6.74% over the past year and 20.62% in the last six months. The company currently holds a market capitalization of approximately $19.1 billion, with a P/E ratio of 35.24. Although analysts' price targets range from $250 to $430, InvestingPro's Fair Value assessment suggests the stock may be overvalued.",
      "url": "https://za.investing.com/news/company-news/burlington-stock-hits-52week-high-at-30907-usd-93CH-4047290",
      "source": "Investing.com South Africa",
      "published": "20260105T150941",
      "overall_sentiment_score": 0.169082,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.064998,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.576383
    },
    {
      "title": "Zai Lab to Present at 44th Annual J.P. Morgan Healthcare Conference",
      "summary": "Zai Lab Limited announced that its senior management will participate in the 44th Annual J.P. Morgan Healthcare Conference on Tuesday, January 13, 2026, at 3:00 p.m. PST / 6:00 p.m. EST. A live webcast of the presentation will be available on the Investor Relations page of Zai Lab’s website, with an archived replay accessible for 30 days. Zai Lab focuses on discovering, developing, and commercializing innovative biopharmaceutical products for unmet medical needs in oncology, immunology, neuroscience, and infectious disease.",
      "url": "https://www.biospace.com/press-releases/zai-lab-to-present-at-44th-annual-j-p-morgan-healthcare-conference",
      "source": "BioSpace",
      "published": "20260105T142637",
      "overall_sentiment_score": 0.136407,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.144032,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.628276
    },
    {
      "title": "Mizuho Lowers Honeywell International (NASDAQ:HON) Price Target to $240.00",
      "summary": "Mizuho has reduced its price target for Honeywell International (NASDAQ:HON) to $240.00 from $250.00, while maintaining an \"outperform\" rating, suggesting a potential upside of 22.52% from its prior closing price. This adjustment comes amidst other brokerages also revising their price targets for HON. The conglomerate recently reported quarterly EPS of $2.25 on $8.95 billion in revenue and provided guidance indicating analysts anticipate 10.34 EPS for the current year.",
      "url": "https://www.marketbeat.com/instant-alerts/mizuho-lowers-honeywell-international-nasdaqhon-price-target-to-24000-2026-01-05/",
      "source": "MarketBeat",
      "published": "20260105T142014",
      "overall_sentiment_score": -0.088492,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.12765,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.625765
    },
    {
      "title": "GATX completes acquisition of Wells Fargo rail portfolio for $4.2 billion",
      "summary": "GATX Corporation, in a joint venture with Brookfield Infrastructure Partners, has finalized the acquisition of Wells Fargo’s rail operating lease portfolio for approximately $4.2 billion. This transaction adds around 101,000 railcars to GATX's North American operations and is expected to be modestly accretive to earnings in the first year. Brookfield also acquired Wells Fargo's rail finance lease portfolio, which GATX will manage.",
      "url": "https://au.investing.com/news/company-news/gatx-completes-acquisition-of-wells-fargo-rail-portfolio-for-42-billion-93CH-4190694",
      "source": "Investing.com Australia",
      "published": "20260105T141001",
      "overall_sentiment_score": 0.161876,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.130975,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.574788
    },
    {
      "title": "Schwab U.S. Aggregate Bond ETF $SCHZ Shares Bought by Daymark Wealth Partners LLC",
      "summary": "Daymark Wealth Partners LLC increased its stake in Schwab U.S. Aggregate Bond ETF (NYSEARCA:SCHZ) by 10.7% in the third quarter, making it their 18th largest holding. Other institutional investors like JPMorgan Chase & Co. and Ameriprise Financial Inc. also modified their holdings. The article details the stock performance and profile of SCHZ, an ETF tracking a broad index of U.S. investment-grade fixed-income securities.",
      "url": "https://www.defenseworld.net/2026/01/05/schwab-u-s-aggregate-bond-etf-schz-shares-bought-by-daymark-wealth-partners-llc.html",
      "source": "Defense World",
      "published": "20260105T140922",
      "overall_sentiment_score": 0.258255,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.20253,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.629698
    },
    {
      "title": "JPMorgan Chase & Co. Reaffirms Sell Rating for Tesla (NASDAQ:TSLA)",
      "summary": "JPMorgan Chase & Co. has reaffirmed its \"sell\" rating for Tesla (NASDAQ:TSLA) after the company missed Q4 delivery expectations and faces increased competition, including BYD surpassing it as the largest BEV producer. Despite this, the aggregate analyst view on MarketBeat is a \"Hold\" with an average price target of $414.92, indicating divergent opinions among analysts. Insider selling by CFO Vaibhav Taneja and director Kimbal Musk in December further contributed to the negative sentiment.",
      "url": "https://www.marketbeat.com/instant-alerts/jpmorgan-chase-co-reaffirms-sell-rating-for-tesla-nasdaqtsla-2026-01-05/",
      "source": "MarketBeat",
      "published": "20260105T140810",
      "overall_sentiment_score": -0.09279,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.113292,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.813372
    },
    {
      "title": "BridgeBio to Participate in the J.P. Morgan Healthcare Conference",
      "summary": "BridgeBio Pharma, Inc. announced that its co-founder and CEO, Neil Kumar, Ph.D., will present at the 44th Annual J.P. Morgan Healthcare Conference on Monday, January 12 at 7:30 am PT. An investor webinar will be available live and for replay on the BridgeBio website. The company focuses on discovering and delivering medicines for genetic diseases, with a pipeline ranging from early science to advanced clinical trials.",
      "url": "https://www.sahmcapital.com/news/content/bridgebio-to-participate-in-the-jp-morgan-healthcare-conference-2026-01-05",
      "source": "Sahm",
      "published": "20260105T135747",
      "overall_sentiment_score": 0.193717,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.145153,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.6027
    },
    {
      "title": "This is how JPMorgan Chase’s stock stands out in the elite $900 billion club",
      "summary": "JPMorgan Chase is on the verge of closing with a market capitalization exceeding $900 billion for the first time, making it the 13th U.S. company to reach this milestone. This achievement places the financial giant in an exclusive club where its stock stands out as the cheapest among its peers. The company's stock rallied 3% intraday, pushing it towards this significant valuation.",
      "url": "https://www.marketwatch.com/story/this-is-how-jpmorgan-chases-stock-stands-out-in-the-elite-900-billion-club-d2a676a5",
      "source": "MarketWatch",
      "published": "20260105T124500",
      "overall_sentiment_score": 0.492937,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.45918,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Railway Pension Investments Ltd Increases Stake in Verisk Analytics, Inc. $VRSK",
      "summary": "Railway Pension Investments Ltd significantly increased its stake in Verisk Analytics, Inc. (NASDAQ:VRSK) by 24.0% in Q3, adding 11,900 shares and bringing its total holdings to 61,400 shares valued at $15.443 million. Institutional investors now own approximately 90.0% of VRSK, with corporate insiders holding a much smaller 0.46%. Verisk reported Q3 EPS of $1.72, beating estimates, and offered FY2025 EPS guidance, while analysts currently rate the stock as a \"Hold\" with an average price target of $278.64.",
      "url": "https://www.marketbeat.com/instant-alerts/filing-railway-pension-investments-ltd-increases-stake-in-verisk-analytics-inc-vrsk-2026-01-05/",
      "source": "MarketBeat",
      "published": "20260105T123016",
      "overall_sentiment_score": 0.168074,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.122984,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.635659
    },
    {
      "title": "Daymark Wealth Partners LLC Increases Stake in John Hancock High Yield ETF $JHHY",
      "summary": "Daymark Wealth Partners LLC significantly increased its stake in the John Hancock High Yield ETF ($JHHY) by 31.9% in the third quarter, now owning 12.65% of the shares valued at $7.86 million. Several other institutional investors, including JPMorgan Chase & Co. and Jane Street Group LLC, also adjusted their holdings in JHHY. The ETF, launched on May 1, 2024, seeks to maximize income primarily through a diversified portfolio of US dollar-denominated high-yield corporate bonds.",
      "url": "https://www.defenseworld.net/2026/01/05/daymark-wealth-partners-llc-increases-stake-in-john-hancock-high-yield-etf-jhhy.html",
      "source": "Defense World",
      "published": "20260105T121016",
      "overall_sentiment_score": 0.278226,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.239739,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.630717
    },
    {
      "title": "2,400 Stocks or 315 Value Picks: Is SCHB or VTV a Better Fit for Your Portfolio?",
      "summary": "This article compares two ETFs, SCHB and VTV, for investors seeking U.S. equity exposure. SCHB offers broad market coverage with a tech tilt and tracks over 2,400 stocks, while VTV focuses on large-cap value stocks, primarily in financials and healthcare, with about 315 holdings and a higher dividend yield. The choice depends on investment goals: SCHB for market-wide growth potential and VTV for income-focused investors valuing established companies.",
      "url": "https://www.theglobeandmail.com/investing/markets/stocks/JPM/pressreleases/36877015/2400-stocks-or-315-value-picks-is-schb-or-vtv-a-better-fit-for-your-portfolio/",
      "source": "The Globe and Mail",
      "published": "20260105T111003",
      "overall_sentiment_score": 0.213367,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.203849,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.64989
    },
    {
      "title": "Allspring Global Investments Holdings LLC Has $13.30 Million Stake in AllianceBernstein National Municipal Income Fund, Inc. $AFB",
      "summary": "Allspring Global Investments Holdings LLC increased its stake in AllianceBernstein National Municipal Income Fund (NYSE:AFB) by 23.7% in the third quarter, bringing its total holdings to $13.30 million. Other institutional investors have also adjusted their positions in AFB, and Director Garry L. Moody recently acquired additional shares. The company has announced a monthly dividend of $0.0502 per share, payable on January 16th.",
      "url": "https://www.defenseworld.net/2026/01/05/allspring-global-investments-holdings-llc-has-13-30-million-stake-in-alliancebernstein-national-municipal-income-fund-inc-afb.html",
      "source": "Defense World",
      "published": "20260105T080903",
      "overall_sentiment_score": 0.162648,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.148543,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.627948
    },
    {
      "title": "Business First Bancshares, Inc. Completes Acquisition of Progressive Bank",
      "summary": "Business First Bancshares, Inc. (BFST) has successfully completed its acquisition of Progressive Bancorp, Inc., increasing Business First's total assets to approximately $8.7 billion. This strategic move expands b1BANK's presence across Louisiana, adding nine new locations in North Louisiana. The acquisition also integrates key Progressive leadership into Business First's and b1BANK's boards and management, emphasizing a shared cultural approach.",
      "url": "https://www.theglobeandmail.com/investing/markets/stocks/BFST-Q/pressreleases/36885894/business-first-bancshares-inc-completes-acquisition-of-progressive-bank/",
      "source": "The Globe and Mail",
      "published": "20260105T080000",
      "overall_sentiment_score": 0.240098,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.119884,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.585315
    },
    {
      "title": "Upstream Bio to Present at the 44th Annual J.P. Morgan Healthcare Conference",
      "summary": "Upstream Bio's CEO, Rand Sutherland, MD, will present at the 44th Annual J.P. Morgan Healthcare Conference on January 12, 2026, at 2:15 p.m. PT. A live webcast of the presentation will be available on the Investors section of Upstream Bio’s website. The company is a clinical-stage biotechnology firm focused on developing treatments for inflammatory diseases, specifically severe respiratory disorders, with its lead candidate verekitug.",
      "url": "https://www.globenewswire.com/news-release/2026/01/05/3212596/0/en/Upstream-Bio-to-Present-at-the-44th-Annual-J-P-Morgan-Healthcare-Conference.html",
      "source": "GlobeNewswire",
      "published": "20260105T070000",
      "overall_sentiment_score": 0.308447,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.178683,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.616335
    },
    {
      "title": "Enanta Pharmaceuticals to Present at the 44th Annual J.P. Morgan Healthcare Conference",
      "summary": "Enanta Pharmaceuticals, Inc. announced that its President and CEO, Jay R. Luly, Ph.D., will present at the 44th Annual J.P. Morgan Healthcare Conference on January 14, 2026, in San Francisco. A live webcast of the presentation will be available on the company's website. Enanta is a clinical-stage biotechnology company focused on developing small molecule drugs for viral infections and immunological diseases.",
      "url": "https://finance.yahoo.com/news/enanta-pharmaceuticals-present-44th-annual-120000533.html",
      "source": "Yahoo Finance",
      "published": "20260105T060000",
      "overall_sentiment_score": 0.105036,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.10529,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.736425
    },
    {
      "title": "Morgan Stanley Downgrades The Southern Company (SO) From Equal Weight To Underweight",
      "summary": "Morgan Stanley downgraded The Southern Company (SO) from Equal Weight to Underweight, lowering its price objective to $81 from $97 due to anticipated utilities share performance driven by data centers and growth, and the recommendation to avoid political and regulatory risk. UBS and JPMorgan also recently reduced their price targets for SO. The stock was up 6.25% YTD as of December 31, 2025.",
      "url": "https://finviz.com/news/266715/morgan-stanley-downgrades-the-southern-company-so-from-equal-weight-to-underweight",
      "source": "Finviz",
      "published": "20260105T040847",
      "overall_sentiment_score": -0.214001,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.141361,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.622993
    },
    {
      "title": "Citigroup stock closes higher to start 2026 — here’s what could drive the next move",
      "summary": "Citigroup (NYSE: C) shares closed 1.7% higher on Friday at $118.70, with investors anticipating key U.S. data and the bank's upcoming Q4 earnings report on January 14. Rising Treasury yields highlight the market's sensitivity to interest rate expectations, influencing major banks like Citi. The report will focus on net interest income, credit costs, expense discipline, and capital plans amidst a busy bank reporting week.",
      "url": "https://ts2.tech/en/citigroup-stock-closes-higher-to-start-2026-heres-what-could-drive-the-next-move/",
      "source": "ts2.tech",
      "published": "20260105T015106",
      "overall_sentiment_score": 0.23463,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.18664,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.620341
    },
    {
      "title": "UBS eleva classificação das ações da Dover para Compra com expectativa de crescimento em 2026",
      "summary": "UBS upgraded Dover Corp. (NYSE:DOV) shares from Neutral to Buy and raised its price target to $256 from $200. The upgrade is based on expectations of accelerating organic growth in 2026 after two challenging years, strong capital allocation, and cost discipline, which are projected to drive double-digit EPS growth. The stock is currently trading at a significant discount compared to the Industrial Select Sector Index, suggesting potential for appreciation.",
      "url": "https://br.investing.com/news/analyst-ratings/ubs-eleva-classificacao-das-acoes-da-dover-para-compra-com-expectativa-de-crescimento-em-2026-93CH-1788956",
      "source": "Investing.com Brasil - Finanças, Câmbio e Investimentos",
      "published": "20260105T014900",
      "overall_sentiment_score": 0.29601,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.148043,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.63162
    },
    {
      "title": "ESL completes Generations Bank acquisition",
      "summary": "ESL Federal Credit Union has completed its acquisition of Generations Bank, adding eight new locations and expanding its presence in the Finger Lakes region. This move increases ESL's assets to over $9.8 billion and its membership to approximately 459,000, with account conversions for former Generations customers expected by February 1. ESL plans investments in the newly served communities and anticipates building new relationships with employees, customers, and local businesses.",
      "url": "https://www.fingerlakes1.com/2026/01/04/esl-completes-generations-bank-acquisition/",
      "source": "Fingerlakes1.com",
      "published": "20260105T012600",
      "overall_sentiment_score": 0.302479,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.214367,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.601154
    }
  ]
}