{
  "ticker": "NVDA",
  "date": "2021-11-15",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T11:06:21.634237",
  "source": "alpha_vantage",
  "article_count": 14,
  "articles": [
    {
      "title": "Nvidia Hits Record High as Stock Surge Nears 120% This Year",
      "summary": "Nvidia Corp. stock rallied to a record high, extending its 2021 advance to nearly 130%. The chipmaker's shares rose 12% in its sixth consecutive positive session, making it the biggest gainer in the Philadelphia Stock Exchange Semiconductor Index. Wells Fargo also raised its price target on Nvidia, citing opportunities in the metaverse.",
      "url": "https://www.bloomberg.com/news/articles/2021-11-04/nvidia-extends-rally-as-year-s-surge-nears-120-ahead-of-results",
      "source": "Bloomberg.com",
      "published": "20211104T153800",
      "overall_sentiment_score": 0.821155,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.830968,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Aeva and Luminar deals show lidar gaining traction",
      "summary": "Aeva and Luminar, two lidar companies that recently went public via SPACs, are gaining traction in the autonomous vehicle industry. Aeva has partnered with Fabrinet for mass production of its chip-scale lidar modules, while Luminar's lidar has been selected for Nvidia's DRIVE Hyperion platform. Another lidar startup, Ouster, also reported a significant increase in sales and plans to launch a new automotive lidar platform.",
      "url": "https://optics.org/news/12/11/12",
      "source": "Optics.org",
      "published": "20211110T201648",
      "overall_sentiment_score": 0.22271,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.327096,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.936063
    },
    {
      "title": "Innoviz Perception Solution Supported on NVIDIA DRIVE Platform",
      "summary": "Innoviz Technologies announced that its advanced perception solution is now supported on the NVIDIA DRIVE platform, integrating its LiDAR sensor and perception software into NVIDIA's end-to-end AI platform for autonomous vehicles. This collaboration allows Innoviz's technology to enable object detection, tracking, and classification, as well as obstacle detection and calibration, and is integrated with NVIDIA DRIVE Sim for development and validation. The partnership aims to accelerate the development and deployment of autonomous vehicles by providing customer access to Innoviz's LiDAR solutions within the NVIDIA DRIVE ecosystem.",
      "url": "https://www.prnewswire.com/news-releases/innoviz-perception-solution-supported-on-nvidia-drive-platform-301419414.html",
      "source": "PR Newswire",
      "published": "20211109T043000",
      "overall_sentiment_score": 0.343387,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.338846,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.914582
    },
    {
      "title": "Luminar Lidar Selected for NVIDIA DRIVE Hyperion Autonomous Vehicle Reference Platform",
      "summary": "Luminar's lidar solution has been selected to be part of the sensor suite in the NVIDIA DRIVE Hyperion autonomous vehicle reference platform, which aims to accelerate the development of autonomous consumer vehicles with production starting in 2024. The platform will utilize Luminar's long-range Iris lidar for Level 3 highway driving, integrating it with NVIDIA’s high-performance compute and AI software. This collaboration is expected to provide automakers with an advanced platform for next-generation safety and autonomous capabilities.",
      "url": "https://www.businesswire.com/news/home/20211109005556/en/Luminar-Lidar-Selected-for-NVIDIA-DRIVE-Hyperion-Autonomous-Vehicle-Reference-Platform",
      "source": "Business Wire",
      "published": "20211109T204138",
      "overall_sentiment_score": 0.38723,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.313723,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.883049
    },
    {
      "title": "Supermicro Enhances Broadest Portfolio of Edge to Cloud AI Systems with Accelerated Inferencing and New Intelligent Fabric Support",
      "summary": "Supermicro announced enhancements to its AI GPU server portfolio, integrating new NVIDIA Ampere-family GPUs to deliver up to 10x faster AI inference performance and 3x faster training. These systems are designed for a wide range of applications from edge computing to cloud environments, critical for uses like autonomous driving, video streaming, and cloud gaming. Supermicro also introduced its Universal GPU Platform and systems supporting the new NVIDIA Quantum-2 InfiniBand product line, alongside optimized solutions for NVIDIA Omniverse Enterprise.",
      "url": "https://www.prnewswire.com/news-releases/supermicro-enhances-broadest-portfolio-of-edge-to-cloud-ai-systems-with-accelerated-inferencing-and-new-intelligent-fabric-support-301419355.html",
      "source": "PR Newswire",
      "published": "20211109T043500",
      "overall_sentiment_score": 0.406703,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.421212,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.871439
    },
    {
      "title": "Nvidia picks Luminar's lidar for self-driving tech, sending its shares up 15%",
      "summary": "Luminar Technologies Inc. saw its stock jump 15% after Nvidia announced it would use Luminar's lidar technology for its self-driving platforms. This news coincided with Nvidia's annual GTC conference. Luminar has also recently partnered with Volvo and is expanding into the Chinese market.",
      "url": "https://www.bizjournals.com/sanjose/news/2021/11/09/luminar-stock-soars-on-nvidia-partnership.html",
      "source": "The Business Journals",
      "published": "20211109T141400",
      "overall_sentiment_score": 0.36571,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.331435,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.815167
    },
    {
      "title": "CoreWeave, Specialized Cloud Provider, Raises $50 Million in New Capital from Magnetar",
      "summary": "CoreWeave, a specialized cloud provider focused on NVIDIA GPU-accelerated workloads, announced it has raised $50 million from Magnetar Capital to expand its infrastructure. This funding follows a period of significant growth for CoreWeave, with its total revenues on track to triple in 2021 and its cloud business experiencing 271% growth in the last three months. The investment will enable CoreWeave to further scale its offerings for high-performance computing, catering to diverse needs such as VFX rendering, machine learning, and digital assets.",
      "url": "https://www.prnewswire.com/news-releases/coreweave-specialized-cloud-provider-raises-50-million-in-new-capital-from-magnetar-301420451.html",
      "source": "PR Newswire",
      "published": "20211110T090500",
      "overall_sentiment_score": 0.236759,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.431934,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.807983
    },
    {
      "title": "AMD lands Meta as customer and takes on Nvidia, sending shares up 11%",
      "summary": "Advanced Micro Devices (AMD) shares rose 11% after announcing Meta Platforms Inc. as a new data center chip customer, intensifying its competition with Intel. AMD also unveiled new chips, including the MI200 for AI and machine learning to challenge Nvidia, and the Bergamo processor for cloud computing to compete with Ampere Computing. These strategic moves bolster AMD's market position against larger rivals and secure its presence with major cloud providers.",
      "url": "https://www.reuters.com/technology/amd-lands-meta-customer-takes-aim-nvidia-with-new-supercomputing-chips-2021-11-08/",
      "source": "Reuters",
      "published": "20211108T215000",
      "overall_sentiment_score": 0.245336,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.261431,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.745424
    },
    {
      "title": "Arista Gains Big on Cloud Boom",
      "summary": "Arista Networks experienced significant stock gains following strong earnings and boosted guidance, driven by increased capital spending from hyperscalers like Meta and Microsoft. The company also continues to gain market share from competitors like Cisco in both data center, cloud, and campus networking segments, indicating a robust cloud boom across the industry. Other infrastructure vendors like NVIDIA, Amazon Web Services, and Broadcom are also seeing growth.",
      "url": "https://www.futuriom.com/articles/news/arista-gains-big-on-cloud-boom/2021/11",
      "source": "Futuriom",
      "published": "20211104T193553",
      "overall_sentiment_score": 0.661444,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.727232,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.707328
    },
    {
      "title": "New VinFast VF e35 electric SUV revealed as Tesla Model Y rival",
      "summary": "Vietnamese brand VinFast is set to debut its new VF e35 electric SUV at the LA Auto Show, targeting rivals like the Volkswagen ID.4 and Tesla Model Y. Designed by Pininfarina, the VF e35 will offer a range of up to 250 miles and level 3 autonomous driving capabilities, with deliveries expected to begin next year. The vehicle aims to be competitively priced in Western markets.",
      "url": "https://www.autoexpress.co.uk/news/356570/new-vinfast-vf-e35-electric-suv-revealed-tesla-model-y-rival",
      "source": "Auto Express",
      "published": "20211115T213156",
      "overall_sentiment_score": 0.039187,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.142746,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.632592
    },
    {
      "title": "Startup Embark Trucks Now Publicly Traded",
      "summary": "Embark Trucks Inc., an autonomous truck software developer, has completed its business combination with Northern Genesis Acquisition Corp. II and is now publicly traded on the Nasdaq Capital Market under the ticker symbols EMBK and EMBKW. The company, co-founded by CEO Alex Rodrigues (26), aims to commercialize self-driving trucks in the U.S. Sun Belt by 2024, leveraging its OEM-agnostic software and recent partnerships with industry leaders.",
      "url": "https://www.ttnews.com/articles/startup-embark-trucks-now-publicly-traded",
      "source": "Transport Topics",
      "published": "20211115T103000",
      "overall_sentiment_score": 0.338798,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.315061,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.629604
    },
    {
      "title": "Investing in Mark Zuckerberg’s vision of the Metaverse with an ETF",
      "summary": "This article discusses investing in Mark Zuckerberg's vision of the Metaverse following Facebook's rebranding to Meta. It explains what the Metaverse is, how investors can gain exposure through companies involved in its creation like Roblox and Unity Software, and highlights the Roundhill Ball Metaverse ETF (NYSE:META) which tracks a basket of such stocks. The article also provides information on thematic ETFs and the fund manager, Roundhill Investments.",
      "url": "https://www.thearmchairtrader.com/metaverse-etf-roundhill-investments/",
      "source": "The Armchair Trader",
      "published": "20211103T204637",
      "overall_sentiment_score": 0.271724,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.309649,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.607833
    },
    {
      "title": "EXPLAINED: What is Metaverse and Why Facebook/ Meta Thinks it's the Future of Internet",
      "summary": "This article explains the concept of the metaverse, why Facebook (now Meta) views it as the future of the internet, and what its potential applications are. It details how the metaverse would work, from virtual interactions and business opportunities to the technologies being developed to build it, while also touching on data privacy concerns.",
      "url": "https://www.news18.com/news/tech/explained-what-is-metaverse-and-why-facebook-meta-thinks-its-the-future-of-internet-4416881.html",
      "source": "News18",
      "published": "20211108T104000",
      "overall_sentiment_score": 0.146497,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.142773,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.602978
    },
    {
      "title": "TSMC and Sony partner to build US$7bn chip factory in Japan",
      "summary": "Taiwan Semiconductor Manufacturing Company (TSMC) and Sony have announced a joint venture to build a $7 billion chip plant in Japan, aiming for mass production by 2024. The new factory in Kumamoto will be TSMC's first in Japan, creating 1,500 high-tech jobs and producing 45,000 12-inch wafers per month to address the global semiconductor shortage. Sony will invest $500 million for a 20% equity stake, with significant funding also provided by the Japanese government.",
      "url": "https://technologymagazine.com/digital-transformation/tsmc-and-sony-partner-build-usdollar7bn-chip-factory-japan",
      "source": "Technology Magazine",
      "published": "20211110T212705",
      "overall_sentiment_score": 0.33592,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.262015,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.586857
    }
  ]
}