{
  "ticker": "NVDA",
  "date": "2025-09-22",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T11:39:12.658790",
  "source": "alpha_vantage",
  "article_count": 50,
  "articles": [
    {
      "title": "OpenAI and NVIDIA Announce Strategic Partnership to Deploy 10 Gigawatts of NVIDIA Systems",
      "summary": "OpenAI and NVIDIA have announced a strategic partnership to deploy at least 10 gigawatts of NVIDIA systems for OpenAI's next-generation AI infrastructure, representing millions of GPUs. NVIDIA intends to invest up to $100 billion in OpenAI as these new systems are deployed, with the first gigawatt expected to be online in the second half of 2026. This collaboration aims to advance AI breakthroughs and empower people and businesses with scaled AI capabilities.",
      "url": "http://nvidianews.nvidia.com/news/openai-and-nvidia-announce-strategic-partnership-to-deploy-10gw-of-nvidia-systems",
      "source": "NVIDIA Newsroom",
      "published": "20250922T000000",
      "overall_sentiment_score": 0.407867,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.430362,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Why Top Investors Are Buying NVIDIA Corp (NVDA)",
      "summary": "Institutional investors significantly increased their holdings in NVIDIA Corp (NVDA) according to their latest 13F filings, driven by strong conviction in AI-driven growth. Notable increases came from Bridgewater Associates, Point72 Asset Management, Appaloosa LP, and Third Point LLC, among others. These moves highlight Wall Street's belief in NVIDIA's continued role as a cornerstone of AI and computing growth.",
      "url": "https://acquirersmultiple.com/2025/09/why-top-investors-are-buying-nvidia-corp-nvda/",
      "source": "The Acquirer's Multiple",
      "published": "20250922T000000",
      "overall_sentiment_score": 0.805796,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.838869,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Nvidia to invest $5B in Intel as part of new chip partnership",
      "summary": "Nvidia Corp. announced a $5 billion investment in Intel Corp. as part of a new chip development partnership. This collaboration will focus on both data center and consumer segments, with Intel creating custom CPUs for Nvidia graphics cards and PC processors with Nvidia chiplets. The deal gives Nvidia a significant stake in Intel and aims to accelerate enterprise AI adoption and expand Nvidia's reach into the PC ecosystem.",
      "url": "https://siliconangle.com/2025/09/18/nvidia-invest-5b-intel-part-new-chip-partnership/",
      "source": "SiliconANGLE",
      "published": "20250918T150800",
      "overall_sentiment_score": 0.238784,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.441231,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "NVIDIA and United Kingdom Build Nation’s AI Infrastructure and Ecosystem to Fuel Innovation, Economic Growth and Jobs",
      "summary": "NVIDIA is collaborating with the United Kingdom to build the nation's AI infrastructure, involving partners like Nscale, CoreWeave, and Microsoft, and an investment of up to £11 billion. This initiative includes deploying hundreds of thousands of NVIDIA Grace Blackwell GPUs, establishing AI factories, and boosting quantum computing and AI/robotics ecosystems. The goal is to accelerate the AI industrial revolution in the UK, fostering innovation, economic growth, and job creation.",
      "url": "https://nvidianews.nvidia.com/news/nvidia-and-united-kingdom-build-nations-ai-infrastructure-and-ecosystem-to-fuel-innovation-economic-growth-and-jobs",
      "source": "NVIDIA Newsroom",
      "published": "20250916T000000",
      "overall_sentiment_score": 0.336682,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.480488,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "NVIDIA Unveils Rubin CPX: A New Class of GPU Designed for Massive-Context Inference",
      "summary": "NVIDIA announced the Rubin CPX, a new class of GPU designed for massive-context inference, enabling AI systems to handle tasks like million-token coding and generative video. This GPU, part of the NVIDIA Vera Rubin NVL144 CPX platform, offers significant AI performance and memory bandwidth improvements, aiming to transform applications like AI coding assistants and video processing. Industry innovators like Cursor, Runway, and Magic are already exploring its potential for accelerating their AI applications.",
      "url": "https://investor.nvidia.com/news/press-release-details/2025/NVIDIA-Unveils-Rubin-CPX-A-New-Class-of-GPU-Designed-for-Massive-Context-Inference/default.aspx",
      "source": "NVIDIA",
      "published": "20250909T000000",
      "overall_sentiment_score": 0.898171,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.863048,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "NVIDIA and Intel to Develop AI Infrastructure and Personal Computing Products",
      "summary": "NVIDIA and Intel announced a collaboration to jointly develop custom data center and PC products that will accelerate AI applications and workloads. The partnership involves Intel designing and manufacturing custom x86 CPUs with NVIDIA NVLink for data centers and x86 SOCs with integrated NVIDIA RTX GPU chiplets for PCs. NVIDIA will also invest $5 billion in Intel common stock as part of this strategic alliance.",
      "url": "https://investor.nvidia.com/news/press-release-details/2025/NVIDIA-and-Intel-to-Develop-AI-Infrastructure-and-Personal-Computing-Products/default.aspx",
      "source": "NVIDIA",
      "published": "20250918T000000",
      "overall_sentiment_score": 0.434449,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.438667,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "NVIDIA Announces £2 Billion Investment in the United Kingdom AI Startup Ecosystem",
      "summary": "NVIDIA has announced a £2 billion investment in the United Kingdom's AI startup ecosystem. This capital injection aims to foster economic growth, support new AI companies and jobs, and enhance the U.K.'s global competitiveness in the AI market, particularly focusing on key hubs like London, Oxford, Cambridge, and Manchester. The initiative, in collaboration with several venture capital firms, seeks to provide crucial capital and advanced AI infrastructure to overcome current scaling challenges for U.K. AI startups.",
      "url": "https://investor.nvidia.com/news/press-release-details/2025/NVIDIA-Announces-2-Billion-Investment-in-the-United-Kingdom-AI-Startup-Ecosystem/default.aspx",
      "source": "NVIDIA",
      "published": "20250918T000000",
      "overall_sentiment_score": 0.447756,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.425209,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Nvidia invests $5bn in Intel",
      "summary": "Nvidia Corp. has agreed to invest $5 billion in Intel Corp., a surprising move given their historical rivalry, to co-develop chips for PCs and data centers. This investment will involve Nvidia buying Intel common stock and the companies integrating Nvidia's graphics technology into Intel's PC chips and Intel's processors into Nvidia's data center products. The collaboration aims to strengthen Intel’s market position against competitors like AMD and leverage Nvidia’s dominance in AI computing.",
      "url": "https://www.moneyweb.co.za/news/companies-and-deals/nvidia-invests-5bn-in-intel/",
      "source": "Moneyweb",
      "published": "20250918T153100",
      "overall_sentiment_score": 0.288755,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.549343,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.962485
    },
    {
      "title": "Super Micro Computer, Inc. - Supermicro Begins Volume Shipments of NVIDIA Blackwell Ultra Systems and Rack Plug-and-Play Data Center-Scale Solutions",
      "summary": "Supermicro announced the broad availability and volume shipments of its NVIDIA Blackwell Ultra solutions, including Plug-and-Play-ready NVIDIA HGX B300 systems and GB300 NVL72 racks. These pre-validated solutions are designed for rapid deployment of high-performance AI infrastructure for various AI applications, optimized for efficiency and performance at scale. Supermicro's Data Center Building Block Solutions (DCBBS) offer turn-key delivery and services to accelerate AI factory deployment, showcasing the company's commitment to cutting-edge AI technology.",
      "url": "https://ir.supermicro.com/news/news-details/2025/Supermicro-Begins-Volume-Shipments-of-NVIDIA-Blackwell-Ultra-Systems-and-Rack-Plug-and-Play-Data-Center-Scale-Solutions/default.aspx",
      "source": "Supermicro",
      "published": "20250911T000000",
      "overall_sentiment_score": 0.751368,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.705128,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.903806
    },
    {
      "title": "Vanguard's VUG ETF: The Ultimate Growth ETF for Your Portfolio",
      "summary": "The Vanguard Growth ETF (VUG) is highlighted as a premier investment for growth-oriented portfolios, driven by its focus on large-cap companies at the forefront of innovation, particularly in AI and technology. The article details its top holdings like NVIDIA, Microsoft, and Apple, its consistent outperformance against benchmarks such as the S&P 500, and its exceptionally low expense ratio. VUG is presented as a stable, diversified, and cost-effective vehicle for long-term wealth building, offering broad exposure to dynamic companies shaping the global economy.",
      "url": "https://finviz.com/news/164254/vanguards-vug-etf-the-ultimate-growth-etf-for-your-portfolio",
      "source": "Finviz",
      "published": "20250911T162200",
      "overall_sentiment_score": 0.678847,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.653444,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.89676
    },
    {
      "title": "VIDEO: ETF of the Week: JTEK",
      "summary": "This article features a discussion between Todd Rosenbluth and Chuck Jaffe about the JPMorgan U.S. Tech Leaders ETF (JTEK) as the \"ETF of the Week.\" They explore why JTEK, an actively managed ETF with over $2 billion in assets, is outperforming traditional tech-focused funds like QQQ, highlighting its unique approach to investing in \"tech-adjacent\" companies. The conversation also covers JTEK's holdings, including Nvidia, Snowflake, and Robinhood, and its role as a growth component in an investor's portfolio.",
      "url": "https://www.etftrends.com/video-etf-of-the-week-jtek/",
      "source": "ETF Trends",
      "published": "20250908T000000",
      "overall_sentiment_score": 0.386202,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.448069,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.894053
    },
    {
      "title": "5 Stocks to Buy Before the Fed Cuts Interest Rates",
      "summary": "Morningstar strategists discuss the economic outlook, including tariffs, inflation, jobs, and the Federal Reserve's potential interest rate cuts. They review recent company earnings for Nvidia, Marvell Technology, and Alphabet, and analyze stock picks like Bath & Body Works, Constellation Brands, and Kraft Heinz. The article concludes with five stock recommendations across real estate, homebuilding, building products, financials, and energy sectors that are positioned to benefit from falling interest rates.",
      "url": "https://www.morningstar.com/stocks/5-stocks-buy-before-fed-cuts-interest-rates-2",
      "source": "Morningstar",
      "published": "20250909T000000",
      "overall_sentiment_score": 0.006208,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.081759,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.888547
    },
    {
      "title": "50% Cost Savings: Beamr's AI Tech Transforms Live 720p Sports to 4K Quality Using NVIDIA Holoscan",
      "summary": "Beamr (NASDAQ: BMR) announced a demonstration of its real-time AI-powered 4K quality enhancement solution at IBC 2025 in Amsterdam. This technology, integrated with NVIDIA Holoscan for Media, can upscale low-resolution content to live 4K while crucially reducing CDN costs by up to 50%. The solution combines NVIDIA RTX Video Super Resolution with Beamr's Content-Adaptive Bitrate technology for optimized and efficient distribution of enhanced streams.",
      "url": "https://www.stocktitan.net/news/BMR/beamr-to-demonstrate-live-4k-quality-enhancement-with-nvidia-j6eit2axnqvi.html",
      "source": "Stock Titan",
      "published": "20250908T221013",
      "overall_sentiment_score": 0.295183,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.339411,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.884814
    },
    {
      "title": "IREN Limited anuncia parceria com a NVIDIA – Ações disparam!",
      "summary": "IREN Limited, uma empresa de centros de dados alimentados por energia renovável, investiu US$ 670 milhões na aquisição de GPUs NVIDIA e AMD para expandir sua plataforma de nuvem de IA. Este investimento quase dobrará sua capacidade computacional, com implantação em um data center de última geração no Canadá, e impulsionou as ações da empresa em mais de 7%. As ações da IREN subiram para mais de US$ 40 por ação após o anúncio, refletindo a confiança dos investidores na estratégia de crescimento da empresa no setor de IA.",
      "url": "https://www.xtb.com/pt/analise-de-mercado/noticias-de-mercado/iren-limited-anuncia-parceria-com-a-nvidia-acoes-disparam",
      "source": "XTB.com",
      "published": "20250922T135000",
      "overall_sentiment_score": 0.473785,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.657191,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.877621
    },
    {
      "title": "Oracle salta 36%, “ganha” US$ 244 bi e tem melhor sessão de 1992 com ânimo sobre IA",
      "summary": "Oracle's shares soared 36%, adding US$244 billion to its market value and marking its best session since 1992, driven by an aggressive outlook for its cloud business and strong demand for AI infrastructure. The company is emerging as a key provider of computational capacity for AI, signing massive contracts including a commitment with OpenAI for 4.5 gigawatts of data center capacity. Oracle's CEO, Safra Catz, projects significant growth in its cloud infrastructure unit, despite high investment costs in data centers.",
      "url": "https://www.infomoney.com.br/mercados/oracle-acao-salta-30-e-adiciona-us-200-bi-de-valor-com-otimismo-sobre-ia/",
      "source": "InfoMoney",
      "published": "20250910T174800",
      "overall_sentiment_score": 0.443684,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.615029,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.868571
    },
    {
      "title": "IWY ETF Price at $270.12: Outperformance Driven by Mega-Cap Tech",
      "summary": "The iShares Russell Top 200 Growth ETF (IWY) has climbed to $270.12, showcasing significant outperformance with a 25.34% yearly gain driven by its concentrated holdings in mega-cap tech giants like NVIDIA and Microsoft. The ETF is positioned to benefit from the AI capital expenditure supercycle and is projected to reach the $300-$310 range within the next year, despite its premium valuation. Its strategic weighting methodology balances concentration risk while leveraging strong growth prospects from its top holdings.",
      "url": "https://www.tradingnews.com/news/iwy-etf-climbs-to-270-usd-backed-by-nvidia-microsoft-and-ai-growth",
      "source": "TradingNEWS",
      "published": "20250915T222916",
      "overall_sentiment_score": 0.401504,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.430464,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.858152
    },
    {
      "title": "Super Micro Computer Inc. Began Shipping Systems Powered by NVIDIA Corporation (NVDA)",
      "summary": "Super Micro Computer Inc. (SMCI) has started shipping systems powered by NVIDIA Corporation's (NVDA) new Blackwell Ultra GPUs, including NVIDIA HGX B300 servers and GB300 NVL72 racks. These new systems offer significantly improved performance, liquid cooling for energy efficiency, and are expected to drive data center expansion due to global AI demand. NVIDIA Corporation designs cutting-edge GPUs and AI platforms across various markets, making it a key player in the AI industry.",
      "url": "https://finance.yahoo.com/news/super-micro-computer-inc-began-223759915.html",
      "source": "Yahoo Finance",
      "published": "20250922T000000",
      "overall_sentiment_score": 0.307753,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.29444,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.85781
    },
    {
      "title": "Oracle names Clay Magouyrk and Mike Sicilia as co-CEOs",
      "summary": "Oracle has appointed Clay Magouyrk and Mike Sicilia as co-CEOs, promoting them from presidents of cloud infrastructure and industries, respectively. Current CEO Safra Catz will transition to executive vice chair. This leadership change comes as Oracle benefits from the AI boom through its cloud infrastructure business and a significant increase in contracted revenue.",
      "url": "https://www.cnbc.com/2025/09/22/oracle-names-co-ceos.html",
      "source": "CNBC",
      "published": "20250922T080900",
      "overall_sentiment_score": 0.238114,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.424679,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.854351
    },
    {
      "title": "Super Micro’s stock is getting an Nvidia bump. Here’s the latest update.",
      "summary": "Super Micro Computer Inc.'s stock is experiencing a rally following the company's announcement that it has started shipping Nvidia Corp.’s Blackwell Ultra systems in volume. The stock has gained 10% over the past three sessions and rose an additional 4% in extended trading. Super Micro emphasizes its advantage in fast deployments of new Nvidia technologies.",
      "url": "https://www.marketwatch.com/story/super-micros-stock-is-getting-an-nvidia-bump-heres-the-latest-update-96f74aa7?gaa_at=eafs&gaa_n=AWEtsqcBSkwX-LmH_JWXe_WmopAAWMk0rr6tzAFKmFy9EeOuuEZ7Voc0VNGJ&gaa_ts=690748b3&gaa_sig=4qAd22aKgA6-miuEDk1Na3VfFuwr4WsHZf6vfKsatJqOs1Go2bgDIwlfUrIHYTypHiu4KUABWlMFy3MLBf7-kw%3D%3D",
      "source": "MarketWatch",
      "published": "20250911T183700",
      "overall_sentiment_score": 0.398774,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.349328,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.843148
    },
    {
      "title": "IREN Limited Announces Partnership with NVIDIA – Shares Surge!",
      "summary": "IREN Limited, a data center company powered by renewable energy, is significantly expanding its AI cloud platform by investing $670 million in NVIDIA and AMD GPUs, nearly doubling its computing power. This investment, combined with its new preferred partner status with NVIDIA, has led to IREN's shares surging over 7%, highlighting investor confidence in its strategic moves and strong financial performance in 2025. The company forecasts substantial annual revenue from its AI cloud services, affirming its position as a leader in renewable-powered AI infrastructure.",
      "url": "https://www.xtb.com/int/market-analysis/news-and-research/iren-limited-announces-partnership-with-nvidia-shares-surge",
      "source": "XTB.com",
      "published": "20250922T080915",
      "overall_sentiment_score": 0.787751,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.735803,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.833446
    },
    {
      "title": "Direxion's QQQU/QQQD ETFs Facilitate Speculation For Magnificent Seven Stocks",
      "summary": "Direxion offers two ETFs, QQQU and QQQD, for speculating on the \"Magnificent Seven\" stocks. The QQQU ETF is a leveraged bull fund tracking 200% of the Indxx Magnificent 7 Index, while the QQQD ETF provides 100% inverse performance for bearish investors. These ETFs allow traders to gain exposure to the Mag 7's performance without the complexities of options, though they carry unique risks such as higher volatility and suitability for short-term holding due to daily compounding effects.",
      "url": "https://www.sahmcapital.com/news/content/direxions-qqquqqqd-etfs-facilitate-speculation-for-magnificent-seven-stocks-2025-09-15",
      "source": "Sahm",
      "published": "20250915T144500",
      "overall_sentiment_score": 0.251374,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.400597,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.714294
    },
    {
      "title": "What Video Gaming and eSports Reveals About Thematic ETFs",
      "summary": "This article examines the evolution and performance of VanEck's Video Gaming and eSports UCITS ETF (ESPO) since its launch in 2019, highlighting its strong returns and the growth of the gaming industry. It discusses how thematic ETFs adapt to market changes, exemplified by shifts in ESPO's holdings, and emphasizes the importance of investment patience. The piece also delves into trends like mobile gaming, in-app monetization, and AI's impact on game development, while noting the slower-than-anticipated revenue growth in eSports.",
      "url": "https://www.vaneck.com/uk/en/blog/etf-insights/what-video-gaming-and-esports-reveals-about-thematic-etfs/",
      "source": "VanEck",
      "published": "20250911T000000",
      "overall_sentiment_score": 0.397726,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.419416,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.709583
    },
    {
      "title": "What Is Going On With Texas Instruments And Analog Devices Stocks On Monday?",
      "summary": "Texas Instruments and Analog Devices stocks dropped on Monday as China escalated its regulatory pressure on the U.S. semiconductor sector, launching new anti-dumping probes. This action, alongside an antitrust ruling against Nvidia, coincides with high-stakes U.S.-China trade talks in Madrid, intensifying geopolitical tensions affecting American chipmakers.",
      "url": "https://www.benzinga.com/markets/tech/25/09/47666977/what-is-going-on-with-texas-instruments-and-analog-devices-stocks-on-monday",
      "source": "Benzinga",
      "published": "20250915T093800",
      "overall_sentiment_score": -0.25649,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.236751,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.646285
    },
    {
      "title": "SK hynix shares hit 52-week high after Oracle rally",
      "summary": "SK hynix Inc. shares reached a 52-week high, trading at 313,500 won, boosted by an overnight rally in Oracle Corp. following its strong earnings outlook and significant jump in remaining performance obligations. This surge also positively impacted other Korean chipmakers like Samsung Electro-Mechanics Co., which also hit a record high after brokerages raised their target prices. The broader tech market saw gains with Nvidia and Broadcom also rising due to renewed optimism for AI infrastructure.",
      "url": "https://pulse.mk.co.kr/news/english/11416718",
      "source": "매일경제",
      "published": "20250911T111704",
      "overall_sentiment_score": 0.627729,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.512272,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.645992
    },
    {
      "title": "Dell Technologies: Silver Lake Partners IV sells $76.2 million in stock",
      "summary": "Silver Lake Group and its affiliates sold $76.2 million worth of Dell Technologies (NYSE:DELL) Class C Common Stock on September 15, 2025, with shares trading between $126.63 and $127.7. The company's stock has surged 36.5% in the past six months and is currently valued at $87.6 billion. Dell recently reported significant earnings, including $8.2 billion in AI server revenue, and increased its fiscal 2026 outlook.",
      "url": "https://www.investing.com/news/insider-trading-news/dell-technologies-silver-lake-partners-iv-sells-762-million-in-stock-93CH-4243666",
      "source": "Investing.com",
      "published": "20250917T120758",
      "overall_sentiment_score": 0.009391,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.114703,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.643238
    },
    {
      "title": "Next Technology Rocketed 38% Today – Here’s What Retail Investors Feel About The Stock",
      "summary": "Next Technology (NXTT) stock surged over 38% and saw a 1,719% increase in user message count on Stocktwits, reflecting extremely bullish retail sentiment. The company, which combines AI with digital assets, significantly increased its Bitcoin holdings, from 833 Bitcoin in late 2024 to 5,833 Bitcoin by mid-2025. Despite recent losses in its stock value this year, investors are optimistic, especially given the rise in Bitcoin's price.",
      "url": "https://stocktwits.com/news-articles/markets/equity/next-technology-stock-rocketed-38-percent-today/chwN8jSRdvt",
      "source": "Stocktwits",
      "published": "20250911T123300",
      "overall_sentiment_score": 0.065981,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.325987,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.641817
    },
    {
      "title": "Micron Technology and Wendy's have been highlighted as Zacks Bull and Bear of the Day",
      "summary": "Zacks Equity Research has named Micron Technology (MU) as the Bull of the Day due to its critical role and strong growth prospects in the AI data center buildout, with a \"Strong Buy\" rating and robust earnings acceleration predicted. Conversely, Wendy’s (WEN) has been designated as the Bear of the Day, facing stagnant sales, a plummeting stock price, and downward earnings revisions, leading to a \"Strong Sell\" rating. The article also touches upon the rebounding U.S. IPO market in 2025, highlighting ETFs like Renaissance IPO ETF (IPO) and First Trust US Equity Opportunities ETF (FPX) as potential beneficiaries.",
      "url": "https://www.tradingview.com/news/zacks:6d18f990a094b:0-micron-technology-and-wendy-s-have-been-highlighted-as-zacks-bull-and-bear-of-the-day/",
      "source": "TradingView",
      "published": "20250915T100932",
      "overall_sentiment_score": 0.464676,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.375094,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.641321
    },
    {
      "title": "Erayak Power Solution Faces Nasdaq Delisting Notice",
      "summary": "Erayak Power Solution Group Inc. (RAYA) has received a delisting notice from Nasdaq due to non-compliance with the Low Priced Stocks Rule, as its securities traded below $0.10 for ten consecutive days. The company plans to appeal the delisting decision by September 10, 2025, and is considering a reverse stock split to regain compliance. Erayak specializes in power supply products like inverters and generators for various applications.",
      "url": "https://www.theglobeandmail.com/investing/markets/stocks/RAYA/pressreleases/34717817/erayak-power-solution-faces-nasdaq-delisting-notice/",
      "source": "The Globe and Mail",
      "published": "20250910T090902",
      "overall_sentiment_score": -0.32188,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.210459,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.639189
    },
    {
      "title": "Elon Musk buys millions of Tesla shares and the Austin company’s stock jumps",
      "summary": "Elon Musk purchased approximately $1 billion worth of Tesla shares, totaling over 2.5 million shares, in response to a proposed trillion-dollar pay package and to signal confidence in the company's future. This acquisition caused Tesla's stock price to jump, helping it recover to a 1.5% year-to-date gain after an earlier 45% decline. The stock purchase also moves Musk closer to the ambitious benchmarks set by the Tesla board for his pay package, which could eventually require the company's market value to reach $8.5 trillion.",
      "url": "https://www.expressnews.com/business/article/elon-musk-tesla-shares-billion-dollar-pay-proposal-21048659.php",
      "source": "San Antonio Express-News",
      "published": "20250915T095300",
      "overall_sentiment_score": 0.187312,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.138948,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.636633
    },
    {
      "title": "Oracle shocks investors with massive future revenue AI deals",
      "summary": "Oracle's shares skyrocketed by 42% despite missing Wall Street revenue expectations, driven by the announcement of several multi-billion-dollar AI-related cloud deals. The company reported $14.93 billion in revenue and touted significant contracts with major AI players like OpenAI, xAI, and Meta, with future revenue obligations soaring to $455 billion. Founder Larry Ellison's net worth increased by $100 billion, briefly making him the world's richest person.",
      "url": "https://www.statesman.com/business/technology/article/oracle-misses-estimates-touts-30b-openai-cloud-21037474.php",
      "source": "Austin American-Statesman",
      "published": "20250909T000000",
      "overall_sentiment_score": 0.415901,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.309456,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.635396
    },
    {
      "title": "Dropbox Secures $700M Loan, Announces Share Buyback",
      "summary": "Dropbox (DBX) has announced an amendment to its Credit and Guaranty Agreement, securing an additional $700 million in delayed draw term loans to address convertible senior notes due in 2026. Concurrently, the company authorized a new $1.5 billion share repurchase program for its Class A common stock. TipRanks' AI Analyst, Spark, rates DBX as Neutral, noting strong technical momentum and strategic moves but tempered by financial instability and declining revenue growth.",
      "url": "https://www.theglobeandmail.com/investing/markets/stocks/DBX/pressreleases/34719733/dropbox-secures-700m-loan-announces-share-buyback/",
      "source": "The Globe and Mail",
      "published": "20250910T060945",
      "overall_sentiment_score": -0.078794,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.130855,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.633929
    },
    {
      "title": "B2Gold Corp stock hits 52-week high at 4.34 USD",
      "summary": "B2Gold Corp's stock has reached a 52-week high of $4.34, reflecting a 58% increase over the past year and a 64% gain in the last six months. The company, with a market cap of $5.72 billion, appears undervalued according to InvestingPro analysis, which also indicates expected revenue growth of 66% this year and includes 12 additional investment insights. This milestone highlights strong investor confidence and favorable market conditions.",
      "url": "https://www.investing.com/news/company-news/b2gold-corp-stock-hits-52week-high-at-434-usd-93CH-4234102",
      "source": "Investing.com",
      "published": "20250910T131900",
      "overall_sentiment_score": 0.075466,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.33873,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.631069
    },
    {
      "title": "Jim Cramer on International Business Machines: “I Think You Should Actually Buy More”",
      "summary": "Jim Cramer recommends buying more International Business Machines (NYSE: IBM) stock, despite its recent decline, viewing the dip as a buying opportunity. He expresses confidence in CEO Arvind Krishna's performance and highlights the stock's valuation at 22 times earnings. The article also mentions that while IBM is a valid investment, the author's conviction lies in other AI stocks with potentially higher and faster returns.",
      "url": "https://www.insidermonkey.com/blog/jim-cramer-on-international-business-machines-i-think-you-should-actually-buy-more-1610997/",
      "source": "Insider Monkey",
      "published": "20250918T232500",
      "overall_sentiment_score": 0.248457,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.185341,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.624704
    },
    {
      "title": "Super Micro’s stock is getting an Nvidia bump. Here’s the latest update.",
      "summary": "Super Micro Computer Inc.'s stock is experiencing a rally, poised for a fourth straight day of gains following a positive business update. The company announced it has started shipping Nvidia Corp.'s Blackwell Ultra systems in volume. This news contributed to a 4% rise in its stock during the extended session and a 10% rally over the past three sessions.",
      "url": "https://www.marketwatch.com/story/super-micros-stock-is-getting-an-nvidia-bump-heres-the-latest-update-96f74aa7?gaa_at=eafs&gaa_n=AWEtsqeRWQsmcqET6CY47G5WzFUIzZjg-LCnOX7hEHlyl7hvtjmJyLtSsHOr&gaa_ts=6907479a&gaa_sig=_lJYEDjUOrmMcFMdPGXV7Hzswp2Zrgqnqz-um1xow2iUkqGuaci3iofSsUAQZB3ZHWwSZuk4sk3I77ELkia2Xw%3D%3D",
      "source": "MarketWatch",
      "published": "20250911T183700",
      "overall_sentiment_score": 0.385468,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.304993,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.62343
    },
    {
      "title": "What’s Driving Baidu to New Heights?",
      "summary": "Baidu Inc.'s stock surged by 7.9% due to promising AI advancements, including the use of self-developed AI chips and the introduction of their ERNIE X1.1 reasoning model, which boasts improvements over rivals. Despite a neutral outlook from Susquehanna due to mixed Q2 results, Baidu is strategically restructuring its finances with a $617.6M senior notes offering and focusing on robust AI cloud growth. The company's strong financial metrics, including $18.96B revenue and a P/E ratio of 12.4, along with high ROA and ROE, position it well for future growth in the dynamic tech market.",
      "url": "https://stockstotrade.com/news/baidu-inc-bidu-news-2025_09_16-2/",
      "source": "StocksToTrade",
      "published": "20250916T160400",
      "overall_sentiment_score": 0.392807,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.138348,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.623093
    },
    {
      "title": "ZyVersa Therapeutics to be delisted from Nasdaq, continues trading on OTCQB",
      "summary": "ZyVersa Therapeutics (OTCQB:ZVSA) announced that Nasdaq will formally delist its common stock due to non-compliance with minimum bid price requirements. While delisted from Nasdaq, the company's shares will continue to trade on the OTCQB Venture Market under the symbol ZVSA. In parallel, ZyVersa is advancing its clinical trials and has secured $12 million in financing for its research and development programs.",
      "url": "https://www.investing.com/news/sec-filings/zyversa-therapeutics-to-be-delisted-from-nasdaq-continues-trading-on-otcqb-93CH-4244533",
      "source": "Investing.com",
      "published": "20250918T071900",
      "overall_sentiment_score": -0.201094,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": 0.2293,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.622411
    },
    {
      "title": "QQQ ETF: Hơn cả một chiếc rổ cổ phiếu công nghệ",
      "summary": "QQQ ETF (Invesco QQQ ETF) mô phỏng hiệu suất của chỉ số NASDAQ-100, bao gồm 100 công ty phi tài chính lớn nhất trên Nasdaq, chủ yếu là các công ty công nghệ hàng đầu như Apple, Microsoft, Amazon và Nvidia. Quỹ này thu hút nhà đầu tư toàn cầu nhờ khả năng tiếp cận nhanh chóng với các cổ phiếu tăng trưởng mạnh trong ngành công nghệ, phù hợp với những nhà đầu tư có khẩu vị rủi ro trung bình đến cao và tầm nhìn dài hạn, mặc dù đi kèm với rủi ro tập trung cao và biến động mạnh. Bài viết cũng so sánh QQQ với các biến thể QQQM và QQQJ, cung cấp cái nhìn chi tiết về cấu trúc danh mục, hiệu suất, chi phí và rủi ro liên quan, giúp nhà đầu tư đưa ra quyết định phù hợp với mục tiêu tài chính cá nhân.",
      "url": "https://www.ebc.com/vi/forex/268747.html",
      "source": "EBC Financial Group",
      "published": "20250916T020939",
      "overall_sentiment_score": 0.342586,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.405928,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.611537
    },
    {
      "title": "Oracle shares climb on reports it could ink $20B cloud deal with Meta",
      "summary": "Oracle shares climbed 4% following reports it is negotiating a potential $20 billion cloud infrastructure deal with Meta Platforms Inc. for AI training and inference. This news comes after a previous agreement with OpenAI for data center capacity and highlights Oracle's growing role in meeting the surging demand for AI infrastructure, contributing to an over 80% rise in its stock this year. Meta may also consider incorporating its internally developed AI chips into the proposed cloud architecture.",
      "url": "https://siliconangle.com/2025/09/19/oracle-shares-climb-reports-ink-20b-cloud-deal-meta/",
      "source": "SiliconANGLE",
      "published": "20250919T194400",
      "overall_sentiment_score": 0.22232,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.142552,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.611107
    },
    {
      "title": "What you need to know about the government’s 10% stake in Intel",
      "summary": "The U.S. government has taken a 10% stake in Intel, a move that experts believe raises questions about its influence on other businesses and markets. This investment, unlike previous government interventions, is not to prevent an immediate corporate failure but to secure the supply of critical computer chips amid national security concerns. The decision has garnered both support and criticism, with debates centering on its economic implications and potential for politicization.",
      "url": "https://www.pbs.org/newshour/politics/what-economic-and-policy-experts-think-about-the-u-s-governments-stake-in-intel",
      "source": "PBS",
      "published": "20250919T162000",
      "overall_sentiment_score": 0.156763,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.109335,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.609401
    },
    {
      "title": "Ault Alliance rebrands as Hyperscale Data, eyes data center growth",
      "summary": "Ault Alliance, Inc. has rebranded as Hyperscale Data, Inc. (NYSE American: GPUS) to reflect its strategic focus on data center operations, particularly expanding its Michigan AI data center capacity from 30 to 300 megawatts. This move aligns with growing demand for AI infrastructure, despite the company facing significant debt and cash burn challenges highlighted by InvestingPro. Stockholders do not need to take action regarding the rebranding.",
      "url": "https://www.investing.com/news/company-news/ault-alliance-rebrands-as-hyperscale-data-eyes-data-center-growth-93CH-3606719",
      "source": "Investing.com",
      "published": "20250909T230948",
      "overall_sentiment_score": 0.171756,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.346767,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.608765
    },
    {
      "title": "BioSig Technologies Rebrands to Streamex Corp.",
      "summary": "BioSig Technologies has rebranded to Streamex Corp., effective September 12, 2025, with the new Nasdaq ticker symbol 'STEX'. This change follows a merger with Streamex Exchange Corporation and aims to expand the company's business model by integrating tokenization technology, particularly in the commodities market. Despite this strategic move, an AI analyst from TipRanks classifies the stock as Underperform due to significant financial difficulties.",
      "url": "https://www.theglobeandmail.com/investing/markets/stocks/BSGM/pressreleases/34782140/biosig-technologies-rebrands-to-streamex-corp/",
      "source": "The Globe and Mail",
      "published": "20250912T044057",
      "overall_sentiment_score": 0.043578,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.028453,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.608707
    },
    {
      "title": "Infleqtion to Go Public Through Merger with Churchill Capital Corp X",
      "summary": "Infleqtion, a leader in neutral atom-based quantum technology, will go public through a merger with Churchill Capital Corp X (NASDAQ: CCCX). This partnership aims to accelerate Infleqtion's mission to commercialize quantum products, supported by over $540 million in gross transaction proceeds including $125 million in incremental financing. The combined company will operate as Infleqtion and is expected to be listed on a North American exchange under the ticker “INFQ,” unlocking new applications in AI, national security, and space.",
      "url": "https://www.businesswire.com/news/home/20250907554013/en/Infleqtion-to-Go-Public-Through-Merger-with-Churchill-Capital-Corp-X",
      "source": "Business Wire",
      "published": "20250908T041137",
      "overall_sentiment_score": 0.387533,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.375605,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.607919
    },
    {
      "title": "WaterBridge prices upsized IPO at $20 per share, to begin trading Wednesday",
      "summary": "WaterBridge Infrastructure LLC has priced its upsized initial public offering of 31.7 million Class A shares at $20.00 per share, aiming to raise approximately $588 million in net proceeds. The shares will begin trading Wednesday on the NYSE and NYSE Texas under the ticker \"WBI,\" with the company operating the largest produced water infrastructure network in the United States. Despite robust operational efficiency and revenue, financial metrics suggest the company is not yet profitable, as highlighted by InvestingPro.",
      "url": "https://www.investing.com/news/company-news/waterbridge-prices-upsized-ipo-at-20-per-share-to-begin-trading-wednesday-93CH-4241389",
      "source": "Investing.com",
      "published": "20250916T220932",
      "overall_sentiment_score": -0.138769,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.330122,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.606478
    },
    {
      "title": "Newegg Stock Soars: Buy Now?",
      "summary": "Newegg Commerce Inc. (NASDAQ: NEGG) stock has soared by 18.53% due to positive investor response to strategic gains in the first half of 2025, including a narrower net loss and increased sales. The company introduced a \"Gamer Zone\" and saw significant growth in GMV and net sales, along with insider buying, indicating strong confidence in its future performance and a promising recovery path.",
      "url": "https://stockstotrade.com/news/newegg-commerce-inc-negg-news-2025_09_12/",
      "source": "StocksToTrade",
      "published": "20250912T180400",
      "overall_sentiment_score": 0.339175,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.341615,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.603471
    },
    {
      "title": "YieldMax RDDT Option Income Strategy ETF (NYSE:NVTX) Stock Quote",
      "summary": "This article provides a detailed stock quote for the YieldMax RDDT Option Income Strategy ETF (NYSE: NVTX), including current price, trading volume, ranges, dividend yield, and performance metrics. It also features top news headlines related to ETFs, such as the impact of AI on chip stocks and new leveraged single-stock ETF launches.",
      "url": "https://markets.financialcontent.com/stocks/quote?Symbol=NY%3ANVTX",
      "source": "Markets Financial Content",
      "published": "20250918T050113",
      "overall_sentiment_score": 0.328508,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.322259,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.593005
    },
    {
      "title": "Occidental Petroleum Stock: Recovery Potential or Value Trap?",
      "summary": "Occidental Petroleum's stock has underperformed the S&P 500 significantly this year due to lower oil prices and high debt, despite strong operations. The company shows financial flexibility with high-margin Permian Basin production and debt reduction efforts, but faces risks from volatile oil prices and environmental liabilities. Investors are left to weigh its historical resilience against ongoing market volatility and debt levels.",
      "url": "https://www.trefis.com/stock/oxy/articles/574972/occidental-petroleum-stock-recovery-potential-or-value-trap/2025-09-12",
      "source": "Trefis",
      "published": "20250912T140834",
      "overall_sentiment_score": 0.202736,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.007383,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.589131
    },
    {
      "title": "Starbucks Ruined by CEO Niccol",
      "summary": "Starbucks CEO Brian Niccol's first year has seen the company's stock underperform significantly compared to the S&P 500, with revenue growth off track and comparable store sales declining. Despite various operational changes and a plan for China expansion, Niccol's efforts have not yet resulted in a turnaround for Starbucks, facing challenges like shaky consumer spending and increased competition in key markets. The article questions whether these strategies will improve financial metrics in upcoming quarterly results.",
      "url": "https://247wallst.com/investing/2025/09/19/starbucks-ruined-by-ceo-niccol/",
      "source": "24/7 Wall St.",
      "published": "20250919T091500",
      "overall_sentiment_score": -0.020844,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.275261,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.579352
    },
    {
      "title": "Asset Entities Approves Merger with Strive Enterprises",
      "summary": "Asset Entities Inc. (ASST) stockholders have approved a merger with Strive Enterprises, Inc., creating a new entity named Strive, Inc. set to trade under the ticker ASST on Nasdaq. This strategic move aims to establish a leading public Bitcoin Treasury Company, maximize Bitcoin per share for investors, and is expected to close around September 12, 2025, pending a private placement financing exceeding $750 million. Asset Entities is a technology company specializing in social media marketing and content delivery.",
      "url": "https://www.theglobeandmail.com/investing/markets/stocks/ASST/pressreleases/34732707/asset-entities-approves-merger-with-strive-enterprises/",
      "source": "The Globe and Mail",
      "published": "20250910T050938",
      "overall_sentiment_score": -0.034145,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.237145,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.561438
    },
    {
      "title": "Quanterix CFO Sriram buys $19,878 in company stock",
      "summary": "Quanterix CFO Vandana Sriram purchased 4,150 shares of the company's common stock for $19,878 on September 12, 2025, according to an SEC filing. This transaction brings Sriram's direct ownership to 87,200 shares, including restricted stock units, and occurs as the stock trades below its Fair Value despite recent gains. The purchase follows Quanterix's Q2 2025 earnings miss and a downgrade by Canaccord Genuity, though the company recently expanded its biomarker research capabilities with a new clinical laboratory permit in New York.",
      "url": "https://www.investing.com/news/insider-trading-news/quanterix-cfo-sriram-buys-19878-in-company-stock-93CH-4242717",
      "source": "Investing.com",
      "published": "20250917T102800",
      "overall_sentiment_score": 0.12779,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.276562,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.561262
    },
    {
      "title": "Synopsys Stock Surge: A Deep Dive",
      "summary": "Synopsys Inc. (NASDAQ: SNPS) shares surged 11.8% due to investor optimism fueled by new strategic partnerships, robust earnings growth forecasts, and the crucial acquisition of Ansys. The company's strategic foresight is also evident in its collaborative educational efforts and embrace of AI, reinforcing its market position despite a recent earnings miss. Analysts maintain an optimistic long-term outlook, highlighting strong profitability and liquidity.",
      "url": "https://stockstotrade.com/news/synopsys-inc-snps-news-2025_09_11/",
      "source": "StocksToTrade",
      "published": "20250911T140300",
      "overall_sentiment_score": 0.1892,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.108573,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.336718
    }
  ]
}