{
  "ticker": "NVDA",
  "date": "2025-03-17",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T11:36:43.225707",
  "source": "alpha_vantage",
  "article_count": 19,
  "articles": [
    {
      "title": "OSRH Stock Plummets to 52-Week Low at $1.31 Amid Market Challenges",
      "summary": "Bellevue Life Sciences Acquisition Corp. (OSRH) stock has fallen to a new 52-week low of $1.31, reflecting tumultuous market conditions and an oversold RSI. The company’s market capitalization is now $25.6 million, with a one-year return of -86.51% and a YTD return of -87.55%. In other news, OSR Holdings secured an equity financing agreement with White Lion GBM Innovation Fund, allowing it to sell up to $80 million in common stock to White Lion to enhance its financial flexibility in the medical device industry.",
      "url": "https://www.investing.com/news/company-news/osrh-stock-plummets-to-52week-low-at-131-amid-market-challenges-93CH-3932756",
      "source": "Investing.com",
      "published": "20250317T045244",
      "overall_sentiment_score": -0.040893,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.108499,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.57821
    },
    {
      "title": "Tidal Trust II - STKd 100% SMCI & 100% NVDA ETF",
      "summary": "This article provides technical information for the Tidal Trust II - STKd 100% SMCI & 100% NVDA ETF (SPCY), including its current price and daily performance. It lists the ETF's ticker symbol and mentions its components, Super Micro Computer (SMCI) and NVIDIA (NVDA). The content also shows market data for major indices like the SPX, Dow 30, QQQ, and VIX.",
      "url": "https://www.cmlviz.com/stocks/SPCY/pivot-points",
      "source": "CMLviz",
      "published": "20250314T160910",
      "overall_sentiment_score": 0.368084,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.322264,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.94117
    },
    {
      "title": "Intel Appoints Lip-Bu Tan as Chief Executive Officer",
      "summary": "Intel Corporation announced the appointment of Lip-Bu Tan as its new Chief Executive Officer, effective March 18, 2025. Tan, a seasoned technology leader with significant semiconductor industry experience, will also rejoin Intel's board of directors. He succeeds Interim Co-CEOs David Zinsner and Michelle (MJ) Johnston Holthaus, who will return to their previous executive roles.",
      "url": "https://newsroom.intel.com/corporate/intel-appoints-lip-bu-tan-chief-executive-officer",
      "source": "Intel Newsroom",
      "published": "20250312T000000",
      "overall_sentiment_score": 0.363268,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.344238,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.626
    },
    {
      "title": "Johnson & Johnson MedTech wins FDA nod for enhanced robotic-assisted bronchoscopy",
      "summary": "Johnson & Johnson MedTech received FDA clearance for its Monarch Quest technology, an enhanced robotic-assisted bronchoscopy system. This new iteration features AI-powered algorithms and integration with GE HealthCare's OEC 3D mobile CBCT imaging system, aiming to improve accuracy and speed in diagnosing lung cancer by better targeting suspicious lung nodules. The technology represents an advancement in minimally invasive access and visualization of airways for earlier and more definitive diagnoses.",
      "url": "https://www.massdevice.com/johnson-johnson-medtech-fda-robot-bronchoscopy/",
      "source": "MassDevice",
      "published": "20250312T000000",
      "overall_sentiment_score": 0.417427,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.301708,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.612376
    },
    {
      "title": "Bank of America stock hits 52-week high at 53.64 USD",
      "summary": "Bank of America's stock reached a 52-week high of $53.64, driven by a 29.71% increase over the past year and strong investor confidence. This performance follows a solid third-quarter revenue report and increased adoption of its AI-powered financial tools. The bank also made significant executive appointments and its analysts commented on market-influencing investment deals.",
      "url": "https://www.investing.com/news/company-news/bank-of-america-stock-hits-52week-high-at-5364-usd-93CH-4328401",
      "source": "Investing.com",
      "published": "20250311T155600",
      "overall_sentiment_score": 0.382089,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.32899,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.615555
    },
    {
      "title": "Board Approves Termination of Investment Sub-Advisory Agreement for First Trust TCW Securitized Plus ETF",
      "summary": "First Trust Advisors L.P. announced that the Board of Trustees of First Trust Exchange-Traded Fund VIII voted to terminate the investment sub-advisory agreement for the First Trust TCW Securitized Plus ETF, effective May 9, 2025. First Trust Advisors L.P. will assume portfolio management responsibilities for the Fund, maintaining existing investment strategies. The company, along with its affiliate First Trust Portfolios L.P., manages approximately $266 billion in collective assets.",
      "url": "https://markets.financialcontent.com/lethbridgeherald/article/bizwire-2025-3-11-board-approves-termination-of-investment-sub-advisory-agreement-for-first-trust-tcw-securitized-plus-etf",
      "source": "FinancialContent",
      "published": "20250311T080000",
      "overall_sentiment_score": 0.12548,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.1333,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.648812
    },
    {
      "title": "Why FPA Global Equity ETF Is Worth Considering",
      "summary": "The FPA Global Equity ETF (FPAG) is highlighted as a promising active ETF that is essentially a carve-out of FPA Crescent's equity portfolio. Managed by Brian Selmo and Mark Landecker, it focuses on 30-50 value-oriented, quality-focused stocks, differing from its benchmark by being fully invested and sometimes overweighting sectors like communication services. While it has outperformed its prospectus benchmark and category benchmark since its December 2021 launch, its fully invested nature means higher volatility and less downside protection during downturns but better participation in rising markets.",
      "url": "https://www.morningstar.com/funds/why-fpa-global-equity-etf-is-worth-considering",
      "source": "Morningstar",
      "published": "20250310T000000",
      "overall_sentiment_score": 0.33986,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.220232,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.627082
    },
    {
      "title": "Malaysia-Arm Deal To Drive Semiconductor Growth",
      "summary": "Malaysia's partnership with United Kingdom-based Arm Holdings Plc (ARM) involves a US$250 million investment to develop proprietary intellectual property (IP) for integrated circuit (IC) design, aiming to elevate Malaysia into a high-value economy and foster local semiconductor firm growth. This collaboration, believed to be the world's first between a nation and a technology giant for IP development, is expected to accelerate the formation of front-end semiconductor firms and help achieve a semiconductor export target of RM1.2 trillion by 2030. Industry analysts have offered mixed outlooks, with some maintaining 'neutral' stances due to current market conditions but acknowledging long-term positive spillover effects for the technology sector.",
      "url": "https://bernama.com/en/news.php?id=2399611",
      "source": "BERNAMA - Malaysian National News Agency",
      "published": "20250306T034300",
      "overall_sentiment_score": 0.346988,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.31011,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.57445
    },
    {
      "title": "Himax Technologies, Tata Electronics, and PSMC Sign MoU Boosting India’s Ultralow Power AI Sensing Market",
      "summary": "Himax Technologies, Tata Electronics, and PSMC have signed a Memorandum of Understanding (MoU) to significantly boost India's ultralow power AI sensing and display semiconductor market. This collaboration, announced at the IESA Vision Summit 2025, aims to strengthen India's position in semiconductor manufacturing, aligning with the \"Made in India\" initiative. The partnership will involve Tata Electronics establishing a manufacturing unit, Himax contributing its WiseEye™ AI sensing technology, and PSMC providing fabrication expertise, fostering innovation, job creation, and economic growth in the sector.",
      "url": "https://cio.eletsonline.com/news/himax-technologies-tata-electronics-and-psmc-sign-mou-boosting-indias-ultralow-power-ai-sensing-market/74201/",
      "source": "Elets CIO",
      "published": "20250306T000952",
      "overall_sentiment_score": 0.376675,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.308007,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.634273
    },
    {
      "title": "Anthropic Stake for the Masses Is Latest ETF Industry Gambit",
      "summary": "KraneShares has acquired a direct stake in Anthropic, a privately held AI company and competitor to OpenAI, through one of its exchange-traded funds. This move combines the surging interest in artificial intelligence with the growing trend of offering private assets to a broader investment audience. Anthropic recently secured funding at a valuation exceeding $60 billion.",
      "url": "https://www.bloomberg.com/news/articles/2025-03-04/anthropic-stake-for-the-masses-is-latest-etf-industry-gambit",
      "source": "Bloomberg.com",
      "published": "20250304T123000",
      "overall_sentiment_score": 0.293079,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.22645,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.634271
    },
    {
      "title": "Cerence Inc. Launches Cerence xUI, Innovative AI Assistant Platform for Next-Generation In-Vehicle User Experiences",
      "summary": "Cerence Inc. has launched Cerence xUI™, an AI assistant platform designed to enhance in-vehicle user experiences through conversational AI, leveraging both edge and cloud technologies. This platform, developed in collaboration with NVIDIA and Microsoft, utilizes the CaLLM™ family of large language models to offer personalized and engaging automotive voice interactions. Cerence xUI allows automakers flexible integration options for new and existing vehicles, promising advanced performance, reduced latency, enhanced privacy, and cost efficiency.",
      "url": "https://www.nasdaq.com/articles/cerence-inc-launches-cerence-xui-innovative-ai-assistant-platform-next-generation-vehicle",
      "source": "Nasdaq",
      "published": "20250313T084300",
      "overall_sentiment_score": 0.337102,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.328748,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.61069
    },
    {
      "title": "Is it time to buy the Magnificent Seven?",
      "summary": "The \"Magnificent Seven\" tech stocks have experienced a significant selloff, making some of them appear undervalued according to Morningstar's fair value metrics. While Meta, Amazon, Microsoft, and Alphabet are now rated as buys, Nvidia and Tesla are fairly valued, and Apple remains overvalued. Morningstar strategists still recommend underweighting growth stocks overall, favoring value stocks due to market volatility and slowing economic growth.",
      "url": "https://www.morningstar.com.au/stocks/is-it-time-to-buy-the-magnificent-seven",
      "source": "Morningstar",
      "published": "20250312T000000",
      "overall_sentiment_score": 0.265983,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.148306,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.725297
    },
    {
      "title": "Oracle Reports Lackluster Results, Damping Cloud Enthusiasm",
      "summary": "Oracle Corp. reported disappointing quarterly results and a lower-than-expected sales and profit forecast for the current quarter, causing its stock to fall. Despite this, the company projects significant revenue growth in the next two fiscal years driven by its expanding cloud infrastructure business and artificial intelligence partnerships. The report also highlighted substantial capital expenditures on data centers and continued strong demand in the AI sector.",
      "url": "https://finance.yahoo.com/news/oracle-gives-strong-outlook-fueling-204213283.html",
      "source": "Yahoo Finance",
      "published": "20250311T000000",
      "overall_sentiment_score": 0.078,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.306876,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.624771
    },
    {
      "title": "Signs of AI Slowdown Could Be Evident in Nvidia, Palantir",
      "summary": "Recent price weakness in Nvidia and Palantir may indicate a potential slowdown in the AI market, despite continued integration of AI technology in various industries. This suggests that the initial AI hype might have already been priced into these stocks, leading to muted responses even to positive earnings reports. The article provides trading options for investors looking to capitalize on either bullish or bearish movements in these AI-related stocks.",
      "url": "https://etfdb.com/leveraged-inverse-content-hub/ai-slowdown-may-be-evident-nvidia-palantir/",
      "source": "ETF Database",
      "published": "20250307T170127",
      "overall_sentiment_score": 0.052251,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.240893,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.980004
    },
    {
      "title": "YMAX ETF: Diversification Risk Hurts Income Prospect (NYSEARCA:YMAX)",
      "summary": "The YieldMax Universe Fund of Option Income ETFs (YMAX) offers a high yield of 57% by diversifying across other YieldMax income funds, but this strategy leads to Net Asset Value (NAV) decline. The fund's use of synthetic covered calls and the impact of underlying stock movements on its holdings cause NAV erosion, making it less ideal for stable income or total returns. Investors seeking better performance might consider individual YieldMax funds rather than the diversified YMAX.",
      "url": "https://seekingalpha.com/article/4765533-ymax-etf-diversification-risk-hurts-income-prospect",
      "source": "Seeking Alpha",
      "published": "20250306T210925",
      "overall_sentiment_score": -0.119837,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.040248,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.60205
    },
    {
      "title": "Semrush CEO Oleg Shchegolev sells $368,509 in company stock",
      "summary": "Oleg Shchegolev, CEO of SEMrush Holdings, Inc. (NASDAQ:SEMR), sold 32,932 shares totaling $368,509 to cover tax obligations from restricted stock units vesting. This was not a discretionary trade, and Shchegolev retains significant direct and indirect ownership in the company. Semrush reported strong Q4 2024 earnings and positive Q1 2025 guidance, and announced leadership changes with Bill Wagner becoming CEO and Shlagle transitioning to CTO.",
      "url": "https://www.investing.com/news/insider-trading-news/semrush-ceo-oleg-shchegolev-sells-368509-in-company-stock-93CH-3910608",
      "source": "Investing.com",
      "published": "20250305T060100",
      "overall_sentiment_score": -0.112365,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.128648,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.637726
    },
    {
      "title": "GE Healthcare stock hits 52-week low at $74.5 amid market challenges",
      "summary": "GE Healthcare (NASDAQ: GEHC) stock has dropped to a 52-week low of $74.5, reflecting a 16.48% decline over the past year despite being considered undervalued with oversold RSI conditions. Amid a challenging healthcare landscape, analysts maintain a positive outlook with price targets ranging from $74 to $115, and the company is actively innovating with new product launches and strategic partnerships. Recent developments include a cash dividend declaration, the introduction of the Revolution Vibe CT system, a collaboration with NVIDIA for AI-powered imaging, and the unveiling of the cloud-based Genesis portfolio.",
      "url": "https://www.investing.com/news/company-news/ge-healthcare-stock-hits-52week-low-at-745-amid-market-challenges-93CH-3965578",
      "source": "Investing.com",
      "published": "20250304T095700",
      "overall_sentiment_score": 0.008222,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.242069,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.617216
    },
    {
      "title": "Morgan Stanley sets $12 target for Aurora Innovation stock",
      "summary": "Morgan Stanley has initiated coverage of Aurora Innovation Inc. (NASDAQ: AUR) with an Overweight rating and a $12 price target, citing confidence in the company's autonomous trucking technology leadership. The firm's analysis highlights Aurora's strong market position, upcoming commercial driverless operation in April, and significant growth potential, although it also notes the stock's high market sensitivity and a slight overvaluation based on current InvestingPro data. This follows recent positive news including strong financial results, a partnership with Continental and Nvidia, and a maintained Overweight rating from Cantor Fitzgerald.",
      "url": "https://www.investing.com/news/analyst-ratings/morgan-stanley-sets-12-target-for-aurora-innovation-stock-93CH-3901652",
      "source": "Investing.com",
      "published": "20250303T095852",
      "overall_sentiment_score": 0.530749,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.338522,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.626186
    },
    {
      "title": "ServiceNow’s newest AI agents bring intelligent automation to telecommunications firms",
      "summary": "ServiceNow has introduced new AI agents at MWC25, developed with Nvidia, to bring intelligent automation to telecommunications firms. These agents aim to boost productivity for Communication Service Providers by autonomously solving problems in customer service and network operations, building upon the existing Now Assist for Telecommunications Service Management platform. The integrated system promises to enhance customer experiences, streamline billing, and free up human engineers for higher-level work.",
      "url": "https://siliconangle.com/2025/03/03/servicenows-newest-ai-agents-bring-intelligent-automation-telecommunications-firms/",
      "source": "SiliconANGLE",
      "published": "20250303T000000",
      "overall_sentiment_score": 0.396894,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.32761,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.84097
    }
  ]
}