{
  "ticker": "NVDA",
  "date": "2025-01-13",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T11:36:01.475427",
  "source": "alpha_vantage",
  "article_count": 50,
  "articles": [
    {
      "title": "NVIDIA Statement on the Biden Administration’s Misguided ‘AI Diffusion’ Rule",
      "summary": "NVIDIA expresses strong disapproval of the Biden Administration's new \"AI Diffusion\" rule, arguing it will stifle innovation and economic growth by restricting mainstream computing applications. The company contends that this overreach undermines America's technological leadership and global competitiveness, advocating for policies that promote innovation and open competition instead.",
      "url": "https://blogs.nvidia.com/blog/ai-policy/",
      "source": "NVIDIA Blog",
      "published": "20250113T000000",
      "overall_sentiment_score": -0.447104,
      "overall_sentiment_label": "Bearish",
      "ticker_sentiment_score": -0.422557,
      "ticker_sentiment_label": "Bearish",
      "relevance_score": 1.0
    },
    {
      "title": "COMPUTEX 2024 News",
      "summary": "NVIDIA's COMPUTEX 2024 news features CEO Jensen Huang's \"Accelerate Everything\" message and a series of announcements focusing on AI, including digital human microservices, NIM for model deployment, and supercharged Ethernet networking. The company is collaborating with the computer industry to build AI factories and data centers, and bringing AI assistants to GeForce RTX AI PCs, highlighting its pervasive role in advancing AI across various industries like robotics, healthcare, and industrial digitalization.",
      "url": "https://nvidianews.nvidia.com/online-press-kit/computex-2024-news",
      "source": "NVIDIA Newsroom",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.453588,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.855297,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Nvidia dethroned as world's most valuable company after just a few days on top",
      "summary": "Nvidia's reign as the world's most valuable company was short-lived, with a two-day selloff erasing over $220 billion from its market capitalization and pushing it to third place behind Apple and Microsoft. Despite a 6.7% drop, analysts see no fundamental issues and expect any volatility to be temporary, reiterating \"buy\" ratings and raising price targets due to confidence in its AI leadership. The decline also coincided with broader market turbulence from a \"triple-witching\" options expiration.",
      "url": "https://fortune.com/2024/06/21/nvidia-market-cap-world-most-valuable-company-nvda-stock-selloff/",
      "source": "Fortune",
      "published": "20241231T235959",
      "overall_sentiment_score": -0.198617,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.298662,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 1.0
    },
    {
      "title": "The 10 Biggest Nvidia News Stories Of 2024 (So Far)",
      "summary": "This article covers the 10 biggest Nvidia news stories of 2024 to date, highlighting the company's rapid expansion and continued dominance in AI computing. Key developments include strategic software startup acquisitions, plans for new GPU and CPU architectures, and significant financial achievements like surpassing Intel in annual revenue and briefly becoming the world's most valuable company. Nvidia's focus on a \"full-stack\" computing approach, encompassing hardware, software, and services, underpins its success amidst growing competition.",
      "url": "https://www.crn.com/news/components-peripherals/2024/the-10-biggest-nvidia-news-stories-of-2024-so-far",
      "source": "CRN Magazine",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.319282,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.804098,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Supreme Court allows investors’ class action to proceed against microchip company Nvidia",
      "summary": "The Supreme Court has allowed a class-action lawsuit against Nvidia to proceed. The lawsuit accuses the microchip company of misleading investors about its reliance on cryptocurrency mining for revenue, leading to a significant stock price drop in 2018. This decision comes as Nvidia faces a separate investigation in China and has recently seen spectacular share price growth due to its role in the artificial intelligence sector.",
      "url": "https://apnews.com/article/supreme-court-nvidia-securities-fraud-bd509b33f4b4b5c72101545f6996a0a2",
      "source": "AP News",
      "published": "20241231T235959",
      "overall_sentiment_score": -0.134813,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.134227,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 1.0
    },
    {
      "title": "Want More Nvidia? Investors Try Funds That Double Its Return—and Risk - WSJ",
      "summary": "Amidst the 2024 stock market rally, investors seeking amplified returns are increasingly turning to single-stock exchange-traded funds (ETFs) for companies like Nvidia. These relatively new products leverage borrowed money or derivative contracts to potentially double the return of a single stock. This trend indicates a growing appetite for higher-risk, higher-reward investment strategies among some everyday investors.",
      "url": "https://www.wsj.com/finance/investing/want-more-nvidia-investors-try-funds-that-double-its-returnand-risk-48148d94?gaa_at=eafs&gaa_n=AWEtsqcr5PW-ByApKZQdDu4LJ8wVw0EiCOV6-SycV_caOkOxBPKMVDjAiCrJ&gaa_ts=69075c8e&gaa_sig=UbxD5t16Dou0KSySHQRnFPThOUe_KmsuLsS5tEF-CeCMO5pxgYSPTCyA4WsGpN3bx4Ph4w3atMNUD7C62LPcPg%3D%3D",
      "source": "The Wall Street Journal",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.218715,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.408788,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Nvidia to Replace Intel in Dow Jones Industrial Average. Sherwin-Williams Also Joins. - WSJ",
      "summary": "Nvidia is set to replace Intel in the Dow Jones Industrial Average, reflecting a significant shift in the tech industry. Additionally, Sherwin-Williams will replace Dow Inc. The changes, effective prior to the open of trading on November 8, were made to provide better representation of the semiconductor and materials sectors within the 30-stock benchmark.",
      "url": "https://www.wsj.com/finance/stocks/nvidia-to-replace-intel-in-dow-jones-industrial-average-sherwin-williams-also-joins-f5510490?gaa_at=eafs&gaa_n=AWEtsqdp2mXux4Ipb2QHcZb2CYpLfFRSwLJ7te81CGKuTiS7jl6uzBD9uTI9&gaa_ts=690750ef&gaa_sig=BdjRWoIc6npWkqQCya6Rxb22V3YO14w66gHx3ZVyO86LXT8NqeMkPdHNkzVvPDzSuB_bHX56oFw-tJ3rZUMLpw%3D%3D",
      "source": "The Wall Street Journal",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.194463,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.417905,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Nvidia’s Ascent to Most Valued Company Has Echoes of Dot-Com Boom - WSJ",
      "summary": "Nvidia has become the world’s most valuable listed company, driven by demand for its AI chips, drawing comparisons to the dot-com boom of two decades ago when Cisco Systems held a similar position. Nvidia's chips are crucial for the AI boom, enabling the creation of advanced AI systems. Despite the historical parallels, a former Cisco CEO suggests the current situation is different.",
      "url": "https://www.wsj.com/tech/ai/nvidias-ascent-to-most-valuable-company-has-echoes-of-dot-com-boom-dd836c90?gaa_at=eafs&gaa_n=AWEtsqevxR0BAHBz8zzjsH30i4fyisWpKsmIEVtJA_HVr7oK9CB5V_FNAN68&gaa_ts=69075c9e&gaa_sig=0-Rw-5_QKcyk1gOd-aTQ2s96g-MeX9WdK62NohVVqTAe6azDQ8Vrbz_HZHIirJOK4oNRt9Eg8pRk2qDXTHMvnQ%3D%3D",
      "source": "The Wall Street Journal",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.396859,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.460232,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "AI Enables Major Healthcare Advances At JP Morgan Event",
      "summary": "The JP Morgan Healthcare Conference is increasingly focusing on AI's transformative role in medicine. Nvidia is a key player, powering digital healthcare devices and collaborating with institutions like Mayo Clinic and IQVIA to drive AI-driven diagnostics and genomic insights. The article posits that AI will revolutionize healthcare, particularly in eradicating diseases like cancer, by leveraging vast clinical data to develop personalized medicine.",
      "url": "https://www.forbes.com/sites/karlfreund/2025/01/13/ai-enables-major-healthcare-advances-at-jp-morgan-event/",
      "source": "Forbes",
      "published": "20250113T090000",
      "overall_sentiment_score": 0.324763,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.727453,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.964227
    },
    {
      "title": "CytoReason Secures $80M from OurCrowd, NVIDIA, Pfizer, and Thermo Fisher Scientific to Scale Its AI Disease Models and Establish US Hub in Cambridge, Massachusetts",
      "summary": "CytoReason has secured $80 million in funding from OurCrowd, NVIDIA, Pfizer, and Thermo Fisher Scientific to expand its AI-driven disease models and establish a US hub in Cambridge, Massachusetts. This investment will enable CytoReason to broaden its therapeutic indications, grow its proprietary data, and further enhance its computational disease models for predictive insights in pharmaceutical R&D. The company's technology is used by six of the top ten pharma companies to make data-driven decisions and reduce R&D timelines.",
      "url": "https://www.businesswire.com/news/home/20240717912688/en/CytoReason-Secures-%2480M-from-OurCrowd-NVIDIA-Pfizer-and-Thermo-Fisher-Scientific-to-Scale-Its-AI-Disease-Models-and-Establish-US-Hub-in-Cambridge-Massachusetts",
      "source": "Business Wire",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.411356,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.404477,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.943138
    },
    {
      "title": "ServiceNow showcases generative AI service agents using NVIDIA AI Enterprise software",
      "summary": "ServiceNow and NVIDIA showcased AI avatars powered by NVIDIA's ACE technology at Knowledge 2024, demonstrating their potential to enhance customer and employee service experiences through more engaging and personal interactions. This collaboration leverages NVIDIA AI Enterprise software, including NIM microservices, to bring digital characters to life using generative AI for various business functions. The initiative aims to offer new communication options for Virtual Agent experiences and boost productivity across industries by integrating AI-assisted interactions.",
      "url": "https://www.businesswire.com/news/home/20240508088614/en/ServiceNow-showcases-generative-AI-service-agents-using-NVIDIA-AI-Enterprise-software",
      "source": "Business Wire",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.38736,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.409927,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.939835
    },
    {
      "title": "CoreWeave Partners With Dell Technologies To ‘Empower Enterprises to Harness AI’",
      "summary": "CoreWeave and Dell Technologies have announced a strategic partnership to deliver high-performance cloud environments for AI with Dell's liquid-cooled servers and racks. This collaboration aims to equip CoreWeave's enterprise customers with the speed and scalability to accelerate AI-driven projects, leveraging Nvidia GB200 NVL72 and Dell PowerEdge XE9712 servers. The partnership addresses the \"insatiable demand\" for AI infrastructure and cloud services, with Dell's technology enabling significant advancements in AI compute power and efficiency.",
      "url": "https://www.crn.com/news/data-center/2024/dell-and-ai-hyperscaler-coreweave-tie-up-massive-strategic-deal",
      "source": "CRN Magazine",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.225014,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.305874,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.929768
    },
    {
      "title": "Nvidia to Replace Intel in Dow Jones Industrial Average. Sherwin-Williams Also Joins. - WSJ",
      "summary": "Nvidia will replace Intel in the Dow Jones Industrial Average, reflecting a significant shift in the tech industry. Additionally, Sherwin-Williams will join the index, replacing Dow Inc. These changes are effective prior to the open of trading on November 8th and aim to improve the representation of the semiconductors and materials sectors within the benchmark.",
      "url": "https://www.wsj.com/finance/stocks/nvidia-to-replace-intel-in-dow-jones-industrial-average-sherwin-williams-also-joins-f5510490?gaa_at=eafs&gaa_n=AWEtsqdC8aNh46ygCz4qOn08FaqTscm3SaX8dSdQ97eyw5nqSz_-YY6rH9nL&gaa_ts=69076164&gaa_sig=KeIS1BcnpuOy67Vy-Jru3XpG3xxkjOs_eHWVw6ga_s538Uvycgyp7KOz2879pgnH2XdGgsXhkT2MF7aUaMn9aw%3D%3D",
      "source": "The Wall Street Journal",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.043693,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.343848,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.924667
    },
    {
      "title": "Nvidia, AMD Lead The Pack, Broadcom Stable, Intel Falters: Analyst's Latest Take",
      "summary": "KeyBanc analyst John Vinh provided a mixed outlook for the semiconductor sector, with Nvidia and AMD showing strong performance and positive catalysts. Conversely, Qualcomm and Synaptics were downgraded due to increased competition and limited growth, while Intel, Micron, Marvell, and Monolithic Power Systems faced negative findings. Broadcom's stable outlook is tempered by potential future competition from Apple.",
      "url": "https://www.tradingview.com/news/benzinga:a503d7ca0094b:0-nvidia-amd-lead-the-pack-broadcom-stable-intel-falters-analyst-s-latest-take/",
      "source": "TradingView",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.014077,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.305067,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.922011
    },
    {
      "title": "F5 to Supercharge AI Application Delivery for Service Providers and Enterprises with NVIDIA BlueField-3 DPUs",
      "summary": "F5 has announced the availability of BIG-IP Next for Kubernetes, an AI application delivery and security solution designed for service providers and large enterprises, leveraging NVIDIA BlueField-3 DPUs. This solution aims to accelerate, secure, and streamline data traffic for large-scale AI infrastructures by optimizing data center resource utilization and enhancing AI application performance. It is particularly beneficial for telco clouds, 5G infrastructures, and high-demand AI use cases, offering improved control, security, and efficiency.",
      "url": "https://www.businesswire.com/news/home/20241023073581/en/F5-to-Supercharge-AI-Application-Delivery-for-Service-Providers-and-Enterprises-with-NVIDIA-BlueField-3-DPUs",
      "source": "Business Wire",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.44,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.456404,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.918694
    },
    {
      "title": "ServiceNow CEO McDermott: 'Taking On The World's Biggest Challenges’ With AI, New Nvidia Pact, More",
      "summary": "ServiceNow CEO Bill McDermott announced new AI technologies and expanded partnerships with Nvidia and Cognizant, leveraging their Q3 earnings to position themselves as a leading AI company. He emphasized that AI, particularly their Now Assist generative AI platform, is driving significant productivity gains and economic growth. The company also introduced Workflow Data Fabric to unify enterprise data and enhance workflow automation, aligning with their financial success which saw beats on revenue and earnings projections for Q3 2024.",
      "url": "https://www.crn.com/news/channel-news/2024/servicenow-ceo-mcdermott-taking-on-the-world-s-biggest-challenges-with-ai-new-nvidia-pact-more",
      "source": "CRN Magazine",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.316429,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.306686,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.88947
    },
    {
      "title": "Cisco To Invest In Hot AI Startup CoreWeave: Report",
      "summary": "Cisco Systems is reportedly investing in CoreWeave, an AI cloud computing provider valued at $23 billion and backed by Nvidia. CoreWeave, founded in 2017, recently raised $1.1 billion and is reportedly planning an IPO by mid-2025. This investment aligns with Cisco's recent strategic focus on AI, evidenced by its acquisitions of Splunk, Robust Intelligence, and its intent to acquire Deeper Insights AI Ltd.",
      "url": "https://www.crn.com/news/networking/2024/cisco-to-invest-in-hot-ai-startup-coreweave-report",
      "source": "CRN",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.404959,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.346139,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.870049
    },
    {
      "title": "Best and worst performing ETFs of 2024",
      "summary": "The article reviews the best and worst-performing ETFs of 2024, highlighting that trends from the previous year, particularly the strong performance of tech and blockchain ETFs, largely continued. Tech ETFs benefited from outperforming earnings and the rise of AI, while blockchain ETFs were boosted by interest rate cuts, spot bitcoin ETF approvals, and crypto advocacy. Conversely, clean energy and Brazil ETFs were among the worst performers, with the former continuing a slump and the latter impacted by fiscal concerns and currency depreciation.",
      "url": "https://www.etfstream.com/articles/best-and-worst-performing-etfs-of-2024",
      "source": "ETF Stream",
      "published": "20250107T000000",
      "overall_sentiment_score": 0.283244,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.715472,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.861417
    },
    {
      "title": "IQVIA and NVIDIA Collaborate to Transform Healthcare and Life Sciences Through Advanced Agentic AI Solutions",
      "summary": "IQVIA and NVIDIA have announced a strategic collaboration to advance AI solutions in healthcare and life sciences, leveraging IQVIA’s data and expertise with NVIDIA’s AI Foundry service. This partnership aims to accelerate IQVIA Healthcare-grade AI™ by developing agentic AI solutions to automate complex workflows and improve patient outcomes. Initial solutions are expected to reach the market within the calendar year, utilizing NVIDIA's advanced AI technologies and platforms.",
      "url": "https://www.businesswire.com/news/home/20250113713508/en/IQVIA-and-NVIDIA-Collaborate-to-Transform-Healthcare-and-Life-Sciences-Through-Advanced-Agentic-AI-Solutions",
      "source": "Business Wire",
      "published": "20250113T000000",
      "overall_sentiment_score": 0.470284,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.434172,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.845022
    },
    {
      "title": "Goldman Sachs says to buy the dip in AI",
      "summary": "Goldman Sachs's trading desk suggests buying the dip in AI-related stocks, despite recent declines, due to anticipated lower interest rates and strong fundamentals. The bank expects significant net income growth for AI companies and increased power generation tied to the technology, identifying a buying opportunity amidst what it perceives as excessive AI pessimism.",
      "url": "https://fortune.com/2024/09/16/goldman-sachs-buy-ai-dip-interest-rates/",
      "source": "Fortune",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.335695,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.341604,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.833715
    },
    {
      "title": "주가 떨어지면 매수…고수들, 아이온큐·엔비디아 사모았다",
      "summary": "국내 투자수익률 상위 1%의 초고수들이 최근 주가가 급락한 양자 컴퓨터 기업 아이온큐와 엔비디아 주식을 집중 매수했다. 이는 젠슨 황 엔비디아 CEO의 양자 컴퓨터 개발 전망 발언과 CES 기조연설 이후 주가 하락을 저가 매수 기회로 판단한 것으로 보인다. 반면 테슬라와 인튜이티브 머신스, 사운드하운드AI 등은 차익 실현 또는 주가 고평가 우려로 순매도 상위에 올랐다.",
      "url": "https://www.hankyung.com/article/202501108604i",
      "source": "한국경제",
      "published": "20250110T142744",
      "overall_sentiment_score": -0.084612,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.282394,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.833006
    },
    {
      "title": "Soluna Unleashes First Batch of NVIDIA GPUs, Targeting $80 Million Revenue Over Three Years",
      "summary": "Soluna Holdings, Inc. has secured a $12.5 million credit facility for its new subsidiary, Soluna Cloud, Inc., to launch NVIDIA H100 GPU-based services. This initiative, focused on sustainable AI infrastructure powered by renewable energy, targets $38 million to $80 million in revenue over a three-year contract. Soluna Cloud aims to provide enterprise-grade Generative AI solutions starting as early as July 2024.",
      "url": "https://www.businesswire.com/news/home/20240624064211/en/Soluna-Unleashes-First-Batch-of-NVIDIA-GPUs-Targeting-%2480-Million-Revenue-Over-Three-Years",
      "source": "Business Wire",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.356418,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.280114,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.82951
    },
    {
      "title": "Experts Think a Broadcom Stock Split Is Coming in 2025. Should You Buy AVGO Now?",
      "summary": "Experts anticipate another Broadcom (AVGO) stock split in 2025 following a significant rally in 2024 driven by its AI and semiconductor performance. Broadcom's strong fundamentals, including impressive revenue and earnings growth, high free cash flow, and strategic advancements in AI and edge computing, reinforce its appeal. Analysts maintain a \"Strong Buy\" rating for AVGO stock, signaling confidence in its continued growth trajectory.",
      "url": "https://www.barchart.com/story/news/30255283/experts-think-a-broadcom-stock-split-is-coming-in-2025-should-you-buy-avgo-now",
      "source": "Barchart.com",
      "published": "20241231T180500",
      "overall_sentiment_score": 0.283365,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.305302,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.735564
    },
    {
      "title": "IBM eyes first record since 2013 as AI optimism fuels 19 percent rally",
      "summary": "IBM has reportedly hit its highest stock price since 2013, nearing an all-time high, driven by investor optimism in its AI and cloud investments. Despite trailing Magnificent Seven stocks in five-year returns, IBM's 19% gain this year, fueled by strong Q4 2023 results and AI demand, positions it for potential re-rating. Wall Street remains divided on its growth prospects, but its robust 3.43% dividend yield sets it apart from many big tech companies.",
      "url": "https://www.bostonglobe.com/2024/03/20/business/ibm-shares-first-record-since-2013/",
      "source": "The Boston Globe",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.247407,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.398866,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.727022
    },
    {
      "title": "This AI ETF Has Favorable 2025 Setup",
      "summary": "The WisdomTree Artificial Intelligence and Innovation Fund (WTAI) is poised for a favorable 2025 setup due to projected elevated AI spending, building on its impressive 2024 performance. While benefiting from its significant allocation to semiconductor stocks, the ETF's diverse holdings, including software and cloud computing names, position it to capture broader AI-driven growth. Experts suggest a shift from hardware to software benefits as generative AI matures, aligning with WTAI's diversified strategy.",
      "url": "https://etfdb.com/model-portfolio-content-hub/ai-etf-wtai-favorable-2025-setup/",
      "source": "ETF Database",
      "published": "20250109T052308",
      "overall_sentiment_score": 0.558953,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.50505,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.649061
    },
    {
      "title": "3 Market-Beating Growth Stocks to Watch in 2025",
      "summary": "This article identifies AppLovin, Taiwan Semiconductor, and Vistra as three market-beating growth stocks poised for continued success in 2025. It details each company's strengths, such as AppLovin's AI monetization, TSMC's industry leadership in chip manufacturing, and Vistra's integrated energy operations across diverse markets, suggesting they offer strong growth opportunities beyond well-known tech giants. The piece notes that while these stocks outperformed in 2024, analysts expect their growth trajectories to continue.",
      "url": "https://www.marketbeat.com/stock-ideas/3-market-beating-growth-stocks-to-watch-in-2025/",
      "source": "MarketBeat",
      "published": "20241230T000000",
      "overall_sentiment_score": 0.226605,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.115058,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.648988
    },
    {
      "title": "Jabil Acquires Mikros Technologies to Support Demand for Liquid Cooling in AI Data Centers",
      "summary": "Jabil Inc. has acquired Mikros Technologies LLC, a leader in liquid cooling solutions, to enhance its thermal management capabilities for AI data centers and other high-power density systems. The acquisition, completed on October 1st, will allow Jabil to address the growing demand for efficient cooling in industries such as artificial intelligence, energy storage, and electric vehicles. Mikros Technologies' proprietary microchannel liquid cooling designs will complement Jabil's existing data center solutions.",
      "url": "https://www.businesswire.com/news/home/20241003396998/en/Jabil-Acquires-Mikros-Technologies-to-Support-Demand-for-Liquid-Cooling-in-AI-Data-Centers",
      "source": "Business Wire",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.37198,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.334979,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.645335
    },
    {
      "title": "Soluna Cloud Secures Deal with San Francisco Compute Company to Deliver Custom AI Cloud Solutions",
      "summary": "Soluna Cloud has secured a Master Services Agreement with San Francisco Compute Company (SF Compute) to provide custom AI cloud solutions. Soluna will supply 80 to 120 Nvidia H100 GPUs for SF Compute's real-time compute trading platform, potentially generating $2.466 million in revenue over one year. This collaboration marks SF Compute as the first customer from Soluna's strategic partnership with Hewlett Packard Enterprise (HPE) GreenLake.",
      "url": "https://www.businesswire.com/news/home/20241203712823/en/Soluna-Cloud-Secures-Deal-with-San-Francisco-Compute-Company-to-Deliver-Custom-AI-Cloud-Solutions",
      "source": "Business Wire",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.318748,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.304217,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.644067
    },
    {
      "title": "ARKK vs. SPRX: Battle of the Active Tech ETFs",
      "summary": "This article compares two active tech ETFs, ARKK and SPRX, which both invest in disruptive growth stocks. It analyzes their strategies, head-to-head performance, portfolio compositions, fees, and analyst ratings to determine which ETF comes out on top. SPRX is ultimately deemed the winner due to its stronger performance in recent years and slightly better Smart Score.",
      "url": "https://www.tipranks.com/news/article/arkk-vs-sprx-battle-of-active-tech-etfs",
      "source": "TipRanks",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.322726,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.374644,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.643196
    },
    {
      "title": "MicroStrategy’s $2 billion Bitcoin buy is largest since 2020",
      "summary": "MicroStrategy Inc. has made its largest Bitcoin purchase since 2020, acquiring approximately 27,200 BTC for around $2.03 billion between October 31 and November 10. This brings the company's total Bitcoin holdings to about 279,420 BTC, valued at approximately $24 billion based on recent record prices. The aggressive Bitcoin strategy, which involves using proceeds from stock and debt sales, has significantly boosted MicroStrategy's stock performance, outperforming major U.S. stocks including Nvidia.",
      "url": "https://fortune.com/crypto/2024/11/11/bitcoin-rally-microstrategy-2-billion-btc-michael-saylor-trump-election-crypto/",
      "source": "Fortune",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.338921,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.218619,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.64279
    },
    {
      "title": "Where The Pros Would Invest $10,000 Right Now",
      "summary": "This article explores investment strategies from three professional investors for allocating $10,000. Russ Koesterich suggests high-quality companies, Sarah Ketterer sees strong potential in emerging markets, and Emily Roland recommends investment-grade corporate bonds for income and stability. The piece also provides ETF suggestions and further analysis for each strategy.",
      "url": "https://finimize.com/content/where-the-pros-would-invest-10000-right-now",
      "source": "Finimize",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.213087,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.372232,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.642319
    },
    {
      "title": "'Roaring Kitty' tweets tied to surge in Koss Corp. stock price",
      "summary": "Koss Corp. stock has experienced significant price surges, most recently a 175% increase, linked to social media activity by Keith Gill, known as \"Roaring Kitty.\" This follows a similar phenomenon in 2021 when Gill's posts fueled the GameStop and Koss trading frenzies. Despite the lack of fundamental company news, these price movements are driven by speculative trading and \"breadcrumb\" hints from Gill, leading to considerable profits for some insider transactions while the company itself had a challenging 2023.",
      "url": "https://www.jsonline.com/story/money/business/2024/09/23/roaring-kitty-tweets-tied-to-surge-in-koss-corp-stock-price/75266243007/",
      "source": "Milwaukee Journal Sentinel",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.42156,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.542183,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.642184
    },
    {
      "title": "With 81% institutional ownership, Ambarella, Inc. (NASDAQ:AMBA) is a favorite amongst the big guns",
      "summary": "Ambarella, Inc. (NASDAQ:AMBA) is largely controlled by institutional investors, holding 81% of the company's shares. The top 15 shareholders collectively own 51% of the company, with Vanguard Group and BlackRock being the largest. Recent insider selling has been noted, but the significant institutional interest suggests confidence in the company's future.",
      "url": "https://simplywall.st/stocks/us/semiconductors/nasdaq-amba/ambarella/news/with-81-institutional-ownership-ambarella-inc-nasdaqamba-is",
      "source": "Simply Wall Street",
      "published": "20241231T000000",
      "overall_sentiment_score": 0.124271,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.113984,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.641677
    },
    {
      "title": "SoundHound AI Reports Record Third Quarter Revenue, Up 89%, Exceeding $25 Million; Raises Outlook",
      "summary": "SoundHound AI reported record third-quarter revenue of $25.1 million, an 89% increase year-over-year, and exceeded expectations. The company also announced an increased revenue outlook for both 2024 and 2025, driven by significant diversification in customer base and expansion into new verticals like financial services, healthcare, and insurance. Keyvan Mohajer, CEO of SoundHound AI, highlighted the company's strong position in conversational AI, attributing success to strong technology, vertical integrations, and proprietary software.",
      "url": "https://www.businesswire.com/news/home/20241112739401/en/SoundHound-AI-Reports-Record-Third-Quarter-Revenue-Up-89-Exceeding-%2425-Million-Raises-Outlook",
      "source": "Business Wire",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.319939,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.31244,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.638782
    },
    {
      "title": "Returns On Capital Signal Tricky Times Ahead For Intchains Group (NASDAQ:ICG)",
      "summary": "Intchains Group (NASDAQ:ICG) shows a declining Return on Capital Employed (ROCE), currently at 3.8% which is below the Semiconductor industry average. While the company's revenue and assets are growing, suggesting reinvestment for future growth, the ROCE has fallen significantly from 17% four years ago. The stock has also decreased by 25% over the last year, indicating potential opportunities for astute investors despite the challenging ROCE trend.",
      "url": "https://simplywall.st/stocks/us/semiconductors/nasdaq-icg/intchains-group/news/returns-on-capital-signal-tricky-times-ahead-for-intchains-g",
      "source": "Simply Wall Street",
      "published": "20241230T000000",
      "overall_sentiment_score": 0.031375,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.12675,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.636923
    },
    {
      "title": "Corsair Gaming Reports Fourth Quarter and Full Year 2024 Financial Results",
      "summary": "Corsair Gaming announced its financial results for Q4 and full year 2024, reporting solid Q4 revenue and adjusted EBITDA driven by strong growth in the Gamer and Creator Peripherals segment. The company provided its 2025 outlook, anticipating revenue between $1.4 billion and $1.6 billion and adjusted EBITDA of $80 million to $100 million, expecting growth due to new high-performance GPU cards and strategic acquisitions like Fanatec.",
      "url": "https://www.businesswire.com/news/home/20250212687649/en/Corsair-Gaming-Reports-Fourth-Quarter-and-Full-Year-2024-Financial-Results",
      "source": "Business Wire",
      "published": "20241231T000000",
      "overall_sentiment_score": 0.249281,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.201149,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.630085
    },
    {
      "title": "Delta (DAL), AMD, Walgreens (WBA) ou Constellation Energy (CEG): qual ação comprar e qual pular",
      "summary": "This article analyzes four major companies—Delta Air Lines (DAL), AMD, Walgreens (WBA), and Constellation Energy Corporation (CEG)—to guide investors on which stocks to buy and which to avoid. It recommends buying Delta and Constellation Energy due to strong financial performance and stable market positions, while advising to skip Walgreens and AMD due to ongoing restructuring challenges and competitive pressures, respectively. The analysis emphasizes considering financial health, growth potential, and individual risk tolerance before making investment decisions.",
      "url": "https://br.tradingview.com/news/invezz:a61cb8c49bc81:0/",
      "source": "TradingView – Acompanhe todos os mercados",
      "published": "20250110T050801",
      "overall_sentiment_score": -0.015577,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.197611,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.624571
    },
    {
      "title": "Schwab Trading Activity Index™: December Score Edges Higher for Third Consecutive Month",
      "summary": "The Schwab Trading Activity Index™ (STAX) increased to 51.16 in December, marking its third consecutive monthly rise. Schwab clients net bought equities, adding exposure in Health Care and Energy sectors, while selling Information Technology and Communication Services. The report highlights market volatility, key economic data releases, and popular stocks bought and sold by Schwab clients throughout December and the entirety of 2024.",
      "url": "https://pressroom.aboutschwab.com/press-releases/press-release/2025/Schwab-Trading-Activity-Index-December-Score-Edges-Higher-for-Third-Consecutive-Month/default.aspx",
      "source": "Charles Schwab Press Releases",
      "published": "20250106T000000",
      "overall_sentiment_score": 0.093717,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.338604,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.623269
    },
    {
      "title": "Why Aflac's CIO won't ever be first to market with generative AI—but is still finding ways to adopt the technology",
      "summary": "Aflac's CIO, Shelia Anderson, emphasizes a conservative yet proactive approach to generative AI, prioritizing guardrails, education, and internal applications before external deployment in 2025. The company is exploring use cases like fraud detection and churn predictions in its Hatch Innovation Lab and leveraging existing partnerships while being cautious about customized solutions and data security. Beyond AI, Anderson is focused on integrating acquisitions, streamlining customer-facing processes, and optimizing cloud migration costs.",
      "url": "https://fortune.com/2024/10/02/aflac-cio-conservative-approach-to-generative-ai/",
      "source": "Fortune",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.106639,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.155449,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.622563
    },
    {
      "title": "Amazon’s AI spending plans keep stock from joining tech rebound",
      "summary": "Amazon's shares are lagging behind its megacap peers due to its substantial spending on artificial intelligence computing, which is impacting its profits. Investors are concerned that increased capital spending will negatively affect cash flows, especially as the company has historically performed better when focused on profitability. This shift to investment mode, coupled with Amazon's lack of a dividend and less aggressive share buyback program compared to competitors, is causing investors to pause on the stock.",
      "url": "https://www.detroitnews.com/story/business/2024/08/20/amazons-ai-spending-plans-keep-stock-from-joining-tech-rebound/74869951007/",
      "source": "The Detroit News",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.041381,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.127544,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.621863
    },
    {
      "title": "Micron Technology sees largest gain in nearly 13 years",
      "summary": "Micron Technology experienced its largest single-day gain in nearly 13 years, with shares rising 15% to $109.88, driven by surprisingly strong sales and profit forecasts. The rosy outlook is attributed to a boom in AI spending, with high-bandwidth memory products—crucial for AI systems—already sold out for 2024 and 2025. The company's recent fiscal fourth-quarter results also beat estimates, further cementing its strong position in the chip market.",
      "url": "https://fortune.com/2024/09/26/micron-technology-shares-stock-surge/",
      "source": "Fortune",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.426086,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.34275,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.621281
    },
    {
      "title": "Jim Cramer Says ‘Amazon.com, Inc. (AMZN) Is A Buy, And I Think It Will Continue To Perform Well’",
      "summary": "Jim Cramer has endorsed Amazon.com, Inc. (AMZN) as a strong buy, citing its performance and strategic positioning in AI. The article highlights Amazon's role across the AI stack, its partnership with Anthropic, and discusses Cramer's investment tips for 2025 including avoiding \"pigs get slaughtered\" mentality, holding through tough markets, and staging buys.",
      "url": "https://finance.yahoo.com/news/jim-cramer-says-amazon-com-055243750.html",
      "source": "Yahoo Finance",
      "published": "20241230T055243",
      "overall_sentiment_score": 0.202239,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.103678,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.616578
    },
    {
      "title": "Cadence Unveils Palladium Z3 and Protium X3 Systems to Usher in a New Era of Accelerated Verification, Software Development and Digital Twins",
      "summary": "Cadence Design Systems, Inc. announced its new Palladium Z3 Emulation and Protium X3 FPGA Prototyping systems, designed to accelerate verification and software development for complex SoCs. These systems offer over twice the capacity and are 1.5 times faster than previous generations, supporting advanced applications like generative AI, mobile, and automotive. The Palladium Z3 features a custom emulation processor and domain-specific apps, while the Protium X3 provides faster bring-up times for software validation, with both systems supporting massive gate designs up to 48 billion.",
      "url": "https://www.businesswire.com/news/home/20240417697934/en/Cadence-Unveils-Palladium-Z3-and-Protium-X3-Systems-to-Usher-in-a-New-Era-of-Accelerated-Verification-Software-Development-and-Digital-Twins",
      "source": "Business Wire",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.383935,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.339835,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.615006
    },
    {
      "title": "Sustainable and Successful: 3 Climate ETFs Beating the Market",
      "summary": "This article highlights three climate-focused ETFs—iShares Climate Conscious & Transition MSCI USA ETF (USCL), Xtrackers MSCI USA Climate Action Equity ETF (USCA), and SPDR MSCI USA Climate Paris Aligned ETF (NZUS)—that have outperformed the S&P 500. These ETFs offer investors ways to support companies mitigating climate change while also achieving strong financial returns. The article details each ETF's approach to sustainable investing, their expense ratios, asset bases, and recent performance.",
      "url": "https://www.theglobeandmail.com/investing/markets/stocks/META/pressreleases/30306444/sustainable-and-successful-3-climate-etfs-beating-the-market/",
      "source": "The Globe and Mail",
      "published": "20250105T060000",
      "overall_sentiment_score": 0.383275,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.312429,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.61048
    },
    {
      "title": "MarketVector Reaches All-Time High of USD 50 Billion in Assets Under Management",
      "summary": "MarketVector Indexes has achieved an all-time high of USD 50 billion in total assets under management (AUM) linked to its licensed indexes, driven significantly by its semiconductor index family with over USD 25 billion in AUM. This milestone highlights the company's growth, institutional credibility, and innovation, particularly in thematic and digital asset indexes, reinforced by strategic partnerships and investor interest in AI and digital assets. MarketVector attributes its success to its team's dedication and client trust, positioning itself as a leader in the indexing industry.",
      "url": "https://www.businesswire.com/news/home/20240626400860/en/MarketVector-Reaches-All-Time-High-of-USD-50-Billion-in-Assets-Under-Management",
      "source": "Business Wire",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.266783,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.419875,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.601122
    },
    {
      "title": "Nixxy CEO Granger Whitelaw Resigns, Successor Search Begins",
      "summary": "Granger Whitelaw has resigned from his roles as a member of the Board of Directors and as Chief Executive Officer of Nixxy, Inc. His CEO resignation is effective on December 31, 2024. The company has begun the search for a new CEO, and the departure is not due to any disagreement with the company.",
      "url": "https://www.tipranks.com/news/company-announcements/nixxy-ceo-granger-whitelaw-resigns-successor-search-begins",
      "source": "TipRanks",
      "published": "20241231T235959",
      "overall_sentiment_score": -0.095915,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.034763,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.588607
    },
    {
      "title": "Intel Extends Leadership in AI PCs and Edge Computing at CES 2025",
      "summary": "At CES 2025, Intel unveiled new Intel Core Ultra (Series 2) processors, including the 200V series with Intel vPro for businesses, and 200HX and H series for creators and gamers, all featuring cutting-edge AI enhancements and performance improvements. Intel also introduced a new suite of processors for edge computing, showcasing significant performance gains in AI workloads compared to previous generations and competitors. The availability of these new systems is set to begin in January and February 2025, with further releases planned for the first half of the year.",
      "url": "https://www.intc.com/news-events/press-releases/detail/1722/intel-extends-leadership-in-ai-pcs-and-edge-computing-at?utm_source=chatgpt.com",
      "source": "Investor Relations :: Intel Corporation (INTC)",
      "published": "20250106T090000",
      "overall_sentiment_score": 0.424419,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.231084,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.577379
    },
    {
      "title": "Pure Storage CEO Giancarlo: Pure Storage Platform Is Built For AI",
      "summary": "Pure Storage CEO Charles Giancarlo discusses how the Pure platform is designed to integrate AI and security, allowing enterprises to use existing data for analytics and AI without specialized environments. He emphasizes the company's significant R&D investment (20% of revenue) to modernize storage into a cloud-like system, positioning flash storage to fully replace traditional disks within the decade. Giancarlo also highlights the competitive landscape and the strategic shift to position Pure Storage as a platform rather than just individual storage arrays, requiring a new approach to sales and channel engagement.",
      "url": "https://www.crn.com/news/storage/2024/pure-storage-ceo-charles-giancarlo-pure-storage-platform-built-for-ai",
      "source": "CRN Magazine",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.25781,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.149152,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.563766
    },
    {
      "title": "Camtek stock hits new heights as Israeli tech firm breaks $100 milestone",
      "summary": "Camtek, an Israeli manufacturer of inspection systems for the semiconductor industry, has seen its stock price break the $100 milestone, achieving a market value exceeding $4 billion. This significant growth, including a 265% increase over the last year, is attributed to high demand from the semiconductor and AI markets, particularly in areas like High Bandwidth Memory (HBM) and Advanced Packaging. The company's strong performance and profitability highlight its crucial role in ensuring chip quality for leading manufacturers amidst a rapidly evolving tech landscape.",
      "url": "https://www.ynetnews.com/business/article/bjhj3ddmr",
      "source": "Ynetnews",
      "published": "20241231T235959",
      "overall_sentiment_score": 0.375732,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.238071,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.556992
    },
    {
      "title": "Townsquare media CEO Bill Wilson's family buys $1,545 in stock",
      "summary": "Bill Wilson, CEO of Townsquare Media, Inc. (NYSE: TSQ), had his adult child purchase 165 shares totaling $1,545, as disclosed in a recent SEC filing. These transactions occurred while TSQ trades near its 52-week low, offering an 8.56% dividend yield. The company is also actively managing its capital through a new share repurchase plan and debt refinancing efforts, with analysts projecting potential upside.",
      "url": "https://www.investing.com/news/insider-trading-news/townsquare-media-ceo-bill-wilsons-family-buys-1545-in-stock-93CH-3793059",
      "source": "Investing.com",
      "published": "20241231T050953",
      "overall_sentiment_score": 0.148676,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.209324,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.546812
    }
  ]
}