{
  "ticker": "NVDA",
  "date": "2025-11-24",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T11:40:35.014846",
  "source": "alpha_vantage",
  "article_count": 50,
  "articles": [
    {
      "title": "Alphabet Closes In On $4 Trillion Market Cap After Surpassing Microsoft As Rumors Swirl Of Meta, Other Hyperscalers Turning To Google TPUs",
      "summary": "Alphabet is nearing a $4 trillion market cap after its stock surged, surpassing Microsoft due to rumors that major hyperscalers, including Meta Platforms, are considering using Google's Tensor Processing Units (TPUs) for AI workloads. This potential expansion of TPU sales could significantly boost Alphabet's revenue, reportedly targeting 10% of Nvidia's annual revenue, and has led to a highly bullish sentiment among investors.",
      "url": "https://stocktwits.com/news-articles/markets/equity/alphabet-closes-in-on-4-trillion-market-cap-on-rumors-meta-turning-to-google-tp-us/cL52Rp0REXb",
      "source": "Stocktwits",
      "published": "20251124T222400",
      "overall_sentiment_score": 0.366058,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.109927,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.848683
    },
    {
      "title": "Google Alphabet stock price today: Alphabet shares surges 6% as Google roars back in AI — is Nvidia’s reign under serious threat? Here’s the key reason - The Economic Times",
      "summary": "Alphabet shares surged nearly 6% following the launch of Google's Gemini 3 AI model, which analysts believe outperforms rivals and utilizes Google's custom AI chips. This development is raising questions about Nvidia's dominance in the AI computing market, even as Nvidia saw a slight dip in its stock. Alphabet has also reported strong financial performance, with a 70% annual gain, increased profit, and significant growth in Google Cloud revenue and Gemini usage.",
      "url": "https://m.economictimes.com/news/international/us/google-alphabet-stock-price-today-alphabet-shares-surges-6-as-google-roars-back-in-ai-is-nvidias-reign-under-serious-threat-heres-the-key-reason/articleshow/125544464.cms",
      "source": "The Economic Times",
      "published": "20251124T211500",
      "overall_sentiment_score": 0.418656,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": -0.321354,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.802127
    },
    {
      "title": "GE HealthCare’s Photonova™ Spectra with Deep Silicon reimagines photon-counting CT to see more, know more and achieve more",
      "summary": "GE HealthCare has announced the submission of its Photonova™ Spectra, a new photon-counting computed tomography (PCCT) system with Deep Silicon detector technology, for U.S. FDA clearance. This system aims to significantly advance medical imaging by providing enhanced spectral and spatial resolution, fast acquisition speeds, and detailed material separation across various medical specialties. Designed for impact across neurology, oncology, musculoskeletal, thoracic, and cardiac imaging, Photonova Spectra leverages AI algorithms and Deep Silicon to offer unprecedented clarity, precision, and efficiency for clinicians.",
      "url": "https://www.businesswire.com/news/home/20251124194716/en/GE-HealthCares-Photonova-Spectra-with-Deep-Silicon-reimagines-photon-counting-CT-to-see-more-know-more-and-achieve-more",
      "source": "Business Wire",
      "published": "20251124T194716",
      "overall_sentiment_score": 0.510323,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.33367,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.613791
    },
    {
      "title": "Ecolab Announces Integrated CaaS Cooling Program for Data Centers",
      "summary": "Ecolab Inc. has launched an integrated Cooling as a Service (CaaS) program specifically designed for data centers. This new program aims to optimize cooling performance by bringing together a suite of management solutions under one service offering. The announcement was made from St. Paul, Minnesota.",
      "url": "https://insidehpc.com/tag/ecolab/",
      "source": "insideHPC",
      "published": "20251124T173629",
      "overall_sentiment_score": 0.339118,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.226703,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.636438
    },
    {
      "title": "Alphabet (GOOG) Stock Soars Above $315 as AI Wave Pushes Valuation Toward $4 Trillion – 24 November 2025",
      "summary": "Alphabet's Class C shares (GOOG) surged above $315, pushing its market valuation towards $4 trillion, driven by strong Q3 2025 earnings, renewed confidence in its AI leadership with Gemini 3, and significant growth in Google Cloud. The stock's rally of 70-75% over the past year reflects growing investor enthusiasm, although analysts note rich valuations and ongoing antitrust risks. The company's vertically integrated AI strategy, including custom chips and a new NATO cloud deal, further bolsters its position.",
      "url": "https://ts2.tech/en/alphabet-goog-stock-soars-above-315-as-ai-wave-pushes-valuation-toward-4-trillion-24-november-2025/",
      "source": "ts2.tech",
      "published": "20251124T170626",
      "overall_sentiment_score": 0.385547,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.331431,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.614698
    },
    {
      "title": "Apple shares hit new all-time closing high",
      "summary": "Apple Inc. (AAPL) shares reached a new all-time closing high of $276.15 on November 24, 2025, rising 1.63%. The company's market value stands at $4.095 trillion, making it the world's second-most valuable company. The article also lists the market values of other top U.S. publicly traded companies.",
      "url": "https://macdailynews.com/2025/11/24/apple-shares-hit-new-all-time-closing-high-30/",
      "source": "MacDailyNews",
      "published": "20251124T164100",
      "overall_sentiment_score": 0.433083,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.37279,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.702666
    },
    {
      "title": "Why the Selloff in Micron Technology Stock Never Made Sense",
      "summary": "Micron Technology's stock experienced a significant selloff despite its strong market position in DRAM and NAND, particularly its pivot to high-bandwidth memory (HBM) critical for AI. The article argues this dip was an overreaction, as new UBS forecasts show exploding HBM demand benefiting Micron and its valuation remains attractive compared to the semiconductor industry average. This creates a compelling buying opportunity for investors seeking AI exposure.",
      "url": "https://247wallst.com/investing/2025/11/24/why-the-selloff-in-micron-technology-stock-never-made-sense/",
      "source": "24/7 Wall St.",
      "published": "20251124T162121",
      "overall_sentiment_score": 0.329871,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.297069,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.854239
    },
    {
      "title": "Tesla (NASDAQ: TSLA) Bull, Base and Bear Price Prediction and Forecast",
      "summary": "This article provides a bull, base, and bear price prediction and forecast for Tesla (NASDAQ: TSLA), analyzing its current stock performance, Q3 earnings, and future growth drivers like the Cybertruck, self-driving capabilities, and Optimus robot. It also considers challenges such as increased competition, insider selling, and negative public perception, offering various analyst price targets and outlining key factors influencing Tesla's stock trajectory.",
      "url": "https://247wallst.com/forecasts/2025/11/24/tesla-tsla-bull-base-bear-price-prediction-and-forecast/",
      "source": "24/7 Wall St.",
      "published": "20251124T150647",
      "overall_sentiment_score": 0.095089,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.142303,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.61878
    },
    {
      "title": "GE HealthCare submits AI-powered photon CT system to FDA",
      "summary": "GE HealthCare announced the submission of its Photonova Spectra system, an AI-powered photon-counting computed tomography (PCCT) system, to the FDA for 510(k) clearance. This new system utilizes proprietary Deep Silicon detector technology to provide ultra-high-definition imaging with enhanced spectral and spatial resolution, aiming to improve disease detection, characterization, and monitoring. The company believes Photonova Spectra will redefine decision-making and care delivery by improving image quality and streamlining workflows in fast-paced healthcare environments.",
      "url": "https://www.massdevice.com/ge-healthcare-submits-ai-powered-photon-ct-fda/",
      "source": "MassDevice",
      "published": "20251124T150631",
      "overall_sentiment_score": 0.273235,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.230498,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.630274
    },
    {
      "title": "Is Advanced Micro Devices AMD a Buy? Analyst Insights & Stock Outlook",
      "summary": "This article examines whether Advanced Micro Devices (AMD) is a good investment, focusing on key financial metrics like earnings growth, analyst ratings, and institutional ownership. It highlights AMD's strong performance in AI and data center markets, despite some concerns about its P/E ratio. The analysis concludes that while AMD shows promise, investors should consider its valuation against its growth potential.",
      "url": "https://www.msn.com/en-us/money/markets/is-advanced-micro-devices-amd-a-buy-analyst-insights-stock-outlook/ar-AA1R3fl1?ocid=finance-verthp-feeds",
      "source": "MSN",
      "published": "20251124T150544",
      "overall_sentiment_score": 0.223079,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.206661,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.609669
    },
    {
      "title": "Pure-Play vs Big Tech in Quantum: How IBM, NVDA, IONQ Stand at '25 End",
      "summary": "The quantum computing industry gained significant momentum in 2025, with both pure-play companies like IonQ and D-Wave, and big tech players such as IBM and NVIDIA, making substantial advancements. While pure-plays offer high upside linked to quantum breakthroughs but also steep risks and volatility, big tech provides a more stable way to benefit from quantum's long-term rise due to diversified cash flows and deep R&D. Investors seeking asymmetric returns might consider modest positions in pure-plays, while those prioritizing risk-adjusted performance should lean towards big tech.",
      "url": "https://finviz.com/news/237853/pure-play-vs-big-tech-in-quantum-how-ibm-nvda-ionq-stand-at-25-end",
      "source": "Finviz",
      "published": "20251124T150000",
      "overall_sentiment_score": 0.319153,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.316647,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.871854
    },
    {
      "title": "TSLQ Breakout Stalls As Tesla's AI Chip Shockwave Flips The Trade",
      "summary": "The Tradr 2X Short TSLA Daily ETF (TSLQ) experienced a significant setback after Tesla CEO Elon Musk revealed the company's extensive in-house AI-chip strategy. This disclosure caused Tesla's stock to jump over 7%, leading to a nearly 15% plunge in TSLQ and essentially erasing its strong November gains. The article details the factors that previously favored TSLQ, such as weak Tesla sales and valuation concerns, and how Musk's AI announcement dramatically shifted investor sentiment.",
      "url": "https://www.benzinga.com/etfs/specialty-etfs/25/11/49042061/tesla-stock-etf-tslq-price-trend",
      "source": "Benzinga",
      "published": "20251124T144700",
      "overall_sentiment_score": 0.237312,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.431294,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.854177
    },
    {
      "title": "Broadcom and these AI stocks are surging as plays on Alphabet’s rapid rise",
      "summary": "Shares of AI-related companies like Broadcom, Celestica, and Lumentum are experiencing a surge, benefiting from Alphabet's recent stock run. Alphabet, initially perceived as an AI laggard, has seen a rapid turnaround due to positive developments in its AI sector, notably with its new Gemini 3 AI model outperforming competitors. This success has propelled Alphabet close to a $4 trillion market capitalization, boosting its key suppliers.",
      "url": "https://www.marketwatch.com/story/broadcom-and-these-stocks-are-surging-as-plays-on-alphabets-rapid-rise-0648a61c?gaa_at=eafs&gaa_n=AWEtsqcK-cwjgZBmUSw5AP5Y6MAX0uJqUV-HE1FctSpbutSMJigCiXaqSXDB&gaa_ts=6924c13a&gaa_sig=VvFPNaRJs7DPviCJgK-qDgQM1mU9_eyQzbkk5Bn_lrofMSzqL8aAAiS6JTL1pk4c44ZWEf-Ri8xOWd6C0kk_eg%3D%3D",
      "source": "MarketWatch",
      "published": "20251124T141200",
      "overall_sentiment_score": 0.403256,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.319818,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.632356
    },
    {
      "title": "Putnam Premier Income Trust (NYSE:PPT) Plans Monthly Dividend of $0.03",
      "summary": "Putnam Premier Income Trust (NYSE:PPT) has declared a monthly dividend of $0.026 per share, with an ex-dividend date of February 20th and payment on February 27th. This dividend implies an annualized yield of 8.8%. Following the announcement, shares of PPT rose 0.3% to $3.55, with trading volume of 182,910 shares.",
      "url": "https://www.marketbeat.com/instant-alerts/putnam-premier-income-trust-nyseppt-plans-monthly-dividend-of-003-2025-11-20/",
      "source": "MarketBeat",
      "published": "20251124T140859",
      "overall_sentiment_score": 0.078705,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.140719,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.640967
    },
    {
      "title": "The QQQ ETF Points to What’s Next for Stocks… And You Probably Won’t Like the Answer",
      "summary": "This article analyzes the Invesco Nasdaq 100 ETF (QQQ) and its implications for the broader stock market, suggesting a potential downward trend despite recent rallies. The author highlights the significant outperformance of QQQ compared to equal-weight S&P 500 ETFs and points to technical indicators like a declining 20-day moving average and a negative Percentage Price Oscillator (PPO) as signs of a risky market.",
      "url": "https://markets.financialcontent.com/stocks/article/barchart-2025-11-24-the-qqq-etf-points-to-whats-next-for-stocks-and-you-probably-wont-like-the-answer?Language=spanish",
      "source": "Markets Financial Content",
      "published": "20251124T135400",
      "overall_sentiment_score": -0.149174,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.128011,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.899251
    },
    {
      "title": "Johnson & Johnson Collaborates with NVIDIA to Advance Healthcare Robotics Using the Isaac Platform",
      "summary": "Johnson & Johnson MedTech is collaborating with NVIDIA to advance healthcare robotics using the Isaac platform. This partnership involves leveraging physical AI simulation to develop robotic platforms, specifically applying these simulations to the MONARCH Platform for Urology for device design, clinical workflow preparation, and training. The goal is to create high-fidelity digital twins to enhance technology development and improve patient outcomes in robotic surgery.",
      "url": "https://thehealthcaretechnologyreport.com/johnson-johnson-collaborates-with-nvidia-to-advance-healthcare-robotics-using-the-isaac-platform/",
      "source": "The Healthcare Technology Report.",
      "published": "20251124T135113",
      "overall_sentiment_score": 0.359224,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.395635,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.868074
    },
    {
      "title": "Amazon announces $50B AI and supercomputing investment for US government agencies",
      "summary": "Amazon announced a $50 billion investment to build AI and high-performance computing infrastructure specifically for US government agencies, starting in 2026. This initiative aims to expand computing capacity across AWS Top Secret, AWS Secret, and AWS GovCloud regions, providing federal agencies with broader access to advanced AI tools for critical missions. The investment is expected to add nearly 1.3 gigawatts of AI and supercomputing capacity and fundamentally transform how federal agencies leverage supercomputing.",
      "url": "https://www.proactiveinvestors.com/companies/news/1083098/amazon-announces-50b-ai-and-supercomputing-investment-for-us-government-agencies-1083098.html",
      "source": "Proactive financial news",
      "published": "20251124T132700",
      "overall_sentiment_score": 0.323928,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.342224,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.612569
    },
    {
      "title": "GE HealthCare’s Photonova™ Spectra with Deep Silicon reimagines photon-counting CT to see more, know more and achieve more",
      "summary": "GE HealthCare has announced the submission of its Photonova Spectra photon-counting CT system, featuring proprietary Deep Silicon detector technology and advanced AI algorithms, for 510(k) clearance to the U.S. FDA. This system aims to revolutionize medical imaging by offering higher spectral and spatial resolution, enhanced material separation, and simplified workflows for a wide range of clinical specialties including neurology, oncology, musculoskeletal, thoracic, and cardiac imaging. The Photonova Spectra is designed to deliver greater diagnostic confidence and precision care through its ability to harness vast amounts of data using NVIDIA’s accelerated computing technology.",
      "url": "https://www.morningstar.com/news/business-wire/20251124194716/ge-healthcares-photonova-spectra-with-deep-silicon-reimagines-photon-counting-ct-to-see-more-know-more-and-achieve-more",
      "source": "Morningstar",
      "published": "20251124T131200",
      "overall_sentiment_score": 0.388206,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.312248,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.748072
    },
    {
      "title": "Why Micron (MU) Stock Is Up Today",
      "summary": "Shares of Micron (MU) jumped 7.2% after several Wall Street analysts, including Morgan Stanley, expressed positive outlooks and raised price targets due to increasing memory demand from AI applications. This optimism follows a previous drop related to market uncertainty over future interest rate cuts despite strong corporate earnings. Micron is up 158% year-to-date and is transforming into a key player for AI-optimized memory and storage.",
      "url": "https://finviz.com/news/237769/why-micron-mu-stock-is-up-today",
      "source": "Finviz",
      "published": "20251124T124000",
      "overall_sentiment_score": 0.332341,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.117522,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.748898
    },
    {
      "title": "Tesla AI Chief Reveals AI4 Power Jump As CEO Musk Eyes Building More Intelligent Chips Than All Rivals Combined",
      "summary": "Tesla's AI chief revealed that the AI4 chip can process a million video pixels in about a millisecond due to its integrated hardware-software design. CEO Elon Musk plans for annual chip updates, including AI5 and AI6, and anticipates building a \"gigantic\" chip fabrication plant to meet future demand for AI and robotics, potentially surpassing the combined output of all other AI chipmakers. Retail sentiment for Tesla was bearish on Stocktwits despite bullish price predictions for its stock.",
      "url": "https://stocktwits.com/news-articles/markets/equity/tesla-ai-chief-reveals-ai-4-power-jump-as-ceo-musk-eyes-building-more-intelligent-chips-than-all-rivals-combined/cL5GU9HREfS",
      "source": "Stocktwits",
      "published": "20251124T120500",
      "overall_sentiment_score": 0.186036,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.129996,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.637367
    },
    {
      "title": "Elfun Trusts Significantly Reduces Stake in Broadcom Inc by 60.7%",
      "summary": "Elfun Trusts significantly reduced its stake in Broadcom Inc. (NASDAQ: AVGO) by 60.7% in Q3 2025 as part of its strategic investment changes. The fund also made new investments in Advanced Micro Devices Inc (NASDAQ: AMD) and BJ's Wholesale Club Holdings Inc (NYSE: BJ), and increased holdings in Eli Lilly and Co (NYSE: LLY) and Waste Management Inc (NYSE: WM). Concurrently, Elfun Trusts fully exited its positions in Kenvue Inc (NYSE: KVUE) and Vertex Pharmaceuticals Inc (NASDAQ: VRTX).",
      "url": "https://finance.yahoo.com/news/elfun-trusts-significantly-reduces-stake-170023446.html",
      "source": "Yahoo Finance",
      "published": "20251124T120000",
      "overall_sentiment_score": 0.176462,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.093633,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.55914
    },
    {
      "title": "ALAB - Astera Labs Inc Stock Price and Quote",
      "summary": "This article provides a detailed stock quote and financial data for Astera Labs Inc. (ALAB), including real-time price, key financial metrics, recent news, and extensive insider trading activity. It highlights the company's performance, analyst ratings, and its role as a semiconductor company for AI and cloud infrastructure.",
      "url": "https://finviz.com/quote.ashx?t=ALAB",
      "source": "Finviz",
      "published": "20251124T115211",
      "overall_sentiment_score": 0.102528,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.134525,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.629853
    },
    {
      "title": "'The Big Short' investor Michael Burry on AI bubble: 'There is a Cisco at the center of it all...Its name is Nvidia'",
      "summary": "Michael Burry, known from \"The Big Short,\" warns of an imminent AI bubble, comparing Nvidia to Cisco during the dot-com bust. He argues that just as Cisco was at the center of the dot-com bubble, Nvidia is playing a similar role in today's AI boom, pointing to its ballooning valuation and questioning the longevity of its products. Burry's hedge fund recently bought put options on Nvidia and Palantir, signaling his bearish outlook.",
      "url": "https://fortune.com/2025/11/24/big-short-investor-michael-burry-nvidia-cisco-ai-bubble/",
      "source": "Fortune",
      "published": "20251124T112300",
      "overall_sentiment_score": 0.0095,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.03725,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.301235
    },
    {
      "title": "Franklin Resources Inc. Has $102.28 Million Stock Position in Comfort Systems USA, Inc. $FIX",
      "summary": "Franklin Resources Inc. significantly increased its stake in Comfort Systems USA (NYSE: FIX) by 19.5% in Q2, now holding 190,737 shares valued at $102.28 million. Despite recent insider selling, analysts maintain a \"Buy\" rating with an average target price of $892.75, and UBS raising its target to $1,140. The company also announced an increase in its quarterly dividend to $0.60 per share, payable on November 24th.",
      "url": "https://www.marketbeat.com/instant-alerts/filing-franklin-resources-inc-has-10228-million-stock-position-in-comfort-systems-usa-inc-fix-2025-11-24/",
      "source": "MarketBeat",
      "published": "20251124T112104",
      "overall_sentiment_score": 0.328026,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.31508,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.61958
    },
    {
      "title": "Nvidia's Fundamentals Remain Strong, Buy Into The Dip (NASDAQ:NVDA)",
      "summary": "Nvidia Corporation is reiterated as a Strong Buy with a $404/share price target, driven by robust AI-driven revenue growth and strong hyperscaler demand for its data center chips. Despite recent stock dips, NVDA trades at a discount to its historical price/sales range, presenting an attractive entry point, with domestic demand poised to offset potential geopolitical risks.",
      "url": "https://seekingalpha.com/article/4847105-nvidia-fundamentals-remain-strong-buy-into-the-dip",
      "source": "Seeking Alpha",
      "published": "20251124T095100",
      "overall_sentiment_score": 0.22645,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.409883,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "FXAIX vs VOO: Is Fidelity or Vanguard Better for S&P 500 Exposure?",
      "summary": "This article compares Fidelity's FXAIX and Vanguard's VOO, both S&P 500 index funds, to help investors decide which is better for their needs. It analyzes their fees, structure (mutual fund vs. ETF), tax efficiency, performance, and suitability for different account types and trading styles. While FXAIX has a slightly lower expense ratio, VOO generally offers better tax efficiency and intraday tradability.",
      "url": "https://www.ebc.com/forex/fxaix-vs-voo-is-fidelity-or-vanguard-better-for-s-and-amp-p-500-exposure",
      "source": "EBC Financial Group",
      "published": "20251124T093156",
      "overall_sentiment_score": 0.293367,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.347544,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.636201
    },
    {
      "title": "Will Microchip Technology's (MCHP) Launch of LAN866x Devices Shift Its Automotive Connectivity Narrative?",
      "summary": "Microchip Technology recently launched its LAN866x family of 10BASE-T1S endpoint devices to simplify in-vehicle Ethernet network integration for automotive manufacturers. While this innovation supports the shift towards software-defined vehicles and next-generation connectivity solutions, the company still faces challenges with high inventory and elevated debt levels. Investors are encouraged to consider Microchip's long-term growth prospects, including a projected 15.9% annual revenue growth and a fair value of $74.68.",
      "url": "https://simplywall.st/stocks/us/semiconductors/nasdaq-mchp/microchip-technology/news/will-microchip-technologys-mchp-launch-of-lan866x-devices-sh",
      "source": "Simply Wall Street",
      "published": "20251124T092607",
      "overall_sentiment_score": 0.161842,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.149328,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.642462
    },
    {
      "title": "WMT - Walmart Inc Stock Price and Quote",
      "summary": "This article provides a detailed financial overview of Walmart Inc. (WMT), including its stock price, key financial metrics, analyst ratings, and recent insider transactions. It also compiles recent news headlines related to Walmart's performance, e-commerce growth, and market position.",
      "url": "https://finviz.com/quote.ashx?t=WMT",
      "source": "Finviz",
      "published": "20251124T092214",
      "overall_sentiment_score": 0.182909,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": -0.305125,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.637008
    },
    {
      "title": "ZJK Industrial and Chaince Digital Announce Strategic Partnership for U.S.-Based Precision Components R&D and Manufacturing Base Serving AI & Semiconductor and Other Industries, with Expected Investment Plan of Up to $200 Million, Advancing the “Ma",
      "summary": "ZJK Industrial and Chaince Digital have formed a strategic partnership to establish a U.S.-based precision components R&D and manufacturing Gigafactory, requiring an investment plan of up to $200 million. This initiative aims to bolster the \"Made in America\" strategy by producing high-value precision and hardware components for AI, semiconductor, electronics, and automotive industries. Chaince Securities will also serve as ZJK's capital markets strategic advisor for the next five years.",
      "url": "https://fox59.com/business/press-releases/globenewswire/9591067/zjk-industrial-and-chaince-digital-announce-strategic-partnership-for-u-s-based-precision-components-rd-and-manufacturing-base-serving-ai-semiconductor-and-other-industries-with-expected-investme",
      "source": "Fox 59",
      "published": "20251124T090000",
      "overall_sentiment_score": 0.374632,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.321249,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.640096
    },
    {
      "title": "Here's Why Oracle Corporation (ORCL) Has Fallen More Than 39% in 2 Months",
      "summary": "Oracle Corporation (ORCL) has experienced a significant 39% decline in its stock price over the past two months, primarily due to concerns about an emerging AI bubble and its rising debt, which now exceeds $100 billion. Despite this, analysts like Robert Oliver from Robert W. Braid and Brent Thill from Jefferies have reiterated \"Buy\" ratings, though some have lowered price targets. The company's credit-default swaps have tripled, indicating increased market concern over its debt trajectory.",
      "url": "https://finviz.com/news/237351/heres-why-oracle-corporation-orcl-has-fallen-more-than-39-in-2-months",
      "source": "Finviz",
      "published": "20251124T085800",
      "overall_sentiment_score": -0.106359,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.111222,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.633228
    },
    {
      "title": "Oppenheimer Initiates International Business Machines Corporation (IBM) With a Buy",
      "summary": "Oppenheimer initiated coverage on International Business Machines Corporation (IBM) with a Buy rating and a $360 price target, citing potential double-digit revenue growth from its software portfolio and sustained low single-digit growth in its consulting segment. The company is also making advancements in quantum computing with plans to link quantum computers over long distances by 2030 and recently unveiled its experimental quantum computing chip, Loon. This positive outlook is supported by a prior Buy rating from Evercore ISI with a $315 price target.",
      "url": "https://finviz.com/news/237350/oppenheimer-initiates-international-business-machines-corporation-ibm-with-a-buy",
      "source": "Finviz",
      "published": "20251124T085800",
      "overall_sentiment_score": 0.20427,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": -0.123247,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.620691
    },
    {
      "title": "Aris Mining Corp stock hits 52-week high at 12.1 USD",
      "summary": "Aris Mining Corp (ARMN) has achieved a new 52-week high of $12.10, showcasing a 183.45% appreciation over the last year and a 90.95% return in the past six months. With a market capitalization of $2.44 billion and a \"GREAT\" financial health rating, the company's strong performance reflects significant investor confidence. Despite a high P/E ratio of 45.57, analysts anticipate continued net income growth, suggesting potential for future gains.",
      "url": "https://www.investing.com/news/company-news/aris-mining-corp-stock-hits-52week-high-at-121-usd-93CH-4370754",
      "source": "Investing.com",
      "published": "20251124T053029",
      "overall_sentiment_score": -0.117455,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.074822,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.601137
    },
    {
      "title": "Alger AI Enablers & Adopters ETF Q3 2025 Portfolio Update",
      "summary": "The Alger AI Enablers & Adopters ETF surpassed the S&P 500 Index in Q3 2025, with NVIDIA Corporation, Nebius Group N.V., and Talen Energy Corp significantly contributing to its performance. Conversely, Netflix, Inc., Twilio, Inc., and Spotify Technology were among the top detractors. This update was excerpted from the Alger AI Enablers & Adopters ETF Q3 2025 Commentary.",
      "url": "https://seekingalpha.com/article/4846957-alger-ai-enablers-and-adopters-etf-q3-2025-portfolio-update",
      "source": "Seeking Alpha",
      "published": "20251124T052213",
      "overall_sentiment_score": 0.130093,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.434245,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.821829
    },
    {
      "title": "Cemtrex to acquire aerospace systems firm Invocon for $7.06 million",
      "summary": "Cemtrex, Inc. (NASDAQ:CETX) has announced a definitive agreement to acquire Invocon, Inc., an aerospace and defense systems-engineering firm, for $7.06 million. This acquisition, notably higher than Cemtrex's current market cap, will establish a new Aerospace & Defense segment and aligns with Cemtrex's strategy to expand into high-reliability technologies. Invocon brings 40 years of experience with mission-critical instrumentation used in significant aerospace applications including space shuttles and the International Space Station.",
      "url": "https://www.investing.com/news/company-news/cemtrex-to-acquire-aerospace-systems-firm-invocon-for-706-million-93CH-4370693",
      "source": "Investing.com",
      "published": "20251124T052208",
      "overall_sentiment_score": 0.129274,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.112931,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.607043
    },
    {
      "title": "Bull of the Day: Advanced Energy Industries, Inc. (AEIS)",
      "summary": "Advanced Energy Industries (AEIS) is highlighted as a strong \"picks-and-shovels\" AI stock due to its crucial role in providing power conversion solutions for AI data centers and semiconductor manufacturing. The company saw significant growth in its Data Center Computing segment and received a Zacks Rank #1 (Strong Buy) following positive earnings and raised guidance. Investors are encouraged to consider AEIS despite recent market pullbacks, as its valuation appears attractive relative to the tech sector.",
      "url": "https://finviz.com/news/235695/bull-of-the-day-advanced-energy-industries-inc-aeis",
      "source": "Finviz",
      "published": "20251124T050251",
      "overall_sentiment_score": 0.452759,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.302702,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.826479
    },
    {
      "title": "ProShares UltraPro QQQ (TQQQ) Surges As Rate Cut Hopes Return: Here's What's Going On",
      "summary": "ProShares UltraPro QQQ (TQQQ) is trading higher as traders bet on leveraged Nasdaq-100 exposure amidst renewed hopes for Federal Reserve rate cuts. Goldman Sachs' call for a December rate cut and historical Nasdaq-100 rebound patterns after significant drops are driving this bullish sentiment. TQQQ, a 3x-leveraged ETF, is benefiting from this shift, with its shares up 6.8% at $50.72.",
      "url": "https://www.sahmcapital.com/news/content/proshares-ultrapro-qqq-tqqq-surges-as-rate-cut-hopes-return-heres-whats-going-on-2025-11-24",
      "source": "Sahm",
      "published": "20251124T050159",
      "overall_sentiment_score": 0.586166,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.529002,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.61782
    },
    {
      "title": "ZJK Industrial and Chaince Digital Announce Strategic Partnership for U.S.-Based Precision Components R&D and Manufacturing Base Serving AI & Semiconductor and Other Industries, With Expected Investment Plan of Up to $200 Million, Advancing the \"Made...",
      "summary": "ZJK Industrial and Chaince Digital have formed a strategic partnership to establish a U.S.-based precision components R&D and manufacturing Gigafactory for AI, semiconductor, and other advanced tech industries. The initiative, which includes an expected investment of up to $200 million, aims to support the \"Made in America\" strategy and strengthen the U.S. high-end manufacturing ecosystem. Chaince Securities will also advise ZJK on capital markets for five years.",
      "url": "https://news.futunn.com/en/post/65342510/zjk-industrial-and-chaince-digital-announce-strategic-partnership-for-us",
      "source": "富途牛牛",
      "published": "20251124T050135",
      "overall_sentiment_score": 0.33716,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.330394,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.611243
    },
    {
      "title": "Bridgewater Associates Is Giving Up on Lyft Stock. Should You?",
      "summary": "Bridgewater Associates has fully divested its 2.48 million shares in Lyft (LYFT) during Q3 2025, despite Lyft's recent achievements in profitability, ridership, and autonomous mobility. Lyft reported record Q3 2025 revenues of $1.7 billion, gross bookings of $4.8 billion, a net income of $46.1 million, and accelerating active rider growth. The company anticipates continued improvement in Q4, forecasting ride volumes to grow in the mid-to-high teens and adjusted EBITDA of $135-$155 million, supported by strategic partnerships and acquisitions.",
      "url": "https://www.barchart.com/story/news/36291482/bridgewater-associates-is-giving-up-on-lyft-stock-should-you",
      "source": "Barchart.com",
      "published": "20251124T045907",
      "overall_sentiment_score": 0.181061,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.343212,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.618324
    },
    {
      "title": "authID Inc: director Garchik buys $216k in shares",
      "summary": "authID Inc. director Stephen Jeffrey Garchik recently purchased 126,608 shares of common stock for $216,499, despite the stock having fallen significantly over the past year. This insider buying happened after authID reported a net loss in Q3 2025 but also noted growth in Annual Recurring Revenue, strategic partnerships, and a successful direct offering. The company maintains a strong liquidity position and analysts view its stock as undervalued.",
      "url": "https://www.investing.com/news/insider-trading-news/authid-inc-director-garchik-buys-216k-in-shares-93CH-4375942",
      "source": "Investing.com",
      "published": "20251124T045334",
      "overall_sentiment_score": 0.302874,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.232663,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.634457
    },
    {
      "title": "Nvidia's Strong Earnings Despite AI Bubble Fears Spark Intrigue Toward REX Shares' Synthetically Leveraged NVDX ETF",
      "summary": "Nvidia (NASDAQ: NVDA) reported strong Q3 earnings, surpassing revenue expectations with $57 billion and beating EPS targets with $1.30, demonstrating robust performance despite AI sector bubble fears. While NVDA stock faced a post-earnings decline due to broader market concerns, analyst Dan Ives views the results as a \"major validation moment for the AI Revolution.\" For investors bullish on Nvidia's long-term prospects, the T-Rex 2X Long Nvidia Daily Target ETF (BATS: NVDX) offers a synthetically leveraged alternative to gain amplified exposure to NVDA's daily performance, albeit with significant risks.",
      "url": "https://www.inkl.com/news/nvidia-s-strong-earnings-despite-ai-bubble-fears-spark-intrigue-toward-rex-shares-synthetically-leveraged-nvdx-etf",
      "source": "inkl",
      "published": "20251124T045133",
      "overall_sentiment_score": 0.063678,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.243179,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.915298
    },
    {
      "title": "Investors Appear Satisfied With Sociedad Química y Minera de Chile S.A.'s (NYSE:SQM) Prospects As Shares Rocket 28%",
      "summary": "Sociedad Química y Minera de Chile S.A. (NYSE:SQM) has seen a 28% share price increase over the last month and a 51% rise in the last year, leading to a high price-to-sales (P/S) ratio of 3.9x compared to its industry. Despite recent revenue decline, the market appears optimistic due to analysts forecasting 16% annual revenue growth for the next three years, significantly outperforming the industry's 8.8% projection. This strong growth expectation explains the elevated P/S ratio and investor confidence.",
      "url": "https://simplywall.st/stocks/us/materials/nyse-sqm/sociedad-quimica-y-minera-de-chile/news/investors-appear-satisfied-with-sociedad-qumica-y-minera-de-1",
      "source": "Simply Wall Street",
      "published": "20251124T044337",
      "overall_sentiment_score": 0.245449,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.35567,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.636412
    },
    {
      "title": "House of Doge and Brag House Holdings Mark Major Milestone as Partner 21Shares Launches 21Shares 2x Long Dogecoin ETF (TXXD)",
      "summary": "House of Doge, the corporate arm of the Dogecoin Foundation, and Brag House Holdings celebrate the launch of the 21Shares 2x Long Dogecoin ETF (TXXD) by partner 21Shares. This new leveraged ETF, trading on NASDAQ as of November 20, 2025, offers investors 2x daily exposure to Dogecoin's performance before fees and expenses. The collaboration highlights Dogecoin's evolution beyond a meme, supported by growing utility and a strong community, and provides a regulated, transparent investment vehicle.",
      "url": "https://www.citybiz.co/article/775935/house-of-doge-and-brag-house-holdings-mark-major-milestone-as-partner-21shares-launches-21shares-2x-long-dogecoin-etf-txxd/",
      "source": "citybiz",
      "published": "20251124T044311",
      "overall_sentiment_score": 0.36278,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.30623,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.61807
    },
    {
      "title": "QQQI ETF Soars With $297.7M Inflows, 14.09% Yield, and $53.93 Price — Nasdaq Income Giant Strengthens",
      "summary": "The NEOS NASDAQ-100 High Income ETF (NYSEARCA:QQQI) has reinforced its leadership among high-yield income ETFs, attracting $297.7 million in new capital over the last week of November. The fund, which trades near its 52-week high at $53.86 and boasts $6.27 billion in assets under management, offers a 14.09% annualized yield with monthly distributions. Its robust performance, tax efficiency, and downside protection make it a strong choice for income-focused investors.",
      "url": "https://www.tradingnews.com/news/qqqi-etf-draws-297m-usd-inflows-as-price-nears-53-usd",
      "source": "TradingNEWS",
      "published": "20251124T042414",
      "overall_sentiment_score": 0.377738,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.30437,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.729436
    },
    {
      "title": "Acushnet Holdings Corp stock hits all-time high at 84.65 USD",
      "summary": "Acushnet Holdings Corp (GOLF) has reached an all-time high stock price of $84.65, signifying strong market performance and investor confidence. The company has seen a 13.63% increase over the past year and a 22.22% gain in the last six months, driven by consistent demand for its golf products and apparel. Despite a slight EPS miss in its latest quarterly earnings, impressive revenue figures led KeyBanc to raise its price target for Acushnet to $90 with an Overweight rating.",
      "url": "https://www.investing.com/news/company-news/acushnet-holdings-corp-stock-hits-alltime-high-at-8465-usd-93CH-4377603",
      "source": "Investing.com",
      "published": "20251124T042254",
      "overall_sentiment_score": 0.097734,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.105089,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.641389
    },
    {
      "title": "What Is Lincoln Electric Holdings, Inc.'s (NASDAQ:LECO) Share Price Doing?",
      "summary": "Lincoln Electric Holdings, Inc. (NASDAQ:LECO) experienced significant share price movement, rising to US$248 before falling to US$221. The stock is currently trading around US$222, appearing fairly valued based on Simply Wall St's model, with intrinsic value estimated at $220.24. The company has a positive outlook, with earnings expected to grow by 32% in the coming years.",
      "url": "https://simplywall.st/stocks/us/capital-goods/nasdaq-leco/lincoln-electric-holdings/news/what-is-lincoln-electric-holdings-incs-nasdaqleco-share-pric-2",
      "source": "Simply Wall Street",
      "published": "20251124T042200",
      "overall_sentiment_score": 0.187,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.330287,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.610385
    },
    {
      "title": "Hexcel Corp stock hits 52-week high at 74.39 USD",
      "summary": "Hexcel Corp's stock has hit a 52-week high of $74.39, reflecting strong performance with a 19.25% increase over the past year and a 42.62% return in the last six months. This achievement comes as the company reported a strong third quarter in 2025, surpassing analyst expectations for earnings per share and revenue. Michael C. Lenz has also been appointed as Executive Vice President and Interim Chief Financial Officer.",
      "url": "https://www.investing.com/news/company-news/hexcel-corp-stock-hits-52week-high-at-7439-usd-93CH-4377803",
      "source": "Investing.com",
      "published": "20251124T042148",
      "overall_sentiment_score": 0.127879,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.109596,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.551656
    },
    {
      "title": "Qualcomm Inc (QCOM) Price Today",
      "summary": "This article provides current and historical price information for Qualcomm Inc (QCOM), including its market cap, daily volume, and a description of the company's core business in wireless technology and chip design. It also presents data on tokenized Qualcomm stock and lists other popular real-world assets.",
      "url": "https://coinmarketcap.com/real-world-assets/qualcomm/",
      "source": "CoinMarketCap",
      "published": "20251124T042138",
      "overall_sentiment_score": 0.146739,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.146101,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.637504
    },
    {
      "title": "Evogene Ltd. (NASDAQ:EVGN) Q3 2025 Earnings Call Transcript",
      "summary": "Evogene Ltd. (NASDAQ:EVGN) reported its Q3 2025 earnings, beating expectations with an EPS of $-0.31 against an anticipated $-0.41. The company highlighted a strategic shift towards computational chemistry, focusing on generative AI for small molecule design in both pharmaceutical and agriculture industries, which led to significant cost reductions in operating expenses. Evogene anticipates further collaborations and internal pipeline growth, particularly with its ChemPass AI platform, aiming for increased financial rewards in the pharma sector after previous successes in agriculture.",
      "url": "https://www.insidermonkey.com/blog/evogene-ltd-nasdaqevgn-q3-2025-earnings-call-transcript-1648888/",
      "source": "Insider Monkey",
      "published": "20251124T040118",
      "overall_sentiment_score": 0.267348,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.348722,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.621702
    },
    {
      "title": "Capital Clean Energy Carriers stock initiated with Buy rating at Clarksons Platou",
      "summary": "Clarksons Platou initiated coverage on Capital Clean Energy Carriers Corp. (NASDAQ: CCEC) with a Buy rating and a price target of $23.00. The company specializes in clean energy transportation, reporting a strong gross profit margin of 80.48%, revenue growth of 32.74%, and a P/E ratio of 7.39. This positive outlook follows robust Q3 2025 earnings and strategic asset sales.",
      "url": "https://www.investing.com/news/analyst-ratings/capital-clean-energy-carriers-stock-initiated-with-buy-rating-at-clarksons-platou-93CH-4374502",
      "source": "Investing.com",
      "published": "20251124T035145",
      "overall_sentiment_score": 0.119853,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.082679,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.566381
    },
    {
      "title": "EZGO announces 1-for-25 reverse share split effective Nov 21",
      "summary": "EZGO Technologies Ltd. announced a 1-for-25 reverse share split, effective November 21, 2025, to increase its share price and maintain its Nasdaq listing. The split will reduce outstanding shares from over 21 million to approximately 868,029, with fractional shares rounded up. This move comes as the company's stock has faced significant declines, and they also recently enacted a warrant exchange agreement to manage their capital structure.",
      "url": "https://www.investing.com/news/company-news/ezgo-announces-1for25-reverse-share-split-effective-nov-21-93CH-4367440",
      "source": "Investing.com",
      "published": "20251124T034512",
      "overall_sentiment_score": -0.076313,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.022549,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.598395
    }
  ]
}