{
  "ticker": "NVDA",
  "date": "2026-01-05",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T11:41:03.762931",
  "source": "alpha_vantage",
  "article_count": 50,
  "articles": [
    {
      "title": "3 Stocks Under $50 We Think Twice About",
      "summary": "This article advises caution on three stocks under $50: Jamf (JAMF), Smith & Wesson (SWBI), and Vishay Precision (VPG), citing concerns like underwhelming growth, suboptimal cost structures, and declining revenues. It suggests investors consider alternative, higher-quality stocks instead, highlighting past successes from StockStory's recommendations.",
      "url": "https://finviz.com/news/267891/3-stocks-under-50-we-think-twice-about",
      "source": "Finviz",
      "published": "20260105T233400",
      "overall_sentiment_score": -0.052584,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.32607,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.647929
    },
    {
      "title": "As AMD chases Nvidia, here’s how it’s positioning itself for the future of AI",
      "summary": "AMD CEO Lisa Su highlighted the company's AI strategy at CES, introducing the MI455 chip with significantly more transistors and HBM4 memory. Su emphasized AMD's role in addressing the ongoing demand for computing power and positioning itself as a strong competitor in the AI hardware market. The company aims to provide cost benefits and enhanced performance with its next-generation products.",
      "url": "https://www.marketwatch.com/story/as-amd-chases-nvidia-heres-how-its-positioning-itself-for-the-future-of-ai-09048ea4?gaa_at=eafs&gaa_n=AWEtsqeadh8lJ_q-4aA3NPEgPCHEOBFDyi-uh80EbNmdRdkWqEtpFxPaK6DC&gaa_ts=695c9ba3&gaa_sig=yz8_YGv6Bas6fOTBsjrkA5R_C03-K-BjVOjEezQwtG3Mlgvr9i2E78bhsfjVB1hxr-M2EMAXJ24CpeXL8jhwpg%3D%3D",
      "source": "MarketWatch",
      "published": "20260105T231300",
      "overall_sentiment_score": 0.277497,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.210647,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.806531
    },
    {
      "title": "NVIDIA Kicks Off the Next Generation of AI With Rubin — Six New Chips, One Incredible AI Supercomputer",
      "summary": "NVIDIA has launched the Rubin platform, a new generation of AI supercomputers featuring six advanced chips designed to accelerate AI development. The Rubin platform promises significantly reduced training times and inference token costs, aiming for up to a 10x reduction in inference token cost and requiring 4x fewer GPUs for MoE models compared to the Blackwell platform. Major industry players like Microsoft, OpenAI, and Meta are already on board to adopt this new technology, which introduces innovations like NVIDIA Vera CPU, Rubin GPU, and NVLink 6 Switch.",
      "url": "https://nvidianews.nvidia.com/news/rubin-platform-ai-supercomputer",
      "source": "NVIDIA Newsroom",
      "published": "20260105T231003",
      "overall_sentiment_score": 0.332518,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.487824,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Credo Technology Group Holding Ltd (CRDO): New Buy Recommendation for This Technology Giant",
      "summary": "Mizuho Securities reiterated a Buy rating on Credo Technology Group Holding Ltd (CRDO) with a price target of $225.00. This recommendation comes despite negative corporate insider sentiment, with several insiders selling shares recently. The company significantly grew its quarterly revenue to $268.03 million and achieved a net profit of $82.64 million, a substantial improvement from a net loss in the previous year.",
      "url": "https://www.theglobeandmail.com/investing/markets/stocks/CRDO/pressreleases/36887429/credo-technology-group-holding-ltd-crdo-new-buy-recommendation-for-this-technology-giant/",
      "source": "The Globe and Mail",
      "published": "20260105T230948",
      "overall_sentiment_score": 0.196743,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.117674,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.618147
    },
    {
      "title": "Lucid, Nuro, and Uber Unveil Global Robotaxi at CES, Announce Autonomous On-Road Testing",
      "summary": "At CES 2026, Lucid Group, Nuro, and Uber Technologies unveiled their production-intent robotaxi, designed for a global service set to launch in the San Francisco Bay Area later in 2026. The robotaxi, based on the Lucid Gravity, features advanced sensor technology, an intuitive in-cabin rider experience, and is powered by NVIDIA DRIVE AGX Thor. Autonomous on-road testing, led by Nuro, has already begun, marking a key step towards validation and market deployment.",
      "url": "https://media.lucidmotors.com/en/newsitem/1061-lucid-nuro-and-uber-unveil-global-robotaxi-at-ces-announce-autonomous-on-road-testing",
      "source": "Lucid Motors",
      "published": "20260105T230938",
      "overall_sentiment_score": 0.419756,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.346222,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.625511
    },
    {
      "title": "Credo Technology Group Holding Ltd (CRDO): New Buy Recommendation for This Technology Giant",
      "summary": "Mizuho Securities analyst Vijay Rakesh has reiterated a Buy rating on Credo Technology Group Holding Ltd (CRDO) with a price target of $225.00, citing the company's strong financial performance including $268.03 million in quarterly revenue and a net profit of $82.64 million. Despite a negative sentiment from corporate insider selling, the analyst consensus on CRDO is a Strong Buy.",
      "url": "https://www.theglobeandmail.com/investing/markets/markets-news/Tipranks/36887429/credo-technology-group-holding-ltd-crdo-new-buy-recommendation-for-this-technology-giant/",
      "source": "The Globe and Mail",
      "published": "20260105T230929",
      "overall_sentiment_score": 0.171816,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.113841,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.60439
    },
    {
      "title": "Aeva and NVIDIA to Integrate 4D LiDAR as Reference Sensor within the NVIDIA DRIVE Hyperion Platform Ecosystem",
      "summary": "Aeva announced its 4D LiDAR technology will be integrated as the reference sensor within the NVIDIA DRIVE Hyperion autonomous vehicle platform. This collaboration expands Aeva's role as a core LiDAR sensor supplier for global automotive OEMs, targeting production vehicles by 2028. The integration aims to enhance Level 3 and Level 4 automated driving by providing superior detection, tracking, and long-range performance through Aeva's unique per-point instant velocity measurement.",
      "url": "https://www.businesswire.com/news/home/20260105712373/en/Aeva-and-NVIDIA-to-Integrate-4D-LiDAR-as-Reference-Sensor-within-the-NVIDIA-DRIVE-Hyperion-Platform-Ecosystem",
      "source": "Business Wire",
      "published": "20260105T230902",
      "overall_sentiment_score": 0.550406,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.520848,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.836228
    },
    {
      "title": "Supermicro Announces Support for Upcoming NVIDIA Vera Rubin NVL72, HGX Rubin NVL8 and Expanded Rack-Scale Manufacturing Capacity for Liquid-Cooled AI Solutions",
      "summary": "Supermicro has announced expanded manufacturing capacity and liquid-cooling capabilities in collaboration with NVIDIA to support the upcoming NVIDIA Vera Rubin and Rubin platforms. This initiative aims to accelerate the deployment of data center-scale, liquid-cooled AI infrastructure, including the flagship NVIDIA Vera Rubin NVL72 SuperCluster and 2U liquid-cooled NVIDIA HGX Rubin NVL8 systems. Supermicro's Data Center Building Block Solutions (DCBBS) and advanced Direct Liquid Cooling (DLC) technology will ensure rapid and efficient delivery of these advanced AI solutions, offering significant performance, efficiency, and reliability benefits for hyperscalers and enterprises.",
      "url": "https://www.prnewswire.com/news-releases/supermicro-announces-support-for-upcoming-nvidia-vera-rubin-nvl72-hgx-rubin-nvl8-and-expanded-rack-scale-manufacturing-capacity-for-liquid-cooled-ai-solutions-302652755.html",
      "source": "PR Newswire",
      "published": "20260105T230847",
      "overall_sentiment_score": 0.302684,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.42066,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.866686
    },
    {
      "title": "Nvidia Details New A.I. Chips and Autonomous Car Project With Mercedes",
      "summary": "Nvidia introduced its new Vera Rubin A.I. chip at CES, promising increased computing power with less energy consumption. This chip, shipping later in the year, is designed to enhance A.I. training efficiency and reduce operational costs for companies like Microsoft and Amazon. Additionally, Nvidia announced a partnership with Mercedes-Benz to integrate its self-driving technology into cars this year, rivaling Tesla's Autopilot.",
      "url": "https://www.nytimes.com/2026/01/05/technology/nvidia-chips-mercedes.html",
      "source": "The New York Times",
      "published": "20260105T230837",
      "overall_sentiment_score": 0.261418,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.409062,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Mercury General (MCY): Buy, Sell, or Hold Post Q3 Earnings?",
      "summary": "Mercury General (MCY) has seen significant stock appreciation, beating the S&P 500 by 27% in six months, now trading at $90.58. Despite its recent performance, analysts are not recommending it as a buy due to slim projected revenue growth, an uninspiring return on equity, and a valuation of 2.1x forward P/B, suggesting limited upside compared to potential downside risks.",
      "url": "https://finviz.com/news/268124/mercury-general-mcy-buy-sell-or-hold-post-q3-earnings",
      "source": "Finviz",
      "published": "20260105T230400",
      "overall_sentiment_score": 0.143496,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.440058,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.605606
    },
    {
      "title": "3 Reasons LOPE is Risky and 1 Stock to Buy Instead",
      "summary": "This article identifies Grand Canyon Education (LOPE) as a risky investment due to weak student growth, barely growing EPS, and only slight improvements in projected free cash flow. The author suggests caution, despite a reasonable valuation, and recommends seeking other investment opportunities. The article concludes by promoting a curated list of \"High Quality\" alternative stock selections.",
      "url": "https://finviz.com/news/268296/3-reasons-lope-is-risky-and-1-stock-to-buy-instead",
      "source": "Finviz",
      "published": "20260105T230200",
      "overall_sentiment_score": -0.027053,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.399165,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.641835
    },
    {
      "title": "Visa (NYSE: V) Stock Price Prediction and Forecast 2026-2030 (Jan 2026)",
      "summary": "This article provides a stock price prediction and forecast for Visa (NYSE: V) from 2026 to 2030. Despite potential regulatory scrutiny, 24/7 Wall St. anticipates significant gains for Visa stock by the end of the decade, driven by its dominance in the global payments processing industry, advancements in digital payments, and strong financial performance. The forecast outlines projected revenue, EPS, and price targets for each year, with an estimated share price of $522.60 by 2030.",
      "url": "https://247wallst.com/forecasts/2026/01/01/visa-v-price-prediction-and-forecast-2025-2030/",
      "source": "24/7 Wall St.",
      "published": "20260105T222744",
      "overall_sentiment_score": 0.371779,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.316191,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.551877
    },
    {
      "title": "Could This AI ETF Surge 300% and Become the Next Nvidia?",
      "summary": "The article discusses the Invesco AI and Next Gen Software ETF (IGPT), highlighting its potential for significant long-term growth, possibly triple-digit gains, despite not being expected to replicate Nvidia's monumental returns. The ETF, which holds Nvidia as its second-largest component, has evolved from a software fund to an AI-centric one, boasting $652 million in assets and significant exposure to semiconductor and AI software companies like Adobe and Snowflake. It offers diversification while capitalizing on the substantial growth tailwinds in the AI software market, which Goldman Sachs projects to expand significantly by 2030.",
      "url": "https://finviz.com/news/267772/could-this-ai-etf-surge-300-and-become-the-next-nvidia",
      "source": "Finviz",
      "published": "20260105T222000",
      "overall_sentiment_score": 0.370619,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.303425,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.91027
    },
    {
      "title": "Why a $7 Million Bond ETF Buy Signals a Defensive Move Inside a $560 Million Portfolio",
      "summary": "LaSalle St. Investment Advisors bought 135,360 shares of the iShares 0-5 Year Investment Grade Corporate Bond ETF (SLQD), valued at $6.88 million, indicating a defensive strategy for capital preservation and steady income. This allocation, while a new position, is for diversification rather than chasing high returns, given the ETF's focus on short-duration, high-quality corporate bonds. It suggests an emphasis on risk management within its $560 million portfolio.",
      "url": "https://www.theglobeandmail.com/investing/markets/markets-news/Motley%20Fool/36894576/why-a-7-million-bond-etf-buy-signals-a-defensive-move-inside-a-560-million-portfolio/",
      "source": "The Globe and Mail",
      "published": "20260105T220923",
      "overall_sentiment_score": 0.116403,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.121733,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.61664
    },
    {
      "title": "NVIDIA BlueField-4 Powers New Class of AI-Native Storage Infrastructure for the Next Frontier of AI",
      "summary": "NVIDIA announced its BlueField-4 data processor powers the new Inference Context Memory Storage Platform, an AI-native storage infrastructure designed for gigascale inference and agentic AI. This platform extends AI agents' long-term memory, enables high-bandwidth context sharing across AI systems, and boosts tokens per second and power efficiency by up to 5x. It addresses the growing need for scalable storage infrastructure for vast context data generated by increasingly complex AI models.",
      "url": "https://nvidianews.nvidia.com/news/nvidia-bluefield-4-powers-new-class-of-ai-native-storage-infrastructure-for-the-next-frontier-of-ai",
      "source": "NVIDIA Newsroom",
      "published": "20260105T220902",
      "overall_sentiment_score": 0.332618,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.447526,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Form 424B2 GOLDMAN SACHS GROUP INC",
      "summary": "This SEC filing (Form 424B2) from Goldman Sachs Group Inc. details the terms of Autocallable Contingent Coupon Underlier-Linked Notes. These notes are linked to the performance of the Russell 2000 Index, Nasdaq-100 Technology Sector Index, and VanEck Semiconductor ETF, offering potential monthly coupons based on specific thresholds. The document outlines the redemption features, cash settlement amounts at maturity, hypothetical examples, and significant risk factors associated with this investment, including credit risk and volatility of the underlying assets.",
      "url": "https://www.streetinsider.com/SEC+Filings/Form+424B2+GOLDMAN+SACHS+GROUP+INC/25806393.html",
      "source": "StreetInsider",
      "published": "20260105T220830",
      "overall_sentiment_score": 0.182199,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.237872,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.803541
    },
    {
      "title": "NVIDIA Announces Alpamayo Family of Open-Source AI Models and Tools to Accelerate Safe, Reasoning-Based Autonomous Vehicle Development",
      "summary": "NVIDIA has unveiled the Alpamayo family of open AI models, simulation tools, and datasets aimed at accelerating the development of safe, reasoning-based autonomous vehicles. This initiative introduces chain-of-thought, reasoning-based vision language action (VLA) models that enable AVs to think through novel scenarios and explain their decisions, improving trust and safety. Mobility leaders like JLR, Lucid, and Uber, as well as the AV research community, are showing interest in adopting Alpamayo to advance level 4 autonomy.",
      "url": "https://nvidianews.nvidia.com/news/alpamayo-autonomous-vehicle-development",
      "source": "NVIDIA Newsroom",
      "published": "20260105T220814",
      "overall_sentiment_score": 0.002875,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.015808,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.333904
    },
    {
      "title": "Watch the NVIDIA CES 2026 keynote with CEO Jensen Huang live here: AI, robotics updates and more",
      "summary": "NVIDIA CEO Jensen Huang's CES 2026 keynote focused heavily on AI, robotics, and autonomous vehicles, showcasing advancements like the new Alpamayo AI for self-driving cars. The event also featured live demonstrations of robots and discussed NVIDIA's strategy for generating data to train AI using its Cosmos platform. NVIDIA remains a key player in AI infrastructure, with its announcements closely watched by both tech enthusiasts and Wall Street investors.",
      "url": "https://www.engadget.com/computing/watch-the-nvidia-ces-2026-keynote-with-ceo-jensen-huang-live-here-ai-robotics-updates-and-more-130028170.html",
      "source": "Engadget",
      "published": "20260105T220600",
      "overall_sentiment_score": 0.264233,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.45465,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "CES 2026: Intel Core Ultra Series 3 Debuts as First Built on Intel 18A",
      "summary": "Intel unveiled its Core Ultra Series 3 processors at CES 2026, marking the first AI PC platform built on Intel 18A process technology, designed and manufactured in the United States. These processors offer exceptional performance, graphics, and battery life, powering over 200 PC designs and are also certified for embedded and industrial use cases like robotics and smart cities. The new series includes Core Ultra X9 and X7 processors with integrated Intel Arc graphics, boasting significant improvements in multithread performance, gaming, and battery life.",
      "url": "https://www.intc.com/news-events/press-releases/detail/1757/ces-2026-intel-core-ultra-series-3-debuts-as-first-built",
      "source": "Investor Relations :: Intel Corporation (INTC)",
      "published": "20260105T220000",
      "overall_sentiment_score": 0.40014,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.171644,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.618938
    },
    {
      "title": "Micron stock whipsaws as “unprecedented” AI memory shortage tightens supply",
      "summary": "Micron Technology Inc. (MU) experienced a volatile trading session, closing down about 1.2% despite early gains, as a Reuters report highlighted an \"unprecedented\" AI-driven memory shortage and rising prices for high-bandwidth memory (HBM). The article discusses the impact of AI demand on memory supply, with manufacturers diverting capacity to HBM, and anticipates upcoming U.S. jobs and inflation data as key catalysts for stock movement. Investors are closely watching for signals on memory contract pricing and HBM availability amidst debates about a potential \"supercycle\" in the memory market.",
      "url": "https://ts2.tech/en/micron-stock-whipsaws-as-unprecedented-ai-memory-shortage-tightens-supply/",
      "source": "ts2.tech",
      "published": "20260105T213708",
      "overall_sentiment_score": 0.09843,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.114174,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.637405
    },
    {
      "title": "KLA Corporation stock jumps 6% as chip-equipment rally builds ahead of Nvidia CES keynote",
      "summary": "KLA Corporation (KLAC.O) shares rose about 6.4% to $1,356, reaching an intraday high ahead of Nvidia's CEO Jensen Huang's keynote at CES, signaling investor optimism for semiconductor factory spending and AI hardware demand. Other chip-equipment makers like Applied Materials, Lam Research, and ASML also saw significant gains, fueled by positive supply-chain reports and brokerage upgrades. Investors are now looking to KLA's upcoming earnings report for guidance, especially regarding the impact of U.S. Commerce Department export rules given China accounted for 39.5% of its Q3 revenue.",
      "url": "https://ts2.tech/en/kla-corporation-stock-jumps-6-as-chip-equipment-rally-builds-ahead-of-nvidia-ces-keynote/",
      "source": "ts2.tech",
      "published": "20260105T210759",
      "overall_sentiment_score": 0.380844,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.432968,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.859703
    },
    {
      "title": "A Deep Dive into the iShares MSCI World ETF (URTH): Performance and Positioning",
      "summary": "The iShares MSCI World ETF (URTH) saw strong performance in 2025, driven by AI investments and U.S. tech, but faces increased volatility in 2026 due to high concentration and valuation. Its portfolio is heavily weighted towards U.S. large-cap tech companies, with NVIDIA now its largest holding. Investors should watch upcoming MSCI index reviews, tech earnings, and the \"soft landing\" economic scenario for its Q1 2026 trajectory.",
      "url": "https://www.ad-hoc-news.de/boerse/ueberblick/a-deep-dive-into-the-ishares-msci-world-etf-urth-performance-and/68462007",
      "source": "AD HOC NEWS",
      "published": "20260105T205203",
      "overall_sentiment_score": 0.213998,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.330067,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.602732
    },
    {
      "title": "Enterprise AI flywheel effect drives scalable use cases",
      "summary": "The \"flywheel effect\" is powerfully influencing enterprise AI, fostering collaborations that build scalable and resilient solutions. This concept, emphasizing consistent, small efforts leading to sustained growth, is evident in partnerships between companies like Hewlett Packard Enterprise Co., SHI International Corp., and their partners, driving significant advancements in AI deployment. Use cases spanning medical data management and smart city solutions demonstrate the tangible ROI and long-term benefits emerging from these AI initiatives.",
      "url": "https://siliconangle.com/2026/01/05/enterprise-ai-partnerships-projects-evolve-unleashai/",
      "source": "SiliconANGLE",
      "published": "20260105T203124",
      "overall_sentiment_score": 0.339767,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.414965,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.896477
    },
    {
      "title": "Marvell stock (MRVL) rises after Melius upgrade sets $135 target ahead of CES CEO chat",
      "summary": "Marvell Technology Inc. (MRVL) shares rose after Melius Research upgraded the chipmaker to \"buy\" with a $135 price target, highlighting its role in AI-driven data centers. The stock's performance is tied to custom silicon demand and investor anticipation for CEO Matt Murphy’s upcoming CES fireside chat and the U.S. jobs report. Marvell's acquisition of Celestial AI and demonstrations at CES further underscore its commitment to next-generation AI infrastructure.",
      "url": "https://ts2.tech/en/marvell-stock-mrvl-rises-after-melius-upgrade-sets-135-target-ahead-of-ces-ceo-chat/",
      "source": "ts2.tech",
      "published": "20260105T200922",
      "overall_sentiment_score": 0.108997,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.24515,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.62337
    },
    {
      "title": "A Note On Open Text Corporation's (NASDAQ:OTEX) ROE and Debt To Equity",
      "summary": "This article analyzes Open Text Corporation's (NASDAQ:OTEX) Return On Equity (ROE) and Debt To Equity ratio. Open Text has an ROE of 13%, similar to the software industry average, but its high debt-to-equity ratio of 1.61 raises concerns about the quality of these returns. The analysis suggests caution, as significant debt can amplify risk, even if it boosts ROE.",
      "url": "https://simplywall.st/stocks/us/software/nasdaq-otex/open-text/news/a-note-on-open-text-corporations-nasdaqotex-roe-and-debt-to",
      "source": "Simply Wall Street",
      "published": "20260105T190948",
      "overall_sentiment_score": 0.200552,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.324673,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.617762
    },
    {
      "title": "Nvidia, Broadcom, AMD among BofA's top chip stocks to 'ride the wave' (NVDA:NASDAQ)",
      "summary": "Bank of America has identified Nvidia (NVDA), Broadcom (AVGO), and AMD (AMD) as its top picks among semiconductor stocks, urging investors to leverage the ongoing artificial intelligence spending boom. The firm maintains a positive outlook on AI-related semiconductor, memory, and semiconductor capital equipment stocks. This recommendation highlights the continued growth potential within the AI sector for these key chip manufacturers.",
      "url": "https://seekingalpha.com/news/4536820-nvidia-broadcom-amd-among-bofas-top-chip-stocks-to-ride-the-wave",
      "source": "Seeking Alpha",
      "published": "20260105T190837",
      "overall_sentiment_score": 0.315835,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.4097,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Form FWP GOLDMAN SACHS GROUP INC Filed by: GOLDMAN SACHS GROUP INC",
      "summary": "Goldman Sachs Group Inc. has filed Form FWP for Market Linked Securities linked to NVIDIA, AMD, and Tesla common stocks, due January 12, 2029. These auto-callable securities offer leveraged upside participation, contingent absolute return, and contingent downside principal at risk. The filing includes a summary of terms, hypothetical payout profiles, and detailed risk factors associated with this complex investment.",
      "url": "https://www.streetinsider.com/SEC+Filings/Form+FWP+GOLDMAN+SACHS+GROUP+INC+Filed+by%3A+GOLDMAN+SACHS+GROUP+INC/25803897.html",
      "source": "StreetInsider",
      "published": "20260105T190822",
      "overall_sentiment_score": 0.066039,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.123999,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.837708
    },
    {
      "title": "Sandisk stock hits fresh 52-week high after CES “Optimus” rebrand as memory-supply story drives swings",
      "summary": "Sandisk shares reached a new 52-week high on Monday before closing slightly lower, driven by a broader interest in memory-related stocks and the company's \"Optimus\" rebrand at CES 2026 for its consumer NVMe SSDs. The stock's performance reflects the volatile NAND flash market, where supply changes heavily influence pricing, especially with increasing demand from AI infrastructure buildouts. Investors are now looking to Sandisk's upcoming Q2 earnings call on January 29th for further insights into demand and pricing.",
      "url": "https://ts2.tech/en/sandisk-stock-hits-fresh-52-week-high-after-ces-optimus-rebrand-as-memory-supply-story-drives-swings/",
      "source": "ts2.tech",
      "published": "20260105T180800",
      "overall_sentiment_score": 0.219354,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.334066,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.638242
    },
    {
      "title": "Magna to Offer DRIVE Hyperion-Compatible ECUs and Tier-1 Integration Services for NVIDIA DRIVE AV",
      "summary": "Magna announced an expanded collaboration with NVIDIA to offer OEMs comprehensive system integration, validation, and vehicle launch services for the NVIDIA DRIVE Hyperion platform. This initiative will support the deployment of NVIDIA DRIVE AV stack running on DRIVE AGX Thor, covering L2++, L3, and L4 autonomy systems. The collaboration aims to accelerate the deployment of software-defined vehicles by combining NVIDIA's AI compute capabilities with Magna's expertise in system engineering and integration.",
      "url": "https://www.globenewswire.com/news-release/2026/01/05/3213263/0/en/Magna-to-Offer-DRIVE-Hyperion-Compatible-ECUs-and-Tier-1-Integration-Services-for-NVIDIA-DRIVE-AV.html",
      "source": "GlobeNewswire",
      "published": "20260105T180000",
      "overall_sentiment_score": 0.549947,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.74186,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.916137
    },
    {
      "title": "NaaS Technology Sets January 23, 2026 Extraordinary General Meeting for Key Shareholder Votes",
      "summary": "NaaS Technology Inc. announced an Extraordinary General Meeting (EGM) for January 23, 2026, in Langfang, Hebei Province, to vote on proposed resolutions. Shareholders as of January 2, 2026, are eligible to participate, with the board strongly endorsing a \"yes\" vote for these strategically important decisions. Despite the board's optimism, NaaS (NAAS) currently holds a Neutral rating from analysts, with a $3.50 price target, primarily due to financial performance concerns.",
      "url": "https://www.theglobeandmail.com/investing/markets/stocks/NAAS/pressreleases/36903059/naas-technology-sets-january-23-2026-extraordinary-general-meeting-for-key-shareholder-votes/",
      "source": "The Globe and Mail",
      "published": "20260105T175834",
      "overall_sentiment_score": 0.058351,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.225012,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.58078
    },
    {
      "title": "Assessing Arm Holdings (ARM) Valuation After Meta AI Partnership And DreamBig Semiconductor Acquisition Plan",
      "summary": "Arm Holdings (ARM) is gaining attention due to a new AI partnership with Meta and plans to acquire DreamBig Semiconductor, intended to enhance its AI efficiency and networking capabilities. Despite recent short-term gains, the stock has experienced significant longer-term declines. Simply Wall St's analysis suggests ARM is overvalued, with a fair value estimate of $70 per share against a market price of $114.73, although this valuation could shift based on the success of new initiatives.",
      "url": "https://www.sahmcapital.com/news/content/assessing-arm-holdings-arm-valuation-after-meta-ai-partnership-and-dreambig-semiconductor-acquisition-plan-2026-01-05",
      "source": "Sahm",
      "published": "20260105T170931",
      "overall_sentiment_score": 0.060028,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.013942,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.598549
    },
    {
      "title": "Arbe Robotics Partners with Nvidiaon AI Driven Autonomous Driving Platform",
      "summary": "Arbe Robotics and Nvidia are collaborating to develop an AI-powered perception platform for autonomous vehicles. This partnership combines Arbe's high-resolution radar technology with Nvidia's computational prowess to enhance safety and reliability. The system will be demonstrated at CES 2026 and integrates directly with Nvidia's DRIVE AGX Orin platform.",
      "url": "https://www.tradingview.com/news/gurufocus:bb8c7a2f3094b:0-arbe-robotics-partners-with-nvidiaon-ai-driven-autonomous-driving-platform/",
      "source": "TradingView — Track All Markets",
      "published": "20260105T170900",
      "overall_sentiment_score": 0.358568,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.342425,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.829236
    },
    {
      "title": "Assessing Taiwan Semiconductor Manufacturing (NYSE:TSM) Valuation After Recent Share Price Momentum and AI Demand Expectations",
      "summary": "Taiwan Semiconductor Manufacturing (NYSE:TSM) has gained significant investor attention due to a 46.8% one-year return and strong revenue and net income growth. While a narrative-based fair value suggests the stock is slightly overvalued at $310 compared to its current $319.61 price, a Discounted Cash Flow (DCF) model indicates a fair value of $208.12, pointing to a much larger overvaluation. The differing valuations highlight the complexity of assessing TSM, especially with the reliance on sustained AI demand and geopolitical factors.",
      "url": "https://simplywall.st/stocks/us/semiconductors/nyse-tsm/taiwan-semiconductor-manufacturing/news/assessing-taiwan-semiconductor-manufacturing-nysetsm-valuati",
      "source": "Simply Wall Street",
      "published": "20260105T170858",
      "overall_sentiment_score": 0.276761,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.377892,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.617292
    },
    {
      "title": "Stock Market Live January 5, 2026: S&P 500 (SPY) at Higher Highs",
      "summary": "The stock market saw the S&P 500 (SPY) reaching higher highs on January 5, 2026, driven by speculation around Venezuela’s oil infrastructure rebuilding benefiting energy stocks, particularly Chevron (CVX). Goldman Sachs upgraded Coinbase (COIN) to a buy with a $303 price target, citing underperformance as an attractive opportunity. Nvidia (NVDA) also received a reiterated buy rating from UBS ahead of a keynote where new AI factory visions are expected to be outlined.",
      "url": "https://247wallst.com/investing/2026/01/05/stock-market-live-january-5-2026-sp-500-spy-at-higher-highs/",
      "source": "24/7 Wall St.",
      "published": "20260105T170836",
      "overall_sentiment_score": 0.341508,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.337387,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.833959
    },
    {
      "title": "D-Wave Quantum Skyrocketed Today -- Is the Stock a Buy for 2026?",
      "summary": "D-Wave Quantum stock saw significant gains today, rising 8.9% amidst a bullish tech market, particularly in quantum computing and AI. The company's quantum-annealing approach and strong balance sheet with $836 million in cash make it a notable player in the nascent quantum computing space. However, due to high volatility and early-stage technology, the stock is best suited for investors with a high risk tolerance.",
      "url": "https://finviz.com/news/267597/d-wave-quantum-skyrocketed-today-is-the-stock-a-buy-for-2026",
      "source": "Finviz",
      "published": "20260105T163100",
      "overall_sentiment_score": 0.342819,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.309622,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.565182
    },
    {
      "title": "How new car radar sees 300m ahead for eyes-off highway driving",
      "summary": "Arbe Robotics announced at CES 2026 its collaboration with NVIDIA to create an advanced AI-based perception platform for hands-off and eyes-off driving. The system features ultra-HD radar capable of 300+ meter long-range detections at highway speeds (up to 130 km/h) and delivers consistent performance in adverse weather. This integration aims to democratize autonomous technology, making it more accessible, reliable, and cost-effective.",
      "url": "https://www.stocktitan.net/news/ARBE/arbe-combines-market-leading-radar-solution-with-powerful-nvidia-ai-bk5ke63dkxxa.html",
      "source": "Stock Titan",
      "published": "20260105T161306",
      "overall_sentiment_score": 0.314217,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.274954,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.849101
    },
    {
      "title": "Nvidia Just Made a $5B Bet on Intel. Here’s Why It Matters",
      "summary": "Nvidia has completed a $5 billion investment in Intel, purchasing over 214.7 million shares and gaining roughly a 4% ownership stake. This move provides Intel with a significant cash injection to support its manufacturing operations and its 18A process, and it gives Nvidia a strategic option for chip manufacturing amidst growing demand for AI hardware.",
      "url": "https://www.techrepublic.com/article/news-nvidia-5b-bet-on-intel/",
      "source": "TechRepublic",
      "published": "20260105T160756",
      "overall_sentiment_score": 0.399583,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.331055,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.932077
    },
    {
      "title": "Broadcom (AVGO) stock slides while chip peers rally — what’s weighing on shares now",
      "summary": "Broadcom (AVGO) shares slid about 2% despite a broader rally in semiconductor stocks, as investors focused on the increasing costs associated with AI infrastructure buildout and its impact on chipmaker margins. This underperformance puts Broadcom, a key supplier of networking silicon for AI data centers, at the center of concerns regarding AI growth sustainability and profitability. Upcoming economic data like ISM services and U.S. CPI, along with Broadcom's next earnings report in early March, will be closely watched for further indications of inflation and its effect on technology valuations.",
      "url": "https://ts2.tech/en/broadcom-avgo-stock-slides-while-chip-peers-rally-whats-weighing-on-shares-now/",
      "source": "ts2.tech",
      "published": "20260105T160747",
      "overall_sentiment_score": -0.024838,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.136649,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.611757
    },
    {
      "title": "Why Bruker (BRKR) Stock Is Up Today",
      "summary": "Bruker (BRKR) stock rose 5.5% after Guggenheim increased its price target to $53.00 from $45.00, maintaining a \"Buy\" rating and signaling a more bullish outlook. This follows a previous increase due to an order for €35 million received by its majority-owned subsidiary, RI Research Instruments. Despite the recent gains, Bruker's stock is still trading below its 52-week high.",
      "url": "https://finviz.com/news/267560/why-bruker-brkr-stock-is-up-today",
      "source": "Finviz",
      "published": "20260105T154600",
      "overall_sentiment_score": 0.266083,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.105642,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.615642
    },
    {
      "title": "Why American Outdoor Brands (AOUT) Stock Is Trading Up Today",
      "summary": "Shares of American Outdoor Brands (AOUT) jumped 5.5% due to significant insider buying activity, signaling strong internal confidence in the company. Although the shares cooled down slightly, this insider purchasing encouraged broader investor interest. This surge follows a period of volatility and a significant drop four months prior due to disappointing financial results.",
      "url": "https://finviz.com/news/267544/why-american-outdoor-brands-aout-stock-is-trading-up-today",
      "source": "Finviz",
      "published": "20260105T154600",
      "overall_sentiment_score": 0.135992,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.133345,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.642621
    },
    {
      "title": "Why Are Vicor (VICR) Shares Soaring Today",
      "summary": "Vicor Corporation's shares jumped 15.1% after Roth Capital initiated coverage with a \"Buy\" rating and a $115 price target, citing Vicor's leadership in power architecture crucial for AI platforms. This new analyst coverage and an ambitious price target, contrasting with a prior average of $93.75, have reignited investor interest and optimism. The company has also shown strong financial performance, including a 18.5% year-on-year revenue growth in Q3 and a solid balance sheet.",
      "url": "https://finviz.com/news/267541/why-are-vicor-vicr-shares-soaring-today",
      "source": "Finviz",
      "published": "20260105T154500",
      "overall_sentiment_score": 0.37763,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.318198,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.626776
    },
    {
      "title": "Uber stock slips on Melius “Sell” call as robotaxi competition looms in 2026",
      "summary": "Uber shares experienced a 1.9% decline after Melius Research downgraded the stock to \"Sell\" with a $73 price target, citing increasing autonomous vehicle (AV) competition expected in 2026 and beyond. Melius warned that intensified AV competition could negatively impact Uber's returns and pricing power, even with the company's strategic partnerships. Investors are now awaiting Uber's February 4th earnings report for updates on its margins and autonomy strategy amid these competitive concerns.",
      "url": "https://ts2.tech/en/uber-stock-slips-on-melius-sell-call-as-robotaxi-competition-looms-in-2026/",
      "source": "ts2.tech",
      "published": "20260105T152700",
      "overall_sentiment_score": -0.135668,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.301451,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.623362
    },
    {
      "title": "Allegro MicroSystems Simplifies SiC Power Design for AI",
      "summary": "Allegro MicroSystems has expanded its Power-Thru™ isolated gate driver portfolio with the new AHV85003/AHV85043 chipset, complementing the existing AHV85311 integrated solution. This expansion aims to simplify high-voltage silicon carbide (SiC) designs for AI data centers and EVs by eliminating the need for external isolated bias supplies and significantly reducing noise and EMI. The portfolio offers both integrated and chipset options, providing design flexibility and supply chain resilience for customers.",
      "url": "https://www.globenewswire.com/news-release/2026/01/05/3212919/0/en/Allegro-MicroSystems-Simplifies-SiC-Power-Design-for-AI-Data-Centers-and-EVs-with-Expanded-Power-Thru-TM-Gate-Driver-Portfolio.html",
      "source": "GlobeNewswire",
      "published": "20260105T150948",
      "overall_sentiment_score": 0.295345,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.229716,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.601336
    },
    {
      "title": "Arbe Robotics shares surge after introducing NVIDIA-backed radar platform",
      "summary": "Arbe Robotics shares surged after the company introduced a new radar platform supported by NVIDIA's AI processing. This collaboration integrates Arbe's imaging radar technology with NVIDIA's DRIVE platform to enhance perception capabilities for autonomous vehicles. The platform aims to provide superior object detection and 4D imaging, improving automotive safety and autonomy.",
      "url": "https://www.msn.com/en-us/money/other/arbe-robotics-shares-surge-after-introducing-nvidia-backed-radar-platform/ar-AA1TBNfr?ocid=finance-verthp-feeds",
      "source": "MSN",
      "published": "20260105T150944",
      "overall_sentiment_score": 0.408096,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.399044,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.821517
    },
    {
      "title": "Is MRVL Stock a Buy, Sell or Hold at a P/S Multiple of 7.67X?",
      "summary": "Marvell Technology (MRVL) is currently trading at a premium valuation with a forward 12-month price-to-sales (P/S) ratio of 7.67X, higher than its sector average. Despite this, the company is experiencing significant growth fueled by the AI wave, strong demand for custom silicon and interconnect semiconductor products, and strategic acquisitions and partnerships. Analysts suggest MRVL is a \"Buy\" due to its strong long-term fundamentals and leadership in the data center and high-speed networking space.",
      "url": "https://www.theglobeandmail.com/investing/markets/stocks/MRVL/pressreleases/36886567/is-mrvl-stock-a-buy-sell-or-hold-at-a-ps-multiple-of-767x/",
      "source": "The Globe and Mail",
      "published": "20260105T150923",
      "overall_sentiment_score": 0.322719,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.336512,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.664219
    },
    {
      "title": "Does Amkor Technology’s (AMKR) Flip Chip Momentum Reveal a Deeper Packaging Edge in Semis?",
      "summary": "Amkor Technology (AMKR) saw a recent stock upswing driven by optimism for advanced semiconductor packaging, particularly flip chip technology. While this aligns with the company's focus on outsourced packaging, investors should consider that the core business remains low-margin and that current share prices are already above consensus targets. The company's future success depends on executing its Arizona campus plans, converting earnings growth into higher returns on equity, and managing its balance sheet effectively amidst tight industry pricing.",
      "url": "https://simplywall.st/stocks/us/semiconductors/nasdaq-amkr/amkor-technology/news/does-amkor-technologys-amkr-flip-chip-momentum-reveal-a-deep",
      "source": "Simply Wall Street",
      "published": "20260105T150857",
      "overall_sentiment_score": 0.138458,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.142888,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.64984
    },
    {
      "title": "Charles Schwab stock hits all-time high at 102.34 USD",
      "summary": "Charles Schwab (SCHW) stock has reached an all-time high of $102.34, now trading at $103.46, marking a 38.88% increase over the past year. The company's strong performance is supported by a market capitalization of $183.65 billion, 21.67% revenue growth, and 37 years of consistent dividend payments. Upcoming earnings on January 21st are expected to provide further insights into its financial strategies.",
      "url": "https://www.investing.com/news/company-news/charles-schwab-stock-hits-alltime-high-at-10234-usd-93CH-4430242",
      "source": "Investing.com",
      "published": "20260105T150821",
      "overall_sentiment_score": 0.428665,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.008598,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.570057
    },
    {
      "title": "Powering the AI Revolution: Advanced Energy Industries Hits Record Highs as Data Center Demand Surges",
      "summary": "Advanced Energy Industries (NASDAQ: AEIS) has reached record highs, trading in the $222–$230 range, driven by the surging demand for power delivery systems in the \"agentic AI\" era. The company's data center computing revenue increased by 113% year-over-year in Q3 2025, and its high-efficiency power conversion technology is crucial for next-generation AI data centers. This strategic shift and operational execution position AEIS as a key enabler for the AI supercycle, offering a more stable investment compared to volatile semiconductor manufacturers.",
      "url": "https://markets.financialcontent.com/wral/article/marketminute-2026-1-5-powering-the-ai-revolution-advanced-energy-industries-hits-record-highs-as-data-center-demand-surges",
      "source": "FinancialContent",
      "published": "20260105T141600",
      "overall_sentiment_score": 0.559927,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.642837,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.811149
    },
    {
      "title": "Should Diodes’ (DIOD) Soft Quarter in a Cooling Chip Cycle Change Its Long-Term Risk Profile?",
      "summary": "Diodes Inc. recently reported earnings below expectations due to a cooling semiconductor market, impacting revenue. Despite this, the company's profitability and cash generation in power management and analog chips suggest it is resilient. The earnings miss highlights cyclicality rather than a fundamental shift in its long-term investment narrative, which hinges on an eventual demand recovery and growth in higher-value automotive and power management products.",
      "url": "https://simplywall.st/stocks/us/semiconductors/nasdaq-diod/diodes/news/should-diodes-diod-soft-quarter-in-a-cooling-chip-cycle-chan",
      "source": "Simply Wall Street",
      "published": "20260105T141043",
      "overall_sentiment_score": 0.245245,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.265904,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.638562
    },
    {
      "title": "Millions more lidar 'eyes' are coming to cars and robots in 2026",
      "summary": "Hesai Technology (NASDAQ: HSAI) announced a plan to double its annual lidar production capacity to over 4 million units by 2026, driven by surging demand from the ADAS and robotics sectors. The expansion is bolstered by their proprietary ASICs, fully automated production lines, and a new factory in Bangkok, Thailand, set to open in early 2027. This move follows Hesai surpassing 2 million cumulative deliveries in 2025 and securing over 4 million units in ATX lidar orders, with mass production beginning April 2026.",
      "url": "https://www.stocktitan.net/news/HSAI/hesai-announces-plan-to-double-annual-lidar-production-capacity-at-vqn8jgkdgm0b.html",
      "source": "Stock Titan",
      "published": "20260105T140914",
      "overall_sentiment_score": 0.597206,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.33119,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.624949
    }
  ]
}