{
  "ticker": "NVDA",
  "date": "2026-01-26",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T11:41:18.190928",
  "source": "alpha_vantage",
  "article_count": 50,
  "articles": [
    {
      "title": "CRWV stock price: Why CoreWeave is getting a big boost from Nvidia today",
      "summary": "Nvidia has invested an additional $2 billion in CoreWeave, a cloud computing platform specializing in AI, to accelerate the development of over five gigawatts of AI factories by 2030. This new investment comes on top of a previous $3.3 billion, demonstrating Nvidia's confidence in CoreWeave's growth strategy and leading to a significant increase in CoreWeave's stock (CRWV). The collaboration aims to meet the escalating demand for AI infrastructure, with CoreWeave gaining early access to Nvidia's new CPU and other products.",
      "url": "https://www.fastcompany.com/91481049/coreweave-crwv-stock-price-up-today-on-nvidia-investment-to-build-ai-factories-artificial-intelligence",
      "source": "Fast Company",
      "published": "20260126T185717",
      "overall_sentiment_score": 0.077293,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.802011,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Nvidia and HubSpot have been highlighted as Zacks Bull and Bear of the Day",
      "summary": "Zacks Investment Research has named Nvidia (NVDA) as its Bull of the Day due to its critical role in the AI revolution, powerful GPUs, and strong growth prospects, including a recent deal to sell AI chips in China. Conversely, HubSpot Inc. (HUBS) is designated as the Bear of the Day, facing challenges from AI disruption, potential cannibalization from its new low-cost offering, and noticeable relative weakness in its stock performance. The article also provides an analysis of Strategy Inc. (MSTR), discussing its Bitcoin-first strategy and its potential for a rebound despite recent stock volatility.",
      "url": "https://www.theglobeandmail.com/investing/markets/stocks/CRM/pressreleases/37229654/nvidia-and-hubspot-have-been-highlighted-as-zacks-bull-and-bear-of-the-day/",
      "source": "The Globe and Mail",
      "published": "20260126T145811",
      "overall_sentiment_score": 0.02401,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.442168,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "NVIDIA Launches Earth-2 Family of Open Models — the World’s First Fully Open Set of Models and Tools for AI Weather",
      "summary": "NVIDIA has unveiled the Earth-2 family of open models, libraries, and frameworks, marking the world's first fully open and accelerated AI software stack for weather and climate prediction. These technologies aim to make AI-powered weather forecasting more accessible and efficient for various organizations worldwide. The Earth-2 family includes new models like Medium Range, Nowcasting, and Global Data Assimilation, which offer enhanced accuracy and speed over traditional methods, building on existing models for a comprehensive weather intelligence ecosystem.",
      "url": "https://blogs.nvidia.com/blog/nvidia-earth-2-open-models/",
      "source": "NVIDIA Blog",
      "published": "20260126T142932",
      "overall_sentiment_score": 0.205066,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.458138,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "CoreWeave stock jumps 6% as Nvidia invests $2 billion to expand AI data center capacity",
      "summary": "Nvidia has invested $2 billion in AI infrastructure provider CoreWeave, causing CoreWeave's stock to jump nearly 6%. This investment will help CoreWeave accelerate its goal of building out \"5 gigawatts of AI factories by 2030\" and expand its data center capacity to meet extraordinary demand for AI infrastructure. CoreWeave primarily generates revenue by renting out data centers filled with Nvidia's GPUs.",
      "url": "https://www.cnbc.com/2026/01/26/3coreweave-nvidia-stock-ai-data-centers.html",
      "source": "CNBC",
      "published": "20260126T115820",
      "overall_sentiment_score": 0.441211,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.417416,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "MASTERINVEST Kapitalanlage GmbH Boosts Position in NVIDIA Corporation $NVDA",
      "summary": "MASTERINVEST Kapitalanlage GmbH has increased its stake in NVIDIA Corporation by 2.5%, acquiring an additional 8,899 shares to bring its total to 369,723 shares, valued at $68.98 million. This makes NVIDIA their largest holding, representing 6.7% of their investment portfolio. The move follows strong quarterly results from NVIDIA and generally bullish sentiment from analysts, despite some insider selling and potential headwinds like rising memory costs and regulatory uncertainties in China.",
      "url": "https://www.marketbeat.com/instant-alerts/filing-masterinvest-kapitalanlage-gmbh-boosts-position-in-nvidia-corporation-nvda-2026-01-26/",
      "source": "MarketBeat",
      "published": "20260126T102944",
      "overall_sentiment_score": 0.208604,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.323027,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Bull of the Day: Nvidia (NVDA)",
      "summary": "Nvidia (NVDA) is highlighted as a \"Bull of the Day\" due to its dominant position in the artificial intelligence sector, a market expected to see trillions in investment. Despite a recent plateau in stock price, its fundamentals have strengthened, leading to a more attractive valuation. The company is also poised for further growth with the expansion of AI into new verticals like physical AI and robotics, and a new deal allowing it to sell H20 AI chips in China.",
      "url": "https://sg.finance.yahoo.com/news/bull-day-nvidia-nvda-090000071.html",
      "source": "Yahoo Finance Singapore",
      "published": "20260126T092928",
      "overall_sentiment_score": 0.383615,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.821691,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "NVIDIA and CoreWeave Strengthen Collaboration to Accelerate Buildout of AI Factories",
      "summary": "NVIDIA and CoreWeave announced an expanded collaboration to accelerate the buildout of over 5 gigawatts of AI factories by 2030, enhancing AI adoption globally. NVIDIA invested $2 billion in CoreWeave, reflecting confidence in its business. The partnership will leverage NVIDIA's financial strength and technology, including the Rubin platform, Vera CPUs, and Bluefield storage, while also incorporating CoreWeave's AI-native software into NVIDIA's reference architectures.",
      "url": "https://investors.coreweave.com/news/news-details/2026/NVIDIA-and-CoreWeave-Strengthen-Collaboration-to-Accelerate-Buildout-of-AI-Factories/default.aspx",
      "source": "CoreWeave",
      "published": "20260126T125929",
      "overall_sentiment_score": 0.448598,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.448193,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.998737
    },
    {
      "title": "Nvidia invests an additional $2 billion in CoreWeave",
      "summary": "This article states that Nvidia has made an additional $2 billion investment in CoreWeave. No further details are provided in the content.",
      "url": "https://www.msn.com/en-gb/money/other/nvidia-invests-an-additional-2-billion-in-coreweave/vi-AA1V0zw2?ocid=finance-verthp-feeds",
      "source": "MSN",
      "published": "20260126T165827",
      "overall_sentiment_score": 0.405445,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.415286,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.946308
    },
    {
      "title": "CoreWeave Stock Surges on NVIDIA's Latest $2B Backing and Tech Integration Deal",
      "summary": "NVIDIA has invested an additional $2 billion in CoreWeave, bringing its total investment to $8.3 billion, and cementing an expanded partnership. CoreWeave's stock surged over 15% following the announcement, which involves CoreWeave building more than 5 gigawatts of AI factories by 2030 using NVIDIA technology, including early adoption of NVIDIA's Vera CPUs and Rubin platform. This strategic move strengthens NVIDIA's ecosystem dominance and challenges competitors like Intel and AMD in the data center market.",
      "url": "https://mlq.ai/news/coreweave-stock-surges-on-nvidias-latest-2b-backing-and-tech-integration-deal/",
      "source": "MLQ.ai",
      "published": "20260126T175827",
      "overall_sentiment_score": 0.082435,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.334418,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.920805
    },
    {
      "title": "3 AI Stocks That Will Trounce Palantir in 2026, According to Wall Street",
      "summary": "This article highlights three AI stocks—Broadcom, Microsoft, and Nvidia—that Wall Street analysts predict will outperform Palantir Technologies in 2026. Broadcom is boosted by a record AI-related order backlog and strong revenue growth. Microsoft is expected to benefit from increased adoption of agentic AI, despite being a recent laggard, while Nvidia continues to see soaring demand for its GPUs, driving impressive revenue growth.",
      "url": "https://finviz.com/news/286548/3-ai-stocks-that-will-trounce-palantir-in-2026-according-to-wall-street",
      "source": "Finviz",
      "published": "20260126T101723",
      "overall_sentiment_score": 0.38974,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.744619,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.901441
    },
    {
      "title": "Envirotech Vehicles Shares Surge After Merger and GPU Order Announcements",
      "summary": "Envirotech Vehicles Inc. (NASDAQ: EVTV) saw its shares surge by over 44% following the announcement of a strategic merger with AZIO AI and a significant order for 256 Nvidia GPUs, expected to generate $107 million in added revenue. This move signifies Envirotech's pivot towards AI and high-performance computing, fostering investor optimism despite existing Nasdaq compliance issues and complex financial metrics. The acquisition is poised to enhance Envirotech's market position and drive future growth in AI-driven technologies and energy-efficient systems.",
      "url": "https://stockstotrade.com/news/envirotech-vehicles-inc-evtv-news-2026_01_26/",
      "source": "StocksToTrade",
      "published": "20260126T145741",
      "overall_sentiment_score": 0.417215,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.312132,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.884912
    },
    {
      "title": "The Architect of AI Infrastructure: A Deep Dive into Super Micro Computer (SMCI)",
      "summary": "Super Micro Computer (SMCI) has transformed from a niche manufacturer into a key provider of AI infrastructure, particularly for chip giant Nvidia, despite facing past accounting scandals. The company's innovative \"Building Block Solutions\" and focus on direct liquid cooling for high-performance AI systems have positioned it uniquely in the market. While navigating increased competition and internal control challenges, SMCI remains a significant player in the AI arms race, with opportunities in new Nvidia platforms and sovereign AI initiatives.",
      "url": "https://markets.financialcontent.com/stocks/article/finterra-2026-1-26-the-architect-of-ai-infrastructure-a-deep-dive-into-super-micro-computer-smci",
      "source": "FinancialContent",
      "published": "20260126T104100",
      "overall_sentiment_score": 0.210931,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.34834,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.871318
    },
    {
      "title": "Microsoft unveils latest AI chip to reduce reliance on Nvidia",
      "summary": "Microsoft has introduced its second-generation AI chip, the Maia 200, to improve the efficiency of its services and offer an alternative to Nvidia's hardware. The chip, produced by TSMC, is being deployed in Microsoft's data centers and will power internal AI teams and cloud services. This move follows similar initiatives by Amazon and Google, aiming to reduce costs and dependence on external chip suppliers.",
      "url": "https://www.detroitnews.com/story/business/2026/01/26/microsoft-unveils-latest-ai-chip-to-reduce-reliance-on-nvidia/88364961007/",
      "source": "The Detroit News",
      "published": "20260126T184126",
      "overall_sentiment_score": 0.086017,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.435636,
      "ticker_sentiment_label": "Bearish",
      "relevance_score": 0.826571
    },
    {
      "title": "T. Rowe Price backs Cyclic Materials, Zocks' $45m, and Nvidia's CoreWeave deal",
      "summary": "T. Rowe Price led a $75 million Series C funding round for Cyclic Materials, a Canadian advanced recycling startup. Zocks, an AI platform for financial advisors, secured $45 million in Series B funding led by Lightspeed and QED Investors. Nvidia agreed to invest $2 billion into CoreWeave, while Blackstone acquired Arlington Industries and Eaton plans to spin off its mobility group.",
      "url": "https://www.axios.com/pro/all-deals/2026/01/26/pro-rata-premium-first-look-jan272026",
      "source": "Axios",
      "published": "20260126T211409",
      "overall_sentiment_score": 0.191854,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.229929,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.81657
    },
    {
      "title": "Buy, Sell or Hold ServiceNow Stock? Key Tips Ahead of Q4 Earnings",
      "summary": "ServiceNow (NOW) is set to release its Q4 2025 earnings, with revenue and earnings growth anticipated. The company's subscription revenues are expected to be strong, driven by its AI Platform, expanding partner base, and strategic acquisitions like Veza and Armis. Despite these positive indicators, macroeconomic headwinds and a stretched valuation (Zacks Rank #3 Hold) pose challenges for the stock.",
      "url": "https://www.theglobeandmail.com/investing/markets/stocks/NOW/pressreleases/37229999/buy-sell-or-hold-servicenow-stock-key-tips-ahead-of-q4-earnings/",
      "source": "The Globe and Mail",
      "published": "20260126T153150",
      "overall_sentiment_score": 0.23818,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.325609,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.745817
    },
    {
      "title": "Buy, Sell or Hold ServiceNow Stock? Key Tips Ahead of Q4 Earnings",
      "summary": "ServiceNow (NOW) is set to release its Q4 2025 earnings, with strong subscription revenue growth expected at $3.42-$3.43 billion. The company is benefiting from its AI Platform, expanding partner base (NVIDIA, Microsoft, Figma), and strategic acquisitions like Veza and Armis, which aim to bolster its security and risk offerings. Despite these positives, macroeconomic headwinds and a stretched valuation (Zacks Rank #3 Hold) pose challenges.",
      "url": "https://www.theglobeandmail.com/investing/markets/stocks/MSFT/pressreleases/37229999/buy-sell-or-hold-servicenow-stock-key-tips-ahead-of-q4-earnings/",
      "source": "The Globe and Mail",
      "published": "20260126T152820",
      "overall_sentiment_score": 0.223672,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.302524,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.734888
    },
    {
      "title": "HPE and 2degrees Collaborate to Accelerate AI Innovation and Strengthen Data Sovereignty in New Zealand",
      "summary": "HPE has announced a strategic collaboration with 2degrees, a leading New Zealand telecommunications provider, to develop a private AI platform built on HPE Private Cloud AI. This partnership aims to accelerate AI-driven innovation and strengthen data sovereignty by keeping critical customer and operational data within New Zealand. The solution is designed to improve network performance, reduce development cycles, and enable 2degrees to deliver more agile and scalable services.",
      "url": "https://www.businesswire.com/news/home/20260126775140/en/HPE-and-2degrees-Collaborate-to-Accelerate-AI-Innovation-and-Strengthen-Data-Sovereignty-in-New-Zealand",
      "source": "Business Wire",
      "published": "20260126T202717",
      "overall_sentiment_score": 0.79017,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.700436,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.732028
    },
    {
      "title": "TSMC Doubles Down On AI Growth With Capex Surge And Dividend Lift",
      "summary": "TSMC plans to significantly increase its capital expenditures to up to US$56 billion by 2026 to boost advanced chip production for AI applications, reflecting a strong commitment to the growing AI market. Concurrently, the company is raising its dividend by 20%, indicating confidence in future cash flow while accelerating investments in capacity. This strategy aims to solidify TSMC's position as a key supplier for high-performance AI chips and support long-term revenue growth.",
      "url": "https://simplywall.st/stocks/us/semiconductors/nyse-tsm/taiwan-semiconductor-manufacturing/news/tsmc-doubles-down-on-ai-growth-with-capex-surge-and-dividend",
      "source": "Simply Wall Street",
      "published": "20260126T222750",
      "overall_sentiment_score": 0.364878,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.324917,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.708973
    },
    {
      "title": "Micron Technology Shares Drop Amid Competitive Pressure",
      "summary": "Micron Technology shares dropped 1.99% following reports of Samsung nearing Nvidia certification for its HBM4 AI memory chips, increasing competitive pressure. Despite this, analysts maintain a positive outlook for Micron, rating it a \"Strong Buy\" due to strong growth, profitability, and momentum, anticipating a \"super-upcycle\" driven by AI demand and plans for significant CapEx expansion. While there's a projected 1-year price target fall according to Wall Street analysts, their current ratings largely remain positive with several recent upgrades and initiations.",
      "url": "https://intellectia.ai/news/stock/micron-technology-shares-drop-amid-competitive-pressure",
      "source": "Intellectia AI",
      "published": "20260126T202404",
      "overall_sentiment_score": 0.026157,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.11543,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.653716
    },
    {
      "title": "Form FWP CITIGROUP INC Filed by: CITIGROUP INC",
      "summary": "This SEC Form FWP filing by Citigroup Inc.details the preliminary terms for \"5 Year Buffer Securities Linked to SPXFP\" offered by Citigroup Global Markets Holdings Inc., guaranteed by Citigroup Inc. It outlines the hypothetical payment at maturity, key dates, underlying index (S&P 500 Futures Excess Return Index), and various risk considerations associated with this investment, including potential loss of principal and credit risk of the issuers.",
      "url": "https://www.streetinsider.com/SEC+Filings/Form+FWP+CITIGROUP+INC+Filed+by%3A+CITIGROUP+INC/25892590.html",
      "source": "StreetInsider",
      "published": "20260126T183456",
      "overall_sentiment_score": 0.170303,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.216709,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.648335
    },
    {
      "title": "IWO vs. VONG: How Does A Small Cap Growth Compare Against A Large Cap Growth Fund",
      "summary": "This article compares two growth ETFs, VONG and IWO, highlighting their differences in focus, cost, performance, and holdings. VONG tracks large-cap growth stocks, primarily in tech, while IWO focuses on small-cap growth stocks across various sectors. Investors should consider their risk tolerance and investment goals when choosing between VONG's large-cap tech concentration and IWO's small-cap diversification.",
      "url": "https://www.fool.com/coverage/etfs/2026/01/26/iwo-vs-vong-how-does-a-small-cap-growth-compare-against-a-large-cap-growth-fund/",
      "source": "The Motley Fool",
      "published": "20260126T185925",
      "overall_sentiment_score": 0.334182,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.300876,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.648265
    },
    {
      "title": "Blood test spares many lung transplant patients an invasive biopsy",
      "summary": "Natera, Inc. announced the publication of a study showing that its Prospera test can significantly reduce the need for invasive transbronchial biopsies in lung transplant patients. The study, conducted by The Ohio State University Wexner Medical Center, found that over 75% of low-risk patients safely avoided routine 9-month biopsies with Prospera-guided care, maintaining similar positive outcomes as those who underwent the procedure. This non-invasive approach improves patient experience and the sustainability of transplant programs.",
      "url": "https://www.stocktitan.net/news/NTRA/prospera-tm-featured-in-landmark-interventional-study-advancing-lung-jkyq4rp29xrk.html",
      "source": "Stock Titan",
      "published": "20260126T112943",
      "overall_sentiment_score": 0.546608,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.308084,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.645833
    },
    {
      "title": "Microsoft (MSFT): Mizuho Says Channel Checks Remain Strong",
      "summary": "Mizuho maintained an \"Outperform\" rating on Microsoft (MSFT) but reduced its price target to $620 from $640, citing strong channel checks and AI adoption despite investor worries about AI disruption affecting software company valuations. Simultaneously, Citi reduced its price target to $660 from $690 while keeping a \"Buy\" rating, noting mixed results from reseller surveys and partner checks, with Azure expected to beat forecasts but non-Azure businesses potentially weaker due to PC forecast reductions. The article suggests that while Microsoft has potential, some AI stocks may offer greater upside and less downside risk.",
      "url": "https://finviz.com/news/286894/microsoft-msft-mizuho-says-channel-checks-remain-strong",
      "source": "Finviz",
      "published": "20260126T150930",
      "overall_sentiment_score": 0.155131,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.120384,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.639664
    },
    {
      "title": "Why Is DigitalOcean (DOCN) Stock Rocketing Higher Today",
      "summary": "DigitalOcean's (DOCN) stock saw a significant jump after an analyst raised its price target to $60 and the company announced performance improvements for its AI platform, including doubling production throughput for a client. The company also appointed a new Chief Product and Technology Officer, signaling progress in its AI cloud offerings. This news follows a period of high volatility for DOCN shares and marks a new 52-week high for the stock.",
      "url": "https://finviz.com/news/287214/why-is-digitalocean-docn-stock-rocketing-higher-today",
      "source": "Finviz",
      "published": "20260126T121000",
      "overall_sentiment_score": 0.289372,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.14884,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.639652
    },
    {
      "title": "3 Profitable Stocks That Concern Us",
      "summary": "This article identifies three profitable companies—Helios (HLIO), P10 (PX), and Affirm (AFRM)—that concern analysts despite their profitability due to issues like stagnant growth, ineffective capital allocation, and high leverage. The author suggests these companies may not be great investments and recommends exploring \"Top 6 Stocks\" for better opportunities.",
      "url": "https://finviz.com/news/287914/3-profitable-stocks-that-concern-us",
      "source": "Finviz",
      "published": "20260126T155923",
      "overall_sentiment_score": 0.053861,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.326197,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.638711
    },
    {
      "title": "Form FWP CITIGROUP INC Filed by: CITIGROUP INC",
      "summary": "Citigroup Global Markets Holdings Inc., guaranteed by Citigroup Inc., has filed a Form FWP for 4-Year Dual Directional Barrier Securities Linked to the S&P 500 Futures Excess Return Index (SPXFP). These securities offer a hypothetical payment at maturity based on the underlying index's performance, with specific calculations for upside, absolute return, and scenarios where the final underlying value falls below a barrier. Investors should be aware of significant risks, including potential loss of investment, credit risk of the issuers, and illiquidity, and should review the full preliminary pricing supplement.",
      "url": "https://www.streetinsider.com/SEC+Filings/Form+FWP+CITIGROUP+INC+Filed+by%3A+CITIGROUP+INC/25892645.html",
      "source": "StreetInsider",
      "published": "20260126T185610",
      "overall_sentiment_score": 0.309992,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.501516,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.637933
    },
    {
      "title": "Skyworks Solutions (SWKS) Receives a Rating Update from a Top Analyst",
      "summary": "Mizuho Securities analyst Vijay Rakesh maintained a Hold rating on Skyworks Solutions (SWKS) with a $60.00 price target. This follows a similar Hold rating from TipRanks – Google’s Google Semiconductors, while TipRanks – PerPlexity reiterated a Buy rating on Skyworks Solutions on January 8. The company recently reported quarterly revenue of $1.1 billion and a net profit of $141.4 million.",
      "url": "https://www.theglobeandmail.com/investing/markets/markets-news/Tipranks/37229662/skyworks-solutions-swks-receives-a-rating-update-from-a-top-analyst/",
      "source": "The Globe and Mail",
      "published": "20260126T145341",
      "overall_sentiment_score": 0.25377,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.319037,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.637692
    },
    {
      "title": "Is FlexShares Morningstar U.S. Market Factor Tilt ETF (TILT) a Strong ETF Right Now?",
      "summary": "The article analyzes the FlexShares Morningstar U.S. Market Factor Tilt ETF (TILT), a smart beta ETF launched in 2011 with over $1.89 billion in assets. It highlights TILT's objective to outperform the Style Box - All Cap Blend segment by tilting towards small-capitalization and value stocks, noting its 0.25% expense ratio and recent performance. The piece also compares it to traditional market-cap weighted ETFs like ITOT and VTI as alternatives.",
      "url": "https://sg.finance.yahoo.com/news/flexshares-morningstar-u-market-factor-112002710.html",
      "source": "Yahoo Finance Singapore",
      "published": "20260126T112000",
      "overall_sentiment_score": 0.171357,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.109023,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.636247
    },
    {
      "title": "Hesai Ranks No.1 in the World for Lidar Patents by KnowMade",
      "summary": "Hesai, a lidar company, has been recognized by KnowMade as a global leader in lidar patents, ranking first in total patent holdings and overall patent strength among lidar companies and third globally behind Bosch and Waymo. The company's extensive patent portfolio covers key technologies and the entire lidar value chain, including anti-interference, 1550nm technology, and core components developed in-house. Hesai continues to expand its global reach and production capacity, solidifying its position in the automotive and robotics markets.",
      "url": "https://finviz.com/news/286831/hesai-ranks-no1-in-the-world-for-lidar-patents-by-knowmade",
      "source": "Finviz",
      "published": "20260126T212819",
      "overall_sentiment_score": 0.710027,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.515361,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.633756
    },
    {
      "title": "Micropolis Robotics Unveils Autonomous Logistics Platform at UMEX 2026 in Abu Dhabi",
      "summary": "Micropolis Robotics unveiled its Autonomous Logistics Platform at the UMEX 2026 exhibition in Abu Dhabi, showcasing a heavy-duty industrial logistics robot designed for controlled environments. The platform, built on Micropolis' M01 system, offers a 4-5 ton payload capacity, extended operational range, and advanced autonomy to improve efficiency and safety in industrial logistics. It integrates with mission planning, fleet management, and warehouse systems for end-to-end automation in factory-to-factory transport, industrial zones, and restricted facilities.",
      "url": "https://finviz.com/news/286748/micropolis-robotics-unveils-autonomous-logistics-platform-at-umex-2026-in-abu-dhabi",
      "source": "Finviz",
      "published": "20260126T185750",
      "overall_sentiment_score": 0.516179,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.24853,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.630646
    },
    {
      "title": "Form FWP Citigroup Global Markets Filed by: Citigroup Global Markets Holdings Inc.",
      "summary": "Citigroup Global Markets Holdings Inc., guaranteed by Citigroup Inc., has filed a Form FWP for 1.5 Year Buffer Securities linked to the worst performance of the Russell 2000® Index and the S&P 500® Index. The securities offer a maximum return of at least 19.25% at maturity, with a buffer against losses up to 15%. Investors face risks including potential loss of principal if the worst performer depreciates beyond the buffer, limited upside, and credit risk of the issuers.",
      "url": "https://www.streetinsider.com/SEC+Filings/Form+FWP+Citigroup+Global+Markets+Filed+by%3A+Citigroup+Global+Markets+Holdings+Inc./25892820.html",
      "source": "StreetInsider",
      "published": "20260126T195659",
      "overall_sentiment_score": 0.240936,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.335035,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.629892
    },
    {
      "title": "AMD (AMD) Stock Trades Down, Here Is Why",
      "summary": "Shares of Advanced Micro Devices (AMD) fell 3.3% after Microsoft unveiled its new Maia 200 AI chip, signaling a move by major tech companies to develop in-house chip designs, which could increase competitive pressure on third-party suppliers like AMD. Despite this drop, AMD's stock has been volatile, and the market's reaction indicates the news is meaningful but not fundamentally altering for the company. The stock is up 12.2% year-to-date and, prior to this news, had received positive analyst commentary and a new board appointment, with strong demand for its server CPUs.",
      "url": "https://finviz.com/news/287389/amd-amd-stock-trades-down-here-is-why",
      "source": "Finviz",
      "published": "20260126T210310",
      "overall_sentiment_score": 0.079879,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.348822,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.625922
    },
    {
      "title": "From logistics to AI marketing: Farmmi sets up new U.S. arm",
      "summary": "Farmmi (NASDAQ: FAMI) has established a new wholly-owned U.S. subsidiary, Bluesage Marketing Inc., to enter the AI-driven digital marketing industry. This strategic move aims to shift the company's focus from traditional logistics to brand building, customer acquisition, and cross-border marketing services using AI and big data. Farmmi expects Bluesage Marketing to create a new digital-services revenue stream and enhance its end-to-end supply chain empowerment for global clients.",
      "url": "https://www.stocktitan.net/news/FAMI/farmmi-inc-establishes-new-u-s-subsidiary-to-focus-on-digital-8primcederls.html",
      "source": "Stock Titan",
      "published": "20260126T115933",
      "overall_sentiment_score": 0.310988,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.315906,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.62506
    },
    {
      "title": "Should iShares Russell 1000 Growth ETF (IWF) Be on Your Investing Radar?",
      "summary": "The iShares Russell 1000 Growth ETF (IWF) offers broad exposure to the Large Cap Growth segment of the US equity market. Launched in 2000, it has over $121.09 billion in assets and a low expense ratio of 0.18%. The ETF is concentrated in the Information Technology sector, with top holdings including Nvidia, Apple, and Microsoft, and has received a Zacks ETF Rank of 1 (Strong Buy).",
      "url": "https://www.sharewise.com/us/news_articles/Should_iShares_Russell_1000_Growth_ETF_IWF_Be_on_Your_Investing_Radar_Zacks_20260126_1220",
      "source": "sharewise.com",
      "published": "20260126T173155",
      "overall_sentiment_score": 0.357378,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.331172,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.624565
    },
    {
      "title": "Is FlexShares Morningstar U.S. Market Factor Tilt ETF (TILT) a Strong ETF Right Now?",
      "summary": "The article analyzes the FlexShares Morningstar U.S. Market Factor Tilt ETF (TILT), a smart beta ETF that debuted in 2011. It highlights TILT's objective to outperform the Style Box - All Cap Blend segment by tilting towards small-capitalization and value stocks, detailing its expense ratio, sector exposure, top holdings, and performance. The article also compares TILT to alternative ETFs like ITOT and VTI, suggesting that traditional market cap-weighted ETFs might be cheaper and lower-risk options for some investors.",
      "url": "https://www.sharewise.com/us/news_articles/Is_FlexShares_Morningstar_US_Market_Factor_Tilt_ETF_TILT_a_Strong_ETF_Right_Now_Zacks_20260126_1220",
      "source": "sharewise.com",
      "published": "20260126T125707",
      "overall_sentiment_score": 0.338405,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.340959,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.620618
    },
    {
      "title": "Hesai Group to Hold Extraordinary General Meeting on March 3, 2026",
      "summary": "Hesai Group (NASDAQ: HSAI) announced an Extraordinary General Meeting (EGM) for shareholders on March 3, 2026, in Suzhou, China, to consider Proposed Resolutions. Class A and Class B ordinary share meetings will also be held on the same day. The record date for voting for both ordinary shares and American Depositary Shares (ADSs) is February 2, 2026.",
      "url": "https://www.stocktitan.net/news/HSAI/hesai-group-to-hold-extraordinary-general-meeting-on-march-3-jyxev10a5sf7.html",
      "source": "Stock Titan",
      "published": "20260126T125845",
      "overall_sentiment_score": 0.176037,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.335098,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.615577
    },
    {
      "title": "Buy, Sell or Hold ServiceNow Stock? Key Tips Ahead of Q4 Earnings",
      "summary": "ServiceNow (NOW) is set to release its Q4 2025 earnings, with strong subscription revenue growth anticipated due to its AI Platform and expanding partner base. Despite potential headwinds from a worsening macroeconomic environment and a \"stretched valuation,\" strategic acquisitions of Veza and Armis are expected to bolster its security portfolio and long-term growth. The stock currently holds a Zacks Rank #3 (Hold), suggesting a wait-and-see approach for investors.",
      "url": "https://www.tradingview.com/news/zacks:a2a1e6fd3094b:0-buy-sell-or-hold-servicenow-stock-key-tips-ahead-of-q4-earnings/",
      "source": "TradingView",
      "published": "20260126T135704",
      "overall_sentiment_score": 0.284135,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.32989,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.614661
    },
    {
      "title": "Portfolio Anchors: SCHB Offers Broader Growth Exposure While VTV Delivers Value and a Higher Yield",
      "summary": "This article compares two ETFs, SCHB and VTV, highlighting their distinct investment strategies. SCHB offers broad US equity market exposure with a significant tech tilt and higher growth potential, while VTV focuses on large-cap value stocks, providing a higher dividend yield and lower volatility. Investors can choose between SCHB for capital appreciation or VTV for lower risk returns and income.",
      "url": "https://www.theglobeandmail.com/investing/markets/stocks/BRK-B-N/pressreleases/37220242/portfolio-anchors-schb-offers-broader-growth-exposure-while-vtv-delivers-value-and-a-higher-yield/",
      "source": "The Globe and Mail",
      "published": "20260126T090044",
      "overall_sentiment_score": 0.324141,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.314631,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.614215
    },
    {
      "title": "TE Connectivity Down 3%: Here’s Why It Could Reach $300",
      "summary": "Shares of TE Connectivity (TEL) dropped 3.25% after reporting strong Q1 2026 earnings, which included a 22% increase in net sales to $4.7 billion, driven by AI demand, and an upbeat Q2 profit forecast. Despite the recent stock pullback attributed to market consolidation, analysts expect the stock to reach $290, implying a 29.4% upside over 2.7 years, based on robust revenue growth and earnings power. The company's valuation model suggests a target price of $290, indicating the stock is potentially undervalued and its long-term thesis remains intact.",
      "url": "https://www.tikr.com/blog/te-connectivity-down-3-heres-the-290-upside-case",
      "source": "TIKR.com",
      "published": "20260126T135815",
      "overall_sentiment_score": 0.220153,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.337357,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.60632
    },
    {
      "title": "Revvity declares quarterly dividend of $0.07 per share",
      "summary": "Revvity, Inc. announced a regular quarterly dividend of $0.07 per share, payable on May 8, 2026, to shareholders of record as of April 17, 2026. This dividend marks the company's 56th consecutive year of payments, reflecting a current yield of 0.24%. Despite trading at a premium valuation with a market cap of $13.02 billion and a P/E ratio of 59.38, the health science solutions provider is set to report its next quarterly earnings in three days.",
      "url": "https://www.investing.com/news/company-news/revvity-declares-quarterly-dividend-of-007-per-share-93CH-4465967",
      "source": "Investing.com",
      "published": "20260126T215252",
      "overall_sentiment_score": 0.086647,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.11529,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.606024
    },
    {
      "title": "The 100MW AI Factory: Siemens and nVent Standardize the Future of Hyperscale Infrastructure",
      "summary": "Siemens AG and nVent Electric plc have collaborated to introduce a standardized 100MW blueprint for \"AI Factories,\" designed to address the intense power and cooling demands of next-generation AI compute clusters. This modular architecture, featuring liquid cooling and grid-interactive power systems, aims to significantly reduce the deployment time for hyperscale AI infrastructure. The partnership positions them competitively in the AI infrastructure market, offering a more efficient and sustainable solution for building large-scale AI data centers.",
      "url": "https://markets.financialcontent.com/stocks/article/tokenring-2026-1-26-the-100mw-ai-factory-siemens-and-nvent-standardize-the-future-of-hyperscale-infrastructure",
      "source": "FinancialContent",
      "published": "20260126T152600",
      "overall_sentiment_score": 0.3015,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.306885,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.603946
    },
    {
      "title": "3 Reasons to Sell RGEN and 1 Stock to Buy Instead",
      "summary": "Repligen Corp (RGEN) has seen a significant stock price increase, outperforming the S&P 500, but the author advises caution. Reasons to sell include slow organic growth indicating waning demand, shrinking adjusted operating margins, and declining return on invested capital. Instead, the article suggests looking at other market-beating stocks, particularly those identified by StockStory's High Quality list.",
      "url": "https://finviz.com/news/288858/3-reasons-to-sell-rgen-and-1-stock-to-buy-instead",
      "source": "Finviz",
      "published": "20260126T230100",
      "overall_sentiment_score": 0.111579,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.31445,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.597962
    },
    {
      "title": "3 Big Reasons to Love Astronics (ATRO)",
      "summary": "Astronics (ATRO) has seen its stock price surge by 125% in the last six months due to solid quarterly results. The article highlights three key reasons for its strong performance: skyrocketing revenue growth (12.9% annualized), increasing free cash flow margin (6.1% TTM), and a jump in Return on Invested Capital (ROIC) due to new investments. Despite trading at 31.5x forward P/E, the article suggests these factors make ATRO a noteworthy stock.",
      "url": "https://finviz.com/news/288710/3-big-reasons-to-love-astronics-atro",
      "source": "Finviz",
      "published": "20260126T110500",
      "overall_sentiment_score": 0.475743,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.438262,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.588159
    },
    {
      "title": "Will Tencent Music’s Hybrid Streaming and Virtual Gifting Model Change Tencent Music Entertainment Group's (TME) Narrative",
      "summary": "Tencent Music Entertainment Group (TME) is gaining attention for its hybrid platform, which combines music streaming, karaoke, and live performance features, generating revenue through virtual gifting and interactive tools rather than just subscriptions. While the Q1 2025 results show a profitable platform with high margins, investors should consider upcoming earnings, potential acquisitions like Ximalaya, and regulatory pressures. The company's diversified revenue model shapes its investment narrative, though its shares might still be undervalued, with various fair value estimates suggesting a need for investors to build their own comprehensive narrative.",
      "url": "https://simplywall.st/stocks/us/media/nyse-tme/tencent-music-entertainment-group/news/will-tencent-musics-hybrid-streaming-and-virtual-gifting-mod/amp",
      "source": "Simply Wall Street",
      "published": "20260126T192727",
      "overall_sentiment_score": 0.145446,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.126777,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.58233
    },
    {
      "title": "3 Value Stocks with Questionable Fundamentals",
      "summary": "This article identifies three value stocks—Taylor Morrison Home (TMHC), Pediatrix Medical Group (MD), and Penske Automotive Group (PAG)—that, despite appearing cheap, possess questionable fundamentals according to StockStory's analysis. The author highlights concerns such as declining sales, weak earnings growth, and eroding returns on capital for each company. Instead of these \"value traps,\" the article recommends considering high-quality alternatives from StockStory's curated list of top-performing stocks.",
      "url": "https://finviz.com/news/286516/3-value-stocks-with-questionable-fundamentals",
      "source": "Finviz",
      "published": "20260126T105739",
      "overall_sentiment_score": -0.074455,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.535157,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.57667
    },
    {
      "title": "Did BlackRock Build A New Floor for Archer's Stock Price?",
      "summary": "BlackRock Inc. has increased its stake in Archer Aviation to 8.1%, signaling a vote of confidence in the electric aviation company. This institutional backing, combined with Archer's strong financial position and strategic partnership with Stellantis, positions the company favorably in the eVTOL sector. The move also creates potential for a short squeeze due to high short interest and institutional accumulation, contrasting with competitor Joby Aviation's recent valuation headwinds.",
      "url": "https://finviz.com/news/287513/did-blackrock-build-a-new-floor-for-archers-stock-price",
      "source": "Finviz",
      "published": "20260126T221831",
      "overall_sentiment_score": 0.278442,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.132709,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.576035
    },
    {
      "title": "Analyst Raises Comstock Resources (CRK) Price Target to $20",
      "summary": "Comstock Resources (NYSE:CRK) saw its share price surge by 14.35% from January 16-23, 2026, making it one of the top-gaining energy stocks. Morgan Stanley increased its price target for CRK from $19 to $20, maintaining an ‘Equal Weight’ rating, following a rebound in natural gas prices and the company's strong performance in 2025. The article notes that while CRK has potential, \"AI stocks hold greater promise for delivering higher returns.\"",
      "url": "https://www.insidermonkey.com/blog/analyst-raises-comstock-resources-crk-price-target-to-20-1681753/?amp=1",
      "source": "Insider Monkey",
      "published": "20260126T221600",
      "overall_sentiment_score": 0.185864,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.105665,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.563714
    },
    {
      "title": "Slow Capital Inc. Sells 25,601 Shares of Broadcom Inc. $AVGO",
      "summary": "Slow Capital Inc. significantly reduced its stake in Broadcom Inc. by 12.8% in the third quarter, selling 25,601 shares, though AVGO remains its largest holding. Despite this sale, Wall Street analysts maintain a \"Buy\" rating for Broadcom with an average target price of $438.61, reflecting strong institutional ownership and recent price target increases. The article also details mixed insider trading activity and Broadcom's solid financial performance, including beating EPS and revenue estimates and increasing its quarterly dividend.",
      "url": "https://www.marketbeat.com/instant-alerts/filing-slow-capital-inc-sells-25601-shares-of-broadcom-inc-avgo-2026-01-26/",
      "source": "MarketBeat",
      "published": "20260126T104351",
      "overall_sentiment_score": 0.268536,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.251259,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.561269
    },
    {
      "title": "SurgePays closes $2.5 million public offering of common stock",
      "summary": "SurgePays, Inc. (NASDAQ:SURG) has completed a $2.5 million public offering of 2,000,000 shares of common stock at $1.25 per share. The company noted that over 100 retail investors participated, despite its stock falling nearly 36% in the past week. This offering follows recent announcements including the appointment of an interim CFO and integration of lead generation aggregators into its ProgramBenefits platform.",
      "url": "https://www.investing.com/news/company-news/surgepays-closes-25-million-public-offering-of-common-stock-93CH-4465151",
      "source": "Investing.com",
      "published": "20260126T135726",
      "overall_sentiment_score": -0.02112,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.169852,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.555564
    },
    {
      "title": "CoreWeave Jumps After Nvidia Expands Collaboration, Invests $2B",
      "summary": "CoreWeave (CRWV) shares surged over 105% after Nvidia (NVDA) expanded its collaboration and invested $2 billion in the company. The partnership aims to accelerate the buildout of AI factories, with Nvidia's investment reflecting confidence in CoreWeave's growth strategy. CoreWeave plans to deploy multiple generations of Nvidia infrastructure, including the Rubin platform, Vera CPUs, and BlueField storage systems.",
      "url": "https://www.benzinga.com/trading-ideas/movers/26/01/50127221/coreweave-jumps-after-nvidia-expands-collaboration-invests-2b",
      "source": "Benzinga",
      "published": "20260126T145638",
      "overall_sentiment_score": 0.041087,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.046409,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.324928
    }
  ]
}