{
  "ticker": "AAPL",
  "date": "2021-09-13",
  "lookback_days": 14,
  "fetched_at": "2026-02-12T23:53:44.353771",
  "source": "alpha_vantage",
  "article_count": 17,
  "articles": [
    {
      "title": "Apple can’t force developers to use its in-app payment system, federal judge rules",
      "summary": "A federal judge ruled that Apple Inc. can no longer compel developers to use its in-app payment system, allowing them to bypass commission fees of 15% to 30%. This decision, stemming from the Epic Games Inc. case, could significantly alter how apps are distributed by dominant online platforms like Apple, Alphabet Inc. (Google), and Amazon.com Inc. However, the ruling stopped short of declaring Apple an antitrust monopolist.",
      "url": "https://www.marketwatch.com/story/apple-must-allow-other-in-app-purchases-on-app-store-judge-ruling-11631291223?gaa_at=eafs&gaa_n=AWEtsqfql3I9l-KYVjVqTnr3q4ZKdM6xjXY8wK5p5M1tktQ-gnK-98EoZHfy&gaa_ts=6907b396&gaa_sig=j6ReqBv-BHFZDFoZ-aJ3HEA0Zs7qVekpa745a16WH3DkmHysIQgOa9jtAaY9va74TcP7ruPHc9Tf-yh1SFXN-Q%3D%3D",
      "source": "MarketWatch",
      "published": "20210910T122600",
      "overall_sentiment_score": -0.220421,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.448832,
      "ticker_sentiment_label": "Bearish",
      "relevance_score": 1.0
    },
    {
      "title": "Get Ready To Use Your iPhone As ID At The Airport",
      "summary": "Apple's digital ID initiative, allowing users to add their driver's license or state ID to the Wallet app, is launching soon. Arizona and Georgia will be the first states to accept these digital IDs at TSA checkpoints, with other states to follow. This privacy-focused feature aims to simplify identity verification for air travel and other transactions, using biometric authentication for security.",
      "url": "https://www.buzzfeednews.com/article/katienotopoulos/apple-wallet-id-license-tsa",
      "source": "BuzzFeed News",
      "published": "20210901T130100",
      "overall_sentiment_score": 0.443491,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.430188,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Apple fixes flaw exploited by Israeli firm’s Pegasus spyware",
      "summary": "Apple has released software updates to patch a critical security flaw in its Messages app that was reportedly exploited by NSO Group's Pegasus spyware. This \"zero-click\" vulnerability allowed hackers to access devices without user interaction, affecting iPhones, iPads, Macs, and Apple Watches. The flaw was discovered by Citizen Lab, which stated it was used to target a Saudi activist's device.",
      "url": "https://www.aljazeera.com/economy/2021/9/13/apple-fixes-flaw-exploited-by-israeli-firms-pegasus-spyware",
      "source": "Al Jazeera",
      "published": "20210913T104000",
      "overall_sentiment_score": 0.071219,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.101395,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 1.0
    },
    {
      "title": "Secret to Apple’s iPhone Sales Boom: Big 5G Deals From Wireless Carriers",
      "summary": "Apple's iPhone sales have seen a boom since the introduction of 5G-capable models, largely driven by aggressive promotional offers from wireless carriers. Major carriers like Verizon, AT&T, and T-Mobile have implemented substantial subsidies to retain customers and encourage upgrades to their 5G services. As Apple prepares to unveil new 5G iPhones, a key question remains about the sustainability of these carrier incentives in fueling iPhone sales.",
      "url": "https://www.wsj.com/business/telecom/secret-to-apples-iphone-sales-boom-big-5g-deals-from-wireless-carriers-11631448003?gaa_at=eafs&gaa_n=AWEtsqdNKL1XMkftp4pheP3S-lGM0afzBUN_FsgY8MislmpfmtV9KU4idAqN&gaa_ts=6907cec6&gaa_sig=Od3-FuogjrKlSPy9INTMtFqwRaPh5HkW-c5Q-OtohVLpxbQ8-976JuYpfmjjzzxSbk6SzPFal3-zcXMMj7w7iA%3D%3D",
      "source": "The Wall Street Journal",
      "published": "20210912T212241",
      "overall_sentiment_score": 0.192284,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.342233,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.932331
    },
    {
      "title": "Alphabet, Tesla and Amazon are among the most favourite stocks held by US-focused mutual funds. Here are top 10 stocks",
      "summary": "This article identifies Alphabet, Tesla, and Amazon as top stock holdings among U.S.-focused mutual funds available to Indian investors. It details 10 such mutual funds, highlighting their investment strategies, underlying assets, and historical performance. The funds provide Indian investors exposure to leading US companies and geographical diversification.",
      "url": "https://www.moneycontrol.com/news/photos/business/personal-finance/bse-and-nse-to-enable-access-to-select-us-stocks-here-are-top-10-stocks-held-by-us-focused-mutual-funds-7387001.html",
      "source": "Moneycontrol",
      "published": "20210906T200600",
      "overall_sentiment_score": 0.309622,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.376749,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.796234
    },
    {
      "title": "Salt adds Universal remote to Apple TV service",
      "summary": "Swiss telco Salt has integrated a Universal Electronics-produced Apple TV remote into its service, designed specifically for Multichannel Video Program Distributors (MVPDs). The remote, launched by Salt in June, combines Bluetooth Low Energy and Infrared for universal control and is also available as a standalone accessory. This collaboration enhances the TV viewing experience for Salt's Apple TV 4K IPTV service customers.",
      "url": "https://www.broadbandtvnews.com/2021/09/02/salt-adds-universal-remote-to-apple-tv-service/",
      "source": "Broadband TV News",
      "published": "20210902T112000",
      "overall_sentiment_score": 0.59051,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.437251,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.735092
    },
    {
      "title": "Globalstar (GSAT) Stock Forecast 2025—Why It's a Good Investment",
      "summary": "Globalstar (GSAT) stock has surged over 500% in 2021 due to rumors of an Apple partnership for satellite communications in the new iPhone 13. While analysts have varying target prices, the company is seen as a good investment due to potential revenue increases from an Apple deal and the growing demand for satellite services, despite competition from Starlink and AST SpaceMobile.",
      "url": "https://marketrealist.com/p/is-gsat-a-good-stock-to-buy/",
      "source": "Market Realist",
      "published": "20210903T130200",
      "overall_sentiment_score": 0.309368,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.349932,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.734246
    },
    {
      "title": "How Navi's FoF on Vanguard US Total Stock Market ETF could add value to your portfolio",
      "summary": "Navi Mutual Fund has filed for a new Fund of Fund (FoF) that will invest in the Vanguard Total Stock Market Index Fund ETF (VTI), a passively managed US-based ETF with a very low expense ratio. This FoF will allow Indian investors to access the broad US equity market, including companies typically unavailable in India, potentially adding value due to low correlation with the Indian market. However, investors should be aware of debt fund taxation rules for international funds.",
      "url": "https://www.moneycontrol.com/news/photos/business/personal-finance/how-navis-fof-on-vanguard-total-stock-market-etf-adds-value-to-your-portfolio-7449981.html",
      "source": "Moneycontrol",
      "published": "20210913T094200",
      "overall_sentiment_score": 0.336956,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.343785,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.708068
    },
    {
      "title": "Broadcom forecasts upbeat current-quarter sales on 5G bet",
      "summary": "Broadcom Inc. forecasted fourth-quarter revenue above Wall Street expectations, driven by strong demand for semiconductors due to 5G adoption and hybrid work models. The company's wireless division, including Apple as a major customer, is also expected to benefit from new iPhone launches. Broadcom's diversification into software business has helped mitigate supply chain disruptions.",
      "url": "https://www.reuters.com/technology/broadcom-forecasts-upbeat-current-quarter-sales-2021-09-02/",
      "source": "Reuters",
      "published": "20210902T204700",
      "overall_sentiment_score": 0.416309,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.314337,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.702933
    },
    {
      "title": "Arlo Offers Comprehensive Third-Party Compatibility With Amazon, Apple, Google, Samsung, And Others For Seamless Smart Home Security Experience",
      "summary": "Arlo Technologies announced enhanced compatibility for its smart home security systems with major platforms like Amazon Alexa, Apple HomeKit, Google Home Assistant, IFTTT, and Samsung SmartThings. These integrations provide users with seamless control over their Arlo devices through voice commands, notifications, and live video feeds on various smart home devices, reflecting Arlo's commitment to a robust and integrated security experience. The updates aim to offer peace of mind regardless of the user's preferred smart home ecosystem.",
      "url": "https://www.prnewswire.com/news-releases/arlo-offers-comprehensive-third-party-compatibility-with-amazon-apple-google-samsung-and-others-for-seamless-smart-home-security-experience-301365880.html",
      "source": "PR Newswire",
      "published": "20210831T080100",
      "overall_sentiment_score": 0.333849,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.336872,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.651236
    },
    {
      "title": "PayPal deepens its buy-now-pay-later push with acquisition of Japan’s Paidy for $2.7 billion",
      "summary": "PayPal has announced its acquisition of Japanese buy-now-pay-later (BNPL) startup Paidy for 300 billion yen ($2.7 billion) to strengthen its presence in the BNPL market, particularly in Japan. Paidy allows consumers to make online purchases and pay in installments at convenience stores, catering to Japan's cash-centric economy. This acquisition follows other significant BNPL deals in the industry, highlighting the growing global trend of flexible payment options.",
      "url": "https://fortune.com/2021/09/08/paypal-acquires-paidy-japan-buy-now-pay-later/",
      "source": "Fortune",
      "published": "20210908T210608",
      "overall_sentiment_score": 0.27723,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.223912,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.648477
    },
    {
      "title": "Lennox announces new integration of its iComfort thermostat",
      "summary": "Lennox has expanded the compatibility of its iComfort thermostats to integrate with various smart home automation platforms, including premium systems like Control4 and popular virtual assistants such as Amazon Alexa, Apple HomeKit, Google Assistant, and IFTTT. This integration allows users to manage their Lennox heating and cooling systems through a wider range of smart home devices, offering enhanced convenience and control over their indoor environment. Control4 customers with Lennox HVAC systems and iComfort S30, E30, or M30 thermostats can request integration through their dealer, enabling centralized control from their smart home system.",
      "url": "https://www.acrlatinoamerica.com/en/news/latest-news/348-enterprises/16671-lennox-announces-new-integration-of-its-icomfort-thermostat.html",
      "source": "ACR Latinoamérica",
      "published": "20210906T204153",
      "overall_sentiment_score": 0.285245,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.231953,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.645027
    },
    {
      "title": "Renate Nyborg becomes Tinder’s first female CEO",
      "summary": "Match Group Inc. has appointed Renate Nyborg as the new chief executive officer of Tinder, making her the dating app's first female CEO since its inception in 2012. Nyborg, who previously led Tinder's operations in Europe, Middle East, and Africa, will succeed Jim Lanzone. Her appointment is effective September 27 and she will report to Match CEO Shar Dubey.",
      "url": "https://fortune.com/2021/09/10/renate-nyborg-becomes-tinder-first-female-ceo-match-group/",
      "source": "Fortune",
      "published": "20210910T204748",
      "overall_sentiment_score": 0.173557,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.102188,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.640564
    },
    {
      "title": "Stryker buys Gauss Surgical for its AI tech that tracks blood loss during childbirth",
      "summary": "Stryker has acquired Gauss Surgical for its AI-powered Triton system, which tracks blood loss during surgery and childbirth to help prevent postpartum hemorrhaging. The Triton system uses an iPhone app and computer vision to measure blood loss from sponges, towels, and fluid canisters, alerting caregivers to dangerous situations. Following the acquisition, Gauss's home diagnostic efforts, including a smartphone-paired rapid antigen test for COVID-19, will be spun off into a new separate company called Exa Health.",
      "url": "https://www.fiercebiotech.com/medtech/stryker-buys-gauss-surgical-for-its-ai-tech-aimed-at-blood-loss-childbirth",
      "source": "Fierce Biotech",
      "published": "20210908T110800",
      "overall_sentiment_score": 0.376082,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.349865,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.607392
    },
    {
      "title": "Toll Brothers plans another high-end neighborhood in Austin area",
      "summary": "Toll Brothers, the nation's 11th-largest homebuilder, is planning another high-end neighborhood in Leander, north of Austin. The company is targeting 112 acres to build 330 luxury homes, with half-million-dollar homes expected to be the focus. This development continues the trend of rapid growth in the Leander area.",
      "url": "https://www.bizjournals.com/austin/news/2021/09/03/toll-brothers-leander-mason-tract-development.html",
      "source": "The Business Journals",
      "published": "20210903T212634",
      "overall_sentiment_score": 0.297468,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.107632,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.60572
    },
    {
      "title": "Stryker Acquires Med Device Company Gauss Surgical",
      "summary": "Stryker announced its acquisition of Gauss Surgical, a medical device company known for its AI-enabled Triton platform that monitors blood loss during surgery. The Triton system utilizes artificial intelligence and mobile technology to provide real-time, accurate blood loss measurements, which has been shown to improve maternal and surgical care by enabling earlier recognition and intervention of hemorrhage. Financial terms of the acquisition were not disclosed.",
      "url": "https://hitconsultant.net/2021/09/07/stryker-acquires-gauss-surgical/",
      "source": "HIT Consultant",
      "published": "20210907T212144",
      "overall_sentiment_score": 0.379558,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.340637,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.603927
    },
    {
      "title": "Financial services giant Charles Schwab to add 450 jobs in Austin",
      "summary": "Charles Schwab, a major financial services company, announced an expansion in Austin that will create approximately 450 new jobs across various functions, including software development, engineering, and client services. This expansion is part of the company's significant growth in 2021, which saw record net new assets and brokerage accounts, and follows a company-wide 5% pay increase for employees. Schwab joins several other large corporations like Oracle, Apple, Amazon, Facebook, and Google in expanding their presence and job offerings in Austin, leveraging the city's tech talent pool.",
      "url": "https://www.statesman.com/story/business/2021/09/01/austin-jobs-charles-schwab/5669379001/",
      "source": "Austin American-Statesman",
      "published": "20210901T211142",
      "overall_sentiment_score": 0.381324,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.301742,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.603116
    }
  ]
}