{
  "ticker": "AAPL",
  "date": "2021-10-04",
  "lookback_days": 14,
  "fetched_at": "2026-02-12T23:53:57.978737",
  "source": "alpha_vantage",
  "article_count": 13,
  "articles": [
    {
      "title": "Apple bans Fortnite from App Store until appeals are exhausted",
      "summary": "Apple has informed Epic Games that Fortnite will remain banned from its App Store until all appeals in their legal dispute are exhausted, a process that Epic CEO Tim Sweeney estimates could take five years. This decision comes after a recent court ruling largely favored Apple, despite requiring the company to allow developers to direct users to alternative payment systems. Epic had sought reinstatement of its developer account, promising to adhere to Apple's guidelines, but Apple cited Epic's past \"duplicitous conduct\" and Sweeney's critical remarks post-ruling as reasons for refusal.",
      "url": "https://www.aljazeera.com/economy/2021/9/22/apple-bans-fortnite-from-app-store-until-appeals-are-exhausted",
      "source": "Al Jazeera",
      "published": "20210922T192604",
      "overall_sentiment_score": -0.099163,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.265105,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 1.0
    },
    {
      "title": "Apple iPhone 13 tests whether deals, cameras will spur upgrades",
      "summary": "Apple released its iPhone 13 lineup, featuring new camera technology and enhanced battery life, to assess if these improvements combined with aggressive carrier deals will drive upgrades despite a lack of dramatic redesign. U.S. carriers like Verizon, AT&T, and T-Mobile are offering significant incentives, sometimes even making the iPhone 13 Pro free with trade-ins, which is already leading to backlogs in online orders for the new devices. This launch kicks off a busy holiday season for Apple, with other new products like a redesigned iPad mini and upcoming MacBook Pros and AirPods also in the pipeline.",
      "url": "https://www.detroitnews.com/story/business/2021/09/23/apple-iphone-13-tests-whether-deals-cameras-spur-upgrades/5839663001/",
      "source": "The Detroit News",
      "published": "20210923T212149",
      "overall_sentiment_score": 0.215688,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.255105,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Apple threatened Facebook ban over slavery posts on Instagram",
      "summary": "Apple threatened to remove Facebook's products from its App Store in 2019 after a BBC investigation revealed domestic \"slaves\" were being sold on apps, including Instagram. The Wall Street Journal's \"Facebook Files\" revealed Facebook took limited action until Apple's threat, despite internal reports showing knowledge of the online slave trade prior to the BBC's inquiry. Following the BBC report and Apple's intervention, Facebook banned hashtags, removed accounts, and developed technology to proactively address content related to domestic servitude.",
      "url": "https://www.bbc.com/news/technology-58645547",
      "source": "BBC",
      "published": "20210923T192605",
      "overall_sentiment_score": -0.214907,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.147071,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.978915
    },
    {
      "title": "INSIGHTS | Conservative investors are pairing portfolio with principles",
      "summary": "Tom Carter, a mutual fund executive, has launched the American Conservative Values ETF to allow conservative investors to align their portfolios with their principles, avoiding \"woke\" companies. The fund, which began in October and already manages over $28 million, aims to provide an option for individuals who wish to invest in companies that share their conservative values rather than those that engage in social and racial justice advocacy. This initiative reflects a broader movement where conservatives are using economic choices to \"fight back\" against companies perceived as aligning with liberal politics.",
      "url": "https://www.coloradopolitics.com/2020-election/insights-conservative-investors-are-pairing-portfolio-with-principles/article_4e546b0c-1ff6-11ec-9304-731f964ae27c.html",
      "source": "Colorado Politics",
      "published": "20210930T052305",
      "overall_sentiment_score": -0.170026,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.330676,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.747633
    },
    {
      "title": "GINN's Got the Goods of Quality Disruptive Companies",
      "summary": "The article highlights the Goldman Sachs Innovate Equity ETF (GINN) as a strong investment opportunity, particularly for those seeking exposure to high-quality, disruptive growth companies. Despite the S&P 500 Technology Index's flat performance in the third quarter, GINN focuses on larger, mature yet innovative companies with high return on equity (ROE), such as Nvidia, Apple, and Microsoft. The fund's significant allocation to technology and healthcare sectors, combined with its emphasis on quality traits and R&D-focused companies, positions it well for continued upside.",
      "url": "https://www.etftrends.com/future-etfs-channel/ginns-got-the-goods-of-quality-disruptive-companies/",
      "source": "ETF Trends",
      "published": "20211004T082450",
      "overall_sentiment_score": 0.300797,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.3063,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.733405
    },
    {
      "title": "BSX publishes market data to Pyth Network",
      "summary": "The Bermuda Stock Exchange (BSX) has started publishing MIAX Pearl Equities market data for ten US companies to the Pyth Network, a decentralized financial market data distribution platform. This initiative marks BSX's first step in providing high-fidelity data to the blockchain industry via the Solana network, with plans to expand the data breadth. The included companies are major US firms like Apple, Amazon, and Tesla, marking a significant development for DeFi markets.",
      "url": "https://www.royalgazette.com/international-business/business/article/20210922/bsx-publishes-market-data-to-pyth-network/",
      "source": "Royal Gazette | Bermuda",
      "published": "20210922T160100",
      "overall_sentiment_score": 0.245134,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.334838,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.720737
    },
    {
      "title": "BSX Begins Publishing MIAX Pearl Equities",
      "summary": "The Bermuda Stock Exchange (BSX), a subsidiary of Miami International Holdings, Inc., has started publishing MIAX Pearl Equities market data for 10 actively traded U.S. companies to the Pyth Network. This marks BSX's first initiative to provide high-fidelity data to the Pyth Network, contributing U.S. equities exchange market data to support DeFi markets. The initial companies include Apple, Amazon, Google, Netflix, and Tesla.",
      "url": "https://bernews.com/2021/09/bsx-begins-publishing-miax-pearl-equities/",
      "source": "Bernews",
      "published": "20210921T204650",
      "overall_sentiment_score": 0.24557,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.252542,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.715341
    },
    {
      "title": "RIM delays new BlackBerry launch; sales crumble",
      "summary": "Research In Motion Ltd (RIM) has delayed the launch of its next-generation BlackBerry phones until early 2013, a significant setback for the company facing crumbling sales, a deeper-than-expected quarterly operating loss, and deep job cuts. The delay, coupled with a 30% workforce reduction and mounting financial pressure, signals a potential terminal decline for the once-dominant technology firm. Analysts are concerned about RIM's survival as it misses crucial shopping periods and struggles to compete with Apple and Android.",
      "url": "https://www.reuters.com/article/oukin-uk-rim-results-idUKBRE85R1LK20120628/",
      "source": "Reuters",
      "published": "20210924T174300",
      "overall_sentiment_score": -0.374557,
      "overall_sentiment_label": "Bearish",
      "ticker_sentiment_score": -0.126206,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.714678
    },
    {
      "title": "Everything you need to know about Apple Harvest Day 2021 as the festival returns to Dover",
      "summary": "Apple Harvest Day is returning to downtown Dover, New Hampshire on Saturday, October 2, 2021, after being canceled as an in-person event in 2020 due to the COVID-19 pandemic. The 37th annual festival will feature over 250 vendors, food courts, live entertainment on two stages, kids' activities including a KidZone and Auto Alley, and the traditional Apple Harvest Day 5K race and apple pie contest. Shuttle parking will be available for attendees.",
      "url": "https://www.seacoastonline.com/story/news/2021/09/27/2021-apple-harvest-day-dover-nh-fall-festival-5-k-race-returns-apple-pie-contest/5810427001/",
      "source": "Seacoastonline.com",
      "published": "20210927T201704",
      "overall_sentiment_score": 0.214228,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.300768,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.713396
    },
    {
      "title": "Specifications of Personal Computers Over Time",
      "summary": "This article traces the evolution of personal computer specifications over 50 years, from the 1971 Kenbak-1 to modern HP Pavilion models. It highlights significant advancements in RAM and processing speed, and discusses key PC specifications like processor speed and RAM, explaining their importance and upgradeability. An infographic details spec changes for popular computers through the years.",
      "url": "https://www.hp.com/us-en/shop/tech-takes/specifications-personal-computers-over-time",
      "source": "HP",
      "published": "20210928T202746",
      "overall_sentiment_score": 0.138428,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.134969,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.706193
    },
    {
      "title": "Netflix VP Of Communications Richard Siklos Leaves The Company",
      "summary": "Richard Siklos, Netflix's VP of communications since 2017, has announced his departure from the streaming giant. His exit follows other executive changes at Netflix, which has seen significant growth in recent years and has maintained its leadership in the streaming market despite increased competition. Siklos previously held a senior communications role at Time Warner and had a notable career as a journalist specializing in the media business.",
      "url": "https://deadline.com/2021/09/netflix-vp-communications-richard-siklos-exits-streaming-company-1234843924/",
      "source": "Deadline",
      "published": "20210924T114100",
      "overall_sentiment_score": 0.023907,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.000378,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.630491
    },
    {
      "title": "Kontakt.io Launches Nano Tag, the World's Smallest Affordable, Disposable & Wearable BLE Tag",
      "summary": "Kontakt.io Inc. has launched the Nano Tag, hailed as the world's smallest affordable, disposable, and wearable BLE tag. This innovation aims to address worker safety and patient/visitor experience in healthcare, hospitality, and events by offering a cost-effective and environmentally friendly solution. The Nano Tag features a compact design, a non-toxic battery, Bluetooth 5.0 technology, and is available for purchase through various channels starting from $4.99 unit price.",
      "url": "https://iotbusinessnews.com/2021/09/20/03207-kontakt-io-launches-nano-tag-the-worlds-smallest-affordable-disposable-wearable-ble-tag/",
      "source": "IoT Business News",
      "published": "20210920T200247",
      "overall_sentiment_score": 0.198247,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.218087,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.616925
    },
    {
      "title": "Jabil expects to hit over $8B in net revenue in Q1 of 2022",
      "summary": "Jabil Inc. (NYSE: JBL) reported strong financial results for the fourth quarter and fiscal year, with net revenue of $7.4 billion and $29.3 billion respectively, despite supply chain challenges. Looking ahead to Q1 2022, the company projects net revenue between $8 billion and $8.6 billion, driven by its diversified business model and opportunities in vehicle electrification, connected healthcare, and infrastructure development. Jabil continues to work with major clients such as Amazon, Tesla, Apple, and Johnson & Johnson.",
      "url": "https://stpetecatalyst.com/jabil-expects-to-hit-over-8b-in-net-revenue-in-q1-of-2022/",
      "source": "St Pete Catalyst",
      "published": "20210929T203627",
      "overall_sentiment_score": 0.264366,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.202757,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.614897
    }
  ]
}