{
  "ticker": "AAPL",
  "date": "2022-11-07",
  "lookback_days": 14,
  "fetched_at": "2026-02-12T23:58:16.814531",
  "source": "alpha_vantage",
  "article_count": 10,
  "articles": [
    {
      "title": "ESG Indexes Lifted by Carbon-Efficient Firms but Underperformed",
      "summary": "MSCI ACWI ESG Indexes underperformed during the first three quarters of 2022 despite generally outperforming from 2013-2021. While carbon-efficient firms positively contributed to performance, exclusions from the MSCI ACWI ESG Leaders Index due to ESG controversies and significant negative contributions from specific stocks like Apple and Amazon primarily drove the underperformance. Industry factors, particularly energy and aerospace and defense, saw a reversal in performance but played a lesser role in the overall ESG index underperformance compared to stock-specific exclusions and dollar strengthening.",
      "url": "https://www.msci.com/research-and-insights/blog-post/esg-indexes-lifted-by-carbon-efficient-firms-but-underperformed",
      "source": "MSCI",
      "published": "20221031T174615",
      "overall_sentiment_score": -0.269055,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.406157,
      "ticker_sentiment_label": "Bearish",
      "relevance_score": 0.731251
    },
    {
      "title": "Exxon's Record-breaking Q3 Profit Nearly Matches Apple's",
      "summary": "Exxon Mobil Corp reported a record-breaking $19.66 billion third-quarter net profit, driven by soaring energy prices, nearly matching Apple's $20.7 billion for the same period. The company's profits were boosted by its continued investment in fossil fuels and strong natural gas earnings, enabling it to exceed Wall Street forecasts and maintain its share buyback program while increasing dividends. Despite withdrawing from Russia, Exxon is on track to meet investment targets and increase production in key areas like the Permian Basin and Guyana.",
      "url": "https://www.oedigital.com/news/500545-exxon-s-record-breaking-q3-profit-nearly-matches-apple-s",
      "source": "Offshore Engineer Magazine",
      "published": "20221028T072000",
      "overall_sentiment_score": 0.29325,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.066864,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.710801
    },
    {
      "title": "Lowe’s opens tech hub",
      "summary": "Lowe's has opened a new 357,000-sq.-ft. tech hub in Charlotte, N.C., centralizing its technology development activities to support its goal of becoming the most customer-centric omnichannel retailer. The facility, designed for innovation and collaboration, will employ up to 2,000 tech professionals and focus on projects like its interactive virtual store models (\"digital twins\") and the \"Measure Your Space\" app feature. This move aligns with Lowe's commitment to leveraging emerging technology to evolve its brand and services.",
      "url": "https://chainstoreage.com/lowes-opens-tech-hub",
      "source": "Chain Store Age",
      "published": "20221026T172735",
      "overall_sentiment_score": 0.365906,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.251804,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.599569
    },
    {
      "title": "Jumia Technologies (JMIA) Announces Appointment of New Management Board and Acting CEO",
      "summary": "Jumia Technologies (JMIA) announced a new Management Board and the appointment of Francis Dufay as Acting CEO, with co-CEOs Jeremy Hodara and Sacha Poignonnec stepping down. The company aims to refocus on core e-commerce fundamentals, reduce operating losses, and achieve profitability. Antoine Maillet-Mezeray has been elevated to Executive Vice President, Finance & Operations, and a search for a permanent CEO is underway.",
      "url": "https://www.streetinsider.com/Corporate+News/Jumia+Technologies+%28JMIA%29+Announces+Appointment+of+New+Management+Board+and+Acting+CEO/20805430.html",
      "source": "StreetInsider",
      "published": "20221107T073200",
      "overall_sentiment_score": 0.273688,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.333814,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.68864
    },
    {
      "title": "Meta's rising capex is a response to TikTok and Apple; Cassava Sciences Files Lawsuit Against Perpetrators of 'Short and Distort' Campaign; A pleasant experience flying Spirit Airlines",
      "summary": "This article discusses Meta Platforms' increased capital expenditures as a response to competition from TikTok and Apple's privacy changes, arguing these investments are crucial for Meta's adaptation and long-term success despite communication shortcomings. It also covers Cassava Sciences filing a lawsuit against \"short and distort\" perpetrators, with the author expressing skepticism based on past experiences. Finally, the author shares a surprisingly pleasant experience flying Spirit Airlines, highlighting cost savings despite extra fees.",
      "url": "https://stansberryresearch.com/whitney-tilsons-daily/metas-rising-capex-is-a-response-to-tiktok-and-apple-cassava-sciences-files-lawsuit-against-perpetrators-of-short-and-distort-campaign-a-pleasant-experience-flying-spirit-airlines",
      "source": "Stansberry Research",
      "published": "20221104T182650",
      "overall_sentiment_score": -0.121879,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.202405,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.719016
    },
    {
      "title": "KLA Corporation Announces Robert Calderoni as New Chair of the Board",
      "summary": "KLA Corporation has appointed Robert Calderoni as the new chair of its Board of Directors, effective immediately. Calderoni, an independent director since 2007, brings over 30 years of technology industry experience. He succeeds Edward \"Ned\" Barnholt, who served as Board Chair since 2006.",
      "url": "https://www.prnewswire.com/news-releases/kla-corporation-announces-robert-calderoni-as-new-chair-of-the-board-301666877.html",
      "source": "PR Newswire",
      "published": "20221102T170500",
      "overall_sentiment_score": 0.206576,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.145367,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.602533
    },
    {
      "title": "Tech investors think they know what will turn around Meta after a 72% implosion this year: Less Mark Zuckerberg",
      "summary": "Tech investors believe Meta Platforms Inc. could recover from its 72% stock implosion if CEO Mark Zuckerberg steps back, as his focus on the metaverse is seen as a drain on earnings. Despite his strong control due to the company's capital structure, some investors view the stock as \"dirt cheap\" and believe it could significantly rise with better management focus on shareholders. Others defend Zuckerberg's long-term vision, citing his past successes and patience.",
      "url": "https://fortune.com/2022/10/31/mark-zuckerberg-meta-72-percent-stock-decline-management-change-investors-markets/",
      "source": "Fortune",
      "published": "20221031T173646",
      "overall_sentiment_score": -0.235977,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.102821,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.55514
    },
    {
      "title": "Opinion: This one stock stands out when looking at key data from the FAANG+ group",
      "summary": "This article discusses the current landscape for tech-oriented stocks, noting that 2022 has been difficult for the sector. It suggests that smart long-term investors should look for bargains among quality merchandise, particularly within the FAANG group. The piece aims to identify one stock from this group that offers a good combination of low valuation and high growth, despite the challenging market conditions.",
      "url": "https://www.marketwatch.com/story/this-one-stock-stands-out-when-looking-at-key-data-from-the-faang-group-11666711871?gaa_at=eafs&gaa_n=AWEtsqc4s_kAE6YrmJ9fyKqALdF4i4eij0CIEYCOif4_oZx6CiZnsBNbM87e&gaa_ts=6907905c&gaa_sig=HlqyLgccrrZhcP8tNa016j_qOxk4D3ep6euoCE5xFb9DNrX60CgrmB8JCFuAgIq-h2Ls5Y95zEG7xptlqT6vvw%3D%3D",
      "source": "MarketWatch",
      "published": "20221025T113100",
      "overall_sentiment_score": 0.257323,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.224981,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.722967
    },
    {
      "title": "Apple Moves iPhone 14 Production to India",
      "summary": "Apple announced it will begin manufacturing its latest iPhone 14 models in India, marking a significant step in the company's efforts to diversify production away from China. This move aligns with India's push for local manufacturing and is expected to boost India's smartphone market. Investors can capitalize on India's digital growth through ETFs like the EMQQ Global’s India Internet and Ecommerce ETF (INQQ).",
      "url": "https://www.etftrends.com/emerging-markets-channel/apple-moves-iphone-14-manufacturing-to-india/",
      "source": "ETF Trends",
      "published": "20221024T170657",
      "overall_sentiment_score": 0.27367,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.313785,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.900382
    },
    {
      "title": "The anti-ESG funds exploiting the US political divide",
      "summary": "The article discusses the rise of anti-ESG funds in the US, which are exploiting the political divide by offering investments that prioritize shareholder value over socially responsible agendas. These funds, such as Strive Asset Management and ACVF, cater to investors who believe ESG investing is politically motivated and detrimental to financial returns. Despite their growing media attention, experts question their overall impact on corporate behavior and capital movement compared to traditional large asset managers.",
      "url": "https://www.euromoney.com/the-anti-esg-funds-exploiting-the-us-political-divide/",
      "source": "Euromoney",
      "published": "20221102T163154",
      "overall_sentiment_score": 0.048246,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.140975,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.74313
    }
  ]
}