{
  "ticker": "AAPL",
  "date": "2022-11-28",
  "lookback_days": 14,
  "fetched_at": "2026-02-12T23:58:30.433214",
  "source": "alpha_vantage",
  "article_count": 10,
  "articles": [
    {
      "title": "iPhone 15 might feature \"no buttons\" - AppleMagazine",
      "summary": "Apple is rumored to be planning to remove physical buttons from its iPhone 15 by 2023, possibly using solid-state haptic buttons instead. This move, supported by reports from Cirrus Logic and analyst Ming-Chi Kuo, could lead to cost savings, improved water resistance, and a sleeker design for future iPhones. The technology would function similarly to the Touch ID home button on older iPhone models.",
      "url": "https://applemagazine.com/iphone-15-might-feature-no-buttons/",
      "source": "Apple Magazine",
      "published": "20221128T162720",
      "overall_sentiment_score": 0.349507,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.349812,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.915532
    },
    {
      "title": "Sound United Parent Masimo Wins Big as Judge Finds Former Employee Stole Its Trade Secrets",
      "summary": "Masimo, parent company of Sound United, won a significant legal battle against a former employee, Dr. Marcelo Lamego, who was found to have stolen trade secrets and used them to develop a competitive product and for patent applications. This ruling strengthens Masimo's ongoing lawsuit against Apple, Inc., which involves similar allegations of stolen technology and patent infringement related to Apple Watch features. The same judge presides over both cases, putting Apple in a difficult position.",
      "url": "https://www.strata-gee.com/sound-united-parent-masimo-wins-big-as-judge-finds-former-employee-stole-its-trade-secrets/",
      "source": "Strata-gee.com",
      "published": "20221122T173622",
      "overall_sentiment_score": 0.332952,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.218229,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.912399
    },
    {
      "title": "Taiwan’s TSMC eyeing advanced chips base in Arizona, founder says",
      "summary": "Taiwanese chipmaker TSMC is planning to produce chips with advanced 3-nanometre technology at its new Arizona factory, according to company founder Morris Chang. This second phase of development would follow the initial 5-nanometre production, reflecting a broader global awakening to the importance of advanced chip manufacturing. Both the US and Europe are offering incentives to attract chip production to their countries.",
      "url": "https://www.aljazeera.com/economy/2022/11/21/taiwans-tsmc-eyeing-advanced-chip-base-in-arizona-found-says",
      "source": "Al Jazeera",
      "published": "20221121T210000",
      "overall_sentiment_score": 0.333816,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.310758,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.717995
    },
    {
      "title": "Moody's closing its consulting business in China, laying off staff: Report",
      "summary": "Moody's Corp is reportedly shutting down its consulting business, Moody's Analytics, in China and laying off over 100 employees across its Beijing, Shanghai, and Shenzhen offices. This move comes as China's zero-Covid policy and subsequent lockdowns are causing many multinational firms to reconsider their operations in the country. However, Moody's credit rating business will continue to operate in China.",
      "url": "https://www.business-standard.com/article/international/moody-s-closing-its-consulting-business-in-china-laying-off-staff-report-122112000048_1.html",
      "source": "Business Standard",
      "published": "20221120T063500",
      "overall_sentiment_score": -0.225072,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.133718,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.727724
    },
    {
      "title": "Samsung Secures 3-nm Advanced Chip Orders From NVIDIA, Qualcomm – Report",
      "summary": "Samsung Foundry has reportedly secured orders from major firms like NVIDIA, Qualcomm, IBM, and Baidu to manufacture advanced 3-nanometer chips. This move, leveraging Samsung's gate-all-around (GAA) transistor technology developed with IBM, aims to position Samsung ahead of TSMC in advanced chip manufacturing and diversify the semiconductor supply chain amidst geopolitical tensions. Deliveries in large quantities are expected to begin in early 2024.",
      "url": "https://wccftech.com/samsung-secures-3-nm-advanced-chip-orders-from-nvidia-qualcomm-report/",
      "source": "Wccftech",
      "published": "20221123T081400",
      "overall_sentiment_score": 0.181409,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": -0.106618,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.639417
    },
    {
      "title": "NASDAQ Trading - How to invest in NASDAQ (US100) index?",
      "summary": "This article provides a comprehensive guide on investing in the NASDAQ (US100) index, detailing its structure, how it works, and reasons for its high volatility. It explains different trading positions (long and short) and identifies opportune times for trading, such as during periods of market panic or significant company announcements. The article also touches upon the use of CFDs and ETFs for investing in NASDAQ.",
      "url": "https://www.xtb.com/int/education/nasdaq-trading-how-to-invest-in-nasdaq-us100-index",
      "source": "XTB.com",
      "published": "20221123T181647",
      "overall_sentiment_score": 0.269956,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.305337,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.728886
    },
    {
      "title": "iPhone 14 Emergency SOS via satellite tested: Here's what it's like to use",
      "summary": "This article details a test of the iPhone 14's Emergency SOS via satellite feature, showcasing its functionality and user experience. It explains how the feature works, from leveraging Apple's investment in Globalstar's satellite network to guiding users through emergency questions. The article also covers manually sharing locations via satellite through the Find My app and the availability of a demo mode for practice.",
      "url": "https://www.tomsguide.com/news/emergency-sos-via-satellite-iphone-14-demo",
      "source": "Tom's Guide",
      "published": "20221115T165609",
      "overall_sentiment_score": 0.228002,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.448509,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.950607
    },
    {
      "title": "Bull vs. Bear: An Indian Century in India Equities ETFs?",
      "summary": "This article presents a \"Bull vs. Bear\" debate on the investment case for India equities ETFs. While the bull argument highlights India's rapid economic growth, digital transformation, and favorable demographics, the bear perspective raises concerns about climate change impacts, political stability, and an uneven distribution of economic growth. The debate explores various ETFs and individual stocks relevant to investing in India.",
      "url": "https://www.etftrends.com/tactical-allocation-channel/bull-vs-bear-an-indian-century-in-india-equities-etfs/",
      "source": "ETF Trends",
      "published": "20221115T163131",
      "overall_sentiment_score": 0.187969,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.106805,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.73521
    },
    {
      "title": "The $98 Roku Smart TV sold out in minutes, but you can still save big on a TV from Walmart",
      "summary": "A $98 Onn. 40-inch LED Roku Smart TV from Walmart sold out within minutes as part of its \"Deals for Days\" Black Friday event. While that specific deal is gone, shoppers can still find other Black Friday savings, including a 55-inch LG 4K TV for under $300. Walmart+ members received early access to these deals.",
      "url": "https://www.sfgate.com/shopping/article/walmart-tv-deal-roku-17577570.php",
      "source": "SFGATE",
      "published": "20221114T163900",
      "overall_sentiment_score": 0.283727,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.320607,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.633154
    },
    {
      "title": "Salesforce Accessibility Execs Derek Featherstone, Catherine Nichols Talk Disability Inside And Out Of The Company In New Interview",
      "summary": "Salesforce accessibility executives Derek Featherstone and Catherine Nichols discuss the company's commitment to disability inclusion, both internally and externally. They highlight the collaborative efforts within the tech industry to promote accessibility, the role of Salesforce's Office of Accessibility and Abilityforce ERG, and the ethical component embedded in their product development. The executives emphasize that accessibility is a continuous journey and a core value for Salesforce, aiming to create a thriving environment for disabled employees and expanding their user base globally.",
      "url": "https://www.forbes.com/sites/stevenaquino/2022/11/14/salesforce-accessibility-execs-derek-featherstone-catherine-nichols-talk-disability-inside-and-out-of-the-company-in-new-interview/",
      "source": "Forbes",
      "published": "20221114T113900",
      "overall_sentiment_score": 0.31224,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.271298,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.630237
    }
  ]
}