{
  "ticker": "AAPL",
  "date": "2022-09-05",
  "lookback_days": 14,
  "fetched_at": "2026-02-12T23:57:35.957757",
  "source": "alpha_vantage",
  "article_count": 6,
  "articles": [
    {
      "title": "Ryder System acquires Baton developing proprietary logistics technology",
      "summary": "Ryder System, Inc. has acquired Baton, a San Francisco-based logistics technology startup, following an earlier investment through its venture capital fund, RyderVentures. This acquisition aims to enhance Ryder's supply chain and transportation solutions by integrating Baton's proprietary technology and talented development team. Baton's cofounders, Andrew Berberick and Nate Robert, will now lead innovation in customer-facing technologies for Ryder's supply chain and dedicated transportation businesses.",
      "url": "https://worldbusinessoutlook.com/ryder-system-acquires-baton-developing-proprietary-logistics-technology/",
      "source": "World Business Outlook",
      "published": "20220902T181651",
      "overall_sentiment_score": 0.222375,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.147087,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.630547
    },
    {
      "title": "Snap CEO to restructure company, cut 20% of workforce",
      "summary": "Snap Inc. is restructuring its operations and laying off 20% of its workforce after experiencing its slowest-ever revenue growth in Q2 and a significant net loss. CEO Evan Spiegel stated the company will refocus on revenue and user growth, and augmented reality (AR) to ensure long-term success. This strategic shift includes discontinuing non-core projects like Snap Originals, Minis, Games, Pixy, Zenly, and Voisey, while also authorizing a $500 million stock buyback program.",
      "url": "https://aibusiness.com/verticals/snap-ceo-to-restructure-company-cut-20-of-workforce",
      "source": "AI Business",
      "published": "20220831T183656",
      "overall_sentiment_score": -0.181533,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.228195,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.749728
    },
    {
      "title": "Lucid Appoints Derrick Carty as Vice President of Platform Software Engineering",
      "summary": "Lucid Group, Inc. announced the appointment of Derrick Carty as Vice President of Platform Software Engineering, reporting to Michael Bell, Senior Vice President of Digital. In this newly created role, Mr. Carty will lead software engineering for the Lucid Air, encompassing ADAS, Audio, CoreOS/Android Framework, Embedded Software, Controls Platform, AUTOSAR, and Systems Architecture. Carty brings 23 years of experience from Apple, Inc. and will focus on delivering new Lucid Air features via over-the-air software updates.",
      "url": "https://ir.lucidmotors.com/news-releases/news-release-details/lucid-appoints-derrick-carty-vice-president-platform-software/",
      "source": "Lucid Motors",
      "published": "20220825T172657",
      "overall_sentiment_score": 0.300551,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.228259,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.627449
    },
    {
      "title": "Tinder-owner Match Group files antitrust case against Apple with India’s competition regulator",
      "summary": "Match Group, owner of Tinder, has filed an antitrust case against Apple with India's competition regulator, accusing the tech giant of monopolistic conduct by forcing developers to use its proprietary in-app purchase system and charging excessive commissions. This action adds to existing challenges against Apple in India and globally regarding its App Store policies. Match argues Apple's practices restrict innovation and unfairly differentiate between app types, especially concerning payment methods favored in India.",
      "url": "https://www.theglobeandmail.com/business/technology/article-tinder-owner-match-group-files-antitrust-case-against-apple-with/",
      "source": "The Globe and Mail",
      "published": "20220824T174626",
      "overall_sentiment_score": -0.254845,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.341411,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.919509
    },
    {
      "title": "Why the ESG/Tech Combination Is Important",
      "summary": "Broad market environmental, social, and governance (ESG) exchange-traded funds (ETFs) frequently have significant allocations to technology stocks. For example, the Invesco ESG Nasdaq 100 ETF (QQMG) has a technology weight of almost 62%. While some critics view this as over-reliance on tech, experts argue that technology companies often embody sustainable development principles, making them suitable for ESG funds despite facing scrutiny on issues like data privacy and energy consumption.",
      "url": "https://etfdb.com/etf-education-content-hub/why-the-esg-tech-combination-is-important/",
      "source": "ETF Database",
      "published": "20220822T044231",
      "overall_sentiment_score": 0.392336,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.408894,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.727132
    },
    {
      "title": "Arm sues Qualcomm, aiming to unwind Qualcomm's $1.4 bln Nuvia purchase",
      "summary": "Arm Ltd. has sued Qualcomm Inc. and its recently acquired chip design firm Nuvia Inc. for breach of license agreements and trademark infringement, seeking to unwind Qualcomm's $1.4 billion Nuvia purchase. Arm is requesting an injunction that would compel Qualcomm to destroy designs developed under Nuvia’s license agreements with Arm, alleging its approval was needed before the transfer to Qualcomm. This lawsuit signifies a major rift between two key technology partners, as Qualcomm had acquired Nuvia to boost its custom computing core designs and challenge competitors in the PC market.",
      "url": "https://www.reuters.com/legal/chips-tech-firm-arm-sues-qualcomm-nuvia-breach-license-trademark-2022-08-31/",
      "source": "Reuters",
      "published": "20220901T152300",
      "overall_sentiment_score": -0.045402,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.229412,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.700542
    }
  ]
}