{
  "ticker": "AAPL",
  "date": "2023-06-05",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T00:24:41.574752",
  "source": "alpha_vantage",
  "article_count": 9,
  "articles": [
    {
      "title": "Introducing Apple Vision Pro: Apple’s first spatial computer",
      "summary": "Apple has unveiled Apple Vision Pro, its first spatial computer, which blends digital content with the physical world using a three-dimensional user interface controlled by eyes, hands, and voice. Running on the new visionOS, Vision Pro features an ultra-high-resolution display system, custom Apple silicon, and offers new ways to interact with apps, enjoy entertainment, relive memories, and connect via FaceTime. The device is designed with advanced materials, focuses on privacy, and will be available early next year starting at $3,499 (U.S.).",
      "url": "https://www.apple.com/newsroom/2023/06/introducing-apple-vision-pro/",
      "source": "Apple",
      "published": "20230605T000000",
      "overall_sentiment_score": 0.412365,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.888556,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "High Beta ETF 'SPHB' Lifted by Heavy Tech Sector Tilt",
      "summary": "The Invesco S&P 500 High Beta ETF (SPHB) performed strongly in May, driven by its significant allocation to the information technology sector. While the broader S&P 500 saw modest gains, the S&P 500 High Beta index climbed 2.4% due to the tech sector's 9.5% rally. SPHB has also demonstrated strong long-term performance, outpacing the S&P 500 over a three-year period.",
      "url": "https://etfdb.com/innovative-etfs-content-hub/heavy-tech-sector-tilt-lifts-sphb/",
      "source": "ETF Database",
      "published": "20230601T195953",
      "overall_sentiment_score": 0.379923,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.347229,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.603255
    },
    {
      "title": "Everything you need to know about Salesforce’s Q1 2024 financial results",
      "summary": "Salesforce, Inc. reported increased first-quarter adjusted earnings in Q1 2024 ($1.69 per share) and revenue growth of 11% year-over-year to $8.25 billion. All key operating segments showed growth, driven by its generative AI ecosystem including Einstein GPT, Slack GPT, and Tableau GPT. CEO Marc Benioff highlighted the role of the Salesforce GPT Trust Layer in securing customer data and enhancing enterprise automation.",
      "url": "https://news.alphastreet.com/everything-you-need-to-know-about-salesforces-q1-2024-financial-results/",
      "source": "AlphaStreet",
      "published": "20230531T000000",
      "overall_sentiment_score": 0.133111,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.028261,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.637834
    },
    {
      "title": "Fidelity Metaverse ETF ETF Price, Holdings, & News (NASDAQ:FMET)",
      "summary": "This article provides an overview of the Fidelity Metaverse ETF (FMET), including its price, holdings, and recent news. FMET tracks a market cap-weighted index of equities related to the metaverse, launched on April 19, 2022, and is managed by Fidelity. The ETF has seen a significant increase in share price since the beginning of 2025 and lists its top institutional shareholders and key holdings.",
      "url": "https://www.marketbeat.com/stocks/NASDAQ/FMET/",
      "source": "MarketBeat",
      "published": "20230523T040218",
      "overall_sentiment_score": 0.303269,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.332482,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.620938
    },
    {
      "title": "Vimeo is tuning out its streaming TV apps",
      "summary": "Vimeo is discontinuing its dedicated streaming TV apps for Apple TV, Android TV, Amazon Fire TV, and Roku starting June 27th. Users can still watch Vimeo content on their TVs by casting from the Vimeo mobile app via Apple AirPlay 2 or Google Chromecast. This move aligns with Vimeo's strategic shift in recent years from a consumer-facing streaming destination to focusing on video-streaming services for businesses.",
      "url": "https://www.techhive.com/article/1940321/vimeo-is-tuning-out-its-streaming-tv-apps.html",
      "source": "TechHive",
      "published": "20230602T091900",
      "overall_sentiment_score": 0.06266,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.012713,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.715216
    },
    {
      "title": "Apple Bets On The Emerging Markets Growth Story",
      "summary": "Apple is increasingly focusing on emerging markets, particularly India, to drive growth amidst a challenging global smartphone market. The company achieved marginal growth in iPhone sales despite overall industry decline, with India seeing significant retail and manufacturing expansion plans. While services and financial technology offer long-term opportunities, the emerging markets strategy is a key component of Apple's immediate growth narrative, alongside ongoing share repurchases and dividend increases.",
      "url": "https://www.forbes.com/sites/bethkindig/2023/06/01/apple-bets-on-the-emerging-markets-growth-story/",
      "source": "Forbes",
      "published": "20230601T081500",
      "overall_sentiment_score": 0.168736,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.407309,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.986192
    },
    {
      "title": "Apple, Microsoft Boost the S&P 500 Amid Tech Comeback",
      "summary": "Apple and Microsoft have significantly contributed to the S&P 500's gains in 2023, accounting for nearly half of the index's rise and reaching an all-time high combined weight of 14%. This tech rally, driven by robust earnings, has left many mutual funds underweight in major tech stocks. The article suggests leveraged ETFs like AAPU, MSFU, and TECL for traders looking to capitalize on the continued bullish trend in the tech sector.",
      "url": "https://www.etftrends.com/leveraged-inverse-content-hub/apple-microsoft-boost-sp-500-amid-tech-sector-comeback/",
      "source": "ETF Trends",
      "published": "20230601T154631",
      "overall_sentiment_score": 0.391611,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.327434,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.717121
    },
    {
      "title": "Examining the Importance of Dividend Growth",
      "summary": "This article contrasts dividend growth investing with high-yield strategies, highlighting its benefits like reduced volatility and steadily rising payouts. It uses Warren Buffett's investments in companies like Coca-Cola and American Express to demonstrate the long-term efficacy of reinvesting growing dividends. The piece concludes by suggesting dividend growth ETFs, such as the T. Rowe Price Dividend Growth ETF (TDVG), as an accessible option for retail investors.",
      "url": "https://www.etftrends.com/active-etf-channel/examining-the-importance-of-dividend-growth/",
      "source": "ETF Trends",
      "published": "20230523T154629",
      "overall_sentiment_score": 0.471838,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.413491,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.552144
    },
    {
      "title": "Steve Jobs: Apple Cofounder and Tech Innovator",
      "summary": "Steve Jobs, co-founder of Apple Inc., was an American inventor, designer, and entrepreneur responsible for pioneering revolutionary technologies like the iPhone and iPad. The article details his life from adoption and early education to co-founding Apple, his departure and subsequent ventures with NeXT and Pixar, and his triumphant return to Apple, ultimately shaping modern technology. It also covers his personal life, battle with pancreatic cancer, and lasting legacy after his death in 2011.",
      "url": "https://www.biography.com/business-leaders/steve-jobs",
      "source": "Biography",
      "published": "20230522T144400",
      "overall_sentiment_score": 0.282287,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.7303,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.961613
    }
  ]
}