{
  "ticker": "AAPL",
  "date": "2024-11-11",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T11:19:03.295350",
  "source": "alpha_vantage",
  "article_count": 28,
  "articles": [
    {
      "title": "Analysts Say ‘We Would Be Aggressive Buyers on Any Pullbacks’ in Microsoft Stock. Should You Be Too?",
      "summary": "Despite a slight dip after its latest earnings report due to increased capital expenditures, Microsoft (MSFT) is viewed by analysts, including Morgan Stanley's Keith Weiss, as a strong buy on any pullbacks. The company exceeded Q1 earnings expectations across all segments, particularly in Intelligent Cloud (Azure), and analysts project continued strong growth for its stock. With 41 out of 48 analysts recommending a \"Strong Buy\" and an average price target implying a 27% upside, the sentiment suggests that Microsoft's AI advancements and robust financial performance make it an attractive investment despite market fluctuations.",
      "url": "https://www.barchart.com/story/news/35967629/analysts-say-we-would-be-aggressive-buyers-on-any-pullbacks-in-microsoft-stock-should-you-be-too",
      "source": "Barchart.com",
      "published": "20241106T152700",
      "overall_sentiment_score": 0.13423,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.339353,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.644682
    },
    {
      "title": "SolarEdge Announces Changes to the Board of Directors",
      "summary": "SolarEdge Technologies, Inc. announced changes to its Board of Directors, electing Avery More as Chairman and appointing Guy Gecht as a new member. Gecht, bringing extensive experience from the technology and cybersecurity sectors, will replace Tal Payne, who stepped down. The company expressed confidence that these changes will strengthen the Board and guide future innovation and growth.",
      "url": "https://www.businesswire.com/news/home/20241106921681/en/SolarEdge-Announces-Changes-to-the-Board-of-Directors",
      "source": "Business Wire",
      "published": "20241106T000000",
      "overall_sentiment_score": 0.250312,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.117023,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.585511
    },
    {
      "title": "Nvidia passes Apple as world's most valuable company",
      "summary": "Nvidia has once again surpassed Apple to become the world's most valuable publicly traded company, reaching a market cap of $3.43 trillion. This comes as Nvidia's stock has nearly tripled in 2024 due to high demand for its GPUs in the AI market, while Apple's shares are up about 17% this year. Nvidia is also set to join the Dow Industrial Average, replacing Intel.",
      "url": "https://www.cnbc.com/2024/11/05/nvidia-passes-apple-as-worlds-most-valuable-company-.html",
      "source": "CNBC",
      "published": "20241105T160200",
      "overall_sentiment_score": 0.19209,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.109239,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.915115
    },
    {
      "title": "Nvidia briefly overtakes Apple as world's most valuable company—it began in a breakfast booth at Denny's",
      "summary": "Nvidia briefly surpassed Apple as the world's most valuable company with a market cap of $3.38 trillion driven by its advanced AI chips. The company's journey began with its co-founders at a Denny's in 1993, overcoming early failures to become a dominant force in AI and computing. CEO Jensen Huang attributes their success to a combination of vision, luck, and 61 years of hard work.",
      "url": "https://www.cnbc.com/2024/11/05/nvidia-briefly-overtakes-apple-as-most-valuable-us-company-origin-story.html",
      "source": "CNBC",
      "published": "20241105T085900",
      "overall_sentiment_score": 0.180361,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.131421,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.705923
    },
    {
      "title": "Nvidia surpasses Apple to become world’s most valuable company",
      "summary": "Nvidia has overtaken Apple to become the world's most valuable company, with its market capitalization reaching $3.43 trillion. This shift highlights the increasing dominance of artificial intelligence in the technology sector, as Nvidia's shares have nearly tripled in 2024. The AI darling's stock closed at $139.91 on Tuesday.",
      "url": "https://www.washingtonpost.com/business/2024/11/05/nvidia-tops-apple/",
      "source": "The Washington Post",
      "published": "20241105T000000",
      "overall_sentiment_score": 0.474401,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.108982,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.928983
    },
    {
      "title": "CoreCard Corporation (NYSE:CCRD) Q3 2024 Earnings Call Transcript",
      "summary": "CoreCard Corporation (NYSE:CCRD) reported better-than-expected Q3 2024 results, with total revenue up 17% year-over-year to $15.7 million, driven by higher license, professional services, and processing/maintenance revenues. The company provided 2025 guidance forecasting total revenue between $60 million and $64 million, and earnings per share between $0.88 and $0.94, with revenue growth excluding Goldman Sachs anticipated at 30% to 40%. CEO Leland Strange also discussed the secured Goldman Sachs agreement through 2026, the ongoing development of their CoreFi platform, and the company's share repurchase program, reiterating that the stock is undervalued.",
      "url": "https://www.insidermonkey.com/blog/corecard-corporation-nyseccrd-q3-2024-earnings-call-transcript-1384541/",
      "source": "Insider Monkey",
      "published": "20241102T082300",
      "overall_sentiment_score": 0.255919,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.149208,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.570059
    },
    {
      "title": "Apple commits $1.5 billion to Globalstar for expanded iPhone satellite services",
      "summary": "Apple has committed approximately $1.5 billion to Globalstar to expand iPhone satellite services, with the deal including $1.1 billion in cash and a 20% equity stake for Apple. This funding will enable Globalstar to acquire new satellites and enhance its ground infrastructure, further supporting direct-to-device satellite connectivity for iPhones, similar to the emergency satellite texting service rolled out in 2022. Globalstar's stock saw a significant jump of 31.4% following the announcement.",
      "url": "https://www.cnbc.com/2024/11/01/apple-commits-1point5-billion-to-globalstar-for-iphone-satellite-services.html",
      "source": "CNBC",
      "published": "20241101T104500",
      "overall_sentiment_score": 0.639091,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.439534,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.951372
    },
    {
      "title": "Apple Earnings: Our Valuation Rises to Reflect Stronger Long-Term Growth, but Less of an AI Impact",
      "summary": "Morningstar has raised its fair value estimate for Apple to $200 from $185, driven by stronger longer-term growth expectations, particularly from iPhone unit sales and the services segment, along with expected margin expansion. However, the short-term forecast for iPhone revenue has been lowered due to a perceived lesser impact from AI on unit sales in the immediate future, leading to the conclusion that shares are currently overvalued. The article notes a positive inflection in iPhone revenue in the September quarter and continued strong growth in services.",
      "url": "https://www.morningstar.com/stocks/apple-earnings-our-valuation-rises-reflect-stronger-long-term-growth-less-an-ai-impact",
      "source": "Morningstar",
      "published": "20241101T000000",
      "overall_sentiment_score": -0.251559,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.291287,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 1.0
    },
    {
      "title": "BlackRock launches ETF that expands beyond the ‘Magnificent Seven'",
      "summary": "BlackRock's iShares has launched a new ETF, the iShares Top 20 U.S. Stocks ETF (TOPT), aimed at investors looking to diversify beyond the \"Magnificent Seven\" tech giants. This ETF comprises the 20 largest U.S. stocks by market capitalization, offering a broader and more diversified approach to capturing growth in the U.S. equity market. The launch addresses concerns about the high concentration and valuations of the Magnificent Seven, which recently experienced a significant market cap slide.",
      "url": "https://www.nbcdfw.com/news/business/money-report/blackrock-launches-etf-that-expands-beyond-the-magnificent-seven/3685874/",
      "source": "NBC 5 Dallas-Fort Worth",
      "published": "20241031T225721",
      "overall_sentiment_score": 0.036147,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.147114,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.578557
    },
    {
      "title": "BlackRock launches ETF that expands beyond the ‘Magnificent Seven'",
      "summary": "BlackRock's iShares has launched the iShares Top 20 U.S. Stocks ETF (TOPT) to offer investors diversification beyond the \"Magnificent Seven\" tech giants. This new ETF comprises the 20 largest U.S. stocks by market capitalization, aiming to provide a broader and more diversified investment in leading U.S. companies. The move comes as some investors worry about the concentration of the Magnificent Seven in the S&P 500 and their high valuations.",
      "url": "https://www.nbclosangeles.com/news/business/money-report/blackrock-launches-etf-that-expands-beyond-the-magnificent-seven/3549528/",
      "source": "NBC Los Angeles",
      "published": "20241031T160900",
      "overall_sentiment_score": -0.125092,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.233415,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.73128
    },
    {
      "title": "PodcastOne Engages MZ Group to Lead Strategic Investor Relations Program",
      "summary": "PodcastOne (PODC) has engaged MZ Group to manage its investor relations and financial communications program to enhance visibility within the investment community. The company, the only pure-play podcast network listed on a US national exchange, highlights its significant content portfolio with 181 exclusive podcasts, 19 million monthly downloads, and 5 million unique listeners, operating in a $2 billion market. This partnership aims to strengthen investor awareness for PodcastOne's unique market position and growth strategy.",
      "url": "https://www.stocktitan.net/news/PODC/podcast-one-engages-mz-group-to-lead-strategic-investor-relations-9rr32ssqprf1.html",
      "source": "Stock Titan",
      "published": "20241031T080000",
      "overall_sentiment_score": 0.156282,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.134817,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.58197
    },
    {
      "title": "T. Rowe Price PM a ‘big believer’ in crypto",
      "summary": "Dominic Rizzo, who manages T. Rowe Price’s new technology-focused ETF, believes in crypto, DeFi, and stablecoins, seeing numerous future applications for these technologies. He notes that while there aren't many direct public market equity exposures to these trends, Coinbase (COIN) is a key exception within his investment framework due to its role as a \"linchpin technology\" and its strong fundamentals. Rizzo expects more crypto equity opportunities to emerge as the trend continues to grow.",
      "url": "https://blockworks.co/news/crypto-trowe-price-tech-etf",
      "source": "Blockworks",
      "published": "20241031T045150",
      "overall_sentiment_score": 0.189271,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.144805,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.617691
    },
    {
      "title": "Vanguard Information Technology ETF: 3 Reasons Why Investors Need to Own VGT Right Now",
      "summary": "The Vanguard Information Technology ETF (VGT) is highlighted as a strong investment due to its focus on U.S. tech stocks, particularly mega-cap growth companies like Apple, Microsoft, and Nvidia. The article discusses VGT's impressive historical performance, its low expense ratio of 0.1%, and its significant exposure to leading technology growth companies, especially those benefiting from AI advancements. Investors are encouraged to consider VGT for long-term portfolio growth, possibly employing a dollar-cost averaging strategy to mitigate volatility.",
      "url": "https://247wallst.com/investing/2024/10/30/vanguard-information-technology-etf-3-reasons-why-investors-need-to-own-vgt-right-now/",
      "source": "24/7 Wall St.",
      "published": "20241030T105500",
      "overall_sentiment_score": 0.352305,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.306043,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.72502
    },
    {
      "title": "Apple introduces M4 Pro and M4 Max",
      "summary": "Apple announced the new M4 Pro and M4 Max chips, expanding the M4 family with enhanced power efficiency and advanced capabilities for Mac. These chips, built on second-generation 3-nanometer technology, feature faster CPUs, GPUs with 2x faster ray-tracing, and significantly increased unified memory bandwidth, along with support for Thunderbolt 5. The M4 Pro and M4 Max are designed to deliver exceptional performance for pro and AI workloads, powering Apple Intelligence on Mac while emphasizing user privacy and environmental benefits.",
      "url": "https://www.apple.com/newsroom/2024/10/apple-introduces-m4-pro-and-m4-max/",
      "source": "Apple",
      "published": "20241030T000000",
      "overall_sentiment_score": 0.336466,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.825191,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Corning Inc. Earnings Call Highlights Growth and Challenges",
      "summary": "Corning Inc.'s Q3 earnings call revealed strong financial performance, especially in Optical Communications, with strategic plans like Springboard and a partnership with Apple driving growth. Despite challenges in the automotive sector and rising operating expenses, the company provided optimistic Q4 guidance, projecting continued expansion and profitability.",
      "url": "https://www.theglobeandmail.com/investing/markets/stocks/GLW/pressreleases/35779273/corning-inc-earnings-call-highlights-growth-and-challenges/",
      "source": "The Globe and Mail",
      "published": "20241029T193400",
      "overall_sentiment_score": 0.411828,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.316769,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.70841
    },
    {
      "title": "COPT plans 1GW data center campus outside Des Moines, Iowa",
      "summary": "COPT Defense Properties is planning a 1GW data center campus near Des Moines, Iowa, after acquiring a 365-acre land parcel for $32 million. The campus is projected to include 15 buildings totaling 3.3 million square feet and will serve an existing Fortune 100 cloud computing tenant. This expansion leverages Des Moines' attractive land values, power availability, renewable energy access, and tax incentives.",
      "url": "https://www.datacenterdynamics.com/en/news/copt-plans-1gw-data-center-campus-outside-des-moines-iowa/",
      "source": "Data Center Dynamics",
      "published": "20241029T000000",
      "overall_sentiment_score": 0.324586,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.252393,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.60661
    },
    {
      "title": "Apple introduces new iMac supercharged by M4 and Apple Intelligence",
      "summary": "Apple announced a new iMac featuring the powerful M4 chip and Apple Intelligence, boasting significant performance improvements and new features. This updated iMac comes in a range of new colors, offers a nano-texture display option, an enhanced 12MP Center Stage camera, and improved Thunderbolt 4 connectivity. It starts at $1,299, with pre-orders available immediately and shipping beginning November 8, promising a transformative user experience with AI capabilities and privacy protections.",
      "url": "https://www.apple.com/newsroom/2024/10/apple-introduces-new-imac-supercharged-by-m4-and-apple-intelligence/",
      "source": "Apple",
      "published": "20241028T000000",
      "overall_sentiment_score": 0.431145,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.712265,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.975389
    },
    {
      "title": "How Nvidia Overtook Apple as World's Most Valuable Company",
      "summary": "Nvidia briefly surpassed Apple to become the world's most valuable company, driven by the immense demand for its specialized AI chips crucial for advanced AI applications. This shift highlights the growing importance of AI-driven technologies in the tech market, with Nvidia benefiting significantly from the race among tech giants to dominate AI. While Apple later regained its lead, Nvidia's surge underscores the impact of AI on market valuations and investment trends.",
      "url": "https://technologymagazine.com/articles/how-nvidia-overtook-apple-as-worlds-most-valuable-company",
      "source": "Technology Magazine",
      "published": "20241028T000000",
      "overall_sentiment_score": 0.274879,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.116121,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.900217
    },
    {
      "title": "Is Apple Inc. (AAPL) a Good Stock to Buy Now According to Redditors?",
      "summary": "This article examines Apple Inc. (NASDAQ:AAPL) as a stock to buy according to Redditors, ranking it 5th on a list of top trending stocks. It discusses recent market trends, the impact of AI on mega-cap stocks, and strategies for hedging risks. The article highlights Apple's strong fundamentals, cash reserves, and growth potential, particularly with its new Apple Intelligence platform, citing positive analyst sentiments and a record-breaking September quarter.",
      "url": "https://finance.yahoo.com/news/apple-inc-aapl-good-stock-102643687.html",
      "source": "Yahoo Finance",
      "published": "20241107T080000",
      "overall_sentiment_score": 0.187792,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.451201,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Vanguard Group Inc's Strategic Acquisition of Atossa Therapeutics Inc Shares",
      "summary": "Vanguard Group Inc acquired over 6.5 million shares of Atossa Therapeutics Inc on September 30, 2024, at $1.52 per share, increasing its biotechnology holdings. This acquisition maintains a 5.24% position ratio in Atossa for Vanguard, aligning with its diversification and long-term growth strategy. Atossa Therapeutics, a clinical-stage biopharmaceutical company focusing on breast cancer and COVID-19 treatments, has a market cap of $176.06 million and a current stock price of $1.40, facing challenges in profitability and growth despite its strong financial strength.",
      "url": "https://www.gurufocus.com/news/2582493/vanguard-group-incs-strategic-acquisition-of-atossa-therapeutics-inc-shares",
      "source": "GuruFocus",
      "published": "20241105T004000",
      "overall_sentiment_score": 0.133991,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.145762,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.62164
    },
    {
      "title": "Vanguard Group Inc's Strategic Acquisition of Aspen Aerogels Inc Shares",
      "summary": "Vanguard Group Inc significantly increased its holdings in Aspen Aerogels Inc by acquiring an additional 118,603 shares, bringing its total to over 4.1 million shares. This move reflects Vanguard's confidence in Aspen Aerogels' growth potential within the sustainable technology sector, aligning with its long-term investment philosophy despite recent stock fluctuations. The acquisition also represents a strategic diversification into the construction sector for Vanguard.",
      "url": "https://www.gurufocus.com/news/2582439/vanguard-group-incs-strategic-acquisition-of-aspen-aerogels-inc-shares",
      "source": "GuruFocus",
      "published": "20241105T002400",
      "overall_sentiment_score": 0.213387,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.149492,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.639257
    },
    {
      "title": "Ford's head of integrated services leaves automaker to join Peloton",
      "summary": "Peter Stern, Ford's head of integrated services, is departing the automaker after approximately one year to become CEO of Peloton, effective January 1, 2025. Stern was responsible for developing Ford's recurring revenue from vehicle services. Michael Amend will lead Ford's digital services unit on an interim basis.",
      "url": "https://www.reuters.com/business/autos-transportation/fords-head-integrated-services-leaves-automaker-join-peloton-2024-10-31/",
      "source": "Reuters",
      "published": "20241031T141500",
      "overall_sentiment_score": -0.061384,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.129261,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.625288
    },
    {
      "title": "Tap to Pay on iPhone expands to more European countries",
      "summary": "Apple has expanded its Tap to Pay on iPhone service to Austria, Czech Republic, Ireland, Romania, and Sweden, allowing millions of merchants to accept contactless payments securely using only an iPhone and a partner-enabled iOS app. This service supports payments from contactless credit/debit cards, Apple Pay, and other digital wallets without requiring additional hardware. Several payment platforms like Adyen, SumUp, and Viva.com are among the first to offer Tap to Pay on iPhone in these new countries, with more expected to follow.",
      "url": "https://www.apple.com/ie/newsroom/2024/10/tap-to-pay-on-iphone-expands-to-more-european-countries/",
      "source": "Apple",
      "published": "20241029T000000",
      "overall_sentiment_score": 0.288348,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.302285,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.902438
    },
    {
      "title": "Apple’s all-new Mac mini is more mighty, more mini, and built for Apple Intelligence",
      "summary": "Apple has unveiled an all-new Mac mini, powered by the M4 and M4 Pro chips, featuring significant performance enhancements in a more compact design. This new Mac mini is also built for Apple Intelligence and marks an important environmental milestone as Apple’s first carbon neutral Mac, with over 80 percent reduction in greenhouse gas emissions. Starting at $599, it is available for pre-order today and will be available on November 8.",
      "url": "https://www.apple.com/newsroom/2024/10/apples-new-mac-mini-is-more-mighty-more-mini-and-built-for-apple-intelligence/",
      "source": "Apple",
      "published": "20241029T000000",
      "overall_sentiment_score": 0.469622,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.47613,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Apple iPhone 16 sales blocked in Indonesia due to local parts rule",
      "summary": "Indonesia has blocked sales of the Apple iPhone 16 due to the company's failure to meet local content requirements, which mandate 40% locally manufactured components. While the phones can be brought in for personal use with taxes paid, Apple has not fulfilled its investment commitment for local certification. This decision comes despite Indonesia being a key market and Apple having invested in app developer academies in the country.",
      "url": "https://www.reuters.com/technology/apple-iphone-16-sales-blocked-indonesia-due-local-parts-rule-2024-10-28/",
      "source": "Reuters",
      "published": "20241028T150900",
      "overall_sentiment_score": -0.411361,
      "overall_sentiment_label": "Bearish",
      "ticker_sentiment_score": -0.395107,
      "ticker_sentiment_label": "Bearish",
      "relevance_score": 0.958034
    },
    {
      "title": "World's Largest Technology Company by Revenue, world record set by Apple Inc.",
      "summary": "Apple Inc. has set a world record for being the World's Largest Technology Company by Revenue, with US$383.29 billion in revenues in 2023. The company, founded in 1976, is headquartered in Cupertino, California, and is known for its consumer electronics, software, and services. Apple has also been recognized as the world's most valuable brand and the largest company by market capitalization.",
      "url": "http://www.worldrecordacademy.org/2024/11/worlds-largest-technology-company-by-revenue-world-record-set-by-apple-inc-424450",
      "source": "worldrecordacademy.org",
      "published": "20241108T000000",
      "overall_sentiment_score": 0.708367,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.870327,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Apple accused by NLRB of deterring employees from discussing pay equity",
      "summary": "The National Labor Relations Board (NLRB) has filed a complaint accusing Apple of preventing employees from discussing pay equity and forcing an engineer to quit after she circulated a wage survey. This marks the third such complaint in a month against Apple, which is also alleged to have barred a Slack channel for pay equity discussions and restricted employees' use of social media and workplace messaging. Apple denies the claims, stating that it strongly disagrees and will share the facts at the hearing.",
      "url": "https://www.reuters.com/legal/government/apple-accused-by-nlrb-deterring-employees-discussing-pay-equity-2024-11-01/",
      "source": "Reuters",
      "published": "20241101T212300",
      "overall_sentiment_score": -0.64894,
      "overall_sentiment_label": "Bearish",
      "ticker_sentiment_score": -0.621317,
      "ticker_sentiment_label": "Bearish",
      "relevance_score": 1.0
    },
    {
      "title": "3 Top Dividend ETFs That Could Build Generation-Spanning Wealth",
      "summary": "This article highlights three top dividend-focused ETFs—iShares Core Dividend Growth ETF (DGRO), Vanguard High Dividend Yield ETF (VYM), and Schwab U.S. Dividend Equity ETF (SCHD)—as efficient ways to build long-term wealth through compound growth. These ETFs offer low expense ratios and hold high-quality companies with consistent dividend histories, providing a reliable investment strategy amidst market volatility. Each fund is detailed with its investment strategy, top holdings, expense ratio, yield, and historical performance over the past decade.",
      "url": "https://www.fool.com/investing/2024/10/29/3-top-dividend-etfs-that-could-build-generation-sp/",
      "source": "The Motley Fool",
      "published": "20241029T070000",
      "overall_sentiment_score": 0.341673,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.276357,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.618486
    }
  ]
}