{
  "ticker": "AAPL",
  "date": "2024-02-12",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T00:27:30.667940",
  "source": "alpha_vantage",
  "article_count": 13,
  "articles": [
    {
      "title": "Disney Heads into the Future on the Apple Vision Pro",
      "summary": "The Walt Disney Company is launching Disney+ on Apple's Vision Pro, marking a new chapter in immersive storytelling. This integration allows viewers to experience Disney+ content in virtual environments like Star Wars' Tatooine or Marvel's Avengers Tower, and watch 3D versions of popular films. The partnership highlights Disney's long-standing focus on blending technology with creativity to enhance entertainment experiences.",
      "url": "https://thewaltdisneycompany.com/disney-apple-vision-pro/",
      "source": "The Walt Disney Company",
      "published": "20240202T000000",
      "overall_sentiment_score": 0.475608,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.495947,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Apple, Skechers fall; Amazon, Deckers Outdoor rise, Friday, 2/2/2024",
      "summary": "On Friday, February 2, 2024, several major stocks experienced significant price changes. Apple and Skechers saw declines due to lukewarm forecasts, while Amazon, Deckers Outdoor, Meta Platforms, and Clorox rose following strong financial results or optimistic outlooks. Microchip Technology and Columbia Sportswear also faced drops after giving disappointing forecasts.",
      "url": "https://qz.com/apple-skechers-fall-amazon-deckers-outdoor-rise-fri-1851220621",
      "source": "Quartz",
      "published": "20240202T000000",
      "overall_sentiment_score": 0.224145,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": -0.339561,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.923204
    },
    {
      "title": "These ETFs could help investors reduce Big Tech exposure",
      "summary": "Investors who are overly concentrated in Big Tech stocks are looking for ways to diversify their portfolios. Equal-weight ETFs like the Invesco S&P 500 Equal Weight ETF and the Invesco S&P 500 Equal Weight Technology ETF are suggested as options to spread risk beyond top-heavy Magnificent Seven companies, as advisors note nervousness about Big Tech valuations.",
      "url": "https://www.cnbc.com/2024/02/03/too-exposed-to-big-tech-these-etfs-may-help-broaden-out-your-risk.html",
      "source": "CNBC",
      "published": "20240203T110000",
      "overall_sentiment_score": 0.153324,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.139309,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.849842
    },
    {
      "title": "Markets Brief: Will the ‘Magnificent Seven’ Stocks Keep Carrying the Market After Earnings?",
      "summary": "The article analyzes the performance of the \"Magnificent Seven\" stocks after their latest earnings reports, noting that while most beat forecasts, market reactions were mixed due to high expectations. It discusses whether these tech giants can continue to drive market gains in 2024, given their current valuations and the potential for a broader market rally. The article also provides a detailed recap of individual company performances and analyst commentary.",
      "url": "https://www.morningstar.com/markets/magnificent-seven-earnings-whats-ahead-biggest-players-stock-market",
      "source": "Morningstar",
      "published": "20240202T000000",
      "overall_sentiment_score": 0.162438,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": -0.1986,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.799601
    },
    {
      "title": "Payments firm PayPal to reduce global workforce by 9% in 2024",
      "summary": "Payments firm PayPal Holdings is set to cut approximately 2,500 jobs, or 9% of its global workforce, in 2024 through layoffs and the elimination of open roles. This decision, announced by CEO Alex Chriss, aims to \"right-size\" the company for efficiency and profitable growth amidst competitive pressures and a need to improve margins. The move follows similar cost-cutting measures by competitor Block.",
      "url": "https://www.reuters.com/business/payments-firm-paypal-cut-around-2500-jobs-bloomberg-news-2024-01-30/",
      "source": "Reuters",
      "published": "20240130T223400",
      "overall_sentiment_score": -0.199552,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.145562,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.715656
    },
    {
      "title": "What Stock Investors Need to Know About Meta’s New Dividend",
      "summary": "Meta Platforms announced its first-ever quarterly dividend of $0.50 per share, alongside its fourth-quarter earnings, leading to a significant stock surge. While the dividend provides a more balanced capital return program, share repurchases will remain the primary method for returning cash to shareholders. The initial dividend yield is modest compared to peers and the broader market index, but Morningstar analysts expect it to grow.",
      "url": "https://www.morningstar.com/stocks/what-stock-investors-need-know-about-metas-new-dividend",
      "source": "Morningstar",
      "published": "20240202T000000",
      "overall_sentiment_score": 0.238281,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.110971,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.636608
    },
    {
      "title": "ESPN, Fox, and Warner Bros. Discovery Team Up to Offer Joint Sports Streaming Service",
      "summary": "Walt Disney's ESPN, Fox, and Warner Bros. Discovery are collaborating to launch a joint sports streaming service for U.S. customers available in the fall. This new service aims to combine their sports offerings, including professional and college games, to better compete with rivals like Comcast and Apple who have seen success in sports streaming. The app will be available standalone or bundled with Disney+, Hulu, or Max, consolidating vast sports rights under one platform.",
      "url": "https://www.investopedia.com/espn-fox-and-warner-bros-discovery-team-up-to-offer-joint-sports-streaming-service-8559816",
      "source": "Investopedia",
      "published": "20240206T191800",
      "overall_sentiment_score": 0.233799,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.101983,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.633516
    },
    {
      "title": "ITOT ETF: Investing Well Doesn’t Have to Be Complicated",
      "summary": "The iShares Core S&P Total U.S. Stock Market ETF (ITOT) offers a straightforward, low-cost way to invest in a broad range of U.S. companies, providing exposure to 90% of the total domestic stock market. With an ultra-low expense ratio of 0.03% and a track record of strong double-digit annualized returns over the past decade, ITOT is presented as an effective long-term portfolio building block due to its wide diversification across 2,589 stocks. Despite its simplicity, it has delivered significant wealth building for investors since its inception in 2004.",
      "url": "https://www.tipranks.com/news/article/itot-etf-investing-well-doesnt-have-to-be-complicated",
      "source": "TipRanks",
      "published": "20240207T042838",
      "overall_sentiment_score": 0.469755,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.319155,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.630284
    },
    {
      "title": "ITOT ETF: Investing Well Doesn’t Have to Be Complicated",
      "summary": "The iShares Core S&P Total U.S. Stock Market ETF (ITOT) is presented as an effective, uncomplicated, and low-cost investment option for long-term growth. The article highlights ITOT's strong historical performance with double-digit annualized returns, wide diversification across 2,589 U.S. stocks, and an ultra-low expense ratio of 0.03%. It emphasizes the fund's lack of concentration risk due to its extensive holdings and its ability to provide exposure beyond just large-cap stocks.",
      "url": "https://finance.yahoo.com/news/itot-etf-investing-well-doesn-063352989.html",
      "source": "Yahoo Finance",
      "published": "20240207T063352",
      "overall_sentiment_score": 0.407868,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.380358,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.625045
    },
    {
      "title": "Gogoro Unveils New Flagship Smartscooter, Pulse",
      "summary": "Gogoro Inc. (Nasdaq: GGR) has unveiled its new flagship Smartscooter, the Pulse, which features an aerodynamic design and a hyperdrive powertrain enabling it to reach 0-50km/h in 3.05 seconds. The Pulse integrates advanced features such as an active-matrix lighting system, a 10.25-inch panoramic HD touch display powered by Qualcomm's Snapdragon QWM2290 digital chassis, and Apple Wallet and Apple Find My integration. The Smartscooter is expected to begin shipping in Taiwan in late Q2 2024, aiming to set a new standard for high-performance electric two-wheelers.",
      "url": "https://www.gogoro.com/news/gogoro-pulse/",
      "source": "Gogoro",
      "published": "20240130T000000",
      "overall_sentiment_score": 0.569071,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.312706,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.616256
    },
    {
      "title": "Corning beats quarterly sales estimates, signals improving demand for fiber optics",
      "summary": "Corning exceeded Wall Street's fourth-quarter adjusted sales estimates, driven by increasing demand for optical fiber cables used in data centers for generative AI applications. Despite a slight dip in optical communications segment sales, the company observes \"green shoots\" in the hyperscale data center space. Although Q4 earnings met expectations, Corning provided a conservative profit outlook for the current quarter, expecting it to be the low point of the year.",
      "url": "https://www.reuters.com/technology/corning-forecasts-weak-quarterly-profit-lower-demand-optical-fiber-cables-2024-01-30/",
      "source": "Reuters",
      "published": "20240130T164200",
      "overall_sentiment_score": 0.25822,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.123462,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.612243
    },
    {
      "title": "Aptiv to cut stake in Motional, self-driving JV with Hyundai",
      "summary": "Aptiv, a US autonomous driving technology company, has decided to significantly reduce its stake in Motional, a self-driving joint venture with Hyundai Motor Group, and will cease injecting additional capital. Motional, which has accumulated 1 trillion won ($750 million) in deficits, had requested further funding from both partners. This decision puts pressure on Hyundai Motor Group to decide on its own additional capital injection, highlighting the ongoing financial and commercial challenges in the autonomous vehicle industry.",
      "url": "https://www.kedglobal.com/future-mobility/newsView/ked202402010016",
      "source": "KED Global",
      "published": "20240201T204205",
      "overall_sentiment_score": -0.46598,
      "overall_sentiment_label": "Bearish",
      "ticker_sentiment_score": -0.318163,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.605452
    },
    {
      "title": "Vishay Unveils New High-Speed Photodiode for Wearable Devices",
      "summary": "Vishay Intertechnology has expanded its optoelectronics portfolio with the VEMD2074, a new high-speed silicon PIN photodiode designed for wearable devices. This photodiode offers improved visible light sensitivity, low capacitance, and quick switching times, making it ideal for accurate signal detection in applications like pulse oximetry and optical heart rate detection. Its small size, flexibility in sensor placement, and cost-effectiveness facilitate integration into compact and price-sensitive products such as smartwatches and earbuds.",
      "url": "https://www.azooptics.com/News.aspx?newsID=28607",
      "source": "AZoOptics",
      "published": "20240202T000000",
      "overall_sentiment_score": 0.496973,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.257669,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.570377
    }
  ]
}