{
  "ticker": "AAPL",
  "date": "2024-09-30",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T11:18:34.187378",
  "source": "alpha_vantage",
  "article_count": 17,
  "articles": [
    {
      "title": "Apple ships $6 billion of iPhones from India in big China shift",
      "summary": "Apple's iPhone exports from India increased by a third to nearly $6 billion in the six months ending September, signaling a significant shift from China. This expansion is driven by Indian subsidies and a skilled workforce, with the company on track to surpass $10 billion in annual exports for fiscal year 2024. Despite its growth in India, Apple still relies heavily on China for manufacturing and sales, though its Indian revenue hit a record $8 billion due to new stores and increased demand.",
      "url": "https://fortune.com/asia/2024/10/29/apple-ships-6-billion-of-iphones-from-india-in-big-china-shift/",
      "source": "Fortune",
      "published": "20240920T000000",
      "overall_sentiment_score": 0.410728,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.424134,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "iOS 18 is available today, making iPhone more personal and capable than ever",
      "summary": "Apple has released iOS 18, bringing significant updates to iPhone customization, the Photos app, Messages, Mail, and introducing Apple Intelligence. Users can now personalize their Home Screen and Control Center, enjoy a redesigned Photos experience with automatic organization, and benefit from enhanced communication features. Apple Intelligence, rolling out next month, integrates generative models with personal context for advanced features in writing, photo editing, and Siri, all while prioritizing user privacy.",
      "url": "https://www.apple.com/newsroom/2024/09/ios-18-is-available-today-making-iphone-more-personal-and-capable-than-ever/",
      "source": "Apple",
      "published": "20240916T000000",
      "overall_sentiment_score": 0.836025,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.803457,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Apple’s Lisa Jackson on How to Design for Sustainability",
      "summary": "Lisa Jackson, Apple's VP of environment, policy, and social initiatives, advises entrepreneurs on designing for sustainability by involving affected communities and embracing regulation. Drawing from her EPA experience, she highlights how regulation \"levels the playing field\" for businesses committed to environmental responsibility and encourages young people to pursue careers in sustainability, stressing the importance of scientific understanding.",
      "url": "https://www.inc.com/chloe-aiello/apples-lisa-jackson-on-how-to-design-for-sustainability.html",
      "source": "Inc.com",
      "published": "20240926T000000",
      "overall_sentiment_score": 0.282183,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.254325,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Apple unexpectedly fell on rebalancing day, who is the culprit?",
      "summary": "Apple experienced a surprising downturn on a rebalancing day when it was expected to benefit from index adjustments. Despite anticipation of increased buying pressure from index funds, a massive sell-off of 30 million shares occurred in the final minutes of trading. Theories suggest either active funds capitalizing on predictable liquidity or arbitrageurs selling after accumulating shares before the rebalancing event contributed to the unexpected drop.",
      "url": "https://news.futunn.com/en/post/48000339/apple-unexpectedly-fell-on-rebalancing-day-who-is-the-culprit",
      "source": "富途牛牛",
      "published": "20240924T085100",
      "overall_sentiment_score": -0.091435,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.205514,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.991011
    },
    {
      "title": "Hello Group: Undervalued With Expertise In App Development Makes It Attractive",
      "summary": "Hello Group (MOMO) is considered significantly undervalued with a P/E ratio of 5x TTM Non-GAAP earnings and 2x TTM EBITDA, presenting a strong buy opportunity. The company benefits from its app development expertise, presence in China's market, and a recently upsized stock repurchase program. However, risks include its Cayman Islands incorporation, operational challenges in China, and potential regulatory changes.",
      "url": "https://seekingalpha.com/article/4722888-hello-group-undervalued-expertise-in-app-development-attractive",
      "source": "Seeking Alpha",
      "published": "20240924T054200",
      "overall_sentiment_score": 0.297122,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.103826,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.749575
    },
    {
      "title": "Ingram Micro IPO, Revenue Details Go Live",
      "summary": "Ingram Micro has filed its registration statement with the SEC for a proposed initial public offering, with its common stock set to trade under the symbol \"INGM\" on the New York Stock Exchange. The filing reveals that Ingram Micro's net sales have declined over the past three years, from $54.4 billion in 2021 to $48 billion in 2023. Platinum Equity, which owns Ingram, will sell the common stock through its entity Imola JV Holdings, with the number of available shares and price range yet to be determined.",
      "url": "https://www.channelfutures.com/channel-business/ingram-micro-ipo-revenue-details-go-live",
      "source": "Channel Futures",
      "published": "20240930T000000",
      "overall_sentiment_score": -0.051828,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.093476,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.742608
    },
    {
      "title": "InterDigital, IBD Stock Of The Day, Flirts With Buy Point After Analyst Day",
      "summary": "InterDigital (IDCC) has been named IBD Stock Of The Day and is approaching a buy point of 140.60 after an analyst day. The stock has a Composite Rating of 95/99 and is forming a shallow flat base. The article also mentions widespread investment in AI stocks by major tech companies.",
      "url": "https://www.investors.com/research/ibd-stock-of-the-day/idcc-stock-interdigital-buy-point/",
      "source": "Investor's Business Daily",
      "published": "20240926T161700",
      "overall_sentiment_score": 0.289218,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.346301,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.737796
    },
    {
      "title": "Politan prevails in Masimo proxy fight, gaining 2 board seats and ousting CEO Joe Kiani",
      "summary": "Activist investor Politan Capital Management secured two new board seats at Masimo's annual meeting, leading to the ouster of founder and CEO Joe Kiani and fellow board member Chris Chavez. This victory doubles Politan's previous board representation and follows criticism over Masimo's acquisition of Sound United and its plans to spin out consumer businesses. Following the vote, Masimo's stock price saw a 3.4% increase.",
      "url": "https://www.fiercebiotech.com/medtech/politan-prevails-masimo-proxy-fight-gaining-2-board-seats-and-ousting-ceo-joe-kiani",
      "source": "Fierce Biotech",
      "published": "20240920T110000",
      "overall_sentiment_score": 0.132128,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.03213,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.730457
    },
    {
      "title": "Should Motley Fool 100 Index ETF (TMFC) Be on Your Investing Radar?",
      "summary": "The Motley Fool 100 Index ETF (TMFC) is highlighted as a suitable option for investors seeking exposure to the Large Cap Growth segment of the US equity market, especially given its strong performance and Zacks ETF Rank of 2 (Buy). The article details its expense ratio, sector allocation, top holdings like Apple, Microsoft, and Nvidia, and compares it to alternative ETFs such as Vanguard Growth ETF (VUG) and Invesco QQQ (QQQ). Investors are encouraged to consider TMFC's attributes alongside its risk and performance metrics for long-term investment strategies.",
      "url": "https://finance.yahoo.com/news/motley-fool-100-index-etf-102008078.html",
      "source": "Yahoo Finance",
      "published": "20240923T000000",
      "overall_sentiment_score": 0.171506,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.138501,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.71494
    },
    {
      "title": "Is the iShares Russell 1000 Growth ETF a Millionaire Maker?",
      "summary": "This article discusses the iShares Russell 1000 Growth ETF (IWF) as a potential \"millionaire maker\" investment. It highlights the ETF's historical performance, its focus on growth stocks within the Russell 1000 index, and its exposure to both large and mid-cap companies. The author suggests that while not perfectly balanced, IWF offers a good chance to outperform the broader market over the long term.",
      "url": "https://www.fool.com/investing/2024/09/21/is-the-ishares-russell-1000-growth-etf-a-millionai/",
      "source": "The Motley Fool",
      "published": "20240921T162200",
      "overall_sentiment_score": 0.225492,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.327988,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.649373
    },
    {
      "title": "Goldman Sachs Reiterates Buy Rating on Jabil (JBL)",
      "summary": "Goldman Sachs has reiterated a Buy rating on Jabil (NYSE: JBL) with a $136.00 price target, following the company's Q4 FY24 earnings report. Despite a mixed report with FY25 EBIT guidance modestly below the Street, Goldman Sachs believes Jabil's repositioned business mix, focusing on favorable end markets like datacenter, auto, industrial, renewables, and medical, will drive long-term growth. The firm also notes Jabil's investments in these areas, addition of new hyperscale customers, and supportive capital allocation as reasons to maintain a positive outlook.",
      "url": "https://www.streetinsider.com/Analyst+Comments/Goldman+Sachs+Reiterates+Buy+Rating+on+Jabil+%28JBL%29/23776700.html",
      "source": "StreetInsider",
      "published": "20240930T054200",
      "overall_sentiment_score": 0.279624,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.210091,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.642238
    },
    {
      "title": "Guo Mingxi: Meta AR glasses Orion will be mass-produced as early as 2027, positioning to replace mobile phones and computers.",
      "summary": "Analyst Ming-Chi Kuo from TF International Securities predicts that Meta's AR glasses, Orion, could enter mass production as early as 2027, aiming to replace smartphones and tablets. Orion's key selling points are its integration of AI technology and spatial computing, though technical challenges and production partner decisions could delay the timeline. Meta may release a lower-spec version before the full-scale mass production to gather market feedback.",
      "url": "https://news.futunn.com/en/post/48144405/guo-mingxi-meta-ar-glasses-orion-will-be-mass-produced",
      "source": "富途牛牛",
      "published": "20240927T080100",
      "overall_sentiment_score": 0.135921,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.137053,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.640421
    },
    {
      "title": "Artificial Intelligence and Adaptive Portfolio Management",
      "summary": "This article highlights a podcast episode from Investor Insights that explores the role of Artificial Intelligence in adaptive portfolio management. The discussion emphasizes AI as a tool to enhance human expertise in creating sophisticated investment applications and evolving portfolio strategies from traditional \"buy and hold\" approaches. It concludes that investors need to understand AI's implications for portfolio management, even if they don't grasp its technical intricacies.",
      "url": "https://www.etftrends.com/etf-strategist-channel/artificial-intelligence-adaptive-portfolio-management/",
      "source": "ETF Trends",
      "published": "20240924T000000",
      "overall_sentiment_score": 0.208296,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.30991,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.637239
    },
    {
      "title": "Capturing the in vogue ‘mega-forces’ in a one-stop ETF shop",
      "summary": "The iShares Global 100 ETF (IOO) was recognized as the top ETF Product at the 2024 Financial Newswire/SQM Research Fund Manager of the Year Awards. This BlackRock fund specifically targets top-performing global companies, focusing on those with diversified revenue streams and large market caps, moving beyond simple index tracking. It has a strong track record of capitalizing on prevailing mega-trends like technology and AI, demonstrating consistent performance in capturing global economic transformers.",
      "url": "https://financialnewswire.com.au/funds-management/capturing-the-in-vogue-mega-forces-in-a-one-stop-etf-shop/",
      "source": "Financial Newswire",
      "published": "20240923T081037",
      "overall_sentiment_score": 0.362307,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.30741,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.635028
    },
    {
      "title": "ResMed Unveils New Collection of Digital and Personalized Solutions designed to Improve Sleep Health",
      "summary": "ResMed has announced new patient-centric products aimed at enhancing the therapy journey for sleep apnea patients, integrating with digital wearables and generative AI for a more personalized sleep health experience. Key innovations include a myAir™ smartwatch app, sleep staging integration, personalized coaching, holistic health trend tracking, and an AI-enabled sleep health concierge named Dawn. Additionally, ResMed introduced LUXE travel gear designed for CPAP users on the go.",
      "url": "https://www.globenewswire.com/news-release/2024/09/30/2955162/0/en/ResMed-Unveils-New-Collection-of-Digital-and-Personalized-Solutions-designed-to-Improve-Sleep-Health.html",
      "source": "GlobeNewswire",
      "published": "20240930T080100",
      "overall_sentiment_score": 0.325439,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.247023,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.623011
    },
    {
      "title": "The Marygold Companies Secures Private Placement to Finance Next-Stage Rollout Initiatives for Recently Developed Fintech Product",
      "summary": "The Marygold Companies, Inc. secured $4.38 million in funding, part of a $6.56 million private placement with Streeterville Capital, LLC, to finance the rollout of its Marygold & Co. fintech app. This digital banking alternative, already soft-launched in the U.S., is set for further market penetration including in the U.K. later this year, leveraging recently acquired investment advisory firms. The app offers features like a digital wallet, physical debit card, and tools for saving and investing, aiming to provide a private banking experience without traditional fees.",
      "url": "https://www.businesswire.com/news/home/20240924438824/en/The-Marygold-Companies-Secures-Private-Placement-to-Finance-Next-Stage-Rollout-Initiatives-for-Recently-Developed-Fintech-Product",
      "source": "Business Wire",
      "published": "20240924T130952",
      "overall_sentiment_score": 0.22044,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.142168,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.615637
    },
    {
      "title": "MUSQ Global Music Industry ETF Celebrates Its One-Year Anniversary on the New York Stock Exchange",
      "summary": "MUSQ LLC announced the one-year anniversary of its MUSQ Global Music Industry ETF (NYSE:MUSQ) debut on the New York Stock Exchange. The fund has surpassed $22 million in assets under management (AUM), offering investors diversified exposure to the global music ecosystem. With the global music industry projected to reach $163.7 billion by 2030, the ETF provides access to key players like Spotify, Universal Music Group, Apple, Alphabet, and Sony Group.",
      "url": "https://www.accessnewswire.com/newsroom/en/sports-leisure-and-entertainment/musq-global-music-industry-etf-celebrates-its-one-year-anniversary-919933",
      "source": "ACCESS Newswire",
      "published": "20240919T080000",
      "overall_sentiment_score": 0.366481,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.337353,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.604768
    }
  ]
}