{
  "ticker": "AAPL",
  "date": "2025-11-24",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T11:23:25.878096",
  "source": "alpha_vantage",
  "article_count": 50,
  "articles": [
    {
      "title": "Apple cuts jobs in latest round of tech layoffs",
      "summary": "Apple announced a new round of job cuts across its sales teams, specifically targeting account managers for businesses, schools, and government agencies, as well as staff operating briefing centers. The company stated that these layoffs affect a small number of roles and are designed to strengthen customer engagement, with affected employees eligible to apply for new positions. These layoffs come amidst a trend of other major tech companies like Verizon, Synopsys, and IBM also announcing job reductions.",
      "url": "https://www.usatoday.com/story/money/2025/11/24/apple-cuts-jobs-tech-layoffs/87454986007/",
      "source": "USA Today",
      "published": "20251124T222054",
      "overall_sentiment_score": -0.295019,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.296034,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 1.0
    },
    {
      "title": "iPhone 17 Boosts Apple's China Sales: What's Ahead for the Stock?",
      "summary": "Apple's latest iPhone 17 series has significantly boosted its sales in China, with October sales jumping 37% year over year, despite facing strong competition and other headwinds. The company expects double-digit growth in iPhone sales for the December quarter in Greater China, driven by the new iPhone portfolio and Apple Intelligence features. However, Apple faces tough competition in the AI space from companies like Alphabet and Microsoft, and its stock is currently trading at a premium with a Zacks Rank of #3 (Hold).",
      "url": "https://www.tradingview.com/news/zacks:b6a2ab419094b:0-iphone-17-boosts-apple-s-china-sales-what-s-ahead-for-the-stock/",
      "source": "TradingView",
      "published": "20251124T190546",
      "overall_sentiment_score": 0.306794,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.337249,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Apple shares hit new all-time closing high",
      "summary": "Apple Inc. (AAPL) shares reached a new all-time closing high of $276.15 on November 24, 2025, rising 1.63%. The company's market value stands at $4.095 trillion, making it the world's second-most valuable company. The article also lists the market values of other top U.S. publicly traded companies.",
      "url": "https://macdailynews.com/2025/11/24/apple-shares-hit-new-all-time-closing-high-30/",
      "source": "MacDailyNews",
      "published": "20251124T164100",
      "overall_sentiment_score": 0.42191,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.828752,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Apple’s Services Business Hits a Record–Big Growth in Q4 2025",
      "summary": "Apple announced record-high Services revenue in Q4 2025, reaching over $28.8 billion, demonstrating a successful shift in strategy from hardware to a digital ecosystem. This growth, driven by subscriptions, digital purchases, and Apple Pay, provides financial stability and resources for further product improvement. Despite challenges like competition and regulation, Apple plans to continue investing in its Services, indicating a future where digital experiences and hardware are deeply integrated.",
      "url": "https://vocal.media/journal/apple-s-services-business-hits-a-record-big-growth-in-q4-2025",
      "source": "vocal.media",
      "published": "20251124T122110",
      "overall_sentiment_score": 0.447308,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.429152,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Jim Cramer Believes Apple's (AAPL) User Base Is Very Important For AI",
      "summary": "Jim Cramer reiterates his belief that Apple's extensive user base is a significant asset for its AI strategy. He suggests that another company could pay Apple a substantial sum to gain access to its 1.5 billion users for AI purposes. This perspective comes after two months since the latest iPhone launch, bringing Apple's AI plans back into focus.",
      "url": "https://finviz.com/news/236773/jim-cramer-believes-apples-aapl-user-base-is-very-important-for-ai",
      "source": "Finviz",
      "published": "20251123T005300",
      "overall_sentiment_score": 0.319546,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.338821,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "AAPL - Apple Inc Stock Price and Quote",
      "summary": "This article provides a comprehensive overview of Apple Inc. (AAPL) stock, including its current price, key financial metrics, stock performance data, and recent news headlines. It also details an extensive list of insider transactions and analyst ratings, offering a deep dive into the company's financial and market standing.",
      "url": "https://finviz.com/quote.ashx?t=AAPL",
      "source": "Finviz",
      "published": "20251121T160000",
      "overall_sentiment_score": 0.129078,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.32019,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Verdict: Apple Hit With $634 Million in Damages in Masimo Lawsuit; Another Shoe May Drop",
      "summary": "A California jury has ordered Apple Inc. to pay Masimo Corporation $634 million in damages for infringing on Masimo's patents related to Apple Watch features. This verdict is a significant win for Masimo in its ongoing legal battles with Apple, which started several years ago. Despite the judgment, both companies continue to have multiple lawsuits pending across various courts and commissions, indicating the dispute is far from over, with Masimo also seeing a new ITC investigation open for Apple's latest Watches.",
      "url": "https://www.strata-gee.com/verdict-apple-hit-with-634-million-in-damages-in-masimo-lawsuit-another-shoe-may-drop/",
      "source": "Strata-gee.com",
      "published": "20251119T185038",
      "overall_sentiment_score": -0.203157,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.209808,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 1.0
    },
    {
      "title": "iPhone 17 Momentum Fuels Apple’s China Comeback In October; Analyst Says Huawei Threat Won’t Trigger Sharp Drop-Off",
      "summary": "Apple's iPhone sales in China surged 37% year-over-year in October, driven by the strong performance of the iPhone 17 Series, signaling a comeback for the tech giant in the region. Despite the upcoming launch of a new Huawei flagship, an analyst predicts no sharp drop-off for Apple due to its current momentum and sustained demand. China remains a crucial market for Apple, contributing significantly to its September quarter sales and underpinning its strong revenue forecast for the December quarter.",
      "url": "https://stocktwits.com/news-articles/markets/equity/i-phone-17-momentum-fuels-apple-s-china-comeback-in-october/cLPNuASREeH",
      "source": "Stocktwits",
      "published": "20251118T021000",
      "overall_sentiment_score": 0.403097,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.403983,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "UBS Reiterates Neutral on Apple (AAPL) as iPhone Wait Times Remain Flat",
      "summary": "UBS has reiterated a \"Neutral\" rating on Apple (AAPL) due to iPhone wait times remaining flat, according to their recent market checks. While wait times for base and Pro Max models are around 12 and 8 days respectively, Pro and Air models show virtually no wait. The report notes an increase in wait times for the base iPhone model in the US, suggesting consumer resonance and supply constraints.",
      "url": "https://finviz.com/news/232219/ubs-reiterates-neutral-on-apple-aapl-as-iphone-wait-times-remain-flat",
      "source": "Finviz",
      "published": "20251117T221200",
      "overall_sentiment_score": 0.009247,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.017795,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 1.0
    },
    {
      "title": "Barclays Raises the PT on Apple Inc (AAPL), Keeps a Sell Rating",
      "summary": "Barclays raised its price target on Apple Inc. (AAPL) from $180 to $230 but maintained a Sell rating on November 18. This follows KeyBanc's reiteration of a Hold rating on November 17, as analyst Brandon Nispel noted weaker-than-expected October data. Despite the mixed analyst views, Apple's Q4 2025 revenue and EPS surpassed expectations, driven by record iPhone and Service segment performance.",
      "url": "https://finviz.com/news/233625/barclays-raises-the-pt-on-apple-inc-aapl-keeps-a-sell-rating",
      "source": "Finviz",
      "published": "20251119T071100",
      "overall_sentiment_score": -0.201171,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.200649,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.991396
    },
    {
      "title": "Barclays Raises the PT on Apple Inc (AAPL), Keeps a Sell Rating",
      "summary": "Barclays raised its price target for Apple Inc. (AAPL) from $180 to $230, while maintaining a Sell rating. KeyBanc reiterated a Hold rating on the stock, noting a 4% month-over-month decrease in October based on Key First Look Data, although the firm expects hardware revenue to remain in line with expectations for fiscal Q1 2026. Apple reported record September quarter revenue of $102.47 billion and EPS of $1.85 for fiscal Q4 2025.",
      "url": "https://www.insidermonkey.com/blog/barclays-raises-the-pt-on-apple-inc-aapl-keeps-a-sell-rating-1647914/",
      "source": "Insider Monkey",
      "published": "20251119T071100",
      "overall_sentiment_score": 0.060639,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.051726,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.975047
    },
    {
      "title": "Analysts Are Neutral on These Technology Stocks: Palo Alto Networks (PANW), Apple (AAPL)",
      "summary": "Analysts have issued neutral ratings for Palo Alto Networks (PANW) and Apple (AAPL), indicating neither a bullish nor bearish outlook. KeyBanc analysts reiterated Hold ratings for both companies, with specific price targets and analyst consensus remaining largely positive. The article highlights individual analyst performance metrics and recent price targets from other firms.",
      "url": "https://www.theglobeandmail.com/investing/markets/stocks/PANW-Q/pressreleases/36176425/analysts-are-neutral-on-these-technology-stocks-palo-alto-networks-panw-apple-aapl/",
      "source": "The Globe and Mail",
      "published": "20251118T112126",
      "overall_sentiment_score": 0.010483,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.035744,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.924076
    },
    {
      "title": "Skyworks Solutions (NASDAQ:SWKS) EVP Sells $456,490.32 in Stock",
      "summary": "Skyworks Solutions EVP Reza Kasnavi sold 7,332 shares of stock for $456,490.32, reducing his position by 21.94%. The company recently announced a quarterly dividend of $0.71 per share and reported strong Q4 results, exceeding EPS and revenue expectations. Analysts currently rate the stock as \"Hold\" with an average price target of $83.18.",
      "url": "https://www.marketbeat.com/instant-alerts/skyworks-solutions-nasdaqswks-evp-sells-45649032-in-stock-2025-11-20/",
      "source": "MarketBeat",
      "published": "20251122T004535",
      "overall_sentiment_score": 0.075081,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.105444,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.774705
    },
    {
      "title": "Should Investors Own Vanguard's VOO ETF Over Invesco's QQQ for Broader Diversification?",
      "summary": "This article compares Vanguard's VOO ETF and Invesco's QQQ ETF, highlighting their differences in cost, yield, and diversification. While QQQ has shown stronger growth with higher volatility, VOO offers broader market exposure and lower expenses, making it potentially better for investors seeking diversification. The article suggests that VOO might be a better choice for new investors due to its broader diversification, while QQQ could supplement a portfolio for those seeking more tech exposure.",
      "url": "https://www.theglobeandmail.com/investing/markets/stocks/AAPL-Q/pressreleases/36254204/should-investors-own-vanguard-s-voo-etf-over-invesco-s-qqq-for-broader-diversification/",
      "source": "The Globe and Mail",
      "published": "20251121T143200",
      "overall_sentiment_score": 0.152482,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.107828,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.749715
    },
    {
      "title": "The Wait is Over: Best Buy’s Black Friday Sale Begins Nov. 20",
      "summary": "Best Buy's official Black Friday Sale begins early on Thursday, Nov. 20, offering doorbusters and deals on various tech products. Shoppers can find savings on TVs, laptops, headphones, kitchen appliances, and more, with special offers for My Best Buy Plus™ and My Best Buy Total™ members. The sale also includes Cyber Sunday and Monday deals and extended store hours to facilitate holiday shopping.",
      "url": "https://www.businesswire.com/news/home/20251118125656/en/The-Wait-is-Over-Best-Buys-Black-Friday-Sale-Begins-Nov.-20",
      "source": "Business Wire",
      "published": "20251118T112047",
      "overall_sentiment_score": 0.269033,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.30576,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.742976
    },
    {
      "title": "The Wait is Over: Best Buy’s Black Friday Sale Begins Nov. 20",
      "summary": "Best Buy's Black Friday Sale officially begins on November 20th, more than a week before Black Friday, offering early access to doorbusters and deals on popular tech products. Shoppers can find savings on TVs, laptops, headphones, kitchen appliances, and more, with additional deals rolling out through Black Friday and Cyber Monday. The article also highlights extended store hours and tools like gift ideas and an AI Gift Finder to help with holiday shopping.",
      "url": "https://markets.financialcontent.com/wral/article/bizwire-2025-11-18-the-wait-is-over-best-buys-black-friday-sale-begins-nov-20",
      "source": "FinancialContent",
      "published": "20251118T060000",
      "overall_sentiment_score": 0.399719,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.427387,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.742829
    },
    {
      "title": "PayPal’s Liverpool Pitch Pays Off and other Digital Transactions News briefs from 11/19/25",
      "summary": "PayPal has become an official digital payments partner for Liverpool FC, enhancing its visibility within the club's e-commerce and membership services. Other digital transactions news includes Klarna expanding its installment-payment options to Apple Pay in several European countries, Janam Technologies enabling contactless payments on its mobile devices using Ingenico's softPOS, and Bitcoin Depot installing machines in Wild Bill’s Tobacco stores. Additionally, SEON updated its fraud-prevention tools for global businesses, Zillow launched a service for renters to report on-time payments to credit bureaus, and Wetzel’s Pretzels began a gift card promotion.",
      "url": "https://www.digitaltransactions.net/paypals-liverpool-pitch-pays-off-and-other-digital-transactions-news-briefs-from-11-19-25/",
      "source": "Digital Transactions",
      "published": "20251119T165122",
      "overall_sentiment_score": 0.270721,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.194108,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.738097
    },
    {
      "title": "Vanguard Group Inc. Sells 983,520 Shares of Skyworks Solutions, Inc. $SWKS",
      "summary": "Vanguard Group Inc. reduced its stake in Skyworks Solutions, Inc. by selling 983,520 shares, though it still holds 13.31% of the company valued at $1.47 billion. Skyworks Solutions recently announced a quarterly dividend of $0.71, and its Q3 2025 earnings beat analyst estimates. The article also details insider stock sales and provides an overview of Skyworks' stock performance and analyst ratings.",
      "url": "https://www.marketbeat.com/instant-alerts/filing-vanguard-group-inc-sells-983520-shares-of-skyworks-solutions-inc-swks-2025-11-23/",
      "source": "MarketBeat",
      "published": "20251124T145134",
      "overall_sentiment_score": 0.220959,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.348483,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.732807
    },
    {
      "title": "John Deere Testing Self-Driving Tractors",
      "summary": "John Deere is preparing for a nationwide rollout of self-driving tractors next year. These AI-powered tractors use satellite navigation and 360-degree cameras to operate in fields, with farmers controlling them via smartphone. This technology allows for extended workdays and frees up farmers for other tasks, with testing currently underway in 18 states.",
      "url": "https://kfab.iheart.com/content/2025-11-18-john-deere-testing-self-driving-tractors/",
      "source": "iHeart",
      "published": "20251118T172901",
      "overall_sentiment_score": 0.277226,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.23429,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.707586
    },
    {
      "title": "Intel Stock Today (INTC) – November 18, 2025: Why Shares Are Sliding After a Huge 2025 Rally",
      "summary": "Intel stock (INTC) is down today, November 18, 2025, pulling back after a significant rally earlier in the year. This slide is attributed to broader tech market weakness, skeptical analyst ratings, and investor re-evaluation of Intel's high valuation amidst its AI and foundry turnaround efforts. Despite the dip, institutional investors maintain large stakes, and strategic developments in packaging technology and AI chips suggest long-term potential, though execution risks and persistent foundry losses remain concerns.",
      "url": "https://ts2.tech/en/intel-stock-today-intc-november-18-2025-why-shares-are-sliding-after-a-huge-2025-rally/",
      "source": "ts2.tech",
      "published": "20251118T172127",
      "overall_sentiment_score": 0.14023,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.210563,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.702242
    },
    {
      "title": "Should Invesco RAFI US 1000 ETF (PRF) Be on Your Investing Radar?",
      "summary": "The Invesco RAFI US 1000 ETF (PRF) tracks the FTSE RAFI US 1000 Index, offering exposure to large-cap value stocks based on fundamental measures. With over $8.19 billion in assets and a 0.34% expense ratio, PRF holds a Zacks ETF Rank of 3 (Hold). The ETF has seen a return of approximately 13.18% year-to-date and 9.83% over the last year, positioning it as a medium-risk option for investors seeking diversified large-cap value exposure.",
      "url": "https://www.sharewise.com/de/news_articles/Should_Invesco_RAFI_US_1000_ETF_PRF_Be_on_Your_Investing_Radar_Zacks_20251119_1220",
      "source": "www.sharewise.com",
      "published": "20251118T150850",
      "overall_sentiment_score": 0.156143,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.103192,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.644952
    },
    {
      "title": "Nvidia defies AI bubble fears but some analysts remain worried",
      "summary": "Nvidia's blockbuster earnings initially eased fears of an AI bubble, but its stock and the broader market still dipped, highlighting ongoing concerns about the technology's profitability despite massive spending. While Nvidia and its proponents see a transformative tech shift, critics and some analysts warn of immense costs, potential financial strain, and an overexcited market, even if AI's long-term impact is undeniable.",
      "url": "https://abcnews.go.com/Business/nvidia-defies-ai-bubble-fears-analysts-remain-worried/story?id=127709332",
      "source": "ABC News",
      "published": "20251122T050600",
      "overall_sentiment_score": 0.140362,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.195916,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.643705
    },
    {
      "title": "Best Buy (BBY) Stock Today, Nov. 25, 2025: Price, 5% Yield and What to Watch Before Earnings",
      "summary": "Best Buy (BBY) stock declined 1.1% on November 25, 2025, ahead of its critical Q3 FY26 earnings report, despite a strong broader market. Investors are keenly watching the earnings to assess the impact of tariffs and holiday demand, given BBY's 5% dividend yield and current valuation. Key themes for the earnings include comparable sales, margin trends due to product mix and tariffs, and the potential impact of its retail media business.",
      "url": "https://ts2.tech/en/best-buy-bby-stock-today-nov-25-2025-price-5-yield-and-what-to-watch-before-earnings/",
      "source": "ts2.tech",
      "published": "20251124T225126",
      "overall_sentiment_score": 0.112117,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.219711,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.642435
    },
    {
      "title": "Raiffeisen Bank International AG Has $11.89 Million Stock Holdings in VeriSign, Inc. $VRSN",
      "summary": "Raiffeisen Bank International AG reduced its holdings in VeriSign, Inc. by 8.6% to 42,102 shares, valued at $11.89 million. VeriSign reported strong quarterly earnings, slightly beating estimates, and authorized a significant stock buyback. Insider selling was noted, but analysts maintain a \"Moderate Buy\" rating for the stock.",
      "url": "https://www.marketbeat.com/instant-alerts/filing-raiffeisen-bank-international-ag-has-1189-million-stock-holdings-in-verisign-inc-vrsn-2025-11-17/",
      "source": "MarketBeat",
      "published": "20251118T165158",
      "overall_sentiment_score": 0.087606,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.142941,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.638969
    },
    {
      "title": "World's biggest company Nvidia stuns Wall Street as it gives biggest clue yet to state of US economy",
      "summary": "Nvidia, the world's largest company, reported blockbuster quarterly sales of $57 billion, exceeding analyst expectations and causing its share price to jump. This strong performance by the chipmaker, which is a key driver of the AI boom, is seen as a significant positive indicator for the broader US economy and investor confidence. While Nvidia's success boosts market sentiment, concerns remain about the market's heavy reliance on a few AI-focused tech giants and potential volatility.",
      "url": "https://www.dailymail.co.uk/yourmoney/article-15307479/nvidia-sales-boost-economy.html",
      "source": "Daily Mail",
      "published": "20251119T162100",
      "overall_sentiment_score": 0.169323,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.116717,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.634999
    },
    {
      "title": "QQQI ETF Soars With $297.7M Inflows, 14.09% Yield, and $53.93 Price — Nasdaq Income Giant Strengthens",
      "summary": "The NEOS NASDAQ-100 High Income ETF (NYSEARCA:QQQI) has reinforced its leadership among high-yield income ETFs, attracting $297.7 million in new capital over the last week of November. The fund, which trades near its 52-week high at $53.86 and boasts $6.27 billion in assets under management, offers a 14.09% annualized yield with monthly distributions. Its robust performance, tax efficiency, and downside protection make it a strong choice for income-focused investors.",
      "url": "https://www.tradingnews.com/news/qqqi-etf-draws-297m-usd-inflows-as-price-nears-53-usd",
      "source": "TradingNEWS",
      "published": "20251124T042414",
      "overall_sentiment_score": 0.380342,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.285577,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.630308
    },
    {
      "title": "Eli Lilly Reaches $1 Trillion Market Cap on Booming Weight-Loss Drugs",
      "summary": "Eli Lilly has achieved a $1 trillion market capitalization, becoming the first pharmaceutical company to reach this milestone, driven by the success of its weight-loss drugs Mounjaro and Zepbound. The company joins a select group of mostly tech companies to surpass this valuation, with its market value now more than double that of its closest industry rival, Johnson & Johnson. This accomplishment positions Eli Lilly as the tenth company globally to exceed the $1 trillion mark according to Dow Jones Market Data.",
      "url": "https://www.wsj.com/health/pharma/eli-lilly-reaches-1-trillion-market-cap-on-booming-weight-loss-drugs-f4664fa9?gaa_at=eafs&gaa_n=AWEtsqf7MKisJNJ0uGVzdTuuhBzI0jippHwu4J5gzKnPlFcGYwr72BIc36rK&gaa_ts=6920d3db&gaa_sig=5qF7zBSMJDRMCPbW9iXVMuBX3639V4szEy1fLNoJDlvjY3V6PZQ1Up2O8ijW1J56wmr-QKCfd8MmGl4oLljB8g%3D%3D",
      "source": "The Wall Street Journal",
      "published": "20251121T205156",
      "overall_sentiment_score": 0.194876,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.142885,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.627875
    },
    {
      "title": "Qualcomm Inc (QCOM) Price Today",
      "summary": "This article provides current and historical price information for Qualcomm Inc (QCOM), including its market cap, daily volume, and a description of the company's core business in wireless technology and chip design. It also presents data on tokenized Qualcomm stock and lists other popular real-world assets.",
      "url": "https://coinmarketcap.com/real-world-assets/qualcomm/",
      "source": "CoinMarketCap",
      "published": "20251124T042138",
      "overall_sentiment_score": 0.111077,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.138043,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.623838
    },
    {
      "title": "FXAIX vs VOO: Is Fidelity or Vanguard Better for S&P 500 Exposure?",
      "summary": "This article compares Fidelity's FXAIX and Vanguard's VOO, both S&P 500 index funds, to help investors decide which is better for their needs. It analyzes their fees, structure (mutual fund vs. ETF), tax efficiency, performance, and suitability for different account types and trading styles. While FXAIX has a slightly lower expense ratio, VOO generally offers better tax efficiency and intraday tradability.",
      "url": "https://www.ebc.com/forex/fxaix-vs-voo-is-fidelity-or-vanguard-better-for-s-and-amp-p-500-exposure",
      "source": "EBC Financial Group",
      "published": "20251124T093156",
      "overall_sentiment_score": 0.264723,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.333627,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.617351
    },
    {
      "title": "SPGM Brings Broader Diversification and Lower Cost Than NZAC",
      "summary": "The article compares two ETFs, SPDR Portfolio MSCI Global Stock Market ETF (SPGM) and SPDR MSCI ACWI Climate Paris Aligned ETF (NZAC), highlighting SPGM's broader diversification, lower cost, and higher one-year return. While NZAC offers an ESG-focused approach, SPGM provides comprehensive global equity coverage without specific screens. The comparison details their expense ratios, dividend yields, performance, and holdings, suggesting SPGM is generally more affordable and diversified, though NZAC appeals to investors prioritizing sustainability.",
      "url": "https://www.theglobeandmail.com/investing/markets/markets-news/Motley%20Fool/36170545/spgm-brings-broader-diversification-and-lower-cost-than-nzac/",
      "source": "The Globe and Mail",
      "published": "20251117T221200",
      "overall_sentiment_score": 0.110141,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.142612,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.611774
    },
    {
      "title": "It's Down 47% But Canaan Inc. (NASDAQ:CAN) Could Be Riskier Than It Looks",
      "summary": "Canaan Inc. shares have fallen 47% in the last month and are down 44% over the past year. Despite its current price-to-sales ratio being similar to the industry average, the company's strong forecasted revenue growth of 70% suggests it might be undervalued, though investor skepticism could be keeping the P/S flat. The article highlights that while the risk of a price drop seems subdued given its growth prospects, some uncertainty in revenue forecasts might be contributing to its consistent P/S ratio within the industry.",
      "url": "https://simplywall.st/stocks/us/tech/nasdaq-can/canaan/news/its-down-47-but-canaan-inc-nasdaqcan-could-be-riskier-than-i",
      "source": "Simply Wall Street",
      "published": "20251119T010656",
      "overall_sentiment_score": 0.020066,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.133214,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.610792
    },
    {
      "title": "Alphabet: Buffett's Bet on Its Next Phase of Growth",
      "summary": "Berkshire Hathaway recently revealed a significant stake in Alphabet, signaling Warren Buffett's confidence in the tech giant's next growth phase. This investment is notable given Buffett's historical preference for undervalued companies, but Alphabet's strong fundamentals, impressive revenue growth, and expanding AI and cloud businesses have made it an attractive buy. The article highlights Alphabet's recent financial performance, its accelerating demand in AI, and its reasonable valuation despite a strong second-half rally.",
      "url": "https://finviz.com/news/233098/alphabet-buffetts-bet-on-its-next-phase-of-growth",
      "source": "Finviz",
      "published": "20251118T121700",
      "overall_sentiment_score": 0.308069,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.305452,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.603054
    },
    {
      "title": "Advanced Micro Devices Inc (AMD) Price Today",
      "summary": "This article provides current and tokenized price data for Advanced Micro Devices Inc (AMD), including market capitalization, daily volume, and a brief company description. It details AMD's semiconductor business for various markets and its acquisition of Xilinx. The article also lists prices for other popular real-world assets.",
      "url": "https://coinmarketcap.com/real-world-assets/amd/",
      "source": "CoinMarketCap",
      "published": "20251123T135052",
      "overall_sentiment_score": 0.079068,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.082134,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.602446
    },
    {
      "title": "Why Are Enviri (NVRI) Shares Soaring Today",
      "summary": "Enviri (NVRI) shares jumped 27% after the company announced it agreed to sell its Clean Earth business to Veolia for $3.04 billion in cash and spin off its remaining businesses. Shareholders are expected to receive significant cash per share and retain ownership in the new publicly traded company. This strategic move aims to strengthen the balance sheet of the spun-off entity.",
      "url": "https://finviz.com/news/236443/why-are-enviri-nvri-shares-soaring-today",
      "source": "Finviz",
      "published": "20251121T171600",
      "overall_sentiment_score": 0.117894,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.115436,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.601311
    },
    {
      "title": "Fold Launches Affiliate Program as Bitcoin Gift Card Gains Momentum on Holiday Gift Guides",
      "summary": "Fold Holdings, Inc. announced the launch of its new affiliate program, allowing content creators to earn commissions on sales of the Fold Bitcoin Gift Card. This initiative seeks to integrate bitcoin into everyday life by providing a unique gift option that can appreciate in value, unlike traditional gift cards. The company has partnered with Impact and plans to expand the program to include other financial products in 2026.",
      "url": "https://investingnews.com/fold-launches-affiliate-program-as-bitcoin-gift-card-gains-momentum-on-holiday-gift-guides/",
      "source": "Investing News Network",
      "published": "20251124T035132",
      "overall_sentiment_score": 0.203017,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.136053,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.595519
    },
    {
      "title": "HP Inc. (HPQ) Soars 6.24% on Strategic AI Partnership Ahead of Q4 Earnings",
      "summary": "HP Inc. (HPQ) saw its stock price surge by 6.24% due to a strategic AI partnership with SAMI Advanced Electronics to manufacture millions of AI-driven computers in Saudi Arabia by 2030, rather than its upcoming Q4 2025 earnings report. This move signals robust investor confidence in HP's long-term vision and its pivot into the artificial intelligence sector and new regional markets. While analyst sentiments are mixed, the market is primarily reacting to the optimistic forward guidance and potential for sustained growth in AI-integrated hardware.",
      "url": "https://markets.financialcontent.com/buffnews/article/marketminute-2025-11-21-hp-inc-hpq-soars-624-on-strategic-ai-partnership-ahead-of-q4-earnings",
      "source": "FinancialContent",
      "published": "20251121T173800",
      "overall_sentiment_score": 0.200346,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.282967,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.594334
    },
    {
      "title": "EZGO announces 1-for-25 reverse share split effective Nov 21",
      "summary": "EZGO Technologies Ltd. announced a 1-for-25 reverse share split, effective November 21, 2025, to increase its share price and maintain its Nasdaq listing. The split will reduce outstanding shares from over 21 million to approximately 868,029, with fractional shares rounded up. This move comes as the company's stock has faced significant declines, and they also recently enacted a warrant exchange agreement to manage their capital structure.",
      "url": "https://www.investing.com/news/company-news/ezgo-announces-1for25-reverse-share-split-effective-nov-21-93CH-4367440",
      "source": "Investing.com",
      "published": "20251124T034512",
      "overall_sentiment_score": -0.110791,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.0089,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.590925
    },
    {
      "title": "Dell Technologies Inc. Class C Common Stock (NY: DELL )",
      "summary": "This page provides a news compilation for Dell Technologies Inc. (NYSE: DELL), featuring recent articles about its stock performance, AI initiatives like \"Project Maverick,\" and mentions alongside other tech giants. Key stories include Dell's stock movements in response to economic news, delays in its AI overhaul, and expansions in its enterprise AI infrastructure. The content covers news items from mid to late November 2025, detailing market reactions to AI developments and broader economic trends affecting technology stocks.",
      "url": "https://markets.financialcontent.com/wss/quote/news?Symbol=321%3A2578133494",
      "source": "FinancialContent",
      "published": "20251121T190000",
      "overall_sentiment_score": 0.097362,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.100865,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.588118
    },
    {
      "title": "ATRenew (RERE) Q3 2025 Earnings Call Transcript",
      "summary": "ATRenew (RERE) reported record Q3 2025 results with total net revenue of RMB5.15 billion, up 27.1% year-over-year, and non-GAAP operating profit of RMB140 million, up 34.9%. The company highlighted growth in its 1P and 3P businesses, driven by increased online pre-owned electronics sales, expanded refurbishment capabilities, and a comprehensive store network. Management outlined a three-stage strategic plan focusing on strengthening core electronics recycling, building the AHS Recycle brand in China, and preparing for international expansion, including increased device exports and potential global platform replication.",
      "url": "https://www.theglobeandmail.com/investing/markets/stocks/JD/pressreleases/36230128/atrenew-rere-q3-2025-earnings-call-transcript/",
      "source": "The Globe and Mail",
      "published": "20251120T095740",
      "overall_sentiment_score": 0.583567,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.322313,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.586379
    },
    {
      "title": "Bitcoin ETFs Just Had One of Their Worst Weeks on Record, Bleeding $1.2 Billion",
      "summary": "Spot Bitcoin exchange-traded funds experienced one of their worst weeks on record, bleeding nearly $1.2 billion in assets, marking the third-highest weekly outflow in their 22-month history. This significant outflow correlated with a 33% drop in Bitcoin's price since early October, hitting its lowest point since April, and was led by BlackRock's iShares Bitcoin Trust (IBIT) with over $1 billion in outflows. Despite these setbacks, some analysts remain optimistic about Bitcoin's historical resilience to drawdowns.",
      "url": "https://decrypt.co/349681/bitcoin-etfs-worst-weeks-bleeding-1-2-billion",
      "source": "Decrypt",
      "published": "20251123T015201",
      "overall_sentiment_score": -0.182139,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": 0.108769,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.582315
    },
    {
      "title": "HP Inc. (HPQ) Soars 6.24% on Strategic AI Partnership Ahead of Q4 Earnings",
      "summary": "HP Inc. (HPQ) saw its stock surge by 6.24% on November 21, 2025, driven by a strategic AI partnership with SAMI Advanced Electronics to manufacture millions of AI-focused computers in Saudi Arabia by 2030, ahead of its Q4 2025 earnings report. This pre-earnings rally reflects investor confidence in HP's long-term vision, particularly its expansion into the burgeoning artificial intelligence sector and regional manufacturing. The market is increasingly valuing companies with clear strategies for future growth and innovation in key technological areas, setting a critical stage for the upcoming earnings announcement and HP's future trajectory.",
      "url": "https://markets.financialcontent.com/stocks/article/marketminute-2025-11-21-hp-inc-hpq-soars-624-on-strategic-ai-partnership-ahead-of-q4-earnings",
      "source": "FinancialContent",
      "published": "20251121T173800",
      "overall_sentiment_score": 0.256152,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.285471,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.579316
    },
    {
      "title": "Alphabet (GOOG) Stock Soars Above $315 as AI Wave Pushes Valuation Toward $4 Trillion – 24 November 2025",
      "summary": "Alphabet's Class C shares (GOOG) surged above $315, pushing its market valuation towards $4 trillion, driven by strong Q3 2025 earnings, renewed confidence in its AI leadership with Gemini 3, and significant growth in Google Cloud. The stock's rally of 70-75% over the past year reflects growing investor enthusiasm, although analysts note rich valuations and ongoing antitrust risks. The company's vertically integrated AI strategy, including custom chips and a new NATO cloud deal, further bolsters its position.",
      "url": "https://ts2.tech/en/alphabet-goog-stock-soars-above-315-as-ai-wave-pushes-valuation-toward-4-trillion-24-november-2025/",
      "source": "ts2.tech",
      "published": "20251124T170626",
      "overall_sentiment_score": 0.414732,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.329394,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.574289
    },
    {
      "title": "BTIG Maintains a Buy on Ardelyx, Inc (ARDX)",
      "summary": "BTIG analyst Julian Harrison reiterated a Buy rating on Ardelyx, Inc. (NASDAQ: ARDX) with a $14 price target, following the company's strong fiscal Q3 2025 results. Ardelyx exceeded revenue and EPS estimates, driven by a significant 92% year-over-year growth in IBSRELA revenue. The company also raised its 2025 IBSRELA revenue guidance to between $270 million and $275 million due to sustained patient demand.",
      "url": "https://www.insidermonkey.com/blog/btig-maintains-a-buy-on-ardelyx-inc-ardx-1647247/",
      "source": "Insider Monkey",
      "published": "20251118T050700",
      "overall_sentiment_score": 0.254366,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.000626,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.573439
    },
    {
      "title": "Aris Mining Corp stock hits 52-week high at 12.1 USD",
      "summary": "Aris Mining Corp (ARMN) has achieved a new 52-week high of $12.10, showcasing a 183.45% appreciation over the last year and a 90.95% return in the past six months. With a market capitalization of $2.44 billion and a \"GREAT\" financial health rating, the company's strong performance reflects significant investor confidence. Despite a high P/E ratio of 45.57, analysts anticipate continued net income growth, suggesting potential for future gains.",
      "url": "https://www.investing.com/news/company-news/aris-mining-corp-stock-hits-52week-high-at-121-usd-93CH-4370754",
      "source": "Investing.com",
      "published": "20251124T053029",
      "overall_sentiment_score": -0.101681,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.259514,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.57255
    },
    {
      "title": "HP Inc. (HPQ) Soars 6.24% on Strategic AI Partnership Ahead of Q4 Earnings",
      "summary": "HP Inc. (HPQ) saw its stock price surge by 6.24% on November 21, 2025, driven by a strategic partnership with SAMI Advanced Electronics to manufacture AI-driven computers in Saudi Arabia. This significant gain occurred prior to its Q4 2025 earnings report, indicating strong investor confidence in HP's long-term vision and pivot into the artificial intelligence sector. The market is keenly watching whether this strategic optimism will translate into tangible financial performance.",
      "url": "https://markets.financialcontent.com/wral/article/marketminute-2025-11-21-hp-inc-hpq-soars-624-on-strategic-ai-partnership-ahead-of-q4-earnings",
      "source": "FinancialContent",
      "published": "20251121T173800",
      "overall_sentiment_score": 0.194642,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.223678,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.57076
    },
    {
      "title": "SPGM Brings Broader Diversification and Lower Cost Than NZAC",
      "summary": "This article compares two ETFs, SPDR Portfolio MSCI Global Stock Market ETF (SPGM) and SPDR MSCI ACWI Climate Paris Aligned ETF (NZAC), highlighting SPGM's broader diversification, lower expense ratio, and larger asset base. While both invest in global equities, NZAC focuses on ESG and climate-aligned mandates, leading to different sector allocations and a slightly lower return compared to SPGM's comprehensive global equity coverage. The choice between them depends on an investor's priority for broad market exposure versus sustainability.",
      "url": "https://www.theglobeandmail.com/investing/markets/stocks/AAPL/pressreleases/36170545/spgm-brings-broader-diversification-and-lower-cost-than-nzac/",
      "source": "The Globe and Mail",
      "published": "20251120T140853",
      "overall_sentiment_score": 0.002075,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.136914,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.570245
    },
    {
      "title": "ProShares UltraPro QQQ Faces Critical Test Amid AI Sector Volatility",
      "summary": "The ProShares UltraPro QQQ (TQQQ) ETF is facing a crucial test due to volatility in the technology sector, despite strong AI investment momentum. The fund experienced a weekly decline of 8.70% but still holds a significant year-to-date gain of 33.25%, reflecting its leveraged nature. Upcoming events like NVIDIA's earnings report and a stock split will significantly impact TQQQ, highlighting the risks of its concentrated technology holdings and the broader AI market's uncertainty.",
      "url": "https://www.ad-hoc-news.de/boerse/ueberblick/proshares-ultrapro-qqq-faces-critical-test-amid-ai-sector-volatility/68367729",
      "source": "AD HOC NEWS",
      "published": "20251118T102502",
      "overall_sentiment_score": 0.067106,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.11903,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.565783
    },
    {
      "title": "NioCorp and FatPipe Interviews to Air on the RedChip Small Stocks, Big Money(TM) Show on Bloomberg TV",
      "summary": "RedChip Companies will feature interviews with NioCorp Developments Ltd. (Nasdaq: NB) and FatPipe, Inc. (Nasdaq: FATN) on its \"RedChip Small Stocks, Big Money™\" show. The program will air on Bloomberg TV, discussing NioCorp's critical mineral project and FatPipe's innovations in SD-WAN and cybersecurity. Both companies will highlight their market positions, strategic partnerships, and growth strategies.",
      "url": "https://www.heraldmailmedia.com/press-release/story/36085/niocorp-and-fatpipe-interviews-to-air-on-the-redchip-small-stocks-big-moneytm-show-on-bloomberg-tv/",
      "source": "The Herald-Mail",
      "published": "20251124T035408",
      "overall_sentiment_score": 0.410615,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.261976,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.56194
    },
    {
      "title": "Finwise Bancorp director Reynolds buys $43,528 in stock",
      "summary": "Finwise Bancorp Director Howard I. Reynolds purchased 2,297 shares of common stock for $43,528 on October 31, 2025, increasing his direct ownership to 38,105 shares. This transaction follows Finwise Bancorp's strong third-quarter 2025 performance, where it exceeded earnings and revenue expectations with an EPS of $0.34 and revenue of $36.66 million.",
      "url": "https://www.investing.com/news/insider-trading-news/finwise-bancorp-director-reynolds-buys-43528-in-stock-93CH-4329011",
      "source": "Investing.com",
      "published": "20251123T021320",
      "overall_sentiment_score": 0.161866,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": -0.130475,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.552475
    },
    {
      "title": "Ingles Markets stock hits 52-week high at 75.67 USD By Investing.com",
      "summary": "Ingles Markets (IMKTA) stock has reached a 52-week high of $75.67, reflecting a 28% gain from its low and strong investor confidence. The company also declared quarterly cash dividends for both Class A and Class B Common Stock, set to be paid in October 2025. Additionally, Ingles Markets adopted updated bylaws, introducing advance notice requirements for shareholder nominations and enhancing indemnification provisions for directors and officers.",
      "url": "https://ca.investing.com/news/company-news/ingles-markets-stock-hits-52week-high-at-7567-usd-93CH-4332032",
      "source": "Investing.com Canada",
      "published": "20251121T104800",
      "overall_sentiment_score": 0.304172,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.193271,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.550071
    }
  ]
}