{
  "ticker": "AAPL",
  "date": "2026-01-05",
  "lookback_days": 14,
  "fetched_at": "2026-02-13T11:05:13.455977",
  "source": "alpha_vantage",
  "article_count": 50,
  "articles": [
    {
      "title": "Strong fundamentals, weak upside: the case against Apple stock in 2026",
      "summary": "Raymond James’ senior analyst Melissa Fairbanks suggests that despite Apple's (AAPL) strong fundamentals and customer base, its stock may struggle to rise significantly in 2026 as these strengths are already priced in. Factors like the slow impact of AI integration, saturation of its massive customer base, and a high valuation (34x forward P/E) are expected to limit near-term upside. Wall Street consensus also indicates a modest potential upside of just 7% for AAPL shares.",
      "url": "https://www.tradingview.com/news/invezz:f8eedebb3094b:0-strong-fundamentals-weak-upside-the-case-against-apple-stock-in-2026/",
      "source": "TradingView — Track All Markets",
      "published": "20260105T150729",
      "overall_sentiment_score": -0.308307,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.424636,
      "ticker_sentiment_label": "Bearish",
      "relevance_score": 1.0
    },
    {
      "title": "Apple stock heads into Monday under a valuation spotlight after Raymond James turns neutral on AAPL",
      "summary": "Raymond James has initiated coverage on Apple (AAPL) with a \"market perform\" (neutral) rating, citing a rich valuation and a lack of immediate catalysts, despite Apple ending Friday down about 0.3%. Investors are focusing on Apple's upcoming holiday-quarter earnings, iPhone demand, Services growth, and the impact of Apple Intelligence. The stock is about 6% below its 52-week high, with macroeconomic factors like jobs data and the Federal Reserve meeting influencing investor sentiment.",
      "url": "https://ts2.tech/en/apple-stock-heads-into-monday-under-a-valuation-spotlight-after-raymond-james-turns-neutral-on-aapl/",
      "source": "ts2.tech",
      "published": "20260104T215533",
      "overall_sentiment_score": 0.083594,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.125785,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 1.0
    },
    {
      "title": "Apple stock today: AAPL starts 2026 on a softer note as valuation talk returns, Vision Pro in focus",
      "summary": "Apple shares fell 0.3% to $271.01 on Friday, the first U.S. trading day of 2026, as Raymond James resumed coverage with a \"Market Perform\" rating due to valuation concerns. The company also faced news of Vision Pro production cutbacks following weak sales. Investors are now watching upcoming economic data, including ISM manufacturing and U.S. jobs reports, and Apple's late-January earnings for future direction.",
      "url": "https://ts2.tech/en/apple-stock-today-aapl-starts-2026-on-a-softer-note-as-valuation-talk-returns-vision-pro-in-focus/",
      "source": "ts2.tech",
      "published": "20260103T131345",
      "overall_sentiment_score": -0.156303,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.230661,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 1.0
    },
    {
      "title": "Apple stock slips as Raymond James turns cautious; Vision Pro pullback report hits AAPL",
      "summary": "Apple shares declined after Raymond James initiated coverage with a \"market perform\" rating, citing valuation concerns and a lack of immediate catalysts. This comes amid a Financial Times report indicating Apple has significantly scaled back production and marketing for its Vision Pro headset due to weak demand and disappointing sales figures. Investors are now looking to Apple's next earnings report for updates on iPhone demand, services growth, and AI feature rollout.",
      "url": "https://ts2.tech/en/apple-stock-slips-as-raymond-james-turns-cautious-vision-pro-pullback-report-hits-aapl/",
      "source": "ts2.tech",
      "published": "20260102T222728",
      "overall_sentiment_score": 0.070025,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.258854,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 1.0
    },
    {
      "title": "Apple stock price today: AAPL ticks up at 2026 open as Raymond James flags valuation, jobs data looms",
      "summary": "Apple shares rose slightly at the open of 2026, trading at $273.08, after Raymond James initiated coverage with a neutral \"market perform\" rating, citing valuation concerns and limited immediate catalysts. Investors are closely watching upcoming U.S. jobs and inflation data, as well as Apple's own earnings report on January 29, to gauge the Federal Reserve's rate path and the company's future growth prospects. The stock's premium valuation leaves it vulnerable to shifts in economic expectations despite early interest from investors.",
      "url": "https://ts2.tech/en/apple-stock-price-today-aapl-ticks-up-at-2026-open-as-raymond-james-flags-valuation-jobs-data-looms/",
      "source": "ts2.tech",
      "published": "20260102T150708",
      "overall_sentiment_score": 0.092734,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.105123,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 1.0
    },
    {
      "title": "Apple's (AAPL) Market Perform Rating Reaffirmed at Raymond James Financial",
      "summary": "Raymond James Financial has reaffirmed its \"Market Perform\" rating for Apple (AAPL), citing limited upside based on current valuations despite the company beating quarterly estimates. While analyst consensus leans towards a \"Moderate Buy\" with an average target price of $283.92, concerns include insider selling and weaker-than-expected demand for the Vision Pro, which is seen as a significant drag on sentiment. Heavy institutional ownership continues, with Apple's market capitalization at $4.02 trillion.",
      "url": "https://www.marketbeat.com/instant-alerts/apples-aapl-market-perform-rating-reaffirmed-at-raymond-james-financial-2026-01-02/",
      "source": "MarketBeat",
      "published": "20260102T131122",
      "overall_sentiment_score": 0.184879,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.272947,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 1.0
    },
    {
      "title": "Raymond James downgrades Apple, says gains will be hard to come by in 2026",
      "summary": "Raymond James has downgraded Apple to a market perform rating, citing the company's high valuation and limited near-term upside. Analyst Melissa Fairbanks believes that Apple's current stock price already reflects its strengths, making significant further outperformance difficult. Despite strong fundamentals and anticipated growth from its Services business and AI integration, the firm suggests that Apple's large existing user base will make incremental gains from technology upgrade cycles harder to achieve.",
      "url": "https://www.cnbc.com/2026/01/02/raymond-james-downgrades-apple-says-gains-will-be-hard-to-come-by-in-2026.html",
      "source": "CNBC",
      "published": "20260102T120842",
      "overall_sentiment_score": -0.150579,
      "overall_sentiment_label": "Somewhat-Bearish",
      "ticker_sentiment_score": -0.414292,
      "ticker_sentiment_label": "Bearish",
      "relevance_score": 1.0
    },
    {
      "title": "Valuation vs. Innovation: Raymond James Resumes Apple Coverage with a Cautious Stance for 2026",
      "summary": "Raymond James has resumed coverage of Apple Inc. (AAPL) with a neutral \"Market Perform\" rating, citing that its current valuation already incorporates optimism around its AI roadmap. Despite Apple's strong ecosystem and impressive market capitalization, the firm expressed caution regarding its high P/E ratio, the challenges of continued user growth, and tepid interest in the Vision Pro. The report highlights a shift towards a more mature, valuation-sensitive era for Apple, amidst regulatory pressures and a turbulent global economy.",
      "url": "https://markets.financialcontent.com/stocks/article/marketminute-2026-1-2-valuation-vs-innovation-raymond-james-resumes-apple-coverage-with-a-cautious-stance-for-2026",
      "source": "FinancialContent",
      "published": "20260102T100600",
      "overall_sentiment_score": -0.073218,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.260821,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 1.0
    },
    {
      "title": "Apple stock today: AAPL slips on Raymond James caution as Wall Street weighs rates and earnings",
      "summary": "Apple (AAPL) shares slipped by about 0.3% following Raymond James' neutral \"Market Perform\" rating and caution on valuation, despite acknowledging Apple's strong ecosystem. The market is also looking towards upcoming U.S. labor data and Apple's late-January earnings report for further direction.",
      "url": "https://ts2.tech/en/apple-stock-today-aapl-slips-on-raymond-james-caution-as-wall-street-weighs-rates-and-earnings/",
      "source": "ts2.tech",
      "published": "20260104T062000",
      "overall_sentiment_score": -0.069829,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.199297,
      "ticker_sentiment_label": "Somewhat-Bearish",
      "relevance_score": 0.969768
    },
    {
      "title": "Apple stock starts 2026 on a slip as valuation debate heats up ahead of Jan. 29 earnings",
      "summary": "Apple Inc. (AAPL.O) shares closed down 0.31% at $271.01 on Friday, underperforming a flat Nasdaq on the first trading day of 2026. Raymond James resumed coverage with a \"Market Perform\" rating, citing valuation concerns and a thin near-term catalyst calendar. Investors are now focused on the upcoming U.S. jobs report, the Fed's meeting, and Apple's Q4 earnings call on January 29th, where iPhone demand and services growth will be scrutinized.",
      "url": "https://ts2.tech/en/apple-stock-starts-2026-on-a-slip-as-valuation-debate-heats-up-ahead-of-jan-29-earnings/",
      "source": "ts2.tech",
      "published": "20260104T150926",
      "overall_sentiment_score": 0.101987,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.018711,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.961148
    },
    {
      "title": "A Shift in Focus: The iShares MSCI World ETF’s Growing Reliance on US Tech",
      "summary": "The iShares MSCI World ETF (URTH) is increasingly dominated by US technology stocks, with US equities now making up nearly 70% of its holdings and NVIDIA becoming its largest position. Despite its \"World\" designation, the fund primarily reflects the US market and developed countries, excluding emerging economies. This high concentration in US tech exposes URTH to specific sector risks and makes its performance significantly dependent on that market segment.",
      "url": "https://www.ad-hoc-news.de/boerse/ueberblick/a-shift-in-focus-the-ishares-msci-world-etf-s-growing-reliance-on-us/68452080",
      "source": "AD HOC NEWS",
      "published": "20260102T150858",
      "overall_sentiment_score": 0.216772,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.129167,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.799022
    },
    {
      "title": "The Ascent of the iShares MSCI World ETF: A Tech-Heavy Trajectory",
      "summary": "The iShares MSCI World ETF (URTH) is trading near all-time highs of $187 per share at the start of 2026, driven by a 22% one-year return primarily from its significant holdings in major technology companies. Despite its \"World\" designation, the ETF is heavily concentrated in U.S. equities, with approximately 75% in U.S. stocks and nearly 28% in information technology. Its future trajectory in Q1 2026 will largely depend on tech earnings, currency effects, and its elevated valuation levels.",
      "url": "https://www.ad-hoc-news.de/boerse/ueberblick/the-ascent-of-the-ishares-msci-world-etf-a-tech-heavy-trajectory/68457911",
      "source": "AD HOC NEWS",
      "published": "20260104T130957",
      "overall_sentiment_score": 0.229404,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.232792,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.793973
    },
    {
      "title": "Nvidia partner Foxconn reports 22% revenue surge as AI buildout ramps up",
      "summary": "Foxconn, a major Nvidia partner, reported a 22% surge in revenues in the fourth quarter of 2025, reaching $83 billion. This figure exceeded both analyst and company expectations, driven by strong growth in its components and cloud businesses. The company, which assembles Apple's iPhone and manufactures data center servers, is becoming a key player in the AI infrastructure buildout, having partnered with OpenAI and Nvidia for next-generation AI hardware.",
      "url": "https://www.cnbc.com/2026/01/05/nvidia-partner-foxconn-revenue-surge-tops-expectations.html",
      "source": "CNBC",
      "published": "20260105T110830",
      "overall_sentiment_score": 0.381225,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.337304,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.745135
    },
    {
      "title": "Navigating a Concentrated Market: The iShares MSCI World ETF’s US-Centric Strategy",
      "summary": "The iShares MSCI World ETF (URTH) is consolidating after a strong 2025, with investor focus now on AI investments and US Federal Reserve policy. Despite a slight negative year-to-date performance, the ETF's strategy heavily relies on developed markets, particularly the US, and has seen Nvidia become its top holding. Its concentrated portfolio, while driving past gains, also presents significant cluster risk within the technology sector.",
      "url": "https://www.ad-hoc-news.de/boerse/news/ueberblick/navigating-a-concentrated-market-the-ishares-msci-world-etf-s/68460706",
      "source": "AD HOC NEWS",
      "published": "20260105T100957",
      "overall_sentiment_score": 0.105819,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.127252,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.736433
    },
    {
      "title": "Should You Invest $1,000 in MP Materials Right Now?",
      "summary": "MP Materials, a rare earth miner, has seen its stock price soar over 230% in the last 12 months due to partnerships with the Department of Defense and Apple. While the company is vertically integrating and expanding its manufacturing capabilities, execution risks and a high valuation suggest the stock is best suited for aggressive investors. The Motley Fool Stock Advisor team did not include MP Materials in their top 10 stock recommendations.",
      "url": "https://finviz.com/news/267285/should-you-invest-1000-in-mp-materials-right-now",
      "source": "Finviz",
      "published": "20260105T112000",
      "overall_sentiment_score": 0.323626,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.323595,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.734811
    },
    {
      "title": "Omaha’s New Captain: Greg Abel Takes the Helm as Berkshire Hathaway Enters the Post-Buffett Era",
      "summary": "Greg Abel has officially taken over as CEO of Berkshire Hathaway on January 1, 2026, marking the end of Warren Buffett's tenure at the executive helm, though Buffett remains Chairman. The succession, long planned, has been met with market stability, demonstrating investors' confidence in Abel and the company's meticulously managed transition. Abel is now tasked with strategically deploying Berkshire's massive $382 billion cash reserve, potentially through large acquisitions or initiating the company's first-ever dividend, while maintaining Berkshire's unique culture and adapting to new market dynamics.",
      "url": "https://markets.financialcontent.com/stocks/article/marketminute-2026-1-2-omahas-new-captain-greg-abel-takes-the-helm-as-berkshire-hathaway-enters-the-post-buffett-era",
      "source": "FinancialContent",
      "published": "20260102T141600",
      "overall_sentiment_score": 0.125832,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.147821,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.734445
    },
    {
      "title": "T-Mobile stock slips in 2026’s first session as investors eye Feb. 11 targets update",
      "summary": "T-Mobile US, Inc. (TMUS) shares fell 1.1% in the first trading session of 2026, lagging competitors Verizon and AT&T. Investors are looking ahead to the carrier's Q4 and full-year 2025 earnings report and capital markets update on February 11, where management is expected to refresh medium-term financial targets. The market is also observing T-Mobile's new Apple TV+ pass-through charge, which highlights how carriers are managing bundled streaming perks amidst rising subscription prices.",
      "url": "https://ts2.tech/en/t-mobile-stock-slips-in-2026s-first-session-as-investors-eye-feb-11-targets-update/",
      "source": "ts2.tech",
      "published": "20260102T144500",
      "overall_sentiment_score": -0.074728,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.053183,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.733202
    },
    {
      "title": "Is Molina Healthcare The Next GEICO? Michael Burry Feels It's A ‘Special One’",
      "summary": "Hedge fund manager Michael Burry — well-known for his prescient short positions — recently offered encouraging comments about the health insurer Molina Healthcare, Inc. (MOH). He likened Molina to an early-stage GEICO, arguing it is undervalued and offers a clearer path to long-term earnings growth than many large-cap peers. Burry believes Molina is a \"special one\" in the insurance industry, despite its recent struggles and analyst skepticism.",
      "url": "https://newsable.asianetnews.com/markets/is-molina-healthcare-the-next-geico-michael-burry-feels-it-s-a-special-one-articleshow-l5do1qi",
      "source": "Asianet Newsable",
      "published": "20260103T190813",
      "overall_sentiment_score": 0.226252,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.312459,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.72449
    },
    {
      "title": "2 Predictions for Berkshire Hathaway in 2026",
      "summary": "As Warren Buffett retires from his CEO position at Berkshire Hathaway and Greg Abel takes over, the author predicts two significant changes for the company in 2026. These include the initiation of a dividend payment, driven by Berkshire's record cash position, and an increased investment in technology stocks, reflecting a shift from Buffett's long-held avoidance of the sector. These moves aim to optimize capital deployment and generate market-beating returns for shareholders in a new era.",
      "url": "https://finviz.com/news/265813/2-predictions-for-berkshire-hathaway-in-2026",
      "source": "Finviz",
      "published": "20260102T043500",
      "overall_sentiment_score": 0.220983,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.345594,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.72142
    },
    {
      "title": "Alphabet stock today: GOOGL slips in premarket even after a $385 price-target hike",
      "summary": "Alphabet's Class A shares (GOOGL) experienced a slight dip of 0.3% in premarket trading despite Citizens raising its price target to $385, citing positive momentum from AI features in Google Search. Investors are closely monitoring the company's AI spending and its potential impact on search growth and margins, while also looking ahead to upcoming U.S. activity data and job reports for clues on Federal Reserve policy. The stock's future trajectory hinges on whether AI-enhanced search can boost traffic and ad pricing without disproportionately increasing costs.",
      "url": "https://ts2.tech/en/alphabet-stock-today-googl-slips-in-premarket-even-after-a-385-price-target-hike/",
      "source": "ts2.tech",
      "published": "20260102T115712",
      "overall_sentiment_score": 0.057827,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.123076,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.720928
    },
    {
      "title": "Jim Cramer Points To Bob Swan Bet On Nike Amid Elliott Hill, Tim Cook's Purchases: Set To 'Win Now'",
      "summary": "Jim Cramer highlighted former Intel CEO Bob Swan's recent purchase of Nike (NKE) shares as a significant bullish signal, alongside buys from Apple CEO Tim Cook and Nike CEO Elliott Hill. Cramer views this \"trifecta\" of insider buying as a strong indicator for Nike's performance in the coming year. Despite a challenging 2025, these insider purchases suggest a potential turnaround, with Cramer emphasizing Nike's \"Win Now\" strategy in China.",
      "url": "https://www.sahmcapital.com/news/content/jim-cramer-points-to-bob-swan-bet-on-nike-amid-elliott-hill-tim-cooks-purchases-set-to-win-now-2026-01-02",
      "source": "Sahm",
      "published": "20260102T101400",
      "overall_sentiment_score": 0.351038,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.25452,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.713739
    },
    {
      "title": "A Deep Dive into the iShares MSCI World ETF: Concentration and AI Momentum",
      "summary": "The iShares MSCI World ETF (URTH) showed robust performance in 2025, driven by AI momentum and a concentration in US technology giants. While offering exposure to developed markets, its high allocation to US tech stocks makes it a concentrated bet rather than a broad diversifier. The article examines its composition, competitive landscape, and critical risks for 2026, including potential index adjustments and inflation concerns.",
      "url": "https://www.ad-hoc-news.de/boerse/news/ueberblick/a-deep-dive-into-the-ishares-msci-world-etf-concentration-and-ai-momentum/68459935",
      "source": "AD HOC NEWS",
      "published": "20260105T050957",
      "overall_sentiment_score": 0.325628,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.305594,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.707625
    },
    {
      "title": "BofA Stays Bullish on Jabil (JBL) as FY26 Outlook Exceeds Expectations",
      "summary": "Bank of America has reiterated its \"Buy\" rating on Jabil Inc. (NYSE: JBL) and raised its price target to $265, following strong fiscal Q1 results and an optimistic FY26 outlook. Jabil's revenue and EPS guidance for FY26 surpassed analyst expectations, driven by increasing demand from AI-related data center spending. The company's momentum in existing programs and a growing pipeline of AI-related projects suggest potential for further upside.",
      "url": "https://www.insidermonkey.com/blog/bofa-stays-bullish-on-jabil-jbl-as-fy26-outlook-exceeds-expectations-1669595/",
      "source": "Insider Monkey",
      "published": "20260102T190400",
      "overall_sentiment_score": 0.470833,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.340249,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.70336
    },
    {
      "title": "A Deep Dive into the iShares MSCI World ETF’s Robust Performance",
      "summary": "The iShares MSCI World ETF (URTH) has demonstrated robust performance this year, driven largely by U.S. technology stocks, achieving a 22.07% year-to-date gain. The ETF, which tracks the MSCI World Index, holds over 1,300 companies from developed nations with a significant allocation to IT, and its top holdings include tech giants like NVIDIA and Apple. Despite its strong track record and liquidity, the fund's elevated P/E ratio of 26.29 suggests high earnings expectations, particularly in the tech sector, which investors should consider.",
      "url": "https://www.ad-hoc-news.de/boerse/ueberblick/a-deep-dive-into-the-ishares-msci-world-etf-s-robust-performance/68449433",
      "source": "AD HOC NEWS",
      "published": "20260102T070903",
      "overall_sentiment_score": 0.369633,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.347465,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.699578
    },
    {
      "title": "Goldman Sachs ignites TSMC rally with 35% target raise, stock hits new peak",
      "summary": "Goldman Sachs raised Taiwan Semiconductor Manufacturing Co. (TSMC) price target by 35% to NT$2,330, causing its stock to surge 6.9% to a new record high. This rally also boosted other Asian tech stocks, with Taiwan's Taiex index surpassing 30,000 for the first time. The increase reflects growing investor confidence in TSMC's role in the AI chip supply chain and expectations of significant future investment by the company in AI capacity.",
      "url": "https://www.cryptopolitan.com/goldman-sachs-ignites-tsmc-rally/",
      "source": "Cryptopolitan",
      "published": "20260105T083937",
      "overall_sentiment_score": 0.301817,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.263948,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.679965
    },
    {
      "title": "TSMC Shares Jump Most Since April After Goldman Lifts Target 35%",
      "summary": "Taiwan Semiconductor Manufacturing Co. (TSMC) shares experienced their largest jump since April, reaching a new record high after Goldman Sachs Group Inc. increased its price target by 35% to NT$2,330. This surge is attributed to continued optimism surrounding artificial intelligence demand, benefiting the world's largest contract chipmaker and key supplier to Nvidia and Apple.",
      "url": "https://www.bloomberg.com/news/articles/2026-01-05/tsmc-shares-jump-most-since-april-after-goldman-lifts-target-35",
      "source": "Bloomberg.com",
      "published": "20260105T035100",
      "overall_sentiment_score": 0.349049,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.320084,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.646563
    },
    {
      "title": "BitMine Immersion Technologies (BMNR) stock slips today as new proxy filing spotlights its giant Ethereum stash",
      "summary": "BitMine Immersion Technologies (BMNR) stock fell about 2% after hours following a new proxy filing ahead of its January 15 annual meeting, where shareholder votes will impact its ability to raise capital. The company, which has repositioned itself as a major holder of crypto, especially Ether, is seeking approval for proposals including a charter amendment to increase common shares and an incentive plan. BitMine highlighted its substantial crypto treasury, including 4.11 million Ether tokens and 192 Bitcoin, with a significant portion of Ether staked, which could generate considerable annual rewards.",
      "url": "https://ts2.tech/en/bitmine-immersion-technologies-bmnr-stock-slips-today-as-new-proxy-filing-spotlights-its-giant-ethereum-stash/",
      "source": "ts2.tech",
      "published": "20260101T175700",
      "overall_sentiment_score": -0.138559,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.131101,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.644995
    },
    {
      "title": "Novavax (NVAX) Stock Trades Up, Here Is Why",
      "summary": "Shares of Novavax (NVAX) rose by 3% following reports that its JN.1 Covid-19 vaccine became available in GP clinics in Singapore. This development comes amid cautious optimism in the biopharmaceutical sector for 2026, despite Novavax's mixed Q3 2025 financial results. The article notes the stock's volatility and its current trading position significantly below its 52-week high.",
      "url": "https://finviz.com/news/266122/novavax-nvax-stock-trades-up-here-is-why",
      "source": "Finviz",
      "published": "20260102T161000",
      "overall_sentiment_score": 0.299571,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.345946,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.639281
    },
    {
      "title": "VOO vs. SPY: Which Popular S&P 500 ETF Wins Out for Investors?",
      "summary": "This article compares two popular S&P 500 ETFs, VOO and SPY, highlighting their similarities in tracking the S&P 500 index and their slight differences. While both offer identical exposure and risk profiles, VOO distinguishes itself with a lower expense ratio, a marginally higher dividend yield, and greater assets under management. These subtle advantages make VOO slightly more appealing for long-term investors seeking to minimize fees and maximize returns.",
      "url": "https://www.fool.com/coverage/etfs/2026/01/01/voo-vs-spy-which-popular-s-and-p-500-etf-wins-out-for-investors/",
      "source": "The Motley Fool",
      "published": "20260101T190200",
      "overall_sentiment_score": 0.185855,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.114786,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.637611
    },
    {
      "title": "TSMC Shares Jump Most Since April After Goldman Lifts Target 35%",
      "summary": "TSMC shares surged following a 35% price target increase by Goldman Sachs, driven by continued optimism for AI-related demand. The world's largest contract chipmaker saw its stock hit a new record high, leading a broader rally in Asian tech stocks. Analysts noted TSMC's strong position in the AI boom and improving profit margins, despite concerns about market overheating.",
      "url": "https://finance.yahoo.com/news/tsmc-shares-jump-most-since-035143858.html",
      "source": "Yahoo Finance",
      "published": "20260105T060816",
      "overall_sentiment_score": 0.263933,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.10593,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.632038
    },
    {
      "title": "The Truth About HP Inc: Is This ‘Boring’ Brand Low?Key a Total Cheat Code?",
      "summary": "HP Inc, traditionally seen as a \"boring\" office printer brand, is gaining unexpected traction on social media platforms like TikTok, where its gaming laptops and budget-friendly devices are lauded for value. The company's products offer a strong balance of performance and price, appealing to students, creators on a budget, and remote workers looking for reliable gear that doesn't break the bank. While its stock (HPQ) is more of a stable, dividend-paying investment than a high-growth \"meme stock,\" HP is quietly becoming a significant player in the tech market for those prioritizing practical power over flashy aesthetics.",
      "url": "https://www.ad-hoc-news.de/boerse/ueberblick/the-truth-about-hp-inc-is-this-boring-brand-low-key-a-total-cheat/68456676",
      "source": "AD HOC NEWS",
      "published": "20260104T040813",
      "overall_sentiment_score": 0.117841,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.031595,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.63108
    },
    {
      "title": "Ross Stores stock hits all-time high at 185.88 USD By Investing.com",
      "summary": "Ross Stores Inc. (ROST) has reached an all-time high of $185.88, demonstrating significant growth with a 19.96% increase over the past year. This achievement is attributed to strong third-quarter earnings, exceeding analyst estimates, and strategic initiatives such as improved marketing and store updates. Analysts from BofA Securities, TD Cowen, and Bernstein SocGen Group have raised their price targets for the company, reflecting positive market sentiment and confidence in its future success.",
      "url": "https://ca.investing.com/news/company-news/ross-stores-stock-hits-alltime-high-at-18588-usd-93CH-4386171",
      "source": "Investing.com Canada",
      "published": "20260105T200844",
      "overall_sentiment_score": 0.405595,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.22937,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.630222
    },
    {
      "title": "TSMC shares jump most since April after Goldman lifts target 35%",
      "summary": "TSMC shares saw their biggest jump since April, reaching a new record high, after Goldman Sachs raised its price target by 35% due to strong AI demand expectations. This surge helped lead a broad increase in Asian tech stocks, with investors continuing to pour money into the AI sector despite some concerns about overheating. Analysts view AI as a multi-year growth engine for TSMC, which is set to invest heavily in capacity expansion and report earnings on January 15th.",
      "url": "https://theedgemalaysia.com/node/788045",
      "source": "The Edge Malaysia",
      "published": "20260105T070816",
      "overall_sentiment_score": 0.323152,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.309882,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.627159
    },
    {
      "title": "Ati stock hits 52-week high at 117.54 USD By Investing.com",
      "summary": "ATI Inc.'s stock reached a new 52-week high of $117.54, driven by strong market sentiment and a remarkable 109.12% increase over the past year. InvestingPro rates ATI's financial health as \"GREAT,\" and analysts are optimistic about its future, setting a high target of $135. The company recently reported strong Q3 2025 financial results and announced leadership changes.",
      "url": "https://ca.investing.com/news/company-news/ati-stock-hits-52week-high-at-11754-usd-93CH-4383709",
      "source": "Investing.com Canada",
      "published": "20260102T180907",
      "overall_sentiment_score": 0.146645,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.122567,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.624465
    },
    {
      "title": "ESGV: Still Ahead Of The Benchmark, But Some Peers Are More Compelling",
      "summary": "The Vanguard ESG U.S. Stock ETF (ESGV) provides broad ESG-screened exposure, with a focus on technology and large-cap companies. While it has outperformed its benchmark (VTI) since inception and boasts a low expense ratio, its recent 12-month returns lag slightly, and its total return and Sharpe ratio since 2020 trail several competitors. The article updates a previous review, analyzing ESGV's current holdings and performance.",
      "url": "https://seekingalpha.com/article/4856832-esgv-still-ahead-of-the-benchmark-but-some-peers-are-more-compelling",
      "source": "Seeking Alpha",
      "published": "20260103T120953",
      "overall_sentiment_score": 0.140655,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.121286,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.624142
    },
    {
      "title": "SSO vs SOXL: Leveraging the Market or Leveraging Momentum",
      "summary": "This article compares two leveraged ETFs, ProShares Ultra S&P500 (SSO) and Direxion Daily Semiconductor Bull 3X Shares (SOXL), highlighting their different investment strategies and risk profiles. SSO provides 2x leveraged exposure to the broad S&P 500, while SOXL offers 3x leveraged exposure to the more volatile semiconductor sector. The piece details their costs, performance, and portfolio makeup, concluding that the choice between them depends on whether an investor wants to leverage general market direction or concentrate on a volatile, specific sector.",
      "url": "https://www.theglobeandmail.com/investing/markets/markets-news/Motley%20Fool/36841393/sso-vs-soxl-leveraging-the-market-or-leveraging-momentum/",
      "source": "The Globe and Mail",
      "published": "20260105T112738",
      "overall_sentiment_score": 0.236858,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.109974,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.623172
    },
    {
      "title": "Is DFAC ETF Still A Buy After 15% Run?",
      "summary": "The Dimensional U.S. Core Equity 2 ETF (DFAC) gained 15% over the last year, matching the S&P 500 despite its factor-based approach. While DFAC includes mega-cap tech stocks, its small-cap holdings face headwinds from rising 10-year Treasury yields and the struggles of unprofitable Russell 2000 companies. Investors should monitor interest rates and DFAC's quarterly fact sheets to assess its future performance, especially compared to more focused small-cap value funds like AVUV.",
      "url": "https://247wallst.com/investing/2026/01/04/is-dfac-etf-still-a-buy-after-15-run/",
      "source": "24/7 Wall St.",
      "published": "20260104T140925",
      "overall_sentiment_score": 0.057082,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.105012,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.621155
    },
    {
      "title": "Tesla stock price is on the rise today despite gloomy expectations for vehicle deliveries: This could be why",
      "summary": "Tesla's stock is rising today despite anticipated lower Q4 2025 vehicle deliveries, potentially due to broader investor optimism for tech and AI stocks and renewed excitement for Tesla's AI and automation initiatives, including robotaxis. The expected dip in deliveries was not a surprise, as consumer demand surged in the previous quarter before tax credit expirations. Investors seem to be focusing on the company's future prospects rather than past performance.",
      "url": "https://www.fastcompany.com/91468201/tesla-stock-price-today-shares-up-gloomy-deliveries-news-why",
      "source": "Fast Company",
      "published": "20260102T130832",
      "overall_sentiment_score": 0.193701,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.205964,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.61855
    },
    {
      "title": "SCHG ETF At $32.62: AI Growth ETF To Buy Below $30",
      "summary": "The SCHG ETF is currently trading near its 52-week high at $32.62, driven by AI-related mega-cap growth stocks like Nvidia, Apple, and Microsoft. While it historically shows strong long-term performance and faster recovery from drawdowns due to its growth and quality factors, its current valuation is considered premium. The article suggests that existing holders should continue to hold, but new capital should wait for a pullback to below $30 for a more attractive entry point, as the current price reflects optimistic growth expectations with limited margin for error.",
      "url": "https://www.tradingnews.com/news/schg-etf-near-33-usd-high-as-ai-giants-drive-19-percent-25-rally",
      "source": "TradingNEWS",
      "published": "20260102T141045",
      "overall_sentiment_score": 0.293175,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.343551,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.613106
    },
    {
      "title": "A Deep Dive into the iShares MSCI World ETF (URTH): Performance and Positioning",
      "summary": "The iShares MSCI World ETF (URTH) saw strong performance in 2025, driven by AI investments and U.S. tech, but faces increased volatility in 2026 due to high concentration and valuation. Its portfolio is heavily weighted towards U.S. large-cap tech companies, with NVIDIA now its largest holding. Investors should watch upcoming MSCI index reviews, tech earnings, and the \"soft landing\" economic scenario for its Q1 2026 trajectory.",
      "url": "https://www.ad-hoc-news.de/boerse/ueberblick/a-deep-dive-into-the-ishares-msci-world-etf-urth-performance-and/68462007",
      "source": "AD HOC NEWS",
      "published": "20260105T205203",
      "overall_sentiment_score": 0.199503,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.220113,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.611927
    },
    {
      "title": "Costamare declares dividends on preferred and common stock By Investing.com",
      "summary": "Costamare Inc. (NYSE:CMRE) has announced cash dividends for its preferred stock series and a quarterly dividend for its common stock. The shipping company will pay dividends on its Series B, C, and D Preferred Stocks, with payments scheduled for January 15, 2026. Additionally, a common stock dividend of $0.115 per share for the quarter ending December 31, 2025, will be distributed on February 5, 2026.",
      "url": "https://ca.investing.com/news/company-news/costamare-declares-dividends-on-preferred-and-common-stock-93CH-4383244",
      "source": "Investing.com Canada",
      "published": "20260102T120834",
      "overall_sentiment_score": 0.068645,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.122319,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.601023
    },
    {
      "title": "AAOI Soars in the Race for the AI‑Powered 800 Gbit Data Center: Can Applied Optoelectronics Keep Up?",
      "summary": "Applied Optoelectronics (NASDAQ: AAOI) is a high-risk, high-reward fiber optics play, positioned at the intersection of AI-driven data center traffic and the global shift to fiber. The company is innovating with 800 Gbit VCSEL transceivers and AI-powered software, driving significant revenue growth despite continued unprofitability and high volatility. While demand for its products is booming, AAOI faces challenges from customer concentration, fierce competition, and a need for substantial capital investment, making it suitable mainly for risk-tolerant investors.",
      "url": "https://ts2.tech/en/aaoi-soars-in-the-race-for-the-ai-powered-800-gbit-data-center-can-applied-optoelectronics-keep-up/",
      "source": "ts2.tech",
      "published": "20260103T100906",
      "overall_sentiment_score": 0.018677,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.061093,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.598797
    },
    {
      "title": "The Truth About Sirius XM Holdings Inc: Is This ‘Old’ Player Suddenly a Viral Comeback Kid?",
      "summary": "Sirius XM Holdings Inc. is unexpectedly gaining viral attention as a \"car radio dinosaur\" stock. The article explores whether SIRI is a shrewd investment due to its cash flow and in-car dominance or an outdated boomer-flop facing competition from streaming services. It delves into the product, market performance, trends, and competitive landscape to help investors determine if the recent hype is justified.",
      "url": "https://www.ad-hoc-news.de/boerse/ueberblick/the-truth-about-sirius-xm-holdings-inc-is-this-old-player-suddenly/68452510",
      "source": "AD HOC NEWS",
      "published": "20260102T190844",
      "overall_sentiment_score": 0.064954,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.038539,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.594112
    },
    {
      "title": "Should You Buy the iShares S&P 500 ETF Before 2026, Even With the Stock Market at an All-Time High?",
      "summary": "The article discusses whether investors should buy the iShares Core S&P 500 ETF before 2026, considering the S&P 500 is at an all-time high. It highlights the diversification of the S&P 500, its historical average annual return of 10.5%, and the low expense ratio of the ETF. The author concludes that despite market volatility, history suggests staying the course with a long-term investment horizon, even if the index is currently expensive.",
      "url": "https://www.theglobeandmail.com/investing/markets/stocks/NFLX-Q/pressreleases/36828817/should-you-buy-the-ishares-sp-500-etf-before-2026-even-with-the-stock-market-at-an-all-time-high/",
      "source": "The Globe and Mail",
      "published": "20260104T065720",
      "overall_sentiment_score": 0.320546,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.336666,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.583893
    },
    {
      "title": "TD SYNNEX Corporation (SNX) Earnings in Focus as Analysts Stay Bullish on AI-Driven Demand",
      "summary": "Analysts remain bullish on TD SYNNEX Corporation (SNX) due to AI-driven demand, despite a recent price target adjustment. The company is set to report its full-year and fourth-quarter fiscal 2025 results on January 8, 2026, and has provided solid guidance, reaffirming its focus on AI adoption and long-term growth initiatives.",
      "url": "https://finviz.com/news/266275/td-synnex-corporation-snx-earnings-in-focus-as-analysts-stay-bullish-on-ai-driven-demand",
      "source": "Finviz",
      "published": "20260102T153200",
      "overall_sentiment_score": 0.389102,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.394926,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.573654
    },
    {
      "title": "GPIX ETF at $52.54: 8% Monthly S&P 500 Income ETF Outshines JEPI",
      "summary": "The Goldman Sachs' GPIX ETF is trading at $52.54, near its 52-week high, and offers an 8% monthly yield by utilizing a dynamic covered-call strategy on the S&P 500. This ETF has outperformed JEPI in 1-2 year returns, providing tax-efficient income with meaningful exposure to S&P 500 growth. The article suggests a \"Buy\" stance for investors seeking high monthly cash flow and equity exposure.",
      "url": "https://www.tradingnews.com/news/gpix-etf-climbs-to-52-usd-8-percent-yield",
      "source": "TradingNEWS",
      "published": "20260102T211016",
      "overall_sentiment_score": 0.351392,
      "overall_sentiment_label": "Bullish",
      "ticker_sentiment_score": 0.295606,
      "ticker_sentiment_label": "Somewhat-Bullish",
      "relevance_score": 0.568826
    },
    {
      "title": "Assessing U.S. Bancorp (USB) Valuation After Recent Share Price Momentum And Modest Undervaluation Signals",
      "summary": "U.S. Bancorp (USB) has shown recent share price momentum, with a 90-day return of 13.54% and a 1-year return of 15.55%. While a valuation narrative suggests a modest undervaluation of 6.2% with a fair value of $57.50, driven by expected revenue growth, its current P/E ratio is slightly above the US Banks industry average, hinting at both valuation risk and opportunity. Investors are encouraged to consider the narrative's full details and potential risks, such as credit issues and regulatory costs.",
      "url": "https://simplywall.st/stocks/us/banks/nyse-usb/us-bancorp/news/assessing-us-bancorp-usb-valuation-after-recent-share-price",
      "source": "Simply Wall Street",
      "published": "20260105T102936",
      "overall_sentiment_score": 0.285695,
      "overall_sentiment_label": "Somewhat-Bullish",
      "ticker_sentiment_score": 0.419999,
      "ticker_sentiment_label": "Bullish",
      "relevance_score": 0.564828
    },
    {
      "title": "Netflix stock today: NFLX drops nearly 3% as Warner deal drama and earnings near",
      "summary": "Netflix (NFLX) shares dropped nearly 3% on Friday, closing at $90.99, as investors continue to weigh the proposed acquisition of Warner Bros. Discovery’s studios and streaming assets. The upcoming fourth-quarter earnings report on January 20th and a rival bid from Paramount Skydance for Warner Bros. Discovery are key factors influencing the stock. The ongoing takeover battle raises questions about leverage, regulatory approvals, and the deal's timeline.",
      "url": "https://ts2.tech/en/netflix-stock-today-nflx-drops-nearly-3-as-warner-deal-drama-and-earnings-near/",
      "source": "ts2.tech",
      "published": "20260104T062000",
      "overall_sentiment_score": -0.148168,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": -0.146009,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.55213
    },
    {
      "title": "The Intelligence Revolution: How Apple’s 2026 Ecosystem is Redefining the ‘AI Supercycle’",
      "summary": "As of January 1, 2026, Apple Intelligence has transformed the technology landscape, evolving from beta features into a seamless, multi-modal operating system experience and triggering the \"AI Supercycle.\" Apple (NASDAQ: AAPL) has transitioned into a leading provider of consumer-grade, privacy-first artificial intelligence, integrating generative AI into the core of its operating systems and setting new industry standards for user data interaction. This shift has revitalized iPhone sales and placed immense pressure on competitors, while Apple's \"privacy-first\" philosophy is redefining the global AI landscape and pushing towards an \"Intelligent OS\" where AI is the fabric of the operating system.",
      "url": "https://markets.financialcontent.com/wral/article/tokenring-2026-1-1-the-intelligence-revolution-how-apples-2026-ecosystem-is-redefining-the-ai-supercycle",
      "source": "FinancialContent",
      "published": "20260101T200755",
      "overall_sentiment_score": 0.012801,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.032588,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.340735
    },
    {
      "title": "Apple stock today slips to start 2026 as Raymond James flags valuation; what investors watch next",
      "summary": "Apple shares fell 0.3% to $271.01 to start 2026 after Raymond James restarted coverage with a \"market perform\" rating, citing limited near-term upside due to high valuation and potential tariff/component-cost pressures. Investors are now focused on upcoming U.S. labor-market data and Apple's late-January earnings report for future catalysts. Separately, Apple appointed Ben Borders as principal accounting officer and faces scrutiny over reported sluggish Vision Pro headset sales.",
      "url": "https://ts2.tech/en/apple-stock-today-slips-to-start-2026-as-raymond-james-flags-valuation-what-investors-watch-next/",
      "source": "ts2.tech",
      "published": "20260103T145826",
      "overall_sentiment_score": 0.009162,
      "overall_sentiment_label": "Neutral",
      "ticker_sentiment_score": 0.023584,
      "ticker_sentiment_label": "Neutral",
      "relevance_score": 0.301756
    }
  ]
}